{"comments": ["&gt;An Alton Republican election judge said Friday she has no regrets about voting for Donald Trump on behalf of her dead husband\n\nProof.\n\nFound it. ***The*** proof.\n\nIt's actual proof that election officials are rigging the vote.\n\n^for ^Donald ^Trump\n\n", "Trump used the phrase \"anchor baby\" to describe women who come into the country illegally and give birth to a kid to gain citizenship. Barron Trump is the son of Donald and Melania. By his words his own son is an \"anchor baby\".", "&gt;“Now they should investigate all the cemeteries in Chicago” said Cook. She said she does not feel she did anything wrong, and only voted as her late husband would have, had he survived.\n\nCognitive dissonance much?", "Hispanics and women.\n\nThis kills the alt-right.", "ID requirements were never *actually* about preventing fraud.", "Lying on your application or during your interview for naturalization is one of the ways naturalized citizenship can be rescinded. If she lied during that process about her work history that could be grounds for de-naturalizing her. Whether they'd ever actually pursue that is another story.", "As a Mexican American living in crap  az this makes me a vary happy burrito.", "Since [the US has birthright citizenship](https://en.wikipedia.org/wiki/Birthright_citizenship_in_the_United_States) anyone born within the US is a citizen, even if their mother did not arrive in the country legally. Trump has used the term '[anchor baby](https://en.wikipedia.org/wiki/Anchor_baby)' to describe children born under these circumstances and has mused that they aren't truly US citizens. This news suggests that Melania's path to citizenship wasn't legal and therefore Donald and Melania's 10 year old son Barron meets the definition of an anchor baby. ", "&gt; Claim you were victimised\n\nThat's the most important step to Trump supporters.\n\nClaim you're the victim early and claim you're the victim often.", "I don't really consider a foreign model who married a billionaire for his money and just acts like a trophy wife really constitutes a productive member of society.", "Now she's an ideal counterexample to that stupid wall. Most \"illegal immigrants\" aren't hiking through the wildnerness by moonlight. They come as tourists and then don't leave. ", "&gt;Trump supporters. They have been conned by a grifter\n\nYou're excusing them too much. A bunch of idiots morons, racists who now have a candidate who panders to their every fear. They're still cretins.\n", "Here's the other thing about hispanic votes. A lot of people aren't voting for him because Trump just acts like a strongman. We love the Hitler and Mussolini shit but really, he is a lot more banal.\n\nHe is Arnoldo Aleman. Fujimori. Castro. Trujillo. Maduro. Hugo Chavez. Uribe. Noriega. Somoza. He's every kleptocrat that's made millions and made folks leave their countries in their first place and let their cousins and family die, or kill em outright. Trujillo and his personal fears of being too dark. Aleman letting North Nicaragua drown in mud after Mitch and pocketing aide money for himself.\n\nHe is the Central American strongman without the military uniform, just puffing his chest and making empty promises. We disavow because we see through that bullshit because we've already lived it before and don't want to again", "You guys can hate on her all you want but don't forget that she gave us one of the most iconic line of our time.  \"When they go low we go high.\" -Melania Trump", "According to his own mouth. He has cheated on all of his wife. By* his own admission. ", "\"Lock her up! Lock her up! Lock her up!\"", "How do you check someone's ID through the mail?", "You missed two.  Sheldon Adelson's paper (Las Vegas Review-Journal) and the McCaw's paper (Barbara News-Press).  Effectively rich people who exert too much control over media they bought and like Trump.", "I hope she's so evil that she confirms their fears and rounds up anyone who voted for Trump and puts them in FEMA concentration camps where everyone has to watch episodes of the new Obama reality TV show where he tears up copies of the Constitution and shoots bald eagles with foreign made guns while gay people have sex in the background on top of the ashes of a Bible. ", "Yeah I mean eventually he has to get rid of her so he can switch to the newest version aka his daughter. ", "I think SNL has a unique opportunity tomorrow night too. Getting T mad over jokes is the simplest way to demonstrate one last time that he cares about his image over anything and everything else. Im rooting for them!", "I imagine the 9th so much it feels more like a memory!\n\nObligatory /r/unexpectedhamilton", "Any truth to the rumors that she had Trump's abortion?\n\nSome are talking about it and some of  those talking about it are the *smartest* people, the *best* people. People who would know, BELIEVE ME.\n\nWho knows? Some say it's true.", "What you're saying is... Obama did this.", "&gt; Nah it's fine. Let's just pay $15 a week to drive on the Comcast Dirtway Express.\n\nYou're being generous.", "First thing Trump will do is obviously to deport Melania to Mexico.", "Don't worry they'll just retreat back to their angry, racist safe spaces...errrrr, I mean echo chambers", "Generally seniors utilize mail-in while minorities and young people don't so it's not at all counter-production to the GOP's efforts if you understand them as the Democratic disenfranchisement attempt that they truly are.", "&gt;Jon Stewart Hilariously Recounts That Time When Trump Bombarded Him With Anti-Semitic Tweets \"Oh I think this guy's trying to let people know I'm a Jew.\"\n\nhttp://www.alternet.org/election-2016/trump-anti-semitic-tweets-against-jon-stewart", "2016 voter fraud tally:\n\nIn person: Republicans 1 - Democrats 0\n\nDead People: Republicans 1 - Democrats 0", "How serious is this?\n\nIf they are not held to account after the election this could end the FBI.\n\nThat is not hyperbole.", "Trump complained about rigging election where people vote twice and dead people vote.  Well he was right.  His supporters prove him right.", "I have the perfect candidate:\n Female made a name for herself with a small loan from her father. American success story, Paris Hilton. ", "The GOP turned upside down.", "If he intends to intimidate voters then it doesn't matter how close to the polling place he is. Intentional voter intimidation like that is not legal.", "Alleged billionaire.", "No that's not the problem here. What the problem here is that Trump is running on a platform to clean up immigration while his own spouse has violated immigration law. It's the pinnacle of hypocrisy. ", "ATTENTION EVERY BLACK AMERICAN VOTING FOR TRUMP!!!\n\nYou dont have to send out a press release just fuck off and vote for your guy.", "Can we have a new holiday? \n\nocho de noviembre", "\"Four score and seven years ago...\"\n\n-Melania Trump", "How so?\n\nBill Clinton never bragged about sexually assaulting women on tape.  He had a consensual relationship with Monica Lewinsky and Hillary and Bill had a lot of issues with that but decided to work through it and stay together.\n\nHow is that in any way the same as protecting someone who brags about sexually assaulting women on tape?", "The very heart of the Trump campaign and xenophobic nationalist movement right now is that it is not based in any kind of impartial ideal like the Bill of Rights and most of US tradition is, it's based in a desire for their personal morality and worldview to be enforced on others. \n\nThey want an authoritarian that they agree with, not a democratic official that they might disagree with.\n\nThey want en echo chamber in the executive branch, and they want to tear down any part of the system that might not give them the result they want.\n\nHyopcrisy doesn't matter in that kind of worldview, because they are incapable of stepping outside their own heads, or entertaining any notion they don't agree with. If they play a game of rock paper scissors and lose, it's because the game was bad, or rigged, or unfair, and the only way to 'fix' it is to remake the game so that they always win.", "I don't get it. Eli5?", "Thing is morally she didn't do anything that bad. Trying to get work when your're attempting to gtfo of Slovenia isn't the end of the world.\n\nIt's just hypocritical as shit she and her husband antagonize the other 11 mil people who did it and build a campaign around ruining their lives.", "&gt; She should win a medal!\n\nOnly a bronze though since she came in third.", "Since RICO is a federal statute and the NYPD is a municipal police department, I doubt it.  Now, had the article stated they had an \"enterprise corruption\" case, it would have been more believable.", "The media can't tell the difference between covering each candidate to the same equal **standards** and artificially trying to make both candidates **look equal**.", "&gt; \"The line of 'Make America great again' the phrase, that was mine, I came up with it about a year ago, and I kept using it, and everybody's now using it, they are all loving it,\" Trump said.\n&gt; \n&gt; \"I don’t know I guess I should copyright it, maybe I have copyrighted it.\"\n\n[Source,] (http://www.rollingstone.com/politics/news/donald-trump-is-americas-stupidest-person-has-never-heard-of-google-20150325) from 2015. ", "Nah man those are the instincts of a true leader. Remember when Lincoln sent out a carrier pigeon about all those women at 4:00 AM.", "Former Berner here.\n\nWe learned this lesson all too well. It's why we hated the media putting the super delegates in their delegate counts.", "Can I explain it like a dictionary?\n\n*an·chor ba·by*\n\n\nnoun: offensive\n\nused to refer to a child born to a noncitizen mother in a country which has birthright citizenship especially when viewed as providing an advantage to family members seeking to secure citizenship or legal residency.\n\nBarron is very likely to be Melania's son to raise after Trump leaves her for his 4th wife.", "I voted twice in an online poll! ", "Nobody's saying it's her fault just that she's not doing anybody any good by being married to him. Other than herself, of course.", "&gt; That's what many people are saying.\n\nAnd many people are also saying it was all a political stunt by the Hillary campaign.", "They've done things like this before. Nothing will happen. They are pretty independent and do fight back. ", "Yes I wish I could tell them all. You guys are awesome, thank you! ", "I really wanna know the thought process behind how anyone falls for this.", "It sounds like they made her carry the fetus to term and give it up for adoption. \n\nNot quite what was meant by \"quietly take care of it\" above.", "538's model is based on the polls and the polls alone.  Early voting reporting isn't included.\n\nThis surge didn't show (it looks like a LOT of these people are generally considered unlikely to vote at all).\n\nLatino Decisions and Univision have had encouraging signs for the latino vote in FL for a while but it looks like the big names may have missed it and that would drown it out in 538's model.", "Maybe if Trump becomes president. Have to take that hardline law and order stance!", "Trump's wife ~~modeled~~ **worked** in US prior to getting **work** visa\n\n", "That's an understatement.", "They are the black voters who have fought with Democrats for years to attain the same rights and opportunities as their white counterparts who are told they have nothing to lose.  They are Hispanics and Latinos who have been accused of being drug dealers and rapists.  They are women who know The all-to-real specter of sexual assault, and watched a man say it was nothing.  They are college educated men and women who recognize supreme ignorance mixed with supreme arrogance.  They are people who see the rising tide of racism and sexism he is feeding, and who are drawing the line in the sand.  They are patriots who see a tyrant grasping for power, wishing to silence and imprison his opponents, and overthrow the results of a democratic election. They come from many backgrounds, but are united by one factor: they are Americans.  Americans who exercise their right to vote. Those are the stories of the Clinton voters.", "man i so hope this is true and not just hype or something.  Ill sleep like a king if Clinton put this away.", "In the article she isn't just a sweet little old lady. She calls out for investigation of Chicago's cemeteries for similar fraud. Her and her late husband were lifelong Republicans and were active in the community, they are vocal opponents of the housing authority. \n\nI don't think what she did was so sweet and innocent at all. She knew what she was doing. ", "Sad but true. I know several people who are voting Trump just because Catholic clergy tells them they can't vote for pro-choice candidates.", "And that's fine. She could have said that. Said she dropped out to be a model. But she didn't. She claimed she graduated. She didn't. Her website said she graduated. She didn't. The GOP convention program said she graduated. She didn't. ", "Guess the rampant sexual assault and misogyny doesn't sit well with them. Go figure.", "It's a dog whistle though.\n\nIt's like talking about \"the inner cities.\"  You know they really mean \"black people.\"", "It will be the absolute sweetest of karma if the hispanic community are the ones that hand Trump a defeat in this election. ", "&gt;and I know this is just locker room talk for some men.\n\nLol. This talking point. ", "Looks like every state allows mail in voting in some form though who qualifies differs from state to state.\n\n&gt;Absentee voting allows you to vote by mail. Though every state has absentee voting, rules on who can participate vary. https://www.usa.gov/absentee-voting\n\nBut according to [this map](http://www.nytimes.com/interactive/2016/11/03/us/elections/how-states-moved-toward-stricter-voter-id-laws.html) and [this table](http://www.ncsl.org/research/elections-and-campaigns/absentee-and-early-voting.aspx#overview), Georgia, Wisconsin, and Kansas all require photo ID at the polls but allow no-excuse absentee voting (anyone can vote by mail for any reason).", "He's probably ready for another 20 year old.", "But he may want to keep her boobs. (He once said he will accept his wife even she has an accident and boobs are not damaged)", "Most important part to this story:\n&gt; \"The portion of this email that was upgraded was provided to the Department by former Secretary Clinton back in December 2014\" Kirby said. \"It was upgraded to confidential – the lowest level of classification – and released in October 2015 during our regular productions of approximately 52,000 pages of former Secretary Clinton’s emails. As to whether emails were classified at the time they were sent, the State Department in the [Freedom of Information Act] process is focusing on whether information needs to be protected today.\"\n\nThe information wasn't classified at the time of the email being sent (2009). ", "It should already be a fucking holiday but good luck getting that to happen with one party working their asses off to disenfranchise \"riggers\"", "It really is because latinos tend to not answer polls. Because fuck em. Got shit to do ", "Alot of is that we don't have high quality polls anymore.  Most of the best pollsters from 2012 have been contracted to do internals. \n\nIf I remember correctly we had 120+ polls the last week in 2012 and we are just hitting 70+ today. 2012 also didn't have the insane amount of trackers that currently dominate the polling scene. ", "Nevada is going for Clinton based on early results.  ", "Canada right next door has two languages and is a nation (and of course dozens of Native American languages and immigrant languages like the USA); Belgium, Ireland, and Paraguay have two languages; Switzerland has three languages; Spain and the Philippines have several; South Africa, Indonesia and India have hundreds of languages. If you have traveled, and I am guessing you have not extensively because people who have seldom rant about the value of whatever they mean by \"shared culture,\" you will find that what is \"weird\" on a global scale is speaking only one language. \n\nI could go on, but I hope you get my point.", "Do states with voter ID laws allow mail-in ballots? That seems counter-productive.", "That's like saying a sexist can't get married (three times) or a racist can't hire a minority(then refuse to pay them.) ", "Melania Trump chose to step into the public light as a spokesperson for the Trump campaign and therefore her claims should be evaluated.\n\nMelania Trump claims that she has a degree in design and architecture from a Slovenia university. Snopes rates this claim [as unproven](http://www.snopes.com/melania-trump-architecture-degree/).\n\nKey facts:\n\n&gt;There is no \"University in Slovenia,\" nor is there a \"University of Slovenia.\" The country contains several colleges, including the University of Ljubljana, which other news outlets have reported (without citation) was where Melania obtained her degree. But while the claim that she possesses a degree in Architecture and Design appears on several web sites, these reports lack specific details, such as the year she graduated. \n\nand\n\n&gt;Melania Trump didn't receive a college degree in design and architecture at the university in Ljubljana, Slovenia, which her biography in the Republican National Convention program claims she had obtained.\n\n&gt;CBS News has checked the official public records of the university, and Melania Trump is not listed as having graduated from there with a degree.\n\nThe fact that Melania Trump has bent the truth in the past, including about her education, absolutely warrants a closer look.", "&gt;Misunderestimate\n\nGuys look! We found George W. Bush's reddit account!", "Well the National Enquirer is one of the only two newspapers endorsing Trump, so it doesn't surprise me that they spiked a story that was critical of him. \n\nI hope you love the smell of Hillary in the morning, because that's what you'll awake to on Wednesday. ", "Actually yes but here's the thing....\n\nAnybody with a fucking ounce of common sense accepts that any career politician has a certain level of corruption - there's actually no real way to fix it - campaigns are expensive. \n\nTrump likes to pretend he self-funded, but he's in for millions to people like Robert Mercer and Sheldon Adelson, and they will come to collect. \n\nHillary and Bill have an interesting thing, in that they do the same cash-for-fifteen minutes thing every politician does in a myriad of charity fundraisers and 10k-a-seat golf tournaments and whatnot, and then kicked all the money into the CGI.\n\nIt's not uncommon - one of the more interesting things in Missouri is that Eric Greitens, the type of guy who might have been a future star of the GOP has run afoul of the establish for not taking money from Rex Sinquefeld, and taking a lot of money from Michael Goguen.\n\nIf you're railing against, feel free to rattle your saber, but I mostly find it naive, especially if you're doing it for Donald Trump, who's had no issues taking 2 million from Geoff Palmer and 15 million from Mercer and Simons.\n\nAs for the FBI, if they're going to use the power of their very large, very loud shield to become a sort of kingmaker, then we are all in very deep shit, because they have a deep and distinct immunity - lost in this whole sea is a very blatant and very distinct fourth amendment violation and a overwhelming privacy violation where they not only searched Huma Abedin's emails without a warrant, but leaked out they had to the Trump campaign, before they ever got said warrant.\n\nThis is flat out, \"we have the tapes of you\" level Gestapo, where the FBI becomes extortionists, like J. Edgar never left. \n\nBad news for democracy, liberty, and personal privacy.\n\nAnd while standing on the right side of the white line this time, think about it this way - what if the FBI hated Trump instead, and maybe used subpoena power to go after the Apprentice tapes, or aggressively investigate Carter Page and Paul Manafort?\n\nMaybe winning an election isn't worth giving up your liberty?\n\n", "Megyn Kelly coming forward about the sexual harassment or was there another one? \n\nedit:\n\nI had no idea that there was a bigger story about Ailes.\n\nhttp://nymag.com/daily/intelligencer/2016/09/how-fox-news-women-took-down-roger-ailes.html", "I hope that she's evil so that we can finally make child sacrifices legal again!\n\nEdit: oh and take your guns too", "Sure she did- she was on Howard Stern with him. ", "Monster", "Nope", "Well that and most polling companies don't employ bilingual callers, so they don't sample the monolingual Hispanic vote well. I'd trust agencies in Florida to poll Florida, not agencies based in Maryland or whatever the fuck.", "I'm not gonna lie I'm fucking terrified of Tuesday. Not feeling confident about it. ", "No paywall no paywall, you're a paywall.", "WTF? Lebron plays for the Cavs dude. They came back from 1-3 to win their first ever NBA championship.", "Heh I had this exact same thought... For example:\n\nIf someone claims Bill Clinton sexually assaulted her - downvoted in r/politics\nSame person withdraws her case - upvoted in r/politics to the top\n\nIf someone claims Donald Trump sexually assaulted her - upvoted in r/politics to the top\nSame person withdraws her case - downvoted in r/politics \n\nI think a large number of subscribers here should just move to r/Clintonsupporters", "Everyone vote we need to keep that orange airhead out of the white house. ", "&gt; I will truly never understand conservatives who do things they only think are wrong if a liberal is doing them.\n\nEntitlement.\n\nMy conclusion is that the vast majority of working-class Republicans take it for granted that Republican control (of everything) is that natural order of things. This means that if that hasn't happened somebody must have cheated. Therefore it's OK to cheat back. And of course, get your retaliation in first.", "You're purposely misrepresenting Donald Trump's position on immigration. He's absolutely fine with productive illegals staying and becoming citizens so long as they're at minimum a 9/10.", "This is how I have been describing them. They are not only stupid. They are ARROGANTLY stupid. \n\nThe American flag flying over my house means I'm the best thing that happened to this world, I know the best words, I have a good brain,  im the most patriot, and AMEN.  ", "&gt; But that isn't Melania's fault.\n\nAccording to Trump if a woman's husband strays, it's the woman's fault. That's why he keeps bringing up Bill Clinton's infidelity--to imply that Hillary is too weak to keep a man in line.", "Wait I was cracking jokes below BUT I JUST READ IT AND SHE IS AN ELECTION JUDGE????. MY GOD 2016!!!!!!!!  ", "I'd bet serious money that he's paid for at least a few abortions over the years ", "On Wednesday I'll eat so many tacos!", "Literally everything far right wing people do is radiate projection. It's a psychological phenomenon at this point to me.\n\nAm I gay? Well then ban gay marriage and make a speech about it!\n\nDo I do drugs? Talk about it in Congress! \n\nDo I have a handful of sexual assault allegations right now? Bring up Bill Clinton. \n\nIt never ever stops. It's not just Trump it's the supporters as well. Saying that we're halting the government and crazy shit that makes absolutely no sense.", "Well we shouldn't pigeonhole them too much. Latinos have just as much right as everyone else to also be angry that Trump grabs 'em by the pussy, promises to order our military to commit war crimes, says global warming is a Chinese hoax, spent his whole life getting rich by cheating people who couldn't afford the lawyers to fight back, and is a narcissistic psychopath with the IQ of a low-quality grapefruit. ", "My friend the Infallible Hand of the Unregulated Free Market can do no wrong, ever, in the Impenetrable Bubble of Radicalized Right-Wing Bullshittery.", "Calling Trump racist is now racist?  I haven't heard the rubber/glue defense since 3rd grade", "Barack \"[You're gonna miss me\" ](https://www.youtube.com/watch?v=QWIaMhciNhE)Obama: \"Look I can only run for two terms. That's the law. But, when Supreme Ruler Overlord Trump changes the law so he can run for a third term, look, I'm going to run too. I'm going to have to.\"", "&gt;Dems and GOP", "I'm one of those left-wing gun fans (there are dozens of us!) so I end up in contact with a lot of pretty right-wing people. The idea that Black Panthers will be prowling around polling booths definitely comes up pretty often.", "Waiting for Melania's episode of \"Dirty Jobs.\"", "I really don't care if he's a philanderer as long as it's consensual. What's really throwing me for a loop is who would fuck him? Everything about him makes my pussy dry up. ", "&gt; The American flag flying over my house means I'm the best thing that happened to this world, I know the best words, I have a good brain, im the most patriot, and AMEN. \n\nNicely encapsulated. Props to you, guy. (or gal)", "Come on now you know that's not the kind of illegals they're worried about. They aren't worried about some hot French student sneaking in and modeling, they're worried about...those *other* people. That's why poster above doesn't see it as \"the same thing.\"\n\nThey're *totally* not racist tho, bro.", "It all makes perfect sense now...", "No puppet. No puppet. You're the puppet.", "Sounds like the Catholic clergy wants to start paying taxes.", "I agree. I kind of understand why but people like to make the arguement that Latinos are natural conservatives. Sure older generation do not like things like gay marriage, but historically many latino-american countries have been extremely progressive with regards to there legislation. I.E. things like Mexico ending slavery and getting universal healthcare before the US. Even the US is aware of this, that's why they imposed dictatorships along the hemisphere to combat socialism. Also latinos don't vote against there interest, and can't be scared by the hell/apocolypse baiting of southern baptists. ", "I'm going to text my Hillary vote so many times...\n\n\nDisclaimer: This is not a thing. Don't do this. ", "So quick question: do you think this lady would have mailed her husband's ID in with the ballot and then they would mail it back? \n\nShe committed voter fraud through a mail in ballot which would not be prevented by voter ID laws. ", "So the city sold parking revenues to private investors who promptly raised the rates through the roof. Is that about right?\n\nThere wasn't a requirement to tie the rate increases to inflation or something? They can just charge whatever they like?", "Damn this is so accurate that it's horrifying. \n\nJust look at Trump's business career. Look at the thousands of people that he's screwed over, all of the lives that he's ruined. \n\nWe're all next if he wins. \n\nHe and his rich buddies are going to be laughing their asses off on the golf course while we are all stuck living with scraps in a shithole country. ", "Pretty shitty thing to do honestly. Glad the guy and his kid are okay.", "Holy shit. This is on Fox News. Lolol. ", "It would look bad if the potential Clinton Administration did it even if the top of admin had nothing to do with it.", "If they are that dumb good.", "Be right back voting on behalf of all the Founding Fathers who would NOT want to see Trump grab this country by the pussy", "Summary:\n\nOct 26th 2016 - Rudy Giuliani during a Foxnews interview: [\"Trump's got a surprise or two that you're going to hear about in the next few days. I mean, I'm talking about some pretty big surprises. We got a couple things up our sleeve that should turn this around\"](http://townhall.com/tipsheet/katiepavlich/2016/10/26/guiliani-we-have-some-big-things-up-our-sleeves-to-turn-this-thing-around-n2237444)\n\nOct 28th, 2016 - FBI Comey message is dropped.\n\nNov 4rd, 2016 - Rudy Giuliani during another Foxnews interview: [\"I had expected this for the last [...] about 3-4 weeks ago. Way back in July this started. Did I hear about it? You're darn right I heard about it\"](http://www.huffingtonpost.com/entry/rudy-giuliani-fbi-clinton-emails_us_581c9e3fe4b0e80b02c93d6b)\n\n... \n\nWhat is troubling isn't just that the Trump campaign was fed this information in advance (for fucks sake, imagine if it was the Clinton campaign being fed FBI information about a Trump investigation), but also that it seems a  federal agency of the United States decided to pick a side and not remain neutral. The reason this has upset some republicans (along with many democrats) is because this is unprecedented. \n\nWhat if the Department of Education, Agriculture, Social Security, etc tossed their hat into the ring and picked sides? What if the Department of Energy said Trump would be a bad pick when it comes down to nuclear weapons, or if the CIA said Trump has troubling Putin connections? Where would it stop?\n\n", "&gt; I haven't heard the rubber/glue defense since the 3rd ~~grade~~ debate\n\nThanks fixed\n\n", "So the reason you believe it's true is the evidence that it's true is evidence of a conspiracy?\n\nRight. Gotcha. Besides, everyone knows the Reptiloids don't have offspring with humans. You need to catch up on your conspiracy updates.", "Probably a lobster.", "But that's why the party is such a mess. It's filled with some actually-not-libertarian hard right Christians (bizarrely) a bunch of Ayn Rand Believers and then some wierd vocal minority trying to claim its fiscal conservatives+social liberals in one place. Legalize weed and lower taxes! But there's no actual strategy in place for comprehensive governance.", "I know some people they're tremendous people, they call me, they say \"what's this about the abortion?\" and you know, I don't know! I'm just asking. \n\nI think people are going to find out that the it's actually in fact much bigger. Much, MUCH, bigger. Believe me. I'm not saying this, they're saying this. They're the one's saying it, I don't know. The media doesn't want to talk about it, I don't know.\n\nThey call me every day. They're finding the most unbelievable stuff. I have guys looking into this, tremendous people, these guys. They're looking into it, doing research and what they've been digging up has been unbelievable. They tell me every day, these guys. UN-believable stuff they're finding. ", "1. http://lasvegassun.com/news/2016/nov/04/illinois-election-judge-allegedly-sent-dead-husban/\n\n2. http://www.crossroadstoday.com/story/33635731/illinois-election-judge-allegedly-sent-dead-husbands-ballot\n\n3. http://www.bnd.com/news/local/article112583058.html\n\n4. http://www.stuff.co.nz/world/americas/us-election-2016/86135014/illinois-election-judge-charged-for-sending-in-dead-husbands-ballot\n\n5. http://www.starherald.com/news/nation_world/illinois-election-judge-allegedly-sent-dead-husband-s-ballot/article_d5f68a0a-3e79-59b2-b53b-48800317bf13.html", "let's be real I was voting bernie all the way through but I still knew he had no shot", "I'm a Hillary supporter. This is an awful thing. You can't destroy someone's property because they disagree with you. It's fucking terrible. ", "They had the one at the RNC with the incorrect Spanish grammar. ", "Oh I am totally aware I realize she's white which makes it a *completely* different situation for them, it's just amazing to see them try to justify it without just coming out and saying \"but she's white\"", "Honestly going after a political opponent is exactly the sort of behavior I'm hoping to *prevent* by voting for Clinton.  That kind of authoritarian behavior is one of the most un-American things a President could do.\n\nThe idiots on r/t_d say all the same things of Hillary that the rest of us say about Trump.  The last thing I want in the world is for them to be proven *right*.", "&gt; Rick Sanchez ... was fired from his job as CNN anchor after he called Stewart a bigot and questioned whether Jews should be considered a minority.\n\n&gt;\"I'm telling you that everyone who runs CNN is a lot like Stewart and a lot of people who run all the other networks are a lot like Stewart, and to imply that somehow they, the people in this country who are Jewish, are an oppressed minority?!\" Sanchez questioned.\n\n&gt;In [John Stewart's] mind, I can't be an anchor,\" Sanchez told Dominick. \"An anchor is what you give to high-profile white [Jews].\n\n&gt;\"Deep down, when they look at a guy like me they see a guy automatically who belongs in the second tier and not the top tier,\" Sanchez said.\n\n&gt;He said he feels that racism exists \"not just [from] the right,\" but also from \"elite, Northeast establishment liberals,\" and that he is condescended to because of his Latino heritage.\n\nhttp://abcnews.go.com/Entertainment/stewart-resonds-sanchez-sacking/story?id=11787594", "DNA test said it wasn't his. I'd find a link if I weren't cripplingly lazy. ", "And his supporters eat it up.\n\nMost \"lies\" Hillary tells are lawyer lies. Misleading but technically true. That's why you see the sniper fire bit brought up so much. It's really the only time (that I can recall) she's undoubtedly lied.\n\nTrump lies a dozen times before lunch. Easily verifiable lies. Takes 5 seconds to google them.", "I legitimately thought you were quoting Baldwin playing Trump on SNL until I realized it was an actual quote.", "https://www.theguardian.com/us-news/2016/nov/04/donald-trump-teenage-rape-accusations-lawsuit-dropped\n\nI hate donald trump but I still believe in being accurate.", "~~doesn't need~~ can't get them", "Exactly. And we are not even going to ask Slovenia to pay for that stupid wall!", "&gt; There are 2 counties that determine about 85% of the vote in Nevada Clark (68%) and Washoe (18%)\n\nThanks, I had certainly been wondering why I was hearing so much about Clark. Now it's quite clear!", "Finally a feel good moment in this election!", "I'm so good I early voted fifty times and my state doesn't even have early voting. ", "You do realize the document he put up is newer than the one you linked. \n\nhttps://twitter.com/LisaBloom/status/794698295775993856", "All these people shouting \"Built the wall!\" are voting to put an illegal immigrant in the White House.", "But when Obama does it his teleprompter is broken. - /r/T_D", "I'm thinking the Clinton campaign is waiting for Wikileaks to play their hand. They keep releasing things that looks like it might be building to something so it's possible Clinton is holding back until the last minute just in case she needs something to bury anything that's released about her. Of course, I'm just pulling this out of my ass, so I could be wrong, but if I were Hillary, that's what I would be doing. Early voting already shows her up. She needs to save whatever she has until the last moment so that no one can ignore it when she drives a fucking spear through him.", "In what way would Clinton break the system to stay in power? Isn't the main reason people don't like her because she represents 'the system' to them and they hate the system?\n\nWhich Clinton supporters are openly discussing murdering him if he wins?", "There's that moral fiber one finds in a Trump supporter. Personally I pay my taxes and vote for increases as well. But high five for the tax cheat!!!", "Legitimate question: how is a document posted by politico from early today phoney? \n\nThe document is linked in this article: http://www.politico.com/story/2016/11/donald-trump-rape-lawsuit-dropped-230770\n", "Yeah I never heard about it until just now.", "That's fine he can come back to America after some extreme vetting.  If we decided that we want him.", "If stating facts is anti-Trump than yeah I guess so.", "Recuerde Recuerde, el ocho de Noviembre.", "Yeah radio signals are freakin' everywhere today.  I'm not an expert, but am an amateur radio guy and know a little bit about it.\n\nFor one, *everyone* carries a radio transceiver today.  A cell phone is not a phone at all, it's a radio transceiver.  So are Wi-Fi stations, some remote controls, appliances, a thousand different things use radio frequencies today.  Further, radio frequencies bounce around and get in through tiny cracks.  Keeping radio frequencies out is like waterproofing when the water is invisible.  It's difficult to keep radio frequencies out short of a Faraday cage.\n\nSo, yes, is it very possible that the detected radio frequencies were coming from outside the building or some random appliance inside.  That is not to say there was no bug.  It is also possible that there is/was a bug.  It would not surprise me.  But you absolutely cannot conclude there was a bug without actually finding the bug.\n\nFurther, small bugs that transmit radio frequencies have been around since the transistor was developed back in the late 1950s.  So these devices have been around for about 60 years.\n\nThey are little microphones that pick up sound and broadcast it to someone listening outside the building.  You've probably seen someone sweep for bugs in the movies and on TV.  The device they use is a radio frequency detector.  It picks up radio frequencies and can tell you the strength of the frequency, so you can find the bug.\n\nWhich makes this story odd because they should have been able to triangulate the frequency they found.  This is super common stuff, everyone.  Look up \"fox hunts\" for amateur radio enthusiasts.  The \"fox\" is a small radio transmitter hidden somewhere.  The hunters use detection devices - often homemade - to find the \"fox.\"  You compete on how quickly you can find it.\n\nA couple more notes:\n\n1. Much more sophisticated, and harder to detect, bugs can be built by electronics hobbyists.  All the parts are commonly available through Digikey or Mouser.  You can easily find plans to build these on the Internet.  Something that won't give itself away so easily can be built in an hour or two, inexpensively.\n\n2. A few years back I ran into a guy who claimed to be retired NSA at a hamfest.  I have no idea if he actually was.  But I had an extremely interesting conversation with him.  He said he had spent his career on the hardware side in the NSA, building and deploying electronics.  This guy knew his shit.  He really, really knew his shit.  He had a ridiculous knowledge of all the civilian/public radio stuff in the area and I learned a lot - all of it true and accurate.  He didn't reveal anything classified, but told me that the devices he worked on were several orders of magnitude more sophisticated than what hobbyists build.  I don't have any trouble believing that.  Considering that hobbyists can build difficult to detect bugs, the pro stuff is probably impossible to find.\n\nWhile I don't have any evidence to go on here, finding some stray radio frequencies without finding a bug is most likely a false alarm.", "I think these early voting numbers is showing that the electorate really isn't as fickle as the variation in polls leads one to believe.  The Latinos didn't give a fuck about emails.", "So the absence of evidence of voter fraud is really just evidence that the voter fraud is done well?\n\nThe logic of the Trump Supporter is amazing. They aren't just never wrong but the evidence that shows them that they are wrong is really just evidence that they are right.", "Hillary won't purge the FBI. That would be a very very bad idea politically, and a little despotic.", "Nope. Ken Starr spent years and 100 million dollars and concluded there wasn't a single bit of truth to the rape allegations. Sorry try again. :)", "But also contribute to the death of print media and good journalism.", "imagine Hillary Clinton did this.", "&gt;She chose nothing.\n\nWhat do you mean when you say \"she chose nothing?\"\n\nShe's out there campaigning and giving speeches for Trump.\n\nAre you saying that as a woman it couldn't possibly have been her own decision?", "It's Hillary is a Satanist week.... gawd man keep up", "Except Nixon was smart good on policy, and had enough shame to step back when caught rather than tarnish his country further.", "Alright.", "Because Republicans at least the ones in power, have much weaker morals than Democrats. Don't believe it? It's not just voter suppression, purges, etc. It's intellectual dishonesty on things like climate change and voter fraud. It's the constant \"we're going to cut your taxes\" when most of the people they're pitching to get a tiny share of those cuts. It's claiming to be \"fiscally conservative\" while running up massive budget deficits. It's harping on social services and tax loopholes while reaping the majority of the benefits. It's \"I'm not racist, but...\"  I could got on and on.", "Yup. Then again a lot of our socialists also were crooks too. It all kinda just sucked tbqh.\n\nBut you got it there on the head. Latinos tend to be educated voters who don't have the same kind of apocalyptic bend to it. Probably because catholicism honestly and yea, we are almost selfish to how far we chase our own interests", "That quoted section was a bit confusing but from looking at the article, it looks like Sanchez is butthurt and wants to blame Stewart for Sanchez' own mistakes. ", "I got pulled over for speeding on one of those stretches.  The cop was like don't worry about the construction signs, they've been up for 6 months without a road crew since putting them up.  He said only slow to 45 if you actually see somebody.", "Trump cheats on his gold digging wife. What's wrong with that? Something to be proud of bro! High five!", "~~Pictures of him standing in a political shirt talking to voters near a voting place while open carrying a gun is proof enough. Judges *do* have some degree of discernment available to them. It's not like a judge would just say \"Shucks, it might just be normal behavior. Since he *could* be a stable, friendly man getting to know the community and expressing his support for the second amendment, I can't do anything.\" Laws restrict the power of the justice system but they are not always boxed in by arbitrary nonsensical boundaries. /u/banjaxe~~\n\nEdit: In the clarity of Saturday morning I've been easily convinced that my uninformed, mildly intoxicated Friday night comment may be misleading. Forty feet *is* arbitrary, and if they really wanted to they could probably find a law he was breaking. But despite having no knoweldge about this I spoke about it as if I did, and people shouldn't do that. /u/rivalarrival /u/patroclus2stronk", "&gt;She never claimed she had a college degree. Trump and his team of goons said that. She didn't even have web authority on her own website\n\n**If** all these false claims can be blamed on the guy who's running for President then it's even more relevant to examine them.", "Nah.  The world is legitimately better without Antonin Scalia.", "&gt;She's might beat Jefferson's 73% or Reagan's 49/50\n\nOh my sweet summer child\n\n", "Actually the above poster is also correct that a child can have citizenship solely by being born in America. You are both correct.", "She chose nothing? Are you saying she lacks agency because she's someone's wife? That's incredibly sexist. ", "They're only white if they agree with them.Oherwise they're a degenerate race. If they do fight for it they're a proud white warrior. \n\n", "That literally means they were not included in the \"likely\" voter model.  Clinton could very well be ahead 3-4 points. ", "Uh oh. Old white people are going to see this...", "Same. Having managers and bosses come in with their employees to caucus to make sure to stack the deck in favor of Hillary was messed up. Essentially water under the bridge now though. Amazing how someone like Trump can bring people together to fight against a common enemy.", "Like she has time she's busy with all her ritual sacrifices /s\n\nstill can't believe people believe that.", "Man I love Harry Reid I remember when he had to take the throne when Ted Kennedy passed away i think it will be Mr bernie turn soon.", "It wasn't classified when it was sent. Also I don't give a flying fuck about the emails. Why do they keep harping on it. Trumps issues are so much more problematic. ", "See that's a key failing of libertarian thought. Roads *are already profitable* to the government by virtue of allowing taxable economic activity to occur efficiently. There (should be) literally no reason to have to charge extra for them. If he wants to complain its that the tax revenue \"generated\" by roads goes to defense and such instead.", "I'm going to love voting for Clinton and against Trump but I really can't wait to vote against Rubio. ", "Pretty sure there were 15k people at a rally with just her is Ohio a week ago. But yeah those times don't matter. ", "for the love of god...\n\nkeep posting this everywhere you can before its too late", "If they hadn't bought it a more serious publication could have. They bought it to own the rights and kill it, not to publish it.", "It's a step in the right direction as opposed to associating america as a whole with racism and misogyny. The less those ideas are heard, the less they will spread.", "Named for John Barron Donald trump's alter ego that he used to hype himself up to the press in the 80s. ", "When you've been afforded greater benefits for so long that you consider it the natural order of things anyone else being risen up feels like you're being dragged down.", "Wait...he has a son called \"Barron?\" Wow.", "Hey man it's the will of the people!", "How does one go from They're to their and then back to they're?", "Just trying to spice things up.", "Condiments on the username!", "Did he name his kid after the fictitious spokesman or did he just like the name Barron so much he used it twice?", "oh my god this is TOO FUCKING GOOD \n\ni'm laughing my ass off DEPORT DONNIE", "I mean how can you seriously fail to see that???", "Worked for a private psychiatric facility...every month we'd have meetings about \"How we're increasing services to our patients\"...by cutting budgets for linen pillows, soap, shampoo...\n\nLast night i worked there, out of 13 patients on the senior unit, 12 of them didn't even have pillows. Just sheets shoved into pillow cases. Brought it up with the state board, to a big \"meh\". Over a dozen inspections in just the two years i worked there, and none of them cared. Boss bought off the right people.", "I really hope if she wins she gives him absolutely zero attention he is beneath the concern of the President.", "Early voting in Florida is open 7am to 7pm Saturday and Sunday. Bring an ID card. Google will point you to locations. \n\nIf you *must* wait until Election Day on Tuesday double-check where your polling place is, and get out there as early as possible. If you're in line when polls close then they have to let you vote.\n\n(Oh, and Amendment 1 probably doesn't mean what you think it means.)", "To all y'all saying this is a non-story take a step back and understand the headline is: Presidential Candidate Immigration Hardliner Married to Once-Illegal Immigrant. If you can't see how that's news you're delusional.", "His platform is 50% 'how do I get angry disenfranchised people to think I'm on their side so they'll vote for me' and 50% 'how do I make the rich even richer and fuck the poor lol'", "When you're so good at the military you have a great relationship and a lot of people are saying global warming is a Chinese hoax", "We'll have trucks on every corner!\n", "Barron Trump. Chief Cyber Officer. We Have The Best Cyber", "I think he gropes them more than he bangs them. The women he aspires to lay probably have some standards when they don't need a green card.", "I may get downvoted and I know how people feel about John MacCain but i have always respected him for hushing a lady insulting Obama at one of his rallies. I would never vote for him, as we disagree on many things. But I think he's a good man. \n\n", "Emails is a BS scandal; if it didn't exist they would still be talking about Beghazi. Or there would be some other BS they would use as an excuse to vote for the most unfit candidate ever. ", "Here's hoping there's similar surprises waiting in Arizona and Texas. She doesn't need either state not by a long shot - but it'd be a wake-up call to Hispanics that *yes, you are a voting block, you have the opportunity to make shit happen.* ", "You know that Michelle Obama is a lawyer right? She has degrees from Princeton and Harvard. ", "Entitlement. ", "Of course it's different: he has to win *new voters* in order to get elected.  His closing argument is undecideds not to the people he acquired at the convention.  \n\n&gt;This is the ad that may very well win him the Presidency.  It is very powerful and very well done. *This is why you have to vote against him: He could win with this.*\n\n\nNow having gotten the sober, honest accessment of it,  it's time to go into attack mode: tear it apart. \n\n\nDon't hate on the people ready to vote for Trump: ...persuade the people who *might* vote for him and be sure to vote yourself.", "The understanding is that if she complains she gets returned and he orders wife #4.", "There's a Hispanic voter surge here too.  It won't flip AZ blue but our votes are definitely not for Donald ", "&gt;$15 a week for one year with a two year contract ^^$89 ^^thereafter\n", "I can't even tell anymore.", "The Christian martyr card!", "People voting stacked the deck? ", "Bad Hombre Tuesday. 10% off at your local taco truck. ", "I voted once for myself and get this, I convinced my friend to vote for her under his own name! They'll never catch that one!", "The best lube starts with a \"B\": Billions.", "Not op but been there. The answer is autocorrect. ", "He's yapping about rounding up eleven million people for doing what his wife did. ", "A Fox News lobotomy job.", "12:00 AM Pacific time Ralston reports that Dems churned out 11,000 more voters today exceeding the 2012 Firewall! Si se puede! 72,000 Clark Dem voters in the basket.", "I have a relative that I'm worried is either going to get arrested for voter fraud or arrested for voter intimidation. Either way I'm warning them in advance so I don't feel bad when I don't vouch for their stupid ass in court.", "He said he would have voted *for* the Civil Rights Act and got booed. How is that stupid? It was an indictment of the libertarian movement in general not Gary Johnson. ", "Tldr- 94 Million includes retirees kids, the disabled, SAH parents", "All you have to do to stop them is ask them the following:\n\nWithout referencing Hillary Clinton in any way shape, or form, please explain to me why Donald Trump is not only qualified to be President, but will do a better job than Obama has for the past eight years. And please, use specifics about his policy proposals, not \"he's gonna make America great\" or \"he tells it like it is\" or \"he's gonna drain the swamp\". How will his policies *directly help you?*\n\nI have yet to receive an answer approaching anything that sounds like a non-racist rational thought.\n\nEdit: spelling", "That might backfire when zombie Ronald and Nancy Reagan end up voting for Clinton.", "I knew a nurse at the hospital where Trump made her get the abortion done. The nurse said she and and her coworkers loved Donald Trump because they all religiously watched \"The Apprentice\" at the time. \n\nShe says that everybody who was working that night when the hospital staff aborted the 10 week old fetus despised Trump after meeting him. \n\nTrump \"comforted\" his mistress for no longer than 10 minutes and during that time he was supposedly a demanding piece of shit who acted like the entire staff needed to wait on him hand and foot and expected everybody to act like it was a Yuuuuge privilege to be in his vicinity.\n\nMy friend had to bust her ass to get Trump's pumpkin spice latte for him from the cafe on the 1st floor (she worked on the 8th floor) even though she was busy AF and when Trump got it he took one sip and threw it in the little bedside trashcan while the cup was still full (he said it wasn't hot enough) and that means the janitor would have to wash out the inside of the container when he changes the bags. \n\nNeedless to say everybody who met him that day hated Donald Trump afterwards. In just a 20 minute time frame he pissed nearly the entire abortion crew off. Two weeks later Trump brought in a \"dancer\" (Aka stripper) to get another abortion (12 weeks preggers) and everybody just ignored him and the abortion crew said that you could visibly tell he was furious that they were not acting impressed by his presence while the abortion was being done. ", "Someone told him where swastikas come from.", "Exactly. No balls. The moment in the 3rd debate where Trump started visibly breaking down was after Hillary said outright \"he choked in mexico\" because he KNEW he did choke like a dog and its humiliating to someone like him who tries to be a strongman.\n\nThen again I'm just biased to that line, it was delivered like a boss. More memorable to me than nasty woman/bad hombres/\"I'll keep you in suspense\".", "I mean I'd hope she wouldn't. \n\nCause that kinda shit is why I don't want Donald Trump to be president. ", "If voter IDs are free for all citizens and made very easily available sure. Even without voter ID laws its stupid to make you have to pay for an ID since law enforcement will often require you to show ID to them.", "Nothing. Anybody who at this stage of the game doesn't realise that he's a reprehensible shit-heel of a person will never change their mind. Short of video evidence of him raping a toddler while burning an American flag I'm fairly certain that his followers will keep the faith. ", "But Trump took a picture of him eating a taco bell! That's outreach right?", "The dude had a kid when he was 60something?", "That \"something something racism\" is \"it disproportionately prevents blacks from being able to vote in numbers vastly more significant than there are cases of in-person voter fraud that it is 'trying to prevent.'\" It also isn't just *incidentally* affecting blacks when the goal is to actually affect Democrats, because similarly non-helpful voter fraud prevention methods aren't suggested that target millennials or other overwhelmingly-Democratic voter blocs.", "And if my Aunt had balls she'd be my Uncle!", "Are you describing Trump at the debates?", "She's an immigrant that worked here illegally so...", "He married someone he would have deported.", "Listen you can look at my posting history and see I'm not fan of Trump, that doesn't mean I condone violence against Trump supporters, especially ones that are just out trying to enjoy a day of fishing with their son. ", "I was thinking that this was while still obviously wrong, a bit sweet since she was trying to right by her spouse, even in death.\n\nBut then she turned out to be an election judge. She knew every reason why what she did was wrong and did it anyways and probably ended up besmirching his name and going against what he would have wanted.", "Damn you guys are touchy aren't ya?", "It's the Enquirer it IS basically the Onion applying Poe's law.\n\nIs there anyone that actually thinks they are really a news company?", "Because he's one of the most brilliant minds in America. He's also been a citizen since 2002 and is an American exceptionalist so I don't see how his native country is important.", "I believe the people of Argentina's eternal hatred of Margaret Thatcher for the Falklands war would disagree among with the others above.", "&gt; Since Abedin explained to the F.B.I., Clinton herself did not use a computer at all, she would often ask aides to print out emails or attachments for her to read. Indeed, a search of the 30,945 emails Clinton turned over to the State Department that are now online reveals that 3,668 of them included the shorthand phrase “pls print.”\n\nJesus, Hillary really is your grandma who asks you to print out articles from the Google.", "Let's not give the bedwetters anxiety now. Clinton is winn*ing.* She just hasn't yet *won.* We can all breathe easy so long as everybody remembers to fucking **vote.**", "Well if it's anything like Hindus for Trump it's probably because they hate Muslims. ", "So you want to double-down on conspiracy?", "Sorry but you're wrong. The case was dismissed. ", "A caucus is a really open process with people allowed to speak and make their case why you should vote for their candidate undecided's identifying themselves and given the opportunity to be persuaded, vote tallies taken in an open fashion, delegates chosen and voted upon to represent. I can see how doing that with your supervisor there making clear their position and seeing the results could influence a persons vote, especially if they are only marginally favoring one candidate over the other. There can be a lot of peer pressure.", "That would be glorious.", "please God yes. The world cant afford to lose America as we know it.", "Look in our defense, the Trump supporters have already quadrupled the cases of voter fraud committed in the last few years. Sometimes you just have to know when you've been bested.", "It is actually a bigger crime to lie on a visa application than it is to jump the border. 10 years in prison vs. 6 months.", "Didn't take long before Hillary got blamed for it. ", "Fool me...ya can't get fooled again*", "&gt; This place isn't that pro-Hillary\n\nOh come on you can't really believe that. I can't stand either candidate but if I even hint that I don't trust Clinton in this sub my comment disappears below threshold almost instantaneously. If I mention that I support Gary Johnson or that Clinton stole the nomination from Bernie, same thing, even if I preface either of those comments with \"Trump is a horrible piece of shit human being, but...\" \n\nYou're deluding yourself if you think that this sub isn't essentially the_Hillary. Mods don't ban people like the_Donald, but the userbase silences dissent just as well. And try posting *any* story that shows some of the shitty things that Clinton has done, and it gets removed immediately, guaranteed. ", "I texted my Trump vote in. MAGA!", "I want to smack him in the face with a palm full of  salty ball sweat but yeah I hate that guy I'm excited  he will finally go down.\n", "Dude bankrupted a casino. Why would Vegas review back him?", "People aren't actually suggesting she be put in jail over this(I think). it's more of a way to show the hypocrisy of right. Hillary is literally being accused of being a satanist now the ridiculous allegations are getting out of hand. ", "Wow. This story may actually have legs. I was sure this was going to pass without making waves.", "What evidence do you have that the rape case is fake? Trump's long history of not being a complete slime around women? Come on.\n\nI don't know if the rape case is true or not. But Trump's behavior with women definitely slow he is capable of it.", "If they basically call the election by 9 pm eastern...we all could be very hungover from the victory party", "That's what he meant when he said the media was rigged.", "First of all just because they didn't openly revolt against a black president doesn't mean they wouldn't sabotage a woman. That's an absurd thing to imply. \n\nSecond of all, if you had read the article, you'd know that it never postulates that these agents are against Hillary because she's a woman. It talks about agents having personal ties to Giuliani and Trump. \n\nLastly, no one is accusing them of making up false stuff about Clinton. They're being accused of letting their personal politics and unfounded claims from neoconservative sources influence their investigations; and of deliberately leaking/openly releasing information about said investigation in order to influence public opinion right before a presidential election. \n\nIs this trolling?", "Guess no one also gives a fuck about Jack Nicholson Jason Alexander, Buzz Aldrin, John DiMaggio and Peter Dinklage.", "You're the Florida!", "Yes. They bought the exclusive life rights to any relationship she has had with a then-married man. She signed an NDA like Trump's ex-wives employees and campaign staff.", "\"All of our ghosts are unemployed we have billions and billions of unemployed ghosts. The (((FED))) wants to hide the data, and that's what's really spooky folks\"", "She got her citizenship on faulty grounds. She lied on the application.  She's an illegal immigrant. ", "He got booed because (some) libertarians believe that the government should not interfere with businesses like the Civil Rights Act forced businesses to change their practices because a law said so. But yeah, I agree with you. It shows the narrow mindedness of American libertarianism. \n\nThe point I was trying to make (which I guess I messed up) was that the current political situation tends to support candidates who clearly have issues with reality. ", "The market has gone down every day since the Comey letter.", "My grandma attempted to on behalf of my completely senile bedridden grandfather, so there's a third for ya.  ", "-This man was actually a supporter and not a paid protestor.  \n  \n-Who is no one Alex?  \n  \n-I'm sorry, that's--  \n  \n-**No one**, Alex. No one.  \n  \n-Yes, I understand that's your answer but it's--  \n  \n-There was nothing that happened. People come up and ask me--wonderful people--why is the rigged media saying you called this guy...  \n  \n-Morry, just cut his mic. I told you this wouldn't go well. Are you happy, Morry? ... No,  just let him talk. He'll forget what's going on. We'll tell him he won and he'll be proud of himself and we can get him out of here.  \n  \n-...the blacks, and they know every four years the democrats pay lip service but they live in hell holes full of...  \n   \n-Yeah, I did, Morry. I told you it wouldn't even be good TV. Celebrity Jeopardy works most of the time. I get that. But this is just...like babysitting an Alzheimer's--...Right, sorry. How is Helen doing?...I'm sorry to hear that, Morry. Sorry.  \n  \n-...and I would never call them *monkeys* or anything else like that. Everyone but me lies to you. About me. Lies to you all the time. About...  \n  \n-Sounds like he might be winding down. ... Yeah, hopefully. You up for Calcerra's for lunch?... Wonderful. Let's end this so we can beat the rush.   \n  \netc.", "All the ones I know who are for trump are basing it solely on abortion. But that's only 3 people out of the hundreds of Latinos I know everyone else is going for Clinton, with the exception of a few angry young cousins I have who hate Hillary and are voting for Jill Stein. Luckily we live in the great blue state of Illinois. ", "No see it's okay if the Russians search your emails but if the NSA does it wrong", "First the Post now Fox News. Looks like they are aiming to take Trump out of this race now and then crush him when he starts his own network. Murdoch don't take no shit. ", "There's no such thing as proof anymore. To the_dumbasses this old lady was a plant, set up by the Hilldawg to make Trump voters look as bad as they are.", "Mental gymnastics classes are held every Sunday.", "\"Wow the milk here must be really good.\"", "\"Hmm.. your face is a little hard to see in this ID.. the picture's a little dark.. you look like a million other blac-- uh voters.. Sorry. I can't be sure it's really you.\"", "IIRC he has a bit of an obsession with the title of 'Baron'. He's never gonna get the title obviously, so he has to use it for other things.", "&gt; \"I guess I should copyright it maybe I have copyrighted it.\"\n\nI'm not sure why but this line, this line in particular, sums up the incredible incompetence of Trump for me.", "Yes the sky is actually falling. It's too late.  I'm a little cynical about hearing this from the MSM now, of all times.  It was all fun and games when you destroyed Howard Dean over a scream, or played along while thousands of American youths were sent to their deaths in Iraq, but now we need to get serious!  \"It's just our crazy political process\". Can't live with 'em, can't live without 'em, \\*chuckle\\*.  But now our democracy is in jeopardy!  \n\nThe media should have been doing their jobs instead of obsessing over revenue for the last 30 years.  Maybe they could have fulfilled their function and we wouldn't be in this situation.", "This is the kind of stuff I don't get.  When another country does something that doesn't work why is it that someone in the US thinks \"But surely we could do the exact same thing here and it would work incredibly!\"", "We should all be going to watch CERTAIN AREAS on voting day. You know what I'm talking about. Rural areas the outer city, Trumpland.", "So The_Donald then.", "&gt; Someone who can't function without a teleprompter\n\nFunny she outperformed him soundly at the first debate by every metric. How'd she do that if she \"can't function without a teleprompter\"?", "They do listen to it they take it as anti establishment and think that means he's the perfect candidate. It's fucking mind blowing.", "&gt; It won't flip AZ blue\n\nIt just might.", "Everybody should have nukes. I mean personal nukes too. They prevent government tyranny.", "Are you kidding? They are constantly whining about being the ultimate victims of everything liberal in the world. It's a neverending whinefest.", "Lorne's twitching uncontrollably over the president calling it a skit and not a sketch. ", "What does Russia gain from nuclear war? There's a reason MAD has worked. \n\nNow that's not to say that Russia won't continue to flex and be provocative. They seem determined to return to the hard line policies and tactics of the Soviet era. But they don't want nuclear war anymore than we do. They just want attention and power. They want to be relevant and acting out is how they get it. Same with countries like North Korea. Every time they want money they test a missile we panic, and then pay China to tell them to not build any more. \n\nRussia is just looking to be a thorn in the world's side so they continue to get bribed into behaving. \n\nNuclear war will never happen. If one country tried to launch against us, there would be 10 other countries launching at them for fear that it it happened to us, they would be the next target. Not to mention our own response. ", "It's weird how when you build a whole election campaign on blaming scapegoats you piss off the scapegoats and unite them against you, bigly. \n\nSadly though, this just reinforces the alt-right narrative that the scapegoats are to blame for everything.", "His recent comments about blocking any Hillary SCOTUS nominations were also not received well. ", "Hey man it looked like it was real for a second.  Experts were right about the \"Southern Firewall.\"\n\nTaught me my lesson, experts are experts for a reason.", "NH is looking iffy. Colorado is a lock though.", "Ermahgawd she didn't use her law license and instead went into and developed a community outreach program for a hospital. The horror! That is obviously less awesome than pursuing a high profile legal career.\n\nEdit her degree from Princeton is in sociology. Where she also started her experience with out reach programs. So yea i would say there was a significant benefit from *that* degree \n\nEdit again. I've worked for outreach programs. Lawyers are typically the shit at filling out grant proposals. So I'd wager she used that education as well. ", "She probably buys more shit in a month than you will in ten years. So she's putting money into the system without taking any out. That seems reasonably productive. ", "Does anyone still pretend the word \"thug\" means anything but--", "It's something that not even his casual lies make the news ... or make a difference.\n\nJust vote. FFS just vote.", "Blaming the media for Trump is like blaming WW1 on a single act of terrorism.\n\nTrump is the end result of 40 years of Reaganomics and Reaganism.  Reagan said that trees caused more pollution than factories long before Trump spoke about Mexican rapists.\n\n", "Donald had Barron run the slogan through the cyber to translate. Barron's mistake cost him his spot in the will. ", "I'll vote the opposite of anyone who believes something as stupid as this", "&gt;You picked a real winner in a hypocrite who dictates policy based on who pays her the most and stealing relief funds from the devastated Haitians.\n\nlol no we do know that trump uses charity money to buy portraits of himself and other useless shit.", "Unfortunately it has to be one. Anything less if the GOP just barely loses, their strategists will proclaim: \"See, we almost did it right, let's stick with this kind of campaigning and even go a little harder next time.\" Trumpists will take complete control over the party and nothing will change.", "Don't forget the lawsuit against his businesses for [discrimination against African-Americans](http://www.usnews.com/news/business/articles/2016-09-26/ap-fact-check-trump-on-discrimination-in-his-business) that he paid to make go away.", "&gt;It is not your “opinion” that it’s tolerable even OK to sexually assault women, label foreigners rapists and drug dealers, default on your debts, mock the disabled, scam all your business partners, donate nothing to charity and skim millions from your own charitable foundation as you threaten to build a 2,000-mile wall, murder the spouses of terrorists and spit on the Constitution. That’s not an opinion. That’s moral, social and spiritual sickness. That’s poison.", "It would not be her. It would be a bipartisan DOJ comittee.", "Have you not heard of mutually assured destruction? Russia isn't that stupid.", "And female so far 56% of voters are female.  \nThen particularly in Florida with that meltdown vs Alicia Machado, you get both for the price of one:  Hispanic females!  Sweet justice.\n\nSeems like Alicia might be a very happy woman on Tuesday evening, getting her old boss to take a long hike on a short plank.", "Not to mention surrounding costs and issues as there are now tolls for areas and roads that didn't have them before. Some places may not have alternate routes either. So if someone *has* to use the road they now have to pay extra money. \n\nPrivatization of public needs without oversight and guarantees is just so fucking bad it depresses me that uneducated and illogical people are so numerous. ", "Entitlement", "Hahaha you guys are actually pretty funny sometimes. ", "It's even worse for water supply. Just check all the cities around the world that privatised water supply... It does not work water lines have to be maintained constantly and that costs a lot of money. They can cash in for some years before the whole system is destroyed. After that happened the private companies say bye bye and the state has to invest insane amounts in a short time", "Alright alright, that's enough outta both of you. Take your upvotes and move along.", "Jesus F. Christ voting should be done by those who will actually have to live through the next president's term. Even a senile old coot should understand that. \n\nAnyway, LOCK HER UP! LOCK HER UP!", "But if this is true she lied on her immigration forms. That would make her an illegal immigrant. Not sure what you're missing here. So nice try.", "More like\n\n&gt;Clinton is winning let's just make sure it's a total blowout", "The insanity that a $0.05 federal gas tax increase is government overreach but having to pay $1.50 every time you get on a different road is \"smart\".", "Side effect of bronzer is thin skin. Who knew?", "yup read this as Obama.", "&gt; now imagine if Comcast was in charge of your daily commute\n\nI can't imagine of a better illustration of why this is terrible. Well done. Hope you don't mind if I steal this.", "Emails and talking to the press in the primary is absolutely no fucking way comparable to Trumps anti-democratic rhetoric... you sound* like a crazy person when you try to equate them. 😳", "And that's the waaaaaaaaaaaaaay the news goes", "Your apparent devotion to some political candidate is kinda creepy.  Trump must have grabbed your pussy extra hard or something.", "and in your fairyland the sky is actually orange because jewish conspiracy and donnie isn't a conman who has been using charity money to buy off attorney generals and settle lawsuits.", "Well yea there's a difference between 30+ years hounding the Clintons and finding nothing, vs. not even starting an investigation on this new breach of immigration law by Melania. Why do I have to point out the obvious?", "Rules to acceptably work illegally in the US:\n\n1) Be attractive\n\n2)  Don't be ~~unattractive~~ brown ", "You should probably watch the skits again they clearly did make fun of her too. Trump is just a hell of a lot easier to mock.", "Do you know how many babies are in nursery school instead of earning a living? So many folks so many. SAD! But we're gonna put em' to work folks, believe me, believe me. Those babies are living in hell. They've got no jobs, no education. What do they have to lose? We're gonna put em to work folks, because it's hell, big league hell, folks. Lotta real poopie pants out there. You know who they are. You know, folks. ", "i don't know if she speaks 5 languages but she's sure as shit not fluent in all of them. Donald \"child raping pussy-grabbing, teen-ogling, daughterfucking\" Drumpf doesn't has no future in US politics or business.\n\nedit: what proof do you have that she speaks 5 languages?", "The amount of stories regarding Trump would be a bombshell in any other campaign. People just simple do not give a shit about Trump and anything about him. It is alarming. ", "\"We found a handful of people who do have voter ID's who are black, and aren't opposed to voter ID laws! Clearly, because not every black voter would be impacted negatively, there is absolutely nothing wrong with it! Journalism is easy.\"\n\nSeeing as it has been shown that voter ID laws don't prevent any significant amount of voter fraud at all, what group of people is it designed to prevent from voting? Or is it not meant to address anything, and is instead a big waste of time and money from the party of \"small government?\"\n\nStatistics happen to not be on your side, so do you at least have some compelling made up narrative about what purpose it is \"supposed\" to serve?", "Vote. The Hispanic surge is real here too.", "&gt; He's every kleptocrat that's made millions\n\nNailed it kleptocrat!  That's exactly what he would be!  \nAs well as the #1 [kakistocrat extraordinaire.](https://en.wiktionary.org/wiki/kakistocracy)\n\n&gt; *Kakistocracy: Government under the control of a nation's worst or least-qualified citizens.*", "\"Four out of ten and seven babes ago...\"", "... You're refering to Trump right? Because that perfectly describes him...", "trumpers tomorrow: PLS! Common shorthand among Clinton satanists for \"Praise Lord Satan!\" Top investigators and Dan Brown are still deciphering PRINT. Working theory: Population Re-education INTernational!!!", "Sure [here's the context](http://www.nytimes.com/2016/10/08/us/donald-trump-tape-transcript.html).\n\nAfter Trump talking about moving like a bitch (his words) on a married woman that he wanted to fuck (his words), they start talking about Arianne Zucker, and Trump says \"I better use some Tic Tacs just in case I start kissing her.\"\n\nSo specifically, the context was that Trump was talking about a woman he hadn't met and how he might just \"start kissing her.\"\n\nFrom there he goes into talking about how he has a habit of just kissing beautiful women without even waiting, and how his celebrity status allows him to do anything, even grabbing women by the pussy (again, his words).\n\nThat describes intentional non-consensual touching of a victim's genital area.\n\nSo, sexual assault.", "I believe a civil racketeering trial is one where a jury can decide to assess damages even quadruple the amount. This could very well end up hurting Trump where it hurts most. He's obviously been thinking about that date, Nov 28th...", "I was going to say that this guy was a little over the top.  Then I realized he was stating facts.\n\n", "No? Why would voter ID laws have done anything in case? Mailed ballots.", "Are you claiming this subreddit has a double standard?!  That's crazy talk", "I don't really watch SNL but a quick Google search debunks this statement. Why the misinformation?", "@RalstonReports\nDems win Clark by 11000-plus, will be ahead overall there by 72K-plus, more than 2012. May be game over in NV for GOP.\n\nThis was after big turnout the previous day in Nevada. \n\n---\nThen there's FL:\n\n@MDCElections\nRECORD: 43k EV voters in one day, most in @MiamiDadeCounty history! Haven't voted? Why wait? ow.ly/1mz5305uLNQ\n\nAlso:\n@steveschale\nSo 879k people voted in Dade in the 2012 Presidential\n\n648k have voted in 2016 with 2 days of EV &amp; EDay yet to go.\n\nAnd this:\n\n@steveschale\nOn Thurs alone, 82.5% of Hispanic early voters were considered low propensity voters.\n\nThat's literally nuts.", "Such a nasty Florida.", "Not with a straight face.", "It's amazing how this guy constantly roots against America. ", "Do you really not understand the difference between the Democratic Primary and the General Election? Do you really not understand the difference between a super delegate and an elector?\n\nIf you don't like the way the Democratic Party does business then you deal with that. The DNC hasn't been able to get its shit together since 1968, and that's got fuck all to do with the general election.", "I would gladly enable ads in my browser if:\n\n1. They weren't the leading vector for malware.\n\n2. They weren't loaded with bloated and poorly-written javascript that severely affected browser performance.\n\n3. Sites would refrain from auto-play videos.\n\nUntil then stuff's gettin' blocked.  For some sites I pay a subscription to avoid ads, like Hulu and YouTube.  Make the ads reasonable, or gtfo.", "So when the very network and reporter that made the claim apologize for and retract it after being widely panned since it was debunked... it's still true for you because you *really* want it to be? \n\nHow do you call others ignorant without there being at least a slight headache from that level of hypocrisy? It's gotta take a lot out of you to maintain that doublethink. ", "Man it is something driving some lonely highway through Nevada and getting an idea of how much open country there is in the west. It's easy to understand how the disappearance of Steve Fossett could take over a year to be resolved even with \"the largest search and rescue effort ever conducted for a person within the U.S.\"  Or how Stephen King could set a novel there  where you get pulled over by some possessed cop after driving hours w/o seeing a single car on a desolated Highway 50..", "Indiana might as well be in that list. You have to have a valid reason but it's just a matter of checking off a box on one from the list they give you. Not like anyone's going to come to your house to check if you're actually sick, or not actually out of the county on election day.\n\nIf you vote in person here in Indiana, supposedly the ID info needs to match your registration. So, I went and updated the address on my driver's license since I moved a couple years ago. Cost me 10 bucks. Guy who confirmed my registration yesterday when I went to vote honestly didn't even want the piece of paper from the license branch that showed I had just updated my driver's license to the correct address. Literally said, \"Aw I don't need that,\" and just went on using my current card. Made me kind of mad since that means I spent 10 bucks for basically nothing.", "This incident is the most perfect summing up of Trump and his supporters - He could hold up a pig call it a cat and they would all go home talking about the best cat they've ever seem. And when someone points out that it was a pig, they'd call it a conspiracy. \n", "What is the hypocrisy here exactly? We have documents that prove Melania worked in US without proper paperwork.  Do you have exact documents that prove bill committed those assaults? No? ", "Over at forwards from grandma we figured it out a long time ago.", "Bad hombres and nasty women get stuff done.", "I thought his middle initial was H?  Or are we talking about two different Jesus's?", "Do you have to wait? Early voting is the new black.", "True but there is a difference between being endorsed by the KKK newsletter and being endorsed ONLY by the KKK newsletter", "wtf? source?", "*\"Nana!  NANAAA!  Por quien vas a votar?\"*  \n\"Ay mijito pues por la Hillary, por quien mas?\"", "Uber has stated for a while that they intend to replace their drivers as soon as possible with automated vehicles. I think they may already be running a pilot of this in one city", "Dumbfuckistan", "Guys is also a total pos and played and helped back Pinochet.", "Oh jeez.  You're in deep.  You should print the direct link to this post and mail it to yourself with the instructions \"do not open before Nov 5 2026\".", "I'm serious.  You don't deserve thought.  Print it seal it, address it, stamp it, and mail it.", "If she worked prior to getting her visa she lied on her green card application, so she was technically an illegal immigrant. That would make Don a green card husband, and Baron and anchor baby. This is all things he's talked against. The whole family has to go. Tough on immigration. ", "Unfortunately I think everything is too late now. ", "Yeah I don't think those are real Bernie supporters. Most of us have moved on to /r/Political_Revolution/ after /r/SandersForPresident shut down.", "It's a *false flag*! She's an *actor*!", "Jesus fuck no. I'm mocking them. ", "That's the funniest shit I've read all day. Thank you Trump supporters for being imbeciles", "\"So how do you feel now that you've beaten Donald Trump?\"\n\n\"Who?\"", "In church", "So Trump encouraged supporters to commit voter fraud they commit voter fraud. What else has Trump suggested to his supporters again?", "Ugh you sound like a Brexiter.", "If Trump wants to get rid of Melania and find a new wife he'd probably use Melania's questionable citizenship status against her during divorce proceedings if she doesn't do what he says (e.g. give him full custody wants more money than he's willing to part with, etc). Overall a shitty situation for Melania to be in, politics or no politics.", "That's more a problem with caucuses being a ridiculous process.  It's why private voting booths exist. \n\nThe only two options were to have their bosses give them time off and see how they voted or let the bosses say \"Fuck it.  I have a business to run so you're not going anywhere.\"  ", "Meh it's a free country. Call yourself what you want.", "You got some os those.... sources ?", "Also projection. They defend themselves against their own negative deeds by denying their existence in themselves while attributing the same types of deeds to others.", "Excatly they always miss that. They love saying pro choice is telling every pregnant woman to get an abortion now. NO ITS PRO CHOICE. The woman chooses what she wants to do with her health. Same with the guy who wants to cut his dick.  ", "Because the guy who wants to cut off his dong and have people think of him as a chick is just causing you *so many problems*. grow the fuck up dude. If you don't agree with someone's lifestyle choices, just don't interact with them irl. That's all you have to do. Nobody forces you to talk to them. The only person with a problem is you.", "I think this election season has made me realize- way too many people really will vote based on party and nothing else and then completely invent any and all rationalizations to justify it", "If there's anything we know about Trump it's that he would've made her pay for it herself. \n\nCheckmate, liberals. ", "I'd consider myself conservative.  I'm so tired of Republicans trying to block the government from governing.  I'm tired of them trying to win elections through disenfranchising minorities.  If I to choose between policy I don't like and that bullshit I'll vote Democrat the rest of my life. ", "I am a centrist/moderate who leans left. I have voted for Republicans on certain things in the past. \n\nRight now I am 100% ashamed at all Republicans who are going for this guy. I live in Texas and I see some of my smartest friends proudly voting for him. I have lost all respect for these people. I didn't give a flying fuck if they voted for Romney or people like him. I have truly lost respect for these people. I'm way more involved in politics than these people because of my family but the people going for him are just insane. My father who is *heavily* involved in Texas politics has been losing sleep over this. He is so fucking upset at people that he is literally silently cutting off friendships. It's just completely absurd. ", "Fucking him might not be the worst part because at least he is just physically unattractive he might shut up in the sack. Imagine being on a date with him, listening to him drone on and on about stuff he owns, boasting and bragging and money money money with occasionally him saying creepy shit like how you are a very beautiful woman, we should make love", "Yes. He a) doesn't know whether he's done so b) too lazy to find out, c) it's not original, it's been said since at least 1980 but he thinks he made it up, d) it's not particularly insightful and is an obvious combination of simple words, almost nobody else would ever consider such a throwaway phrase worth copyrighting. \n\nOh and e) of course everyone else is using it and 'loving it' Donnie, you egomaniac.", "The ones proposing it surely don't care about that angle. They do see what did work in that situation: private businesses made a lot of guaranteed money off something people can't reasonably pass on. They're salivating at the thought of getting in on that.\n\nAdd to it a following that has decided the government can do no right but \"business\" is infallible and full of the good heart of the working man and, well... They don't much care what other people have tried. Extra points for American exceptionalism that says \"we will succeed at this terrible idea, because we're better than the other people.\"", "The odd thing is that this year there will be voting fraud to combat non-existent voting fraud because a presidential candidate said not to trust the system.  Now the system is working as intended and there's radio silence on this election being \"rigged\".  Yet the FBI has been leaking information to a campaign weeks ahead of time before dropping knowledge of this days before an election.  If there were a rigging it hasn't been helping Clinton.  And if there were a swamp to drain, I'd start around the New York FBI office.", "&gt; you have the leading scientists generals, economists and more warning us not to put this guy in charge\n\n\"The Establishment.\"\n\nWhat do they know?", "Nonpartisan studies have shown that it's just not a significant issue though anecdotally this year seems to be different.", "yeah this jesus's middle name is Fucking\n\nhe's a bit more hardcore than *your* jesus", "http://imgur.com/a/QtG2J\n\nTrump &amp; Pecker together at a party signing boobs. Are we surprised by the way they treat women?", "The cross-checking system that uncovered this very case you mean?", "My grandma hasn't voted but she's 98 and can't read anymore. I could've voted for her via mail in ballot but I didn't. Because I'm a decent person and that would be taking advantage of a mentally incompetent person. And it's illegal. So whatevs.", "Compare suicide rates before and after. It's the best treatment we have for severe gender dysphoria.", "Harry enten tweeted that Harry Reid built a superb GOTV organization in Nevada. Trump's mortal enemy Reid is twisting the knife in this election.", "are you fucking kidding me this fuckhead is now going to sell US infrastructure to the highest bidder\n\nbut no Clinton is the corrupt one", "&gt; she actually went through the process as intended\n\nNo she didn't, actually. Hence, the article....", "He'll go door to door confiscating your guns since he forgot to do that while he was in office.", "If you actually watch the skits you would know she's portrayed as a power hungry lunatic who will say anything to get elected.", "Dude do you understand that you sound like a crazy person right now? Even if every conspiracy about her emails and the primary were true.... it is STILL no where near close to the insane and dangerous rhetoric Trump has been willing to say and actions take despite the clear and present risk to our democratic institutions.\n\nAgain, you sound crazy when you try to equate them. I am not saying that to be rude or incivil, I am just being honest. You do not sound stable. Get help ffs. ", "This is just another example of voter suppression from the DNC... Is what some Trump supporter is saying somewhere.", "He has *some* scruples.  It seems like he only makes the news half of the time for something respectable.  The other half tends to be something like his comments about never confirming a SCOTUS pick from a dem president.", "That also raises the point that not all people pay taxes or very little, because they get earned income credits or whatever else it may be since they don't earn enough. Suddenly you add the cost of driving through toll roads everywhere, that they never had to spend in their budget in the first place, and suddenly it's a regressive tax against the poorest people out there.", "&gt; Never thought I could get so pumped about having good highways but here I am.\n\nI'm so sick of the Party of Reagan, but I would vote for the Party of Eisenhower.  There was a time Republicans prided themselves on public investments in roads and bridges.  Not any more.  Industry can do no wrong.  Ike warned us about the 'undo influence of the military industrial complex,\" today's RNC is brought to you by a generous contribution from them.", "Trump made it an issue. Now every case gets attention and every case had something to do with him.", "if true this office should be prosecuted to the full extent of the law.\n\nStill does not excuse anyone for going out and committing voter fraud for themselves.", "I believe \"illegal immigrant\" is the preferred nomenclature.", "I want to blame the MSM and the right-wing media and mostly the Republican Party but the one hesitation I have is that however ignorant and crazy those things are, there seem to be tens of millions of citizens who are way more ignorant and crazy. I feel like our system is based on an optimistic view of human nature, but in reality people seem to largely suck. I have no answers. ", "This election is proving party over country. 100%. That is scary and absolutely fucking pathetic. ", "There's some people in Kansas who continue to vote themselves into the ground who would like to speak with you.", "&gt; He said if all I could do was \"attack his examples\" we can't properly debate,\n\n\nBut...like....that's how debate *works*. :( \n\nAnother sad example of how conspiracy thinking simply uses different rules. ", "The NYT WSJ and Economist sites are well designed, and provide quality journalism. I'd recommend subscription.", "No she is a doctor who panders to antivaxxers. That is a huge lie. Will she be pandering to climate change deniers next? ", "Wasn't it the New Black Panther party and not the Black Panthers?", "[you can't be freaking serious!] (http://lmgtfy.com/?q=Audrey+R.+Cook+alton+voter+fraud)", "He has the most loyal followers. Did you ever see that? Where he could scroll down the front page and SHOOT some typos and he wouldn't lose any upvotes! Ok? It's like incredible. No they say /u/megasansIX we love you too, man. No I mean his upvoters are by far... he's at 68, 69 upvotes... he's at 90 upvotes. Total. It's like will you post absolutely... he's at 68 or 69 total. Will you most likely post? I think it's like 90 upvotes. That's into the 90s, other Redditors are at like 10. A guy like OP? He's a nobody. They don't have karma they don't have nothing. Soft, they're all soft. Like a sans serif font.", "Yes by all means, let's hamper other people's ability to vote because Republicans can't abide by the rules of a fair election.", "&gt;Weasel words unsubstantiated claims and false equivalence.", "I have listened to his words and am sickened by them.", "For $1000,000,000?\n\nI would literally let Donald Trump have every orifice of my body, no questions asked, for at least a week. \n\nNose, ears, nothing is off limits. He can even make his own hole in my leg as long as there are EMTs around to make sure I don't die (the leg being the location of the femoral artery and all). ", "...after church.", "Mark my words we will need those guns for when the gop makes its comeback. As horrible of a shill as hillary is, Republican Hitler will be worse. All it takes is enough civil strife and the powder keg is going off. \n\nI don't want to be defenseless when my door gets kicked in for having a gay friend or not saluting the flag at a football game.\n\n", "it's better than donnie's SNL conspiracy.", "Still two cases so far ive heard of and neither was for more than one extra vote. It doesnt seem like a big issue.", "Thank you!  Yeah Illinois is not party to this voter ID dumbassery.", "So they were right dead people are voting. For Trump.", "The age old idea that conservatives make money by gutting shit and liberals spend it by progressing shit.\n\nA complete fallacy but an easy idea to get behind.", "1. Media pushes something ignorant/crazy\n2. Regular person internalizes ignorant/crazy media\n3. Regular person now ignorant/crazy seeks ignorant/crazy media\n\nThe circle of stupid.\n\nAlso 4. ???, 5. PROFIT", "the media created trump", "Trump's had the hots for her since she was 12.", "Haha that's not how it works.  You must get your information from 90's TV shows.  More than that, you seem to think you know everything.  You should stop thinking that.", "well it's really Donald Trumps money ", "*sigh*\n\nPresident Ron Paul President Mitt Romney, and President Bernie Sanders would like to have a word with you about reality. ", "It's possible he's been honest the whole time but referring to his Russian pals' plans on election day.", "- So Trump plans to sue the world or have the world sue the USA as he has the workers he stiffed? How's that gonna work out?\n- Reneging on 30yo trade agreements and alienating those who now produce all the consumables that fuel the US economy doesn't appear to be enlightenment (all while using these same agreements to line your pocket by manufacturing your products in the countries you're renegotiating with). That's truly biggly.", "\"Trump Presidency\"\nNice joke bruv.", "The Republican party has a majority of its elected members denying climate change and scientific studies on ecology environmental protection, and endorsing trickle-down economic theory when it's been proven that it does not work.\n\nBy large, the Republican (or conservative) agenda is the polar opposite of scientific proof.", "Fake AF. ", "Come now. It's just the invisible hand of the market that has dictated the roads to our malls have a toll increase of 200% during the holiday season. Increased traffic and all. ;)", "Illinois doesnt even ask me for an excuse. Ive also never had to show my ID to vote in person. I provided all my ID stuff when I registered I dont have to show it again when I vote.", "&gt; Because he's one of the most brilliant minds in America.\n\nCorrection: he is one of the most brilliant minds in *the world*.", "Caucuses are dumb. ", "Biased in favor of a supremely qualified presidential candidate over a petty self indulgent man-child? Must be a conspiracy. A conspiracy against idiocy.", "Which uni did you get your masters in international diplomacy? \n\nOr did you  get told this information by bias sources?\n\n", "I think he's Russian. ", "They bought her story so no one else could publish it. That's the story here.", "He only had a supermajority for a few months because one of the seats was contested for half a term.", "Lol those are racial slurs?", "It didn't exist very widely until Trump began *encouraging* it by brainwashing his followers into thinking the election is rigged. But you're probably not capable of understanding that effects have causes.", "\"Get more bigly with these *yuuge* training tips\"", "Fucking everyone uses adblock and it isn't enough revenue by itself.\n\nThe economists charges something like $441 for a yearly subscription - there's no way in hell they could get that per person from ads.\n\nThat being said, if you can afford it, I'd recommend a subscription.", "I thought people liked him because he told it like it was?\n\nIs it hyperbole or does he mean it?\n\n", "FUCK him up compadres ", "Stormfronters actually....", "I was told by a Trump supporter that \"racist\" didn't have meaning any more. ", "That's not the point. We're not saying that 100% of Trump voters are racist. But it is irresponsible to ignore the heavy support he has among alt-right communities. \"Dog whistle\" comments like these embolden this section of his base. This is why these kind of comments are dangerous. They give the alt-right a uniting champion in the public view. A champion who refuses to distance himself from these toxic citizens and by doing so seems to validate their opinions.\n\nThe reason he doesn't outright talk about these racist topics is because he recognizes that most of his supporters would not stand for it. But with this rhetoric, he is able to attract the alt-right while still appealing to his more traditional conservative base.\n\n", "Yes.", "What in the hell was that?\n\nIt might just be the best thing...\n\n\never ", "You forgot \n6. Heavily fine\n7. Lifetime voting ban \n8. all the privileges lost to conviction\n\nIn reality she is 88 and would just be a drain on prison facilities for a non violent crime. To do that as an election judge I would like to see full investigation.", "But I mean no matter how non-fascistic Hillary actually behaves, those people are still going to think she is Hellspawn. Might as well double jeopardy that shit.", "Yes. ", "Not an election but when Reagan was governor of California he signed a bill into law that banned open carry a loaded weapon. This occurred because the Black Panthers marched on the capital while open carrying. http://theweek.com/articles/582926/how-ronald-reagan-learned-love-gun-control", "Haha that photo was quite possibly the worst example of political malpractice ever in history. Did they sit around and say \"hey what would be a good way to show respect for cinco de mayo? I know! Let's take a picture of me eating a taco bowl that some Latino undoubtably cooked for me. That's a good way to show them I respect their culture.\" ", "Let's just call it poorly. His hotel business is suffering badly down 40% Trump branded items now are scattering to the wind with other names. Any new projects have been put on hold indefinitely.", "Nationalism is a good substitute for personal accomplishment and a lot of Trump supporters haven't been doing so great. \n\nStill though, fascism is not an ok response.\n\nEdit: Thank you, Midas. ", "And conservatives still believe Obama hates america hates them, wants to take all their guns and put them in fema camps.\n\nThe problem with conservatives is that they don't think - they just feel and act to dehumanize someone they don't like. They practically fell over themselves doing all they could to see him fail so that America would fail, all so that they could be 'proven right' about him.\n\nSick people on the right, no wonder trump is so popular. He will literally carry out their desires to destroy america, at which point they will blame blacks, women, immigrants, gays, those on disability, etc - their real targets.", "My cousin ( a Trump supporter) recently argued with me on Facebook that his Nazi support was taken out of context because those were American patriots and ACTUAL nazis are liberals. His argument was they were the national *socialists* so therefore they are liberals. \n\nI just can't even this election. ", "Yeah it's not like Donald started on with a small loan from Fred, was bailed out several times by Fred, and finally inherited the business Fred built.", "Old ladies can't cast steel ballots?", "Thinking Trump is a good way to \"bring down the establishment\" is like thinking you should set your house on fire because the faucet is leaking.", "How is this fraud? Why should his vote not count just because his body died? I'm sick of people wanting to disenfranchise voters.", "It would be so delightful if the Hispanic vote and the female vote lost him all the marbles. The two groups he's been shitting on this whole time. \n\nI'm laughing my arse off at him over the latest polling numbers from Nevada and Florida. \n\nNo reason to slow down though. Erase him. Humiliate him.", "Perhaps face your rape charges and you can bask in the sun on your way to court. ", "So Trump's dad got money from the government but since he was a 'private citizen' Trump himself got no benefit.\n\nMy daddy had slaves working in his gold mine and daddy gave me lots of gold.  But since I never personally owned any of those slaves my hands are clean.", "Damned if you didn't hit the nail on the head. Libs get a lot of shit for being holier than thou because their ideas sometimes differ from the mainstream but conservatives can be downright arrogant and controlling.", "Or not hot enough which is important to Trump.", "Thanks Obama!", "It's embarrassing how close this is. The most powerful nation in the world and the oldest functioning democracy shouldn't be so susceptible to fascism.", "Is there any way T_D doesn't get nuked by the admins by the end of the next week? They're either going to brigade every political sub and most non-political subs if they win or dox and brigade every sub if they lose. It's going to be ten times worse than the FPH drama and that was the biggest drama the site's ever seen.", "Dennis Micheal Lynch isn't even remotely close to a credible source.  He was fired this August by conservative news company Newsmax one of the largest political websites on the Internet, founded by Christopher Ruddy, **who was an early supporter of Trump’s** presidential campaign, for being waaaay too crazy of a Trump supporter **even for him**, including censoring any negative news about Trump and stating, on air, that his news program was about \"fighting for Trump\", which is hella illegal for a journalist to do.  He was literally pulled *off-air* for this.  Also for defending Roger Ailes and trying to censor news about the sexual harrasment scandal.\n\nhttp://www.thewrap.com/newsmax-host-dennis-michael-lynch-is-pulled-off-the-air-for-defending-fox-news/\n\nhttp://www.thewrap.com/dennis-michael-lynch-fired-by-newsmaxtv-in-fox-news-donald-trump-flap/\n\nHe's also one of the 19 hopefuls that starting out running for the Republican primary, as reported by Fox News:  http://insider.foxnews.com/2014/10/24/filmmaker-dennis-michael-lynch-running-president-2016\n\nThe \"news source\" that OP here has so generously linked to isn't even an actual newssite, it's his own personal website masquerading as a newssite.  According to wikipedia: \"In early 2016, Lynch created his personal news and politics website, DennisMichaelLynch.com. The site mainly features articles from Mr. Lynch's team, as well as articles written by Dennis himself.\"\n\nI'm not making this up, the fucking \"About Us\" Section opens with this horseshit:\n\n&gt;DML has built an enviable reputation for delivering the news the mainstream media will not. And he never hesitates to give unbiased political commentary, and he is always straight-to-the-point and tells-it-like-it-is **even if it means he loses his primetime TV show.**\n\n I didn't add that bolding by the way.  *That's there on the actual page.*  You can't make this shit up.\n\nWhen an ACTUAL conservative or otherwise credible news source reports the same thing, like Fox, the Hill, The National Review, or hell, even fucking Breitbart, then come back and cry about how no one is paying attention to all the Democrat election fraud.  **If this actually happened, why aren't any of the above reporting it?**  Is David Micheal Lynch some kind of investigative genius, and only he can see the truth?\n\nOH!  But there IS Voter Fraud occuring in one Miami county:  http://www.miamiherald.com/news/politics-government/election/article111029767.html\n\n&gt;A 74-year-old woman tasked with opening envelopes sent by Miami-Dade County voters with their completed mail ballots was arrested Friday after co-workers caught her illegally marking ballots, resulting in an unknown — but small — number of fraudulent votes being cast for mayoral candidate Raquel Regalado.\n\nRaquel Regalado is a member of the **Republican party.**  Who is running against *another* Republican, so it's not just \"biased Dem's trying to false flag!\"\n\n&gt;In a separate election-fraud case, authorities also arrested a second woman Friday on charges of unlawfully filling out voter-registration forms on behalf of United for Care, the campaign to legalize medical marijuana in Florida.\n\n&gt;The Miami-Dade state attorney’s office accused Tomika Curgil, 33, of filling out forms for five people without their consent. She also submitted at least 15 forms for people who apparently don’t exist — and several forms for people who are dead.\n\nCould this be the famous dead person election fraud people have been screaming about?\n\n\n", "He loves being a victim.", "I like the part where that story exists only in a massive circlejerk of right wing blog sites with nary a trace of anything that even comes close to a credible source to be found.  ", "My personal favorites are the three on the street flying worn or damaged flags all day and night without lights on them but have the gall to question my patriotism for not supporting their lord and saviour", "Investigate the cemeteries? For what like their own polling station?", "No windows in the embassy? Oh wait just more lies from Assange.", "Assuming your irrational hatred of body dismorphia is valid (which fyi, there are studies showing it's a real thing not just a \"mental illness\") and that any of your tax dollars go towards financially covering a private, voluntary operation, you really think the Republicans stand for truth and reason? The party that thinks creationism is more valid a belief than evolution, that climate change doesn't exist, and that trickle down economics works despite massive evidence that they are wrong about all these things?", "I know. No /s required... but that's how they sound repeatedly. ", "He's just pushing it.\n\nPushing it real good.", "Woah imagine Donnie's Twitter outrage over that. His ego couldn't handle that shit. ", "Drain ALL of the swamps.", "President Obama wasn't screaming at the protestor.\n\nTrump: &lt;leans into microphone&gt; Wrong.  \n\nHe was protecting his right to free speech.  \n\nTrump: Wrong.  \n\nThere's video evidence I can pull it up on my phone. Countless people have seen it.  \n\nTrump: Wrong.  ", "Only the rich cemeteries.  The poor cemeteries well those people should have to walk or take the bus to get to a polling station.", "Misleading title. \n\n&gt;“I have heard more and more chatter of [Chelsea] and bari talking about lots of what is going on internally to people” Band complains in the exchange. “Not smart.”\n\nEdit\n\nThinking about it a bit, this is an odd story. It seems anti-Chelsea which would be anti-Clinton. But the not smart comment was bout Chelsea doing anti-Clinton stuff. \n\n", "Again where is this idea that your tax dollars are going anywhere towards funding a private operation? You're practically frothing at the mouth about people who have no effect on your lives. You've made up this idea that your tax money goes to sex change operations out of no where so that you can talk about how terrible these people are for wanting to change their sex at your expense. It's like hating gay people for wanting to get married; them getting married has no effect on you, and them changing their sex to be happier doesn't effect you in the slightest. If they're happier after the operation, who gives a shit that they changed genders?\n\nFrankly, it's hilarious to see you railing about how \"unscientific\" it is for gender dismorphia to exist when it's well reported and documented. Go look in actual medical journals rather than random sites online and you'll see the facts, though I doubt you'll let that change your mind. Also, you haven't cited shit to me. Lastly, we have only been talking about two genders, nothing about a gender spectrum. Why bring it up out of nowhere? Something tells me you're just an LGBT+ bigot.", "Exactly.  Dig his movement's grave.\n\n10 Feet Deeper.", "&gt; Trump at Bayfront Park: 700/10000\n&gt; \n&gt; Obama at FIU: 5000 indoors (full capacity with also lots more on the floor) and long lines outside. \n\nThat's gotta burn. lol\n\nThe more Trump looks like a loser the less motivated people will be to see him. It's also kinda creepy how most of his crowds are just white people. It comes off pretty cult-ish.", "These guys can't even grasp at straws properly. ", "Ask yourself this seriously.. Would Trump do any different?\n\nHe has already promised to help Russia bomb ISIS and so far that has resulted in thousands of casualties", "You want your leader to represent the best of your country not the worst. ", "Oh my Lord! What a fucking hilarious joke! You had me lol-ing off my seat! It isn't at all hackneyed and shoehorned in where it's totally unrelated to the subject at hand! They should give you a Comedy Central show - you're just like Matt and Trey.", "Just like my country: young highly impressionable, and slightly terrified.", "But thanks for playing Every Vote Counts 2016!", "I do think she'll get down to business while Trump would spend (waste) his first 100 days just getting even with everyone he can.", "What gives? The guy's trying to add a little flavor to the conversation and you're acting like you bit into a peppercorn.", "When I voted last week it turned out my DL had expired the previous week on my birthday. I had no idea. Let me add there were at least 4 Trump supporters decked out in their Trump gear, hanging around \"monitoring the polls\". They looked super pissed, either because it wasn't as exciting as they expected, or because the line was mostly minorities, women, or minority women. Everyone was absolutely silent, too, which was kinda weird feeling. Is it like that everywhere? Quieter than a library. \n\nAnyway, when I got to the front of the line, the worker who checked my ID practically shouted \"THIS IS EXPIRED! (To person next to her, waving my ID) THIS IS EXPIRED WHAT DO WE DO? OH SHE CAN VOTE ANYWAY? OK MAAM YOUR LICENSE IS EXPIRED BUT YOU CAN VOTE ANYWAY BUT ITS EXPIRED.\"\n\nI was mortified (also because she said \"DID YOU DRIVE HERE ON THIS EXPIRED LICENSE?!\") (No, I didn't, whew.) I was thinking any minute now I'm gonna get hassled by some overzealous poll watcher  saying I was committing voter fraud. Fortunately they just stayed where they were, arms crossed and frowning.\n\nThen I didn't get a sticker :(", "A class act. ", "Because women have autonomy and can choose to do whatever the fuck they wanna do. And they're probably hard-nosed Republicans.\n\nThose are the only good reasons I could think of.", "Am a mid twenties Hispanic in south Florida. everyone in my social circle and their families hate Donald trump as I suspect every other Hispanic does. He fucked with Univision to start back with the pageant shit and it's all been a flaming turd since then. Never have I seen or heard about so many Cubans voting democrat. Amazing", "America has had enough of experts!", "Ironic considering Trump used his power to force a golf course on a bunch of poor Scottish people who didn't want it and is now trying to screw them over on paying. ", "Exactly this. He can't just lose he must be humiliated on a grand scale so we can show our fellow Americans and the world that we are not a nation of hate, racism, bigotry, or misogyny. Even better, we must make it known to the Republicans that we are now, and even more so in the future, a nation of diversity.", "Mental gymnastics are their speciality.\n\nMaybe it was renowned character actress Margo Martindale?", "GOP logic.  \n\nTrump saying that he can't control the violent actions of his followers shows us what a great leader he is.", "It's got his fingerprints all over.", "I fear he could do Hitler style damage but the comparison isn't really fair Hitler was a great orator.", "Even better.", "Maybe get out of bed in the morning Julian? Jesus Christ you sound like my teenage daughter when she's in a mood. ", "It is literally a worse crime to do that than to jump the border. Indeed its how most illegal immigrants come to the US and then become illegals. ", "A half brother he barely knows and who is light years away from in terms of education and background. Malik is probably mad he has not been able to cash in on his relationship with the POTUS. He even ran for office in Kenya on the \"I am the POTUS brother\" platform and still lost.", "Calm down Julian, desperation doesn't sell on Reddit.", "Found your source! Yeah that says fuck all about gender dismorphia. That basically says that post-op people are at a higher risk for many issues, such as suicide. The paper doesn't make any claim about gender dismorphia, just that they are a high risk group. Perhaps your drive to make gender dismorphia completely wrong and insane is because you have some issues you haven't worked out about yourself, yeah?", "Trump's within striking distance of the Presidency. This is a good ad and \"grab them by the pussy\" has either been forgotten or normalized. \n\nGet in touch with people you know in all States. Read up Hillary Clinton's proposals on her website. Read her Wikipedia page. Talk to people about what her record is and what she intends to do. Let's get people voting *for* something. ", "It is true you will find more reports on more right wing sites all posting images of the alleged affidavits that they conveniently host themselves rather than pointing to it on it's original government source site since it's allegedly a public document.", "Completely ignoring the part about *negotiating* a no-fly zone I see. ", "There are no windows on the Trump train but you got on of your own volition.", "GOD 2016! MAHA! Make America Holy Again!", "assange isn't a whistleblower. Whistleblowers are people of conscience who take personal risks to challenge institutions they're a part of. Early on you could have made the argument that he was one, when he was at least giving a platform to whistleblowers. Now, he's disseminating information that was hacked from US institutions by a hostile foreign power, for the purpose of advocating for an authoritarian candidate. There's no moral righteousness to being a tool of the Russian government and promoting a candidate who is openly hostile to the Bill of Rights. The false equivalency of \"the dnc is corrupt so this is okay\" is intellectually incoherent. You consider yourself an opponent of corruption so you favor Assange helping to elect trump????", "It's just one poll but she is now pre-comey levels in it which is good ", "I saw a woman on TV very critical of Trump saying she votes conservative and will be voting for the conservative party \"despite the idiot they've got on the ticket\".\r\rIt's a shame she can't see how damaging it is for the country to support such an obvious conman and narcissist. ", "Our findings suggest that sex reassignment although alleviating gender dysphoria, may not suffice as treatment for transsexualism, and should inspire improved psychiatric and somatic care after sex reassignment for this patient group.\n\nSo we should increase care for high risk groups. ", "Also go to your county's board of elections to check the closest EV polling place. One just opened up across from me and I didn't know it until I got a GOTV house call. You might have EV polling places open that you didn't have in 2012 that no one knows about and will be a fast vote. And you do NOT need your voter card just a government ID that has a signature. We voted at a new polling place at 9:30AM on. Sunday while everyone's at church. It was a beautiful thing - 5 mins tops. \n\nOh and whatever you do vote NO on amendment 1!!!", "No pity here you egotistical rapist.", "Just the modern day \"right to bear arms.\" /s", "that's why the_donald loves you they too live in somebody elses house that they haven't left in years", "In his defence he never claimed to have looked for any other sources.", "Oh let it be so. Let it be America's diversity that puts a stake through his heart. I can think of nothing that's more American than that.", "But salt and pepper aren't condiments :(\n\n*Quick check and apparently they are. Well you live and learn.*", "Also he didn't dodge the draft in World War I.  ", "I think it's a radical fecal liberation group. ", "This case was found by a routine check of names against death records.", "Romney was neck-and-neck in the polls and lost by four points.", "/u/weirdowiththeglasses do not throw away your shot. ", "I do hope she's the mastermind they think she is because she would get. Shit. Done.", "shouldn't have raped or tried to rig an election.", "Exactly. I absolutely hate how people universally praise Reagan. He was a Terrible president that had good delivery. Policy is what matters. \n", "Considering that I was balls deep in the middle of a combat zone at the time I remember... a very specific group of things.", "Assange was alright. Until he himself became a warmongering corrupt political agent. Ah well die the hero or live long enough to see yourself become the villain. ", "Black Trump supporter on BBC summed it up politicians come and go and make big promises and nothing really changes. Yes we can Obama really achieved nothing. Yeah yeah congress blah blah. People are so desperate for change and they see that in Trump, even if it is a leap into the unknown. Everyone knows Clinton is pure detached corporate warring Washington special interest career politician and they are *totally* sick of it and if you aren't happy about that then perhaps Bernie Sanders shouldn't have been pushed aside - that was when sensible socially aware change got dismissed and well here you are. The political establishment have gambled big time on Hillary hoping that everyone will take just one more dose of that nasty old DC medicine that has seen real incomes degrade and limbless veterans fighting phony oil wars.\n\nIt is so analogous to Brexit it is amazing, UK govt stifled EU discontent until half the country was ready to explode because they felt so ignored. This democratic deficit led to the nuclear option of massive constitutional upheaval, Brexit, unthinkable to most people a few years, including me who wanted to join the Euro originally.", "What a shit article.  Trump's dad got rich developing real estate by taking loans from banks that benefited from a government insurance policy which somehow equates to son directly benefitting from the program.", "In what universe was Obama yelling at a protester by telling the crowd to respect his right to free speech?\n\nYou guys need to tell yourselves so many lies each day that go against objective video-recorded reality.", "Collectively? Literally everything worth knowing.", "I wouldn't say that trump's 13 yr old victim was a woman or \"into sexual predators.\"", "Taco Trucks on Every Corner please!", "Humanity as a whole seems to have some natural defencive mechanism in play that protects us from self-annihilation. \n\nI think diversity is one of them no question about it.", "For anyone who wasn't around at the time- it really was a big deal.\n\n There was hot debate all over the country about how would she be able to raise her daughter and take care of her husband if she was working. How she was too smart to be a good First Lady. The jokes about how she was really president not Bill, because she had the audacity to offer her opinion on current issues beyond what pattern of china she would chose. \n\nEven the choice of a cat as a presidential pet was used as a talking point about how 'woman-ruled' the White House was. It's ridiculous when you look back on it, but it was all normal at the time. \n\n", "guilty verdicts help.  This is America if you forgot.", "Wow you must *really* have been triggered if you need to repeat yourself like that. ;p\n\nNext time, don't support a  fascist child rapist - fewer guilt triggers to deal with.", "The biggest predictor of voting is whether you voted the last time. Trump may have lost the Republicans the next 3 or 4 elections.", "Seriously haha.. see you at r/the_meltdown ", "It was but people either ignorantly don't realize the difference or maliciously mislead others. I'll put my money on the former, though.", "It's not like she came from Tanzania she left a nice country to make her fortune. She chose to enable Trump."], "links": ["5b89up", "5b7nvh", "5b89up", "5b83ja", "5b89up", "5b7nvh", "5b83ja", "5b7nvh", "5b89up", "5b7nvh", "5b7nvh", "5b86k2", "5b83ja", "5b7nvh", "5b7nvh", "5b7nvh", "5b89up", "5b7xl8", "5b89up", "5b7nvh", "5b86k2", "5b7nvh", "5b8ilr", "5b89up", "5b6y8s", "5b7nvh", "5b83ja", "5b89up", "5b6shj", "5b89up", "5b8en3", "5b89up", "5b6ch7", "5b7nvh", "5b715x", "5b7nvh", "5b7nvh", "5b8ida", "5b83ja", "5b7nvh", "5b7nvh", "5b7nvh", "5b7nvh", "5b826e", "5b7nvh", "5b8jd9", "5b7nvh", "5b6y8s", "5b86k2", "5b83ja", "5b7nvh", "5b89up", "5b7nvh", "5b86ak", "5b8en3", "5b83ja", "5b8jd9", "5b7nvh", "5b83ja", "5b7nvh", "5b7nvh", "5b8fwk", "5b83ja", "5b83ja", "5b89up", "5b7nvh", "5b7nvh", "5b84mq", "5b6shj", "5b83ja", "5b8ida", "5b89up", "5b7nvh", "5b7nvh", "5b8kbi", "5b83ja", "5b83ja", "5b83ja", "5b8f3i", "5b826g", "5b89up", "5b6shj", "5b7nvh", "5b83ja", "5b8ilr", "5b8en3", "5b84mq", "5b89up", "5b7nvh", "5b89up", "5b89up", "5b83ja", "5b7xl8", "5b7nvh", "5b7hwn", "5b86ak", "5b83ja", "5b89up", "5b7nvh", "5b89up", "5b7nvh", "5b89up", "5b7nvh", "5b83ja", "5b7nvh", "5b83ja", "5b6y8s", "5b7gmo", "5b86k2", "5b89up", "5b715x", "5b7nvh", "5b7xl8", "5b89up", "5b7nvh", "5b7nvh", "5b7gmo", "5b7nvh", "5b83ja", "5b89up", "5b89up", "5b6y8s", "5b6y8s", "5b8pr0", "5b8s0l", "5b7nvh", "5b89up", "5b89up", "5b8en3", "5b7gmo", "5b7nvh", "5b83ja", "5b6y8s", "5b8ilr", "5b89up", "5b83ja", "5b8pr0", "5b83ja", "5b7nvh", "5b89up", "5b6shj", "5b7nvh", "5b7gmo", "5b6y8s", "5b7nvh", "5b8nfq", "5b7nvh", "5b83ja", "5b83ja", "5b89up", "5b7nvh", "5b7nvh", "5b7gmo", "5b7xl8", "5b84vk", "5b8ilr", "5b7nvh", "5b715x", "5b7nvh", "5b7nvh", "5b83ja", "5b68iy", "5b83v3", "5b89up", "5b8en3", "5b7nvh", "5b7xl8", "5b8ilr", "5b7nvh", "5b89up", "5b84vk", "5b86k2", "5b6mfg", "5b83ja", "5b6shj", "5b6y8s", "5b8ilr", "5b715x", "5b7nvh", "5b60q3", "5b8en3", "5b7nvh", "5b7nvh", "5b7nvh", "5b83ja", "5b8s0l", "5b83ja", "5b8ilr", "5b83ja", "5b8kbi", "5b6y8s", "5b0i9u", "5b8nfq", "5b6y8s", "5b7xl8", "5b83ja", "5b7nvh", "5b89up", "5b7nvh", "5b89up", "5b89up", "5b89up", "5b89up", "5b7nvh", "5b7nvh", "5b89up", "5b6y8s", "5b89up", "5b83ja", "5b7nvh", "5b6y8s", "5b89up", "5b83ja", "5b7nvh", "5b7nvh", "5b65bq", "5b86k2", "5b83ja", "5b7nvh", "5b89up", "5b8wwb", "5b7xl8", "5b83ja", "5b6y8s", "5b7gmo", "5b89up", "5b83ja", "5b83ja", "5b89up", "5b7xl8", "5b89up", "5b7nvh", "5b89up", "5b83ja", "5b89up", "5b6y8s", "5b8uja", "5b7gmo", "5b89up", "5b8ilr", "5b83ja", "5b7nvh", "5b7nvh", "5b89up", "5b6y8s", "5b83ja", "5b7nvh", "5b89up", "5b89up", "5b86k2", "5b7nvh", "5b7nvh", "5b8pr0", "5b89up", "5b7nvh", "5b7xl8", "5b8fwk", "5b84mq", "5b8ws4", "5b83ja", "5b7xl8", "5b7nvh", "5b7nvh", "5b83ja", "5b83ja", "5b83ja", "5b89up", "5b7nvh", "5b8r1u", "5b83ja", "5b7nvh", "5b89up", "5b83ja", "5b7xl8", "5b7nvh", "5b8s0l", "5b7nvh", "5b83ja", "5b8s0l", "5b84vk", "5b7gv6", "5b8xof", "5b8s0l", "5b8uja", "5b7nvh", "5b6y8s", "5b8s0l", "5b89up", "5b7gmo", "5b83ja", "5b7vxd", "5b8s0l", "5b89up", "5b89up", "5b83ja", "5b89up", "5b7nvh", "5b6y8s", "5b8z9k", "5b6y8s", "5b89up", "5b83ja", "5b86k2", "5b86k2", "5b83ja", "5b86k2", "5b89up", "5b86k2", "5b86k2", "5b83ja", "5b65bq", "5b83ja", "5b83ja", "5b7nvh", "5b7nvh", "5b7gmo", "5b8wwb", "5b8z9k", "5b83ja", "5b86k2", "5b7nvh", "5b83ja", "5b7gmo", "5b91ss", "5b8en3", "5b86k2", "5b83ja", "5b6y8s", "5b89up", "5b7nvh", "5b6y8s", "5b89up", "5b89up", "5b7nvh", "5b83ja", "5b6y8s", "5b86k2", "5b86k2", "5b6y8s", "5b84vk", "5b6shj", "5b7nvh", "5b7nvh", "5b7nvh", "5b7nvh", "5b86k2", "5b8uja", "5b7nvh", "5b7xl8", "5b89up", "5b83ja", "5b83ja", "5b86k2", "5b86k2", "5b8ws4", "5b6ch7", "5b83ja", "5b91ss", "5b89up", "5b86ak", "5b86k2", "5b0i9u", "5b8xof", "5b84vk", "5b8uja", "5b8tys", "5b7xl8", "5b83dy", "5b83ja", "5b89up", "5b7gmo", "5b7nvh", "5b7gmo", "5b83v3", "5b89up", "5b0i9u", "5b7xl8", "5b7nvh", "5b83ja", "5b6y8s", "5b0i9u", "5b6y8s", "5b7nvh", "5b7nvh", "5b7nvh", "5b7xl8", "5b5rvz", "5b89up", "5b89up", "5b7gmo", "5b89up", "5b89up", "5b89up", "5b89up", "5b7nvh", "5b83ja", "5b89up", "5b89up", "5b89up", "5b89up", "5b89up", "5b6shj", "5b7nvh", "5b83ja", "5b6shj", "5b7xl8", "5b6y8s", "5b6y8s", "5b89up", "5b86k2", "5b89up", "5b89up", "5b7xl8", "5b89up", "5b89up", "5b89up", "5b83ja", "5b6y8s", "5b7nvh", "5b92hg", "5b86k2", "5b84vk", "5b89up", "5b65bq", "5b6y8s", "5b6y8s", "5b89up", "5b89up", "5b826e", "5b8z9k", "5b6shj", "5b6y8s", "5b6ch7", "5b7xl8", "5b8wwb", "5b715x", "5b89up", "5b89up", "5b89up", "5b89up", "5b91ss", "5b7nvh", "5b89up", "5b89up", "5b7nvh", "5b89up", "5b89up", "5b89up", "5b5s00", "5b8z9k", "5b8z9k", "5b6ch7", "5b7nvh", "5b7nvh", "5b83ja", "5b89up", "5b8z9k", "5b92hg", "5b89up", "5b7nvh", "5b6y8s", "5b89up", "5b8fwk", "5b83ja", "5b86k2", "5b7nvh", "5b7hwn", "5b7xl8", "5b65bq", "5b715x", "5b89up", "5b7xl8", "5b7xl8", "5b91ss", "5b826g", "5b715x", "5b715x", "5b6shj", "5b715x", "5b7nvh", "5b89up", "5b89up", "5b89up", "5b715x", "5b83ja", "5b94pk", "5b89up", "5b9cf8", "5b86k2", "5b99k5", "5b89up", "5b86k2", "5b89up", "5b9c7u", "5b9bic", "5b99k5", "5b89up", "5b7nvh", "5b9cf8", "5b9c7u", "5b83ja", "5b89up", "5b9bic", "5b89up", "5b89up", "5b89up", "5b9bic", "5b89up", "5b89up", "5b89up", "5b89up", "5b9dv5", "5b7gmo", "5b89up", "5b9977", "5b89up", "5b9c7u", "5b83ja", "5b9977", "5b86k2", "5b86k2", "5b89up", "5b7nvh", "5b89up", "5b89up", "5b89up", "5b89up", "5b9cf8", "5b9dv7", "5b83ja", "5b86k2", "5b7gmo", "5b83ja", "5b89up", "5b9cf8", "5b89up", "5b86k2", "5b7nvh", "5b9bic", "5b7nvh", "5b9bej", "5b9bic", "5b89up", "5b8wwb", "5b89up", "5b86k2", "5b9bic", "5b89up", "5b9bic", "5b9c7u", "5b6shj", "5b89up", "5b83ja", "5b9bic", "5b86k2", "5b9bic", "5b89up", "5b83ja", "5b89up", "5b86k2", "5b9bic", "5b89up", "5b9c7u", "5b7nvh", "5b89up", "5b9bic", "5b6y8s", "5b7nvh", "5b9bic", "5b86k2", "5b99k5", "5b7gmo", "5b86k2", "5b7xl8", "5b83ja", "5b83ja", "5b8wdt", "5b7gv6", "5b7nvh", "5b826g", "5b7gmo", "5b715x", "5b7xl8"]}