{"comments": ["Now we watch the rights hypocrisy when they say no after screaming for investigations into everything. ", "\"YOU'RE the swamp.\" (points to Christie's ass crack filling with sweat like a sluice trough.)", "No swamp. No swamp. ", "Add Puerto Rico in there too!", "So we have the FBI and the Kremlin both trying to influence an election for the same candidate. And people calling themselves \"patriots\" supporting a fascist. \n\nJust when you think U.S. politics can't get any weirder. ", "Taxation without representation in our government's capital is stupidly ironic.  ", "\"Unlike the anti-establishment Trump he told viewers, Clinton has the full backing of the U.S. security services, \"oligarchic\" corporations and the media.\"\n\nSaid on Russian-owned media (all tv media is state-owned in Russia). Remarkable.", "It's the whole premise for white supremacy. Ethnic pride is essentially this statement:\n\n&gt;I am white. Other people who are also white have accomplished great things. I have accomplished nothing but I look like people who accomplished great things, therefore I am superior to you.", "That actually sounds insane enough to be his official policy. For today. ", "Replacing the ego of the one with the ego of the whole.\n\nI think you're on to something with that. \n\nThe deep-seated insecurity of /r/The_Donald would fit with the diminishing of individual ego's.  ", "I am really starting to understand how Nazi Germany happened.  There is a section from They Thought They Were Free that fits well.\n\nNow I see a little better how Nazism overcame Germany - not by attack from without or by subversion from within but with a whoop and a holler. It was what most Germans wanted - or, under pressure of combined reality and illusion, came to want. They wanted it; they got it; and they liked it.\n\nI came home a little bit afraid for my country, afraid of what it might want, and get, and like, under combined pressure of reality and illusion. I felt - and feel - that it was not German Man that I met, but Man. He happened to be in Germany under certain conditions. He might be here under certain conditions. He might, under certain conditions, be I.\n\nIf I - and my countrymen - ever succumbed to that concatenation of conditions, no Constitution, no laws, no police, and certainly no army would be able to protect us from harm.", "I had a lady at work say what's wrong with the Russians being involved in our election!  People have lost their minds.", "Middle finger to the establishment? They are giving a middle finger to everyone but themselves. Obama and our ambassadors have already had to fight to repair bridges with our allies that Trump is lobbing molotovs at before he even crosses them.\n\nFuck Trump.", "Am I reading this right?\n\nHis argument was that the Nazis were too far to the left for his liking?", "I thought this was already established?", "I just want to make sure that you are in fact kidding. Right? Please be kidding.", "Russia questions democracy.\n\nExcuse me.\n\nAHAHAHAHAHAHAHAHAHAAAA", "Or as donald describes it \"he attacked him!\"", "Now it's documented I believe. ", "I have no problem with hot Adriatic Austrians or Slavic aliens productively employed here.\n\nEdit to include Adriatic Austrians", "Alternative headline \"Clinton sent her daughter unclassified material\"", "A Republican candidate backed by the kremlin...  ", "There's this whole conservative meme that socialism leads to fascism. Hitler was a socialist so socialism is bad. Google it of you're in for some logic gymnastics", "The Republicans have been practicing obstructionism for at least eight years now and have vowed to go even longer even to the point of not confirming any new Supreme Court justices. They are a huge part of 'the establishment'.", "Wikileaks is currently accusing podesta of being a satanist. If they had any good ammo they'd use it. They're at the 'guns empty but you still desperately throw it ' stage.", "Well they'd disagree, but they're not known for their clear and rational thinking.", "Statute. *Statute* of limitations. It's not a statue.", "LATER classified = Not an issue. At all.", "I detect a wolf in sheep's clothing.", "Obama will be President until 1/20/17.", "It will not be long at all into 2017 before people start saying 'I wish we had that Obama guy back'", "I doubt white supremacists would agree with that statement but they might after some minor editing. You could rephrase it for nationalism easily, if you consider your country the bees's knees of statebuilding.    \n\nPerhaps the Trumpets have a weird co-dependence going on with Trump and the movement.  \n\n  ", "Don't listen to this people.  Vote vote vote.  Don't let this dangerous, racist, woman-hating, moron anywhere near the White House.  And don't give his angry legitimize his angry supporters. ", "you didnt get the joke... back to t_d with you. ", "That is because Trump is [embarrassed by his illiteracy.](https://www.youtube.com/watch?v=7LFkN7QGp2c) That is why he takes it out on the poor teleprompters.", "November '16 was an inside job!", "That's... not what happened.", "It's the sanctions.  \n\nAnd the Ukraine was joining nato when he grabbed back the Crimea.  Note that going soft on Russia in Ukraine was the only thing the Trump team pushed for on the party platform during the Primary caucus.  Only thing.\nhttp://www.politifact.com/truth-o-meter/article/2016/aug/04/did-trump-campaign-soften-platform-language-benefi/\n\nBecause Manafort one of Putin's fixers in the Ukraine.\nhttp://www.politico.com/story/2016/08/trump-manafort-ukraine-crimea-russia-226573\n\nNeither Hillary nor Putin want war. Because that would be mutually assured destruction.\n\nThe weird thing is that Trump, who is cheerfully ignorant about policy, is laser-precise about Russia.\nhttp://www.vox.com/2016/8/1/12191602/trump-ukraine-russian-troops", "\"Satanic cults\"\n\nThis is how you gain Hillary supporters.  Why?  Because there's lots of great reasons not to like Hillary but you guys are always so stuck on the most batshit crazy ones, that even the legitimate attacks only garner sympathy for her.  ", "It is not illegal to send someone material which is not classified until after you send it. Period.", "If the dems get the Senate the first 100 days is going to feel like full-blown communism to the uneducated right. \n\nIt'll be glorious. ", "Or when another country does something wonderful like free college and universal healthcare, the United States says \"we could never do that because we are so big and they are so small\" it's nothing but a weak cop out", "LOL Check out [this interview](https://www.youtube.com/watch?v=xbkq7BBF7z0) it's 7 minutes long but worth it, where Trumps advisor struggles to answer Jake Tapper's questions. The ending is **priceless*, the guy literally had no answer and ran out of words.\n\nJake: But david.. It's his own words..\n\nDavid: (Shrug)\n\nWhen you hard press Trump's team about donald's own words, they fail miserably.", "Yeah I'm gonna have to agree. Remember the war on Christianity? Or how any racial equity group/policy is actually racism?\n\nEquality feels like oppression when you're the privileged one. ", "This is like the very definition of  shitpost.  ", "Yep I text mine in every day ", "It's alright. He saved up his vacation days for this.", "Thiel thinks it is ok that people just die in the streets when they cannot afford food or medical aid while he feasts on his venture capital money. His normal is what others call a dystopia. ", "Clinton enthusiasm = People realizing Trump could actually be president and *now* they wanna help out. \n\nEdit: For context I'm a salty organizer ready for this fucking shit show to be over", "&gt;Since 1920 the vast increase in welfare beneficiaries and the extension of the franchise to women — two constituencies that are notoriously tough for libertarians — have rendered the notion of “capitalist democracy” into an oxymoron.\n\n\nThiel's definition of \"normal\" terrifies me", "I feel terrible for the gold digger.\n\nEdit: feel not fell", "Not OP either but been they're too.\n\nHaven't been their though.", "*followed by*\n\n\"Wow our country has gone to shit! Damn minorities/Millennials!\"", "They have become a death cult in a way. It's just political suicide for the sake of making their government is the problem dogma a self fulfilling prophecy. It's a problem that will just spiral into itself unless we choose to stop it. ", "We learned it by watching you dad!", "But that's ok because I already got mine and everyone else suffering is a result of their character so they don't deserve it anyway!", "Settle down Donald.", "ITT: trump supporters who really cared about immigration yesterday.", "It's not just him but Trump is the poster boy for projection.\n\nLie constantly? Brand your opponent a liar.  \nShady foundation? Attack opponent's foundation.  \nDealings with foreign governments and heads of state that the public wouldn't approve of? Try to dig up any connection your opponent has to other states.  \nExist as the archetype of an out of touch billionaire trust fund baby? Hit your opponent on her ties to Wall Street.  \nSex scandals? Opponent's husband's sex scandals.  \n\nThe list keeps going on and on. Trump has a flaw, so he attacks Clinton for *the exact same thing* claiming it somehow disqualifies her, despite him doing it in far worse fashion every time.", "&gt;There are countless other people reporting on it.\n\nYou're right!  The source from your first link was reblogging from the first hit on Google about this Mike fucking Cernovich, a white-identity politics alt-righter who in an interview with the New Yorker is described thusly:\n\n&gt;Although he doesn’t appear on Fox News or syndicated radio shows, he is an expert at using social media to drive alt-right ideas into the heart of American political discourse.\n\n&gt;“Here’s what we’re gonna do tomorrow,” he said. “We have to think of a good hashtag, and we have to have all of our memes lined up.” He suggested talking points for his followers to deploy, such as “If the alt-right is racist, is Israel racist, too?” Cernovich prefers to call himself an “American nationalist,” but he often uses “we” when discussing the alt-right movement. \n\nSource: http://www.newyorker.com/magazine/2016/10/31/trolls-for-trump\n\nSource: http://www.dangerandplay.com/2016/11/04/florida-election-officials-caught-filling-out-absentee-ballots-affidavit-alleges-floridafraud/\n\nDon't forget the hard hitting second hit on google, the Independent Journal Review!  It's own wikipedia page had a *glowing* descriptiong:\n\n&gt; The Independent Journal Review was founded in 2012 by entrepreneurs and former Republican party staffers Alex Skatell and Phil Musser. The editor is Bert Atkinson, a former waiter. Skatell has described the site as targeting a \"mainstream center-right audience\".  The site has been described as a cross between BuzzFeed and RedState, and a cross between the Drudge Report and Upworthy.\n\nSource:  https://en.wikipedia.org/wiki/Independent_Journal_Review\n\nSource:  http://ijr.com/opinion/2016/11/261634-florida-voter-fraud-broward-county/\n\nOr the third hit on google, the famous Gateway Pundit, that super credible BLOG of hard-right Jim Hoft, who has been described by political media watchdog \"Media Matters\" as:\n\n&gt;But despite all this stiff competition, Jim Hoft (aka Gateway Pundit) stands out as uniquely incompetent. Hoft runs with (or spawns) almost every inane story that bubbles up in the conservative blogosphere, has proven that he has absolutely no vetting process for the sources he cites... has \"never had any training in politics or journalism,\" but now has the \"#8 ranked political blog in the United States\" that is \"frequently mentioned on top national news shows.\"\n\nSource:  http://mediamatters.org/blog/2010/09/21/jim-hoft-dumbest-man-on-the-internet/170927\n\nSource:  http://www.thegatewaypundit.com/2016/11/update-trump-campaign-preparing-lawsuit-broward-co-fl-sec-elections-brenda-snipes/\n\nMeanwhile, actually fucking credible news agencies like, I don't know, the Pulitzer prize winning Miami Herald are reporting on it without all the crazy: \n\n&gt;after Republican Party of Florida Chairman Blaise Ingoglia accused her office of opening tens of thousands of mail-in ballots without the proper review of an independent canvassing board tasked with overseeing and certifying elections. Ingoglia — who backed off Wednesday following a compromise — also said Snipes had erred by giving the public only a half-hour each morning to observe.\n\n&gt;Still, to ensure faith in the county’s elections process, Judge John D. Fry — one of three judges who make up Broward’s canvassing board — said he told members of both parties Wednesday that he would be present during ballot canvassing every day until the entire board convenes again Monday morning. He also said he would entertain all requests to observe the canvassing of ballots.\n\n&gt;“I told them anything that we do that you want to observe, I’d love to have you here,” Fry said.\n\n&gt;On Thursday, two attorneys from each party — Larry Davis and Sunrise Mayor Mike Ryan on the Democrat side, David Shestokas and Joe Nixon for the Republican National Lawyers Association — took him up on his offer.\n\n&gt;Fry gave them the tour of Snipes’ mail-in ballot processing operation, which consisted of two large rooms and about 50 visible employees at her Lauderhill headquarters off State Road 7. In the first room, Fry showed them where mail-in ballots, after being received in their sealed envelopes, are initially scanned through a computerized system and sorted. Then, next door, Fry said multiple employees with blue rubber gloves go over each individual ballot envelope to ensure that voters have penned their signature — and that it matches the signature on record.\n\n&gt;Ballots without signatures or with signatures that vary from those on file are flagged, and then the entire batch is re-entered and sorted again in the computer. The problematic ballots set aside are then given to a small group of employees with laptops who contact voters to inform them that they need to correct the problem with their ballot. The envelopes of ballots authenticated by elections staff — trained by handwriting experts — are cut in the first room and can’t be challenged on the basis of signature, Fry acknowledged.\n\n&gt;At last count, roughly 700 ballots were missing signatures, and about 35 had problematic signatures, according to Kevron Aird, an assistant for the Broward supervisor’s voter services director.\n\n&gt;The entire process is conducted each day under the supervision of an alternate of the canvassing board, Fry said. The board itself will begin reviewing and deciding the validity of any unresolved absentee ballots when it convenes on Monday, he said, and will display each ballot on a monitor for the public to see.\n\n&gt;**“I verified we’re doing it the right way,” Fry said.**\n\n&gt;In statements Thursday, both the Republican Party of Florida and the party’s lawyers association said they have representatives observing elections across the state, not just in Broward, **and the party said it only sent its letter after Snipes failed to respond to earlier attempts to address concerns about the process. The state party said it was “pleased” with Fry’s presence and transparency.**\n\nhttp://www.miamiherald.com/news/local/community/broward/article112431667.html\n\nAnd here's the article from Thursday when the Republicans first accused the county: \n\nSource:  http://www.miamiherald.com/news/local/community/broward/article112183717.html\n\nSo again, come back when ACTUAL news organizations, and not just high profile right wing internet celebrities and Republican Buzzfeed are reporting \"Election fraud!  Election fraud! PROVEN!\"  Because that's not what the RNC is saying, that's not what the judge is saying, that's not what the local papers are saying.  \n\n\"But they have a signed affadavit!\"  Yeah, the State Attorney's office is aware, affadavits aren't magic bullets that bend space and time to make everything you want to believe correct.  Have you READ the affadavit?  And do you know what the Broward State Attorney's office response was?  She was mistaken.\n\n&gt;It was determined that the ballots were being completed by SOE staff on behalf of overseas military personnel who had voted by faxing their ballots to the election office. The fax paper does not scan into the voting machines and the votes must be transferred onto a ballot that can be scanned. State law allows such a transfer of vote to a computer ballot.\n\nThat's from a press release by the Broward State Attorney's Office. The source of the quote is the Independent Journal Review (it's in one of the updates at the bottom of their original article about this).  This was corroborated by the confirmed Twitter account of Broward County's local newspaper, the Sun Sentinel 15 hours ago, although they did not release any excerpts from the release.  It is not publicly available, I checked.  I might call them later and ask to see it, but for now, the Sun Sentinel has also confirmed it in two different tweets.\n\nSource:  https://twitter.com/browardpolitics/status/794646144680923136\n\nhttps://twitter.com/browardpolitics/status/794646020823117824\n\n", "&gt; mass voter fraud that Democrats will have committed by and on election day\n\nYou have a source for that?", "Not talking about that at all also there's already hard evidence of him denying black people housing, so letting his wealthy black business associates play doesn't mean much. ", "GW Bush invaded Iraq on the premise Saddam had WMD. Later it turned out Saddam had none. But that's not half as careless as Clinton. /s", "You guys alone are gonna save this country and deserve all the credit for it. ", "I hope it doesn't get banned. I actually enjoy watching them revel in their delusion. Jesus I've watched them justify being racist to a judge because he's Mexican, a gold star family because they're Muslim and sexually assaulting women.\n\nIt's unreal how disconnected that sub is. ", "Or you know, listen to them, because it's true, but still vote.", "Smart - don't want to be dealing with those voting lines on the 28th.", "We don't know it will be close. \n\n1. Trumpers love to answer polls while there are few enthusiastic HRC supporters (response bias). \n\n2. He's really never topped 44% in a two-way national average of polls and seems to be naturally about 42 or 43. \n\n3. It's basically impossible for candidate of a major party to get less than 40 unless there is a strong third party candidate to siphon votes, in which case 35 is the floor. Trump is near the lower bounds here.\n\n4. All the polling goes after models of previous races and we know pollsters have a track record of underestimating Democratic turnout in Presidential cycles and GOP in off years.\n\n5. It's much harder to poll today due to cellphones. Automated  (cheaper) polls can't dial cells, so you're seeing largely land line responses. For several years most people in the US haven't had landlines, and it's rapidly falling. I can't find a recent statistic, but it's under 40 percent and I'm sure skews older and whiter than the population. \n\n6. We're seeing a surge in Latino turnout and this group is particularly difficult to poll. This is also true of other minorities and young people who overwhelming favor Clinton.\n\n7. Hillary has a very sophisticated data-based GOTV operation, while Trump has seen this as a waste of money and banked on TV and twitter. Essentially, this is just leaving 1-3% ( and up to 5% if you believe some) to the Clinton organization. He's handicapped himself.\n\n8. Trump is far behind in resources. He lied about being able to self-finance, and alienated many big money GOP donors. This means fewer ads, smaller staff, etc.\n\n9. We're seeing signs that he may be blown out. AZ, TX, GA and AK, and Utah are all in play, even with potentially bad polling methodology. \n\nNow, who knows....I'm not psychic and this is a sui generis odd ball election, but it sure looks plenty bad for Trump.", "That's only a story at Fox News.  ", "It'll be great! No more taxes! You can keep your whole paycheck and watch the country you grew upon deteriorate around you!", "Oh I didn't realize humor was universally objective and thus you and I have to find all the same things funny.\n\n...but it doesn't really explain the career of Carrot Top.", "Wow there's bad headlines... and then there's that^", "As a mixed girl in South Florida who's married to a Dominican let me tell you many of my Cuban and PR friends that voted for Romney aren't touching Trump with a 10 ft pole. The only people I know voting for Trump are white guys. ", "Money is in most people's standards the more money the less standards. People have literally married people on life support for money.", "Should be easy to clear then.", "You can't vote in our election comrade.", "You're allowed to vote for her but you know as well as I do that that won't make a lick of difference.\n\nIf you're really concerned about the total cost in terms of human life then I'd suggest looking into the candidates [positions on climate change](http://www.luxresearchinc.com/news-and-events/press-releases/read/trump-presidency-could-mean-34-billion-tons-more-us-carbon) and the [cost that might have](http://www.skepticalscience.com/global-warming-positives-negatives-intermediate.htm) in terms of increased war famine, drought, mosquito borne diseases etc.\n\nI just don't think people have the luxury of wasting votes for the sake of ideals when there is so much at stake this time round.\n\nHaving said that, if you live in a safe state that is not likely to be contested then one might as well vote for one of the other candidates if they prefer.", "There are more self-identified democrats than self-identified republicans in America. It's not a 7% over sample", "Historically the ABC/WaPo's final poll is extremely accurate to final vote percentages.  So  Clinton's lead/trend line is very favorable.", "It needs to be something of a middle ground if not a state. The city needs to be able to make its own budget without needing Congress ", "I understand that it's not illegal to send people unclassified material no matter how much you try to spin it.", "I like her. ", "Or you know, make a joke... ", "Im'ma tag you \"Nike\" cuz.. *woosh*", "I think he probably means because he's in London. We never get sunlight. Rain fog, wizards? Yes. But not sunlight. ", "Due to the worst recession since the Great Depression.\n\nThat's solid economics. You're right though would be nice to increase taxes to pay down some of the debt now it's stabilised.", "Latinos are going to save America from tiny orange hands. ", "And those emails.", "Was this before or after he claimed Hillary is worshipping Satan?", "I would guess \"none of your fucking business\" amount of dollars.", "Nope it's the label. It's always been the label. That's how the law works.", "Bernie supports CLINTON...", "Again your source is shit. LGTB+ people as  a whole are more prone to suicide, the control is for general population. Comparing pre-op members and post-op members would make a claim that the surgery causes higher suicide rate. The study doesn't show that, nor does the study makes no claim about gender dismorphia, just showing they're a high risk group. You're just twisting this one study to suit your needs, like a consevasive claiming global warming is fake because there is still snow. Use critical thinking, not your emotions.\n\nWhat ad hominem? You haven't shown any source that we're really paying for even 10% of surgeries. You'really full of it. Finally, being gay was considered a mental illness for decades because of people like you. What difference is there between you and those that railed against homosexuality being a thing?", "Do we really even need to investigate? Rudy Giuliani seemed happy enough to tell everybody all about it.", "Oh boy if the Democrats did this, GOP would be forming a new committee. ", "\"corruption is okay as long as you're working against the other side\" - the right", "Like that woman in Iowa that voted twice for Trump.  *\"I only committed voter fraud to counteract all the voter fraud going on the other side!\"*", "DC has a larger population then Wyoming  of course they should be a state. It's unconscionable they aren't represented in Congress.\n\nPuerto Rico if they want it.", "The Republicans will never allow DC nor PR to become a state. That's 4 more Dem senators!", "I want to know if Trump paid Guiliani or one of his firms to get access to the NYC FBI where we know Rudy has ties. Rudy worked with them as federal prosecutor, and he's even hired out of that office for his security firm. When you see him admit to knowing about the leak early, I don't think it's wrong to investigate him.\n\nAnd, if you're investigating Rudes, my guess is that he doesn't do this stuff for free. Sounds like conspiracy to commit sedition, along with Hatch Act violations for the partisan leakers themselves. ", "So there's actually a history of DC lobbying for representation in Congress. If you don't live in DC or nearby you may not know this but they have a single non voting representative in the House. That's it. Obviously this is a problem to the people who live there because they have no representation in Congress even though they live in the same city as it so there are groups trying to do this every year. \n\nNow why wouldn't Maryland just want to absorb DC? All the goodies that come along with having the nation's capital in your state, sounds great right? Well there are a lot of problems with that, foremost being that would in all likelihood require a constitutional amendment and secondly nobody in either place actually want it. Poll after poll show Maryland doesn't want their land back and DC is a living breathing entity that the residents believe they shouldn't have to change just to be enfranchised in the nation's capital. \n\nSo, why hasn't it happened yet? One word: Republicans. Go look on 538 and see what part of the country is the most liberal. You scroll down and you will see DC all the way at the bottom, it is the most liberal cluster of electoral votes there is. So they know it would 99.9% mean there would be 2 new Democratic senators and a good few reps that will certainly be Democrats as well. After everything about voter suppression this year (see NC, WI, Broward County in FL, etc.) people can't deny it anymore. Compounded by the fact that per the constitution Congress has unilateral control over the district (they have a city council and such, but Congress can really do whatever they want whenever they want if they so choose) you have to wonder why it hasn't happened yet. \n\nThis is a fascinating study in American politics, as horrible as it that Wyoming has more representation in Congress than the people living a mile away from it (no hate on Wyoming, you know why I chose you). \n\nThis referendum will pass with flying colors, but just watch for the Republican obstructionism that will make this go flat. Sadly, it's inevitable. As unpopulated as they are, places like Idaho and South Dakota still have one vote in ratifying a constitutional amendment and you can probably guess which way they'd vote IF it for some mindfucking reason it makes it through Congress. ", "That's fucking disgusting. \n\nUpvote but just this once you filthy fuck", "And a few Electoral College votes.", "&gt;During the Republican primary however, Trump said he believed Christie was involved in the Bridgegate plot, declaring at a rally in South Carolina in December: “The George Washington Bridge, he knew about it.”\n\n&gt;Prosecutors said Bridget Kelly, Christie’s former deputy chief of staff, and Bill Baroni, a Christie appointee to the Port Authority of New York and New Jersey plotted with Christie ally David Wildstein to close lanes at the bridge and create gridlock in order to punish the Democratic mayor of Fort Lee, Mark Sokolich, for not endorsing Christie for re-election.\n\n&gt;Wildstein, a high-ranking Port Authority official, pleaded guilty to orchestrating the scheme and was the prosecution’s star witness. In federal court in Newark on Friday, Kelly and Baroni were found guilty of all counts against them. The most serious charges carry up to 20 years in prison. Sentencing was scheduled for 21 February.\n\n", "&gt; paid Giuliani\n\nlol Rudy sold himself to the devil before he even left office. The man is a legit hack, and he's been fapping to Trump's twitter rage-porn for many, many years. The two don't need to pay each other, they can barely keep their hands above the table. [**Here is Donald Trump literally pressing his face into Rudy Giuliani's inflated breasts, as Rudy calls him \"a dirty boy\".**](https://youtu.be/ZgdmhjJU7OM?t=30s)", "DC has more people than Vermont too", "They're pretty much in the same boat as DC. Not the reasons for where they are politically but they have a single non-voting rep in the House and pay federal taxes and such. It's about representation because they basically are a part of the US. I may be wrong, but I'm pretty sure this is how Hawaii eventually became a state. Like \"yeah we might as well make you official at this point.\" But people cared about representation then, not now when Republicans think about how it'll just be two more Democratic senators instead of these people having a voice. ", "I've heard it as: When you're used to preferential treatment equality feels like discrimination.\n\nYours is good, too.", "This is why I voted for him twice.", "&gt; They are ARROGANTLY stupid.\n\n\"Why should I believe in science? \n\n* My dad last weekend. ", "Four rallies yesterday two today, two more tomorrow. The man is a machine. The work Bernie and Obama are doing will make a big difference in the end.", "\"Something special\" doesn't justify disenfranchising 650000 Americans (more than Vermont or Wyoming) who pay more in federal taxes than 22 other states. The current proposal would reserve a smaller federal district surrounding the Capitol, White House, and major federal buildings. This is consistent with the other 15 or so federal republics in the world, which except for the US and Brazil, allow the citizens of their capital to have representation. \n\nThe true opposition to it is sad partisanship and I think having representation in Congress is \"something special\" that we DC citizens need, democrat or republican. If you don't want to call it a state, fine, but provide us with full representation in Congress. \n\nEdit: the article is also wrong. A constitutional amendment would not be needed if the current DC was shrunk to encompass the federal zone I described. Then the remaining land could be added as a state by a simple vote in congress. The constitution only mandates a maximum size for DC and shrinking it could be accomplished by legislation, leaving the void being land that is not part of a current state, allowing for admission much like Alaska or Hawaii. ", "We can't let these people take over this country. This is just sickening.", "Such a diverse crowd there running the entire gamut from middle-aged white people all the way to elderly white people.", "He already fixed the economy and the Republicans in Congress have said he's not allowed to nominate any judges or pass any legislation so...", "Oh *now* they give credibility to the leaks when it points across the aisle?\n\nI hate this game we're playing as a country.\n\nInvestigate ***EVERYONE*** that the leaks give damning evidence against and leave partisanship out of it.", "The most famous case for how fascism happens to normal people is the [Stanford Prison Experiment](https://en.wikipedia.org/wiki/Stanford_prison_experiment). Ordinary people were split into two groups prisoners and guards, and within days the guards were torturing their counterparts, with the scientists observing the experiment so desensitized that they didn't realize it needed to be stopped until an outside visitor pointed out to them that they'd gone too far.\n\nThe only requirement for human cruelty towards another is the mental distancing of framing a group of people as \"the other\". It's why armies break people down mentally in order to build them back up as a unit, set to fight against any outside aggressor. It's what allows people to overcome the natural inclination not to fire upon their fellow man.\n\nThe truth is, we've all got more in common than we commonly acknowledge, and when we lose sight of our commonalities we lose sight of our humanity, to our own detriment.", "&gt; These Macedonian clickbaiters aren’t doing this because they support Trump Silverman says. Rather, they’re doing it for profit. A 16-year-old who runs a site called BVAnews.com told him it’s averaging 1 million page views per month. He declined to share revenue figures, but in theory that could translate to tens of thousands of U.S. dollars per year—many times more than Macedonia’s median income. \n\nGod damn Macedonian zit-pickers are going to tank our country.", "Or undocumented I guess ", "I can't claim to know Rudy very well but he certainly doesn't appear above board. He's associated with Bernie Kerik who went down for organized crime ties, and Rudy's connections to the FBI office in has something to do with his same firm that Kerik used to head. \n\n\nRoy Cohn is in this too. Mob fixer, McCArthy hack. Roger Stone, tied to both Cohn, Watergate and the Brooks Brother's Riot.", "Terrifying. Hope the reporters stay safe. \n\n", "Dead lives matter!", "Donald Trump is planning on putting a Goldman Sachs executive in as his Treasury Secretary. His campaign is run by the media lobbyists, and some of the most corrupt people in Washington. Trump himself is a member of the 1% and unlike Clinton has been that since he was born.\n\nAll of the talk of \"draining the swamp\" is all very reminiscent of Gamergate and \"it's about ethics in video game journalism\", and birtherism and \"we're just asking questions\". ", "You necrocist Clinton supporters are all the same", "neither dc nor maryland want that...", "The US and Russia will never engage in outright war.\n\nThat's M.A.D. territory and there's no coming back from it. Neither the US or Russia wants to destroy themselves.\n\nThe worst that will happen is we continue to fight proxy wars and destabilize regions of the world.", "She literally thinks the ultimate liberal put-down is to say \"black people do it too sucker\", as if letting black people do something is the ur-example of liberal hypocrisy. She's racist as fuck. ", "Me too! In one year none the less!\n\nKidding just messing with the von clownstick supporters.\n\nI will miss Obama, he has received so much criticism that has been unwarranted and,and at its core, full of hate and insecurities. I hope history books smile upon his legacy, I know I do. On top of his amazingly calm and collected professionalism, he just seems like a cool dude.\n\nGet out and vote people!!!!", "I knew there was going to be a big surge in Trump supporter voter fraud. They truely believe due mostly to misinformation, that there is no oversight of voters and think that anybody can cast 2 dozen votes and there's no way anybody can find out. \n\nSo in their minds they are just \"trying to keep up\" with the armies of liberals and \"Urban\" voters casting scores of votes and getting away with it. \n\nLittle do they know that this whole voter fraud schtick is exactly that, schtick. \n\n^edit:spelling/punctuation", "Fucking animals. The fact that donald encourages this behavior is frankly terrifying. And he wonders why the media doesn't fawn over his every word.", "The Trump campaign is so sad - make fake documents; report them in fake news.", "It's actually an issue of unchecked or non-existent regulation mainly stemming from the regean tax cuts of the 80s which inspired a wave of \"greed is good\" that our govt. officials envy and still suffer from. \n\nWhile voter participation is a huge issue, the \"fault\" isn't as easy as lazy people. It is a  cyclical issue, Let's take this as an example: if we were the land of democracy we would have made voting day a national holiday, this one oversight on our govt officials affects lower income families who cant afford to have a better job and  have bosses who tell them they will lose their job if they leave to vote. Which in turn causes said person to not vote, and not care to vote because the system tells him/her it's not for them. Thus creating a cycle where there is real voter suppression from the top down which inspires the 40% participation rate in our elections (general anyway.) ", "The so-called \"swamp\" that needs draining is Republican obstructionism. Obama was unable to make reasonable reforms because of Republicans who literally blocked him for 6 years (D's had majority in 09-10, and good legislation was passed). Look at actual House procedural votes in the last 6 years; Republicans don't govern, they obstruct. They literally SHUT DOWN THE GOVERNMENT because they didn't like Obamacare. \n\nJust spouting impotently \"DC's corrupt!\" doesn't understand the problem. We need people that want to govern in the government. ", "If you're white they just let you do it...grab em by the ballot.", "\"It's ok if I do it it's those other people you got to watch out for! /s", "&gt; Bernie Sanders is the one who is a Nazi afterall the Nazi's were National **SOCIALISTS**\n\nYou have no idea how many times people told me this during the primary, and then linked being left at all with being a nazi. ", "Nope the campaign pays the federal government for it.\n\nhttp://www.npr.org/2016/07/07/485097272/fact-check-air-force-one-who-pays\n\n&gt;\"There are payments that are made by the [Democratic National Committee] to the federal government anytime the president is traveling for political purposes,\" White House spokesman Josh Earnest told reporters, who were also flying aboard the presidential 747. ", "'It's only 'non-patriots' that need investigation'. ", "Or at the very least remove all the shitty laws preventing them from getting help", "you can tell because an e-mail was discovered in which clinton's campaign manager's brother's roomate's cousin was invited to brunch by....wait for it...ANOTHER ACTOR. clearly this is her inner circle at work.", "So an affidavit from a former not current, employee with no evidence except their word. \n\nHm, seems legit ", "Yeah why don't we own the president? Why did we give him free will to do and say what he wants? Since he works for us we own all of his time, right? Just like how your employer owns every minute of your life.", "The only question Russia should have for US democracy is \"What's it like to be a democracy?\"", "What exactly should he be doing instead?", "Lol EEEEEEEEEEE-MAAAILLLSS. This is rich coming from people who attack Bill Clinton, even though he isn't running for president either.", "...well there goes my breakfast...", "It's a good thing that Hillary and Trump aren't equally corrupt and unfit then. ", "", "Why is he eating dinner every single day instead of you know being the president?\n\n", "No one is Goin to start a war with Rusdia.", "Lol aren't big fish stories ones that are greatly exaggerated and hyperbolic with nothing big about them? Apt word choice", "Yep we've gone from\n\n&gt;Four score and seven years ago, our fathers brought forth on this continent...\n\nto\n\n&gt;let me assert my firm belief that the only thing we have to fear is fear itself\n\nto\n\n&gt;And so, my fellow Americans: ask not what your country can do for you; ask what you can do for your country\n\nto\n\n&gt;No puppet! No puppet! You're the puppet!", "If you read the article....\n\n\"The new state would embrace the current 68 sq mile (176 sq km) district except for a core of federal property around the White House Capitol and monument-rich National Mall.\"", "He's also a dictator in an anti-American authoritarian government which rejects democracy. You think maybe that has something to do with it?", "Captain Obvious is obvious.", "They are not equally corrupt and unfit thankfully. ", "Wrong ", "Because it is owned by Adelson who is a GOP supporter and backing Trump.", "When you've got nothing else going for you nationalism is free.\n\nI think that explains a lot of the fanatical republican base.", "\"Democrat Party\"\n\nKinda gives away the bias of the source.", "HUGE WIKILEAKS EMAIL YESTERDAY!!! Hillary [likes](https://twitter.com/nxthompson/status/794642496634703876) to drink tea and read Human Rights Watch reports!! BREAKING!!", "Serious question. What advantages would it be to the United States to have PR a state?", "Not buying it also from my perspective as a black person there is only one party trying to diminish my right to vote and it's not the DNC.", "Hey when you can't assemble a winning coalition in America, you have to go international.", "Bu bu buttt Okeefe had undercover video /s", "I'm not sure if I'm at all comforted by the idea of a commander in chief who's petulance and incompetence is such that it for all intents and purposes would prompt what would effectively be a military coup.", "Then shrink the size of the borders to be just SCOTUS Congress, White house, and the Mall. No citizen should lose their right to vote and be represented due to where they live", "This should really be the takeaway here.", "And what has HRC said or done this election that's so unpresidential?", "Hispanic voters might save us from dur fuher. ", "The billionaire who inherited his money from daddy who lives in a penthouse in Manhattan, takes limos everywhere, had a multi-season reality show on NBC featuring celebrities, who had the Clintons at his wedding, is just the anti-establishment guy we want!", "The Satanic dinner tweet was truly sad Wikileaks basically on par with the National Enquirer at that point.", "Some I assume, are good people.", "Why does the media even participate in this? My story would be very short \"Donald Trump whipped an angry mob into a psychotic furor in a building across town last night.\"", "You are absolutely allowed to sit with your grandma and discuss the ballot ask her choices and fill in the ballot for her.  Otherwise physically disabled people could not be allowed to vote which is not true. ", "This is an especially egregious fake news outlet. Not sure how a website like this is allowed.", "There is no end to your delusions. I would like to remind everyone that this new child sex trafficking delusion is based on seeing some emails where Clinton campaign staffers talk about pizza and hotdogs and deciding that they're talking in code about children. Yes seriously.\n\n How? How are your brains so thoroughly broken? And you accuse Hillary of having brain damage. Christ...", "I just watched the show  I've been a regular viewer for the last four years. Never have I never seen Bill like this. He is a step ahead of the media and the current discourse. \n\nHe spoke about Russia and the FBi working for /with Trump, -  the way he articulated this sent shivers down my spine.  \n\nUSA you are on the edge of something very dangerous. \n\n\n", "Hillary used her home computer. That's all you have. It's literally NOTHING. ", "You talked about mass voter fraud committed by Democrats as if it were a *fact*. A fact /r/politics is deliberately trying to obfuscate. But now that your bluff is called it's \"just a guess\".", "The big fish that has taken years upon years without anything approaching criminal charges..\n", "Was it classified at the time she sent it? If not it doesn't mean jack shit. ", "Are you seriously claiming Clinton might have sent her daughter troop movements? Jesus Christ conspiracy is leaking.             ", "With all the melodrama of the campaign it's easy to forget just how historically significant this moment is for America. These women help us remember. ", "Gee Putin is for the candidate that doesn't want to back NATO nations so Russia can expand unopposed, what a complete shocker.", "Trump also deleting emails and documents when under court orders so I guess we will have to call it even. Thankfully Trump has done far worse along with this and has terrible policies to boot.", "Let's talk about your \"guys\" who I suspect are more stereotype than rooted in fact.  How do you know they're not citizens (or at least legal residents)?  How do you define \"all day\" and do you know what they do when they're not there?  \n  \nThere was a pretty famous study years ago called Tally's Corner about an area in Washington DC where there were commonly black men of working age hanging out and drinking on the stoop in the daytime.  \n  \nThe long story short is that they were stereotyped as \"welfare bums\" by whites driving by who would see them.  The sociologist who investigated it found that they worked full time jobs either at night and/or over weekends and so when people would see them on a weekday morning or afternoon it was their \"weekend\" or after work social time.  Often there were babies or young children in the apartment/house so they had to socialize outside to keep the noise down.  \n  \nThat's not to say that there weren't problems there, many of which stemmed from poverty issues, but be careful when you judge someone by the parameters of your own life.", "Yum! Can't wait to see what recipes they have. Satanic blood orgy??", "Username checks out", "The idea of a partisan FBI working with Donald Trump AFTER the election is more terrifying than a partisan FBI working to get Trump elected. This is serious banana-republic level stuff.", "Liar or idiot?  With Trump you never have to choose!", "I actually cannot fathom that a human-being would not be able to comprehend the sheer degree of hypocrisy that is occurring here.\n\nEarlier this year Australia endured the longest election in our history - it lasted for 54 days. The result was a near tie. But despite the thin-ness of the margin that our current government holds not a single credible person has questioned the integrity of our electoral system. We've had controversy after controversy since, issues with our governer general, the government unable to pass bills (good) and so forth. Currently, the Australian \"equivalent\" of the Republican party is in power, but it's still functional. The left-moderate party has enough power that they can stop most unreasonable bills. So many questions have been asked about the competency of our PM, but nothing at all has come close to just how socially, mentally and legitimately incompetent Trump is.\n\nIn 2004 Australia, a hopeful Prime Minister entirely lost his chances at the role because of, and get this, shaking the opponents hand too firmly. http://www.news.com.au/entertainment/tv/mark-lathams-famous-overly-physical-hand-shake-with-john-howard-revisited/news-story/ae926777c1a669d8a6d145c15f2e8da0\n\n\nImagine for a second if that same standard was applied to Trump. \n\nImagine the headline: \"In Australia, a Prime Minister lost the election for shaking his opponent's hand too firmly. In America, a Presidential candidate may win after bragging about sexual assault.\"\n\n\nEven John McCain for example, who as far as I know is a more reasonable Republican, has proudly shown complete and enthusiastic disregard for democracy in committing to obstruct supreme court nominees. This is literally disregarding democracy. That is saying \"Even though the majority American public has given someone the power to select a future Supreme court justice, we are going to reject their decisions\".\n\nThe fact that Republicans cannot realise that investigating this issue is important is so blatantly hypocrital that it is almost unbelievable.", "This is the plan all along.  Make up some terrifying-sounding story get it out into the public, apologize later.  The negative impressions this story creates in people's minds will not be undone by Fox admitting it wasn't true.  They are probably celebrating that Trump is still citing it.  Nobody on the Right has any regard for reality anymore.", "&gt; The fact that Republicans cannot realise that investigating this issue is important is so blatantly hypocrital that it is almost unbelievable.\n\nThey are fueled by blind hatred.\n\nThey literally fucking HATE liberals and Democrats. They fantasize about firing squads violent revolutions and civil wars. They are driven by revenge fantasies.\n\nIf given the choice between authoritarian dictatorship with Republicans in charge, or a Constitutional Republic with Democrats in charge they will passionately vote for the dictatorship. It's hatred, not just rivalry or political disagreements. They want revenge and they want punishment for those not on their team.\n\nThey are rapidly allying with *Russia* because they hate half of America so much they now have a common enemy.\n\nThere is simply nothing you can do to reason with someone who literally considers their political opponents to be an evil that needs to be executed/imprisoned. \n\nThey are off the deep end, hypocrisy is one of their more reasonable traits at the moment.", "If anyone in Clinton's camp was associated to someone like Christie who's aids were just convicted -- Trumpster's would be calling for her to be put in front of a firing line.\n\nThe hypocrisy is reaching astounding levels now", "In Trump's world the truth is something you create, not something you discover.", "Trump is horrible it blows my mind how many people support him\n\nI knew racism still existed but I didn't know it was this bad", "People who genuinely support Trump (i.e. not internet trolls) should watch the Obama video then the Trump video.  It's kind of clear who the villain is in this story.", "I know but they are essentially capped at 3 (which they wouldn't be if they were a state); and PR has no electoral votes. If they were a state they'd have about 7.", "It's possible. A big reason behind that is the GOP's complete disregard for people of color and immigrants. Their short term attempt to rile up their base has long term negative consequences. And in states like Florida which have increasing populations of the same people they are alienating the GOP is pushing away a huge swing state in future presidential elections.", "Month old account\n\n-100 comment karma\n\nThis is a Trump supporter pretending to be a Sanders supporter.\n\n", "DC has 3 EVs", "\"I eat paint chips and make assertions that make it sound like Hillary hasn't been investigated nonstop.\" - You ", "The problem is they won't accept it. A family member of mine is apparently supporting Trump on the basis that he will be good for the economy (*eyeroll*) I pointed out to him that IF Trump actually cared about the economy or protecting American jobs, then why doesn't he manufacture his goods in the United States instead of China? Why does he use Chinese steel instead of American steel? Why do his companies lobby for increased work visas to hire foreign workers rather than hiring American citizens and paying them decent wages? His answer was stunned silence until he said, \"Well Hillary's tax plan will kill my job and I'll have to sell my house.\" to which I imagined myself banging my head against a brick wall. You can't talk sense into them when they've had their emotions justified by a louder, more powerful voice. That is the terrifying thing and that is why he has to lose because if he wins, all of their fears and paranoia will be given legitimacy. ", "That's the whole point of \"mistaken\" reporting like that. Nobody notices the retraction but they'll never forget the lie. ", "[deleted]  \n ^^^^^^^^^^^^^^^^0.4548 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/04407)", "Republicans. The party of family values.    LOL.", "Came here for the article. Stayed for the photo of the stereotypical hippie who appears to be trapped in 1999. He even has a discman in his pocket as far as I can tell.", "Imagine the script for a romantic comedy. Trump wants a cheap divorce and his wacky lawyer suggests running for president on a deportation platform. During the course of the campaign and the hardships they endure their love is reignited but there is one problem, Trump is winning. Can he throw the election in time to save his marriage? ", "Obama literally chastised his own crowd and defended the protestor. \n\nThe concept of grace has never entered Donald's goon brain.  ", "You're not even kidding.  \nhttp://www.npr.org/2016/08/03/488477378/for-donald-trump-mike-pence-brings-conservative-christian-cred  \n&gt;INSKEEP: That you can - basically that you can determine reality by thinking the right way. Is that it?\n\n&gt;CROMARTIE: Exactly. And so any problems you have in life - it's because of negative thinking.", "Don't let the facts get in way of a good storyline ", "The wealth gap in that potential future state will blow people's minds.", "You mean he lied.\n\nLied.\n\nJust fucking say it and stop supporting the lying fascist.", "The kids were paid by the Clinton campaign to create a diversion for Podesta to fly over battleground states and drop Satanic chemtrails. \n\nYou heard it here first", "I've been watching Bill for almost ten years now and never once have I actually seen him be this serious. Watching this last night made me even more nervous than I already was, because he's absolutely right with this. If Trump tries to sue the people he disagrees with to silence them into obedience, just wait until he has police, mandates, and the military under him.\n\nThis election is no fucking joke, people. If you think you can vote third party or sit this one out because Clinton is dishonest a quarter of the time or because she screwed Bernie over (who I fought so very hard for), then you're welcoming Donald Trump into the White House. \n\nPlease, think long and hard about your choice, guys -- I get the impulse to vote Stein or Johnson. It took me a good long while to decide not to vote Stein like I did in 2012. Some things should transcend party ideologies or personal grudges, and a need to stop Trump is the highest of those things. The country and the world can handle four or eight years of Hillary. It can't handle the same with Trump, at least not as a democracy.", "It's hilariously stupid. They're literally screaming \"She's a witch!\"", "Meanwhile Trump can't even get a past Republican president to endorse him. ", "It's sad that half the country was too preoccupied with white anxiety to see it but Obama is the coolest dude to ever be president. So classy.", "The Trump cult phenomenon will be studied for generations.\n\nThey went fucking crazy. Like fully embracing even the most insane conspiracy theories and far fetched interpretations and accepted a wholesale rejection of reality. All because some conman ran for president and told them the world is out to get them.\n\nI hope they can recover from this election. I really do. Having half the country lose their damn minds is bad for our future. \n\nThis \"spirit cooking\" episode is so unbelievably stupid and delusional it's hard to even explain or empathize with it. They literally lost their minds over some artist having a dinner. Like literally believing in blood orgys and child sacrifices... People have probably been committed to institutions that believe less crazy stuff.\n\nJesus Christ Trump supporters get a fucking grip.", "It's fun to watch everyone's edgy 16-year old shithead suburbanite nephew and everyone's crotchety, ignorant Uncle Facebook join forces to Make r/forwardsfromgrandma Great Again.\n\nI'm glad I don't have to look back on 16-year old me and justify spending all year hanging out with angry old white folks on the internet and triggering SJWs at school for the keks.", "\"California -- home to 40 million people and the world’s sixth-largest economy -- is likely to relax its restrictions on pot for recreational use according to the latest polls. And similar measures in Arizona, Maine, Massachusetts and Nevada also have slight leads. Supporters believe a California victory, let alone a sweep in all five states, could be what they need to change the federal discussion about the drug, which is currently on par with heroin under U.S. law.\"", "DC will always be capped at 3. There is a finite amount of space and a building height restriction. You're not getting more than 1M people in here and that's what it would take to get an additional EV if we were a state. See Montana having only 3 EVs. ", "Check out his post history where he denies man-made climate change.\n\nAnd we're to believe he's voting for a candidate who's party makes it their No. 1 issue.\n\n/u/Noneoftheabove2016 is a phony plain and simple.", "I think Ward 2's median income was around $120k while Ward 8 was around $38k. It's pretty insane once you cross the Anacostia River.", "\nThe owner of American Media Inc parent co of the National Enquirer, is owned by David Pecker, a friend of Trump's. No negative stories about him are allowed to be published there (or in Star, National Examiner, The Sun, OK Magazine, The Globe, Radar Online, Shape, Flex, Men's Fitness, Muscle and Fitness and some other publications), and they are required to write positive stories about Trump. It's well known. They also put ads on the cover.", "Not anymore. Right now the Democrats really want PR to become a state, whereas the GOP really don't want them to. The GOP will forever block it since you need 2/3 of congress to approve the GOP will continue to hold half of congress.", "so now hillary worships satan? is this what losing looks like?", "No. \n\nI mean it **is wrong** for sure but that's not **why**. It's just a bit fucking on the nose for the Russian media to do this.\n\nI mean for a start, Clinton doesn't have the full backing of the heavily Republican FBI. ", "Why would any self respecting constitutionalist support the war on drugs? It's diametrically opposed to everything the founders stood for especially Jefferson.", "Fox news ran a story on it saying she definitely had three Trump abortions. \n\nEdit: I redact my earlier statement. Feel free to use it as you wish, though. ", "Would be awesome if Rudy ends in jail after all the shit he has been up to. ", "I'm not sure it would require a constitutional amendment. The constitution mandates DC's maximum not minimum size. DC has been shrunk before by a simple resolution in congress when a chunk was retroceded back into Virginia in the mid-1800s. If you shrunk the size of the current DC to the Capitol/White House/Federal building area by legislation just as part was retroceded, that would leave a void of land that is not part of a current state that could be admitted by congressional vote like Alaska or Hawaii. \n\nEdit: a word", "At the end of Obama's term we have 4.9% unemployment rate, a 2.9% GDp growth, and the lowest crime rate in history.  \n\nThat's a pretty good track record and we should keep that going.  ", "It totally is ridiculous. The entire country of Canada shamed one of our politicians after she made a huge upheaval after being \"elbowed\" by Trudeau. Trump's sexual harassment gets turned into a new slogan for him in the US. \"Grab her by the pussy!\" Is on tshirts. It's night in day in comparison American politicians need to be held to a higher standard. ", "Of course he is. He's a piece of shit.", "Are you even old enough to vote? Acting like an absolute child. Your candidate didn't win? Lost by 3 million votes? Better throw a tantrum.", "DC's historical population was significantly higher (more than 800k in 1950) so 1M someday is hardly unthinkable.", "\nAny truth to the rumors that she had Trump's abortion?\nSome are talking about it and some of those talking about it are the smartest people, the best people. People who would know, BELIEVE ME.\nWho knows? Some say it's true.", "You need to work on your agreeing skills.", "The people of Florida don't want a racist misogynist, and fascist asshat destroying the economy with trickle down economics.\n\nGood on you, Florida!", "That's it. The National Enquirer's reputation has been stained for all time by this. I shall never take that newspaper seriously again.", "They've given us Lin-Manuel Miranda. It's the least we can do.", "&gt; *The horrible thing about the Two Minutes Hate was not that one was obliged to act a part but that it was impossible to avoid joining in. Within thirty seconds any pretence was always unnecessary. A hideous ecstasy of fear and vindictiveness, a desire to kill, to torture, to smash faces in with a sledge hammer, seemed to flow through the whole group of people like an electric current, turning one even against one's will into a grimacing, screaming lunatic. And yet the rage that one felt was an abstract, undirected emotion which could be switched from one object to another like the flame of a blowlamp.*\n\n&gt; *Then the face of Big Brother faded away again and instead the three slogans of the Party stood out in bold capitals:*\n\n&gt; *WAR IS PEACE*\n\n&gt; *FREEDOM IS SLAVERY*\n\n&gt; *IGNORANCE IS STRENGTH*", "There's a pretty major difference in that the FBI is using these leaks to influence the election.\n\nI have no problem with leaks. I have a severe problem with our government tampering with our election.", "The only thing Project Veritas has ever proven is what a dishonest prick O'Keefe is.", "You mean the one that sexualised her underage daughter!?  Apples and oranges.", "They are literally incapable of dissent against Trump. If Trump says something it *becomes* truth to them. It's much closer to a religious devotion than political affiliation.\n\nI've never seen so many people become hypnotized/devoted to a conman and driven to such extremes to defend the indefensible. It's scary.\n\nYes Hillary has supporters, but they are almost entirely reluctant \"better than Trump\" and open to admission of her faults. She's just a fucking politician, there's no cult.\n\nBut Trump supporters are cult-like followers almost entirely incapable of objectivity.", "Maher was freaking out and this is a guy who is good friends with Ann Coulter and Kellyanne Conway and has respectful political conversations with both of them.  How many red flags do we need?", "The next time a Trump supporter complains about biased media show them this headline. It's embarrassingly charitable.\n\n*He lied his face off.* ", "The way Trump described it as Obama 'screaming' at him it honestly sounds like the Trump campaign planted the protestor hoping to get that reaction, but when Obama was nice to him Trump stayed on the script anyways.", "Pretty sure just about every establishment organization is on Hillarys side by a long shot. I think all Trump has is conservative media and Russia. \n\nLike really Goldman Sachs? That's me whole financial industry is all over Hillary. They hate Trump. ", "What advantages to the USA?\n\nNot really that much except millions of citizens will have a voice in the government they already pay taxes to.", "You should politely suggest he stop taking all his medications if doesn't believe in science.", "Because why not merge North and South Dakota? Because both states have their own identities.\n\nMerging us into Maryland would actually cause us to lose autonomy. We'd likely get gerrymandered to share reps with Potomac and PG Counties. We'd be under the whims of Annapolis and while having Senators would be nice they wouldn't really be \"our\" Senators. \n\nSo the 650k citizens of DC would actually lose rights by merging us into MD. Plus MD doesn't want 650k new people into their state swinging the state political pendulum. ", "I'm sure he's going to be 100% honest once he gets into office though.  /s", "Losing by 3mil votes = cheated clearly.\n\nIt's absolutely throwing a tantrum. You didn't get your way, so instead of acting like an adult you're just going to bitch and moan and not bother voting. And you think you're special for doing it, which is the funniest part.\n\nMost Bernie supporters liked him because they thought he would be best for president, myself included, and now that he's out the grown up adult thing to do is look at the 2 candidates that you can choose from and pick the best of the two, which is pretty clearly Clinton. But again, I doubt you're old enough to vote.", "I love when trumpettes show just how misinformed they are by repeating this talking point.\n\nHillary isn't setting up a no fly zone for *all of Syria* but rather for pockets of land within Syria. Such as setting up a 2 mile radius no fly zone around a hospital that way injured children don't need to worry about being blown up going to and from the hospital. \n\nSo you are already fundamentally wrong. But even if you were right and Hillary made *all* of Syria a no fly zone there still wouldn't a be war. You underestimate just how much Russia would try to avoid going to war with the US at all costs. I bet you were one of those people who expecting WW3 to break out when Turkey shot down a Russian Jet. The era of major powers directly going to war with each is over, satellite wars are all the rage now.\n\n", "Alright I pre-apologize for sounding catty here. But why is her face so utterly void of human expression? Is that Botox face? Or plastic surgery face? Or just a mask to hide her misery? Because it's very off-putting to try to read her expressions. My brain does not compute. ", "Well yeah because he's a shameless liar.", "ah yes.. the woman that has always spent whatever political capital she had on health- and childcare. \n\nsurely the fraudster candidate that has the citizens united dude in his camp will be better to get money out of politics and fight corruption. good lord", "Duh but it's about to be fascist, so get ready for another study. ", "They could squeeze 2 million in if they really wanted to but it would require destroying all of DC's unique rowhouses and replacing them with apartment buildings. It'd look like shit and people wouldn't want to live here.", "True and once he releases the full unedited footage we can verify that.", "I'm no millenial but I did support Bernie. You speak for yourself. Jill Stein is a nut and doesn't deserve a vote. She doesn't even deserve to be mentioned as a candidate she's so unqualified. I prefer the adult way of voting. I'll take the good with the bad. Jill Stein is just bad.", "Solution: Make DC a state and give Alaska to Canada. ", "Is this how you are going to spend your whole saturday bruh ", "Oh boy! Spam a misleading headline, and [a brigade attempt from /r/t_D](http://archive.is/JpMLZ)! It's like I hit the lottery!", "Yeah anyone who trust anything O'Keefe produces definitely suffers from it. ", "Wikileaks directly linking to conspiracy theories on reddit. ", "[deleted]  \n ^^^^^^^^^^^^^^^^0.0774 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/33825)", "Sooooooooo Trump ", "For all that talk about law and order you guys sure seem to have no problem doing away with key parts of our legal system like innocent before proven guilty and everyone's right to legal counsel.", "I love it when people outside of DC think it's neat to have DC while ignoring the people getting fucked over in that location. ", "What's wrong with you? You really think people doing their jobs deserve to be treated like that? Take a close look at the woman in the last scene working on her laptop at the front of the pen? How do you think she felt at that moment? ", "&gt;These sites plagiarize or aggregate stories both real and fake, from right-wing U.S. sites, then slap provocative headlines on them and post them to Facebook. Some of the most popular stories, Silverman reports, include false claims that the pope endorsed Trump, that Gov. Mike Pence called Michelle Obama “the most vulgar first lady we’ve ever had,” and that Hillary Clinton will be indicted for her use of a private email server. These stories garnered far more engagement on Facebook than legitimate investigative stories from the likes of the New York Times.\n\nThe amount of bullshit you see in internet is staggering. It's depressing to see how easily you can manipulate large sectors of the electorate.", "Meanwhile Trump backs Russia, questions US democracy.", "Hillary wants to negotiate a no-fly-zone. And frankly I don't buy the \"vote for the shithead advocating warcrimes cuz hillary gonna start nucular war\" scaremongering. ", "All the Latinos want to stop Trump.\n\nAll the African Americans want to stop Trump.\n\nAll the women want to stop Trump.\n\nAll the gays want to stop Trump.\n\nAll the college graduates want to stop Trump.\n\n\nGet your shit together uneducated heterosexual white dudes.", "I was expecting the gif of  Vince McMahon", "You know hillary winning is the best thing for Bernie. If you want him to get anything done in the senate. We need her to win. ", "This is beyond stupid. I feel after this election we need a new word for it. Any suggestions?", "This is sad. You're sad.", "I'll never understand how self-proclaimed \"patriots\" can be clamoring for America to be Russia's bitch and support someone whose slogan is literally \"America sucks now\"", "Radical. Conservative. Terrorism. Why does the right refuse to name our enemy?", "The media in general haven't been talking about this.\n\nJust imagine if this was a black guy who did this 4 days before the election -- it would be all you'd be hearing: \n\n* \"Has the recent killing of two police officers by a black man helped Trump's chances\"?\n\n\nWhat we don't hear: \n\n* \"Has the recent killing of two police officers by a white racist hurt Trump's chances\"?\n\n&amp;nbsp;\n\n\nEDIT - watch the video simply amazing.   \"I'm a white victim of racism because the cops took my rebel flag away\".  \n\nCops: here's your flag back.  Go home.\n\nHe goes home, get's a gun and murders two cops.", "Imagine the outrage if a minority:\n\n-Killed two cops\n\n-Burnt down a church\n\n-Held children at gunpoint\n\n-Attached razors to a Clinton sign and placed it in a polling station\n\n-Stood outside of a campaign headquarters with a gun for days on end\n\n\n\nBut if a Trump supporter does it?  All good over at the_demagogue!", "[They were quick to say who it was before they knew. ](http://imgur.com/sqDaeAd) ", "He was a Confederate flag waving racist Trump supporter. ", "Isn't this where we dismiss him as mentally ill and not a terrorist? ", "It was amazing how this was breaking news all over TV until the minute the shooter turned out to be white and then it vanished literally within an hour. ", "Michael Savage was losing his mind last night screaming into the microphone about how the media is attacking white men by reporting these stories. ", "Lock her up! Deport immediately! No amnesty! Etc etc this that and other Trump shit.", "Honestly he's completely lost it over the last few years to the point where I disregard everything he's saying. Beyond Rudy being his typical self is there more evidence of this?", "The real question is why does the right get to have their ridiculous political witch hunts while the left gets denied a real investigation into actual leaks.  I really will not understand why this will just get dropped by next week.", "Or the election judge who voted for Trump on behalf of her dead husband.", "If I were Obama I would fire Comey the day after the election.  The conduct of the FBI has been absolutely disgraceful.", "That was literally the police narrative \"he was known by police he had drug and mental health issues\".", "the core belief of the republican base is that  ONLY republicans are \" real  americans\". Any Democrat who holds office is in their view illegitimate which is why blocking them becomes their highest priority and something they can devote full energy to. \n\nDemocrats on the other hand, at least on occasion try to govern.", "So he's a victim and not a terrorist then right? \n\nPoor guy.", "DC resident here we also pay more taxes than like 22 states.", "White people killing cops doesn't move their narrative forward...", "As an older American it boggles my mind to see so many conservatives openly cheering for a Russian dictator. Ronald Reagan would spit in the face of these fucking traitors.", "[Meet Jim Kallstrom.](http://www.thedailybeast.com/articles/2016/11/03/meet-donald-trump-s-top-fbi-fanboy.html) He checks all the boxes.\n\n- Former head of the New York field office\n- Used to work for one of Giuliani's security firms\n- Hates Comey\n- Hates the Clintons and called them a crime family\n- Has claimed repeatedly to have spoken to active FBI agents about the Clinton case\n- **Founded a charity which received almost $1.3 million from Trump**\n- The charity itself has Limbaugh and several Trump Hotels people working for it\n", "The right supporters would MAKE it a big deal because they fight and stick together and act as a unified force to make things happen and get preferential media coverage.\n\nThey right PLAYS the media while the left is still trying to play fair for the sake of paying fair. \n\nWhen someone cheats and you play fair... what tends to happen? ", "It's not just racism  it's anger.   Hate takes energy,  no one is racist just for fun,  it is an outlet for anger at \"perceived injustice\".   We all do it.   Even if you were the most staunch liberal  you'd be prone to judging a redneck in overalls with a southern twang.   I'm saying that impulse is there but you are probably mindful enough to know what it is and not act on it. \n\nThese people are so angry they are willing to put up with Trump's inadequacies.  \n\nThe world has changed so much and it is so complex.   You and I know the factors are extremely complex and permeate so many interconnected facets,  that a simple solution wont work. \n\nThe world has left these people behind and they are pissed.   I too miss the simpler times,  sometime,  but the past is usually recalled in a fonder light that  it was. ", "It's ok she's white European so it doesn't matter. ", "No he should not be fired by Obama. He should be charged by the Justice department for violating the Hatch act and then forced from office. Obama needs to stay out of that mess.", "Make her take her anchor baby with her.", "Ronald Reagan passed gun control bills. If he were alive today republicans would lynch him.", "http://abcnews.go.com/Politics/wireStory/illinois-election-judge-allegedly-dead-husbands-ballot-43314675\n\nIt's actually a very sad story ", "Not just a white man a model donald trump supporter", "Someone pointed out that Comey might actually have been backed into a corner on the most recent reveal. The thought being that so much of the FBI rank and file has a distaste for Clinton and the grumbles at the lack of indictment endorsement from Comey, that had he not announced the new information it would have been leaked regardless. At that point it makes it look worse for him and Clinton because he would have been seen as attempting to hide information and why would they hide something unless it was damaging to the Clinton campaign if it got out?\n\nSo, I'm gonna give him the benefit of the doubt and assume that he was just trying to make a best judgement call because he cannot trust the people under him to follow orders. \n\n", "Hillary has been slandered more than any human in recent history.", "*\"Trump says\"* is usually a good indicator that the next words are going to be incorrect.", "Ever law abiding American who believes in the right to be deemed innocent the 4th amendment and due process should want Rudy questioned.  Every American should be upset of the leaks and the manipulation of their election by rogue agents controlling what you hear and know to their own gain.  \n\nYou wanted law and order and yet if you support what happened then you only want your law and your order. Sad", "That's 4 more Democrats in the Senate and even more in the House.  The GOP will do anything to keep these people unrepresented.", "Remember that story about the person that died and wrote in their obituary that their last wish was that nobody vote for Clinton? That is when you are too invested and it is time to step away from the news. ", "Sickening. Not surprised though", "He bragged in advance of the event.  He hinted and glouted like a dog who had the bone hidden under the bed.  He was proud that he had the leak and was using it for his advantage.  Yeah he took illegal information filtered to provide the highest impact against Hillary with no means to check the complete information and then gave it tothe Trump campaign.  Lock him up!  Information in an ongoing investigation is classified. ", "Obama is a leader and a great man... Trump is barely even a man.", "And Trump just kicked out a Hillary supporter then FUCKING LIED ABOUT WHAT OBAMA DID! Jesus fuck, people. God damnit. Obama didn't yell at the protester to shut up--he yelled at his OWN supporters for trying to suppress the protester. \n\nI voted for the man twice. I still feel good with my vote, even though there are things I don't agree with, but god damnit I am glad he has been the president during a formative time in my life. Class above all else. ", "I've been trying to explain this to my fellow Republicans for months. Trump isn't just a bad candidate he's bad for the life of the party. He's pushing away every single demographic that will eventually make up an overwhelming majority. Hispanics, African Americans, women, college educated, and millennials...Most of those will likely not come back for several election cycles, and that's only if the party fixes itself.", "They're lying with bullhorns and whispering an admission of guilt. It's so that they can spread lies while hiding behind the \"it was an honest mistake\" excuse. \n\n# \"Hillary Clinton [insert accusations]\" \n\n^(\"turns out she doesn't our bad\") ", "Um I still heard plenty about it.", "A white man convinced the world was out to get him with \"reverse racism\" meant to ruin white people - aka the white supremacist talking points popular both among trump supporters and among white men online (see the talking points commonly regurgitated in r/worldnews and elsewhere). Shits getting scary.", "But who will teach Donald the cyber?", "No you don't understand there is no hypocrisy here, you see, it's only corruption if Clinton or one of her associates does something (even if it's legal).\n\nSince Christie is not associated with Hillary's camp, this whole bridgegate thing is perfectly fine. Completely consistent with Trump's philosophy.", "&gt; Founded a charity which received almost $1.3 million from Trump\n\n's Foundation comprised of other people's money...Trump doesn't give his own money.  Ever.  For anything.", "She's an illegal! Deport her! Let her go to the back of the line and come in legally!", "Trump lied.\n\nIt's weird how he has to keep doing that despite being perfect.", "The FBI *used* to say it. ", "Because one party is full of petulant children and one is left holding the bag.", "The problem is Comey might be one of the more moderate ones. He probably sent that letter since he knew the new emails would get leaked anyway. I think giving him a chance to clean house would be a better first choice then get rid of him if he can't or won't.", "If you look at the facts you'd think you have to decide is Trump a liar or an idiot.  I still am not sure which.\n\nBut, those traits do not have to be mutually exclusive.  He's probably an idiot and a liar.  \n\n\n\n\n", "Do you remember when they asked Trump how he felt about Pence voting for the Iraq war? Trump said he forgave Pence.\n\nThe hypocrisy knows no bounds.", "They should also look into why Rudolph denied the NYFD upgraded radios after the WTC bombing long before 9/11. An upgrade that would have spared the lives of MANY fireman. ", "The problem is that two parts of America diverged from each other culturally. Here in NYC the government intervention is not frown upon, LGBT rights is given and you can see gay couples flirting in open, guns are basically forbidden here, and, in some districts, Whites are already minority and nobody gives a damn. In Deep South, they want a little government as much as possible, LGBT is basically crime against mankind, second amendment is sacred, and they never seen a person with different color other than black. Not to mention, rural America is in decline due to manufacturing jobs leaving the country, while here's me drinking expensive espresso at a hipster cafe.\n\nI don't know how it is going to end, but this is probably going to last our lifetime. ", "Y'allqaida\n\n", "But my nice round 50!\n\nNah, seriously, let's do this. Equal representation for all American citizens.", "Anybody with a job paying less than $150000 a year would be a fool to vote GOP.", "But that's *fighting for freedom from tyranny*! So it's okay!", "An investigation is not proof of wrongdoing but is often misinterpreted as that. Which is why the FBI usually doesn't comment on ongoing investigations: they haven't finalized any evidence they *might* have. Do I care if the Clinton Foundation is under investigation? No. That is what law enforcement is supposed to do: keep an eye on things. \n\nPeople are upset that some law enforcement officers broke protocol and put out information that will easily be misinterpreted as evidence of guilt. Bret Baier has already had to apologize for the talk of \"indictment\" since that may not happen at all. ", "ITT Trump lovers deflect. ", "As a statistician I love 538, but even Nate Silver has acknowledged that his model is unable to account for some of the unique aspects of this election. People who have never voted before or were considered unlikely voters are turning up, and there is a big disparity in ground game between the two parties.\n\nEdit: https://www.rawstory.com/2016/11/fivethirtyeights-extraordinary-prediction-model-is-failing-in-the-clinton-trump-race-and-thats-according-to-its-guru-nate-silver/", "You have a source for this? I want to read about it", "Ahh the Constanza philosophy: It's not a lie if you believe it.", "Except that the DNC is a private entity and the FBI is a federal institution. Was the DNC leaking to Hillary unethical? Sure. Was it illegal? No. The FBI giving info to one party in order to manipulate a federal election is WAY bigger news than either party's internal BS. The FBI deciding it wants a certain outcome for an election should scare everyone on all sides. It's borderline treason.", "This is why Fox's make-believe retraction shouldn't buy them any credit.\n\nThis is how pretty much all of these fucking Clinton conspiracy theories started and the Trumpettes will be talking about how Hillary dodged this \"indictment\" for the next twenty fucking years.", "So they will fight to be able to have people intimidate voters. Hilarious. ", "I support Trump and I have zero problems with this. I hope they investigate the Bushes too. Corruption needs to be stomped out regardless of affiliation.", "Is that what Rudy's FBI sources are saying?", "Must... Intimidate... Voters", "2 for DC 2 for Puerto Rico", "No. Then our problems would be ignored and MD doesn't want us back.\n\nEdit: I just voted for statehood a few days ago! :)", "Not that anyone should listen to celebrity endorsements but I like me some tom hanks. Always seemed so down to earth and genuinely likeable.", "I am guessing she didn't pay taxes on that income either.  That ought to be a smart move unless you come from the south and work on below min wage.", "&gt; Trumpster's would be calling for her to be put in front of a firing line.\n\nThey already are.", "Putin's plan doesn't hinge on actually getting Trump elected.   The damage done to the global perception of US democracy this cycle has been catastrophic.   Authoritarians around the world rejoice.   ", "It *is* a sad story from a human perspective. From an ethical perspective as well, for opposite reasons.  She should know better than almost anyone that just because she *believes* her dead husband would have voted for Trump, in fact he might not have - and even if he would have, there's just no excuse for casting a ballot in a dead person's name based on what they probably would have wanted.  What kind of precedent would that set? How close to the election does the dead person's family still get to vote for them?\n\n...is anyone else concerned by the fact that it isn't even Election Day and there have already been two Trump voters who have been caught committing voter fraud?  I think the previous investigation found only 39 instances, so this seems to indicate that this election will have a much higher instance of fraud (and likely most of it will benefit Trump) while simultaneously he is likely to lose anyway AND many of his supporters - and perhaps he himself - will refuse to accept the outcome.  If it is later shown that there was (relatively, meaning significantly more than in previous years) widespread fraud, they will take that as a vindication *even if it favored their candidate.*", "I saw it when it happened.  He told the crowd to calm down respect the protester's right to free speech, respect his service and respect their elders.  I remember thinking the way Obama handled that was the complete opposite of what I would expect from Trump.\n\nThen Trump says Obama yelled at the guy and acted disgracefully.  Trump just makes up reality as he goes along. ", "No its because they say racist shit like \"black people only vote Democrat for the entitlements\" ", "I don't think anyone is saying that. You're just trying to create conflict. ", "Bill Maher coined the phrase \"Zombie Lie\" for a reason. It's a classic conservative tactic. ", "the republican right shares the same self righteous ideological purity as the talibani.  \n\ni am not kidding.  one -ism is much the same as another -ism", "I really REALLY hope he gets nailed for his \"charity\" after this election is over. He needs to get nailed for all of his bullshit, actually. I pray it all doesn't go away. Trump Foundation, Trump University, bribing the AG, violating Cuba embargo, I'm sure I'm forgetting a few. He needs to get nailed for *all of it*.", "Except it's impossible to split. The divide is and I'm simplifying this tremendously, rural versus urban. The people in urban areas think a certain way and the people in rural areas think a certain way. Of course, there are urban and rural areas that think differently, but the bulk of the areas think the same way.\n\nThis can't be divided geographically. Especially when you have areas like California and NY, which are on separate ends of the map, with pretty much only red states dividing them. The country will stay together, but there's a lot of work ahead.", "I'm glad I woke up and was able to leave the Republican party.  Luckily my wife woke up as well.", "So their GOTV operations are literally to stop American citizens from voting with menacing hill billies. The Trump campaign from top to bottom is slime. ", "Terrorist's father who denounced his son's actions and had nothing to do with the terroristic acts themselves.\n\nOr are we holding parents accountable for their 29 year old children's actions now?", "I hope it's true but 538 currently has Trump with a slight lead in Florida.  People need to get out and vote.", "He doesnt bring in the best immigrants. He brings in cheaters russian agents, people who doesnt respect american law.\n\nAnd some, I presume, are just his wives.", "And Wyoming. ", "It's almost a joke how cliche that dude looks. Good for him for actually going out there and trying to make a change though. That's more than a lot of people can say. \n\nI just wish he would take optics into consideration. ", "According to the entire intelligence community and Mike Pence.", "someone asked him a question and he answered. Trump himself is a washed up reality tv star so why not listen to celebrity opinion.", "You mean the people who own DC's unique rowhouses wouldn't want to live there.", "The GOP said Trump could lose by 6 points in Clark County (Las Vegas) and still carry the state. Clinton currently leads by 13.7 points. ", "Because the FBI is a partisan joke? ", "I sorta think this might be the case considering Comey's conduct up to this point. But what do we know we're just armchair detectivess", "Why is everything a -gate ", "Why won't the right use the term \"radical white domestic terrorism?\"", "So they just use BLM as a codeword for a word that they can't use anymore? Fucking hell.", "I hate to be \"that guy\" but everyone still needs to vote!", "Sounds redundant", "\"They're bringing drugs. They're bringing crime. They're rapists. And some I assume, will stop me from being president.\"\n\n\nhttps://twitter.com/RalstonReports/status/794756727803478016", "Just for reference Trump can take every swing state plus NH and still lose if Clinton has Nevada.", "It's also important to point out that \"radical Islamic terrorism\" is just another brand of conservative terrorism.", "I liked the polls two weeks ago better than now. I don't understand how people can so easily forget/forgive that Billy bush tape. ", "My mom listens to this tool tells me he's just joking and doesn't really believe the vile he says. Yet whenever I debate her, she says the same god damn things this moron says. I really think he's worse than Limbaugh because he loves spouting that he's a doctor and to many people that makes him smart and truthful. ", "As a millennial its more so how can anyone forget/forgive the GOP platform and is GWB really out of everyone's memory by now? ", "&gt; These people are so angry they are willing to put up with Trump's inadequacies. \n\nThe problem is that they are angry at the exact wrong people and continue to vote against their own self interest... and it's killing ALL of us. \n\nThey think brown people and poor people are \"taking\" everything. The [exact opposite is true](https://www.youtube.com/watch?v=QPKKQnijnsM). The top 1% now own 40% of our nation's resources... while our roads crumble, mentally ill people walk our streets without treatment. While they continue to tell us teachers get paid too much and children do not need art classes. While they continue to tell us poor people \"get too much\" (OMG...)\n\nThey think illegal immigrants are raping people. The exact opposite is true. [They commit **less** crime](http://www.wsj.com/articles/the-mythical-connection-between-immigrants-and-crime-1436916798) per capita than normal Americans. In fact, the newer they are to this country, their crime rate goes down even further\n\nThey think brown people are taking their jobs, and again... [not even close to correct.](http://www.nytimes.com/2016/09/22/us/immigrants-arent-taking-americans-jobs-new-study-finds.html?_r=0) \n\nThey think our nation is being overrun with violent crime, which is [nearly laughable.](http://www.aei.org/wp-content/uploads/2014/07/crime.jpg)\n\nThey're problem is not being able to tell when they are being [lied](http://www.politifact.com/personalities/donald-trump/) to. It's complete lack of critical thought. They're flying in feelings alone that are put there by pundits and the actual politician vying for power, which is incredibly stupid and dangerous. ", "Well the DNC has a collection of bugs he can choose from. ", "Three things to note here. \n\nFirst and most importantly; two police officers died because of this. By all means and accounts they were nothing but respectful and they were murdered for doing their job. It's horrible. No matter how much any of us give our political hot takes, we should never lose sight of the fact that officers are losing their lives. And regardless of who is the one pulling the trigger, it is a terrible loss. My heart goes out to their friends, family, and precincts. \n\nSecondly; Trump and Giuliani both connected this attack with the Black Lives Matter movement because police were shot.  (See: Edit 1) So without any ID on the attacker, the only information that they need to blame this attack on black people is that a cop died. That's racist and it's shameful.\n\nThirdly; no, this man does not reflect every Trump supporter. But it is horrifically alarming that this type of person exists in our country. He went to a football game at a predominantly black school (see: edit 2) and waved a confederate flag. He was causing a disturbance, was asked to leave, and kept yammering on about his rights. Two weeks later, he murdered two police officers. The thing that we should take away from which candidate he supports is that it seems like every single person who behaves this way (confederate flag, racism) seems to be a Trump supporter. Even the KKK has endorsed Trump. And that speaks volumes, not about Trump supporters, but about who Trump is. His rhetoric attracts bigots. That's what we should be focusing on as far as politics are concerned. It's the same logic of not every rectangle is a square, but every square is a rectangle; not every Trump supporter is a racist, but every racist is a Trump supporter. \n\nAgain, let's not forget that two lives were lost when we bring this crime to a national stage. It's a horrible loss that is much too frequent. \n\nEdit 1- there is a fair bit of reading between the lines in this article. \n\n&gt; This week, Trump tweeted that he was praying for the families of those killed in Iowa and offered words of support for police. Giuliani, who was stumping for Trump in Iowa hours after the shooting, said, “I’m not going to politicize this, but let me give a politicized take on a previous police killing. Just, you know, coincidentally.” He added, “This is not an isolated incident. This is happening all over the country.”\n\nSo Trump only offered his prayers, Giuliani connected this shooting with others. The article contrasts Trump's reaction to this shooting with the shooting earlier this year in Baton Rogue which involved a black shooter. I'd made the jump that the difference was racially based, but that doesn't have to be the case. However, given his entire body of work, you can't rule it out. \n\nEdit 2- the school isn't predominantly black, but an officer pointed out to the man that we was flying a confederate flag at an event where he knew there would be a lot of black people. Error on the school's racial make-up, but the point still stands. ", "Regardless of the numbers it's imperative you encourage your  friends and family to join you.  It's part of civic responsibility, and it makes it much more likely for people to vote in the next cycle.", " Have the right to complain about whatever the fuck I want.  ", "I couldn't help but notice the dramatic shift in his tone and affect between the interview in which he bragged that he had insider knowledge and the more somber denial.", "Wait *you're* calling bullshit on whether or not *I* heard about it?\n\nShut up. \n\nListen to NPR. ", "It seems the only major differences between the 538 scenario and the Princeton Election Consortium (PEC) are the following 3 states:\n\n**Florida** - 538: Trump / PEC: Clinton\n\n**North Carolina** - 538: Trump / PEC: Clinton\n\n**Nevada** - 538: Trump / PEC: Toss-up\n\nAlso Sam Wang from PEC says he will eat a bug if Trump gets more than 240 electoral votes.", "Im so ready to be done worrying about it. ", "Michael Savage is seriously fucking batshit.  If you've never listened to him... do yourself a favor and give him a half an hour just to experience the pure id of the far right.   It feels like some sort of psychedelic comedy routine, until you realize it's absolutely sincere.   Just like the alt-right.  Funny how all the far right movements are exactly the same in spirit, no matter how much they try to pretend they're unique, independent, special little snowflakes.", "&gt; Clinton’s campaign of course, is doing everything it can to make that a reality. For months, Democratic staff and volunteers have been registering tens of thousands of new Latino voters all over the state, but with a particular focus in the Central Florida counties, where migration from Puerto Rico has been most intense.\n\nThis is the Clinton ground game we keep hearing about. If she wins Florida, Ohio or even Georgia, it's because of their organized efforts to get out the vote. ", "My grandmother at 81 years old, is on her literal deathbed as we speak. Unconscious and being administered morphine. She's going to be dead within a day or two. She's seen it all, everything from the last 80 years, from the great depression to hitler and ww2, to mlk and jfk and bushes one and two, from missile crises to terrorist attacks, from Syria to gitmo, from the Crack epidemic to the heroin epidemic, from the rise of prosperity to the threat of its destruction. And she's been cogent over the last year and a half. But her last wish was that she could live long enough to see trump fucking lose. She hates him. She sees him as another hitler or Mussolini. She said would rather die than live in a country where trump is president, and even though even she knows that hillary is a politician with all the baggage that comes with that, she still adamantly hoped that the country she loves was smart enough not to elect the demagogue fascist who will ruin us. ", "There is absolutely no intention of \"Draining the Swamp\" or leading an \"anti-establishment\" administration.\n\nIt's all campaign rhetoric and all that's going to happen is that the *Republicans will be the establishment again*. that's it, full stop. The GOP will get all their bills turned into law, and the conservatives will get their pick of the supreme court. They will try and undo progressive legislation and progress. There is no other intention. It's just a conman selling desperate people what they want to hear. \"I'll fix everything\", yeah...\n\nHis administration will be *Republicans*, not independents, not moderates, *Republicans*. The house and senate will be *the same fucking Republicans*, the whole thing is just Republicans replacing Democrats. The \"revolution\" is a lie, obviously.\n\nThe establishment Republicans will kiss his ass, and then he'll do whatever they want in return. He's going to be played, and his political ignorance will be abused easily. He'll just sit there and pretend like everything is better now, and that something changed, but it's just the same exact Republicans and GOP ideology back in power, that's it.", "When it's their poisonous doctrine that created the problem and not THE OTHER, they dismiss it completely.\n\nThis poor, poor man. Let's have some understanding here, I mean they made him stop waving a flag. It was obviously a misunderstanding.", "Oh I've listened to him. For maybe 10 mins the most at a time and it takes everything I have to keep from face palming myself to unconsciousness. I think the dumbest thing I've ever heard him say is this:\n\nThe worst thing to come from the open gay movement is that now gays do not try to stay hidden like before and hide it by marrying the opposite sex and having children. This has lead to millions of children not being born which could have been the person to cure cancer or aids. ", "Well he would have a lot of FBI/former FBI friends from his time as a federal prosecutor. But besides that no I don't think so. Personally I think he has some former FBI friends who told him some rumors and he's making it out to be a bigger deal than it is because he wants attention.", "I just want to say black people knew it. ", "Imagine if Muslims were doing it. Of course trump fans are more outraged on discussions of white privilege..", "Calling it now Nov 9th newspaper headlines-\n\n\"Voters to Trump: You're Fired.\"", "Some of them I assume, are good people.", "Then reduce the size of the capital to the national mall. The president and family can be its only residents.", "I'd really like to believe this but serious question -- how the eff do polls like 538 have this as 49.9-50.1? DEAD seems really strong for it to be a coinflip... ", "If you agreed with everything a politician said or did regardless of content or merit you'd be a trump supporter.", "That's how you know they're racist.\n\nMuslim man kills somebody and Trump and supporters say all Muslims are criminals.\n\nBlack man kills somebody and Trump and supporters say all blacks are criminals.\n\nMexican man kills somebody and Trump and supporters say all Mexicans are criminals.\n\nWhite man kills somebody and Trump and supporters say nothing. \n\nWhat a joke.\n\nBonus: Half a dozen women get sexually assaulted by Trump and Trump and supporters say women sexual assault victims are criminals.", "Watching 538's prediction is gonna give me an aneurysm...", "This article is about a Trump supporter downplaying the seriousness of inappropriate groping (man on woman) by doing it to another woman and saying it's in good fun. The worldview of some Trump supporters really is lagging by 60 years. ", "Yup. As a Democrat I am *really* tired of Republicans taking a shit on America and the Dems coming along with a shovel to clean it up. ", "You get the first woman inaugurated as the 45th president of the United States. Thanks in no small part, to explosive Latino turnout.", "Vote GOP: because fuck poor people amirite?", "So radical conservative terrorist? ", "Instead of actually adapting their policies to the modern age where minorities actually have a sizeable chunk of the electorate the GOP prefers rather to try and disenfranchise them.\n\nThat really says all that needs to be said about why I'm so opposed to Republican politicians.", "Maybe it's time Democrats start looking at Republicans as not real Americans and see how long it takes for the GOP to call a truce. If they are insisting that Democrats have no right to govern or name people to the Supreme Court why should Democrats consider rule by Republicans legitimate? They don't represent anyone but whites by their actions suppressing minority voters. Some old Afrikaans should tell them how sustainable that was in South Africa. ", "Check his comments. This guy is an MRA and a 2nd amendment gun nut.\n\nMove along nothing to see here.", "Here is [an interesting factoid](https://twitter.com/adrian_gray/status/794728475307413505) about polling Latino voters. Could a lot of these polls be significantly under representing voters who primarily speak spanish?", "and she is still gonna be POTUS. Tough ass woman.", "Possible but it is disturbing that we as a culture increasingly dismiss ugly things said on the record as \"oh they didn't mean that'.", "That could possibly start Civil War II.", "Trump: take and don't give back then promise to change the system so he and people like him can no longer take without giving back.\n\nHe hasn't contributed any tax money for years to support the military, infrastructure, education... yet those of us who dutifully pay our taxes have done just that.  That makes him \"smart\", right?  ", "Even if he 100% violated the Hatch act (which is not a given) it is a civil and administrative issue.\n\nThere are no criminal charges that could be brought under the Hatch act. ", "They're proud of the double standard. \n\n&gt;\"He's entitled to make a mistake every once in a while\" Trump said of Pence.\n\n&gt;\"She's not?\" Lesley Stahl asked.\n\n&gt;\"No. She's not,\" Trump said.\n\nhttp://thehill.com/blogs/ballot-box/presidential-races/288097-trump-on-pence-voting-for-iraq-war-i-dont-care", "&gt; If I need to see an oral surgeon I am not going to the guy who says 'you know what, I think I can be a pretty good oral surgeon.\n\nTo be fair, a better characterization would be\n\n&gt; 'I am the best oral surgeon. Dental school is rigged, folks.'", "Ok.  Bernie's rallies were bigger than Hillary's and he lost.  Your point is nonsense.", "Republicans wont allow this.\n\nFirst it's flatly democratic to let US Citizens vote, and we've seen how the GOP doesn't like democracy.\n\nSecond, it'll be a democratic state.\n\n", "9/11", "interesting but you see the difference right?  The Democrats aren't actively keeping anyone from voting who wants to vote in those elections but are relying/counting on voter apathy whereas Republicans are actively trying to strip people of their voting rights who wish to vote and are eligible to vote. Big difference.", "So Trump believed Christie was involved in this crime and he hired Christie anyway? Does he owe money to the New Jersey mob or something?", "From her [program](https://www.hillaryclinton.com/issues/a-fair-tax-system/):\n\n&gt; **As president Hillary will:**\n\n&gt;\n* Restore basic fairness to our tax code. Hillary will implement a “fair share surcharge” on multi-millionaires and billionaires and fight for measures like the Buffett Rule to ensure the wealthiest Americans do not pay a lower tax rate than hardworking middle-class families. She’ll close loopholes that create a private tax system for the most fortunate, and she’ll ensure multi-million-dollar estates are paying their fair share of taxes.\n* Close corporate and Wall Street tax loopholes and invest in America. Hillary will close tax loopholes like inversions that reward companies for shifting profits and jobs overseas. She will charge an “exit tax” for companies leaving the U.S. to settle up on their untaxed foreign earnings. She will close tax loopholes that let Wall Street money managers pay lower rates than some middle-class families. And she’ll reward businesses that invest in good-paying jobs here in the United States.\n* Simplify and cut taxes for small businesses so they can hire and grow. The smallest businesses, with one to five employees, spend 150 hours and $1,100 per employee on federal tax compliance. That’s more than 20 times higher than the average for far larger firms. We’ve got to fix that.\n* Provide tax relief to working families from the rising costs they face. For too many years, middle-class families have been squeezed by rising costs for everything from child care to health care to affording college. Hillary will offer relief from these rising costs, including tax relief for Americans facing excessive out-of-pocket health care costs and for those caring for an ill or elderly family member.\n* Pay for ambitious investments in a fiscally responsible way. Hillary believes that we can afford to pay for ambitious, progressive investments in good-paying jobs, debt-free college, and other measures to strengthen growth, broaden opportunity, and reduce inequality. Hillary will use the proceeds from ensuring the wealthiest and the largest corporations pay their fair share to pay for these investments without adding to the debt.\n\nI can't seem to find the part about raising taxes on the poor you speak of.", "More than that he directly said that Pence can make mistakes but Hillary can't. He's not even trying!", "Nah just really economically anxious.", "I would pay money for a legit study of the average IQ of Hillary supporters vs Trump supporters.", "Against corruption but pro grabbing women by the pussy. I like the cut of your jib.", "I can't understand how the GOP is so quick to dismiss that video. Sad!", "Lol this has been the Republican narrative for as long as I've been alive. Shit's *been* scary. This is just the result of decades of manipulative ideology, the right has no connection to reality, and how do you fight that? I mean, when evidence actually *strengthens* their resolve. They believe black people are the most privileged people in America, that voting twice is fighting voter fraud, and that illegal immigration is the greatest threat facing the nation. They wanna  \"make america great again\" but refuse to acknowledge that the tax rates on the highest earners back then was twice what it is now. We're living in 1984, and we're all screwed. ", "It helps dumb people understand there was a controversy. ", "I too live less than a mile from the second shooting. I see a ton about it on local news but nothing on national.\n\nMy Facebook feed however, is packed with it.", "The idea that the entire US military will be commanded by Donald Trump is one of the saddest things I've ever imagined.\n\nEverything humanity has worked for will be put in jeopardy every day because of incompetence and ego.", "But Trump said it so it must be true! ^^^/s", "We've had vicious candidates and we've had idiot candidates but I don't think we've ever been cursed before with a vicious idiot for a candidate.", "You're correct **but** I have noticed that there is a similar attitude, it's just phrased differently. \n\nLook at the Supreme Court issue. My conservative friends see it as perfectly justified to not vote on the court because of the stakes involved. They don't see it as hypocrisy, they view it as \"extreme times call for extreme measures\" because to have a left-leaning Court will (they think) inevitably lead to the decline of America and traditional conservative principles. If Trump is elected, they'll push for an immediate vote on a new nominee because \"elections have consequences.\"\n\nSo they look at Giuliani's leaks as the act of a patriot; it's no different than how the left looks at the Chelsea (Bradley) Manning leaks -- the act of a patriot ignoring rules for a higher moral purpose. ", "I still get pissed when people say \"we voted for a black guy to be president  racism is over\" because they leave out one key factor **when Obama won, the Senate lost its only black member**. Sorry for yelling. ", "&gt;rural America is in decline due to manufacturing jobs leaving the country\n\nThis is one that gets me the manufacturing jobs aren't going anywhere, at least not in a geographic sense. We still manufacture a massive amount of shit it's just done by robots. Those jobs are never coming back to first world humans, just like transport jobs aren't going to return to the horse and wagon.\n\nWhich is something these rural people don't want to acknowledge because it means the prosperity of the parents is *never* coming there way again, unless they embrace new industries and skill training. However that requires the government regulate, tax, and then provide a service and these people have been led to believe for most of their lives that would be the worst possible thing. \n\nIt would be ironically amusing if it weren't so sad.", "He would clog the drain though.", "He's just a tired old man with little hands without the energy to go to Wisconsin. Sad.", "That's a burn", "Can you imagine if Clinton had a top surrogate under investigation for a criminal conspiracy ? Or a former campaign manager and advisor under investigation  for Russian  ties? Or been told by the courts to stop intimidating voters? Conservatives would  be apoplectic. Yet somehow Trump is still getting support.", "&gt;Hates illegals\n\n&gt;marries one", "There is NO way it's comparable to heroin. ", "Trump believes that women have no bodily autonomy in so many different ways. The government can make your family's reproductive decisions and he can use his wealth and power to grab an unwilling woman by her vulva and thinks it's hilarious enough to boast about.", "538 is an aggregate but it has become really bullish on Trump after their embarrassing mistake during the Repub primaries. I'm not convinced he's dead there but early vote trends are looking promising.", "Only for new and even more intense worry to take over if your preferred candidate loses.", "This right here is the core of it. They aren't arguing principal anymore. They arn't disputing liberal or democratic ideals they are disputing their right to have an opinion at all. In their minds they are the real Americans, all others are illegitimate.", "There's nothing pleasing about the threat of yeehawdists trying to form a Christian... cowliphate.\n", "I just wish repubs would use Google or YouTube once in a while but then cognitive dissonance relies on staying within the bubble and making sure nothing outside of that invades it", "Bernie had bigger crowds than either...and he lost. George Wallace was really good at drawing crowds...and he lost. You might want to consult data and history rather than relying on your feelz regarding Hillary's voice.", "&gt; ...is anyone else concerned by the fact that it isn't even Election Day and there have already been two Trump voters who have been caught committing voter fraud?\n\nA little but not too concerned. It sounds like double voters are getting caught pretty easily. The system is working.", "What I'm really tired of is the Dems not using that shovel to put the Republicans out of their misery once and for all. \n\nReally had a chance to do some great things when they had the trifecta when Obama came into office....", "but gay marriage and fetus", "They could have also used the words of Trump and Pence in that area one saying women in the military is \"Bedlam\" and one saying \"Women is the military, bad idea.\"\n\nHe's been a disgrace to the armed forces, the men and women, and I really don't think I could continue serving if it's under him. ", "Because one is considerably less shit than the other. ", "The military is standing up against the racist and misogynist asshat Donald.\n\nWhy?  Because they can see that Trump really knows nothing about military strategy.  Look at his comments regarding Aleppo during the debates.  Look at his comments regarding the current offensive in Mosul.  It's clear he is misinformed.    ", "CPA here:  explain it to me.  this will be entertaining.", "Really the only question left is what color pant suit will HRC wear at her inauguration?", "Posted this before but it's critically relevant.\n\n• Cultivate cult of personality (\"I'm the only one who tells you the truth\")\n\n• Discredit media (\"They're all liars, every single one\")\n\n• Discredit the entire system (\"It's completely broken and corrupt, top to bottom\")\n\n• Offer self as the sole person able to fix it (\"and I'm the only one who can fix it\")\n\n• Create your own media (Use current media until they wake up, Twitter, rallies, internet)\n\n• Use conspiracy theory and appeal to emotions, allowing for discounting of all exterior facts\n\n• Blame the victims, begin smearing of enemies, especially traitors perceived disloyal\n\n• Use dog whistle: violence (\"Throw him out. And do me a favor, punch him in the face.\")\n\n• Hyper misogyny, misguided populism, racism\n\n• Declare foreign threats, play on fears (\"ISIS\")\n\n• Stoke nationalism (border security, military) (\"We need a strong military, a strong police force.\")\n\n• Denouncing of traitors, foreigners, outsiders, deviants\n\n• Suppression of vices (anti-liquor, anti-drug, anti-porn, etc)\n\n• Unification under one ideal (One army, one flag, one God)\n\n• [Emergency event / attack] used to seize power\n\nWhen a person's faith in a system they had lived in their entire lives becomes shaken, they become particularly prone to suggestion and conspiracy theory, further undermining that core belief in the system. Look for irrationality and a total disregard of facts. Once a portion of population becomes convinced other side is cheating, they too resort to cheating (\"They're doing it so we have a right to!\") even though no proof of initial cheating was provided. (Early symptom detected here: preempted poll rigging claim prior to election).\n\nThe most insidious thing about fascism is that by the time it's finally obvious to absolutely everyone, it's too late to do anything about it. Early warnings are critical.\n\nPeople laugh these things off, but **this is not a joke, this is not a drill. Democracy is facing a threat not seen in our lifetimes. We need to focus and pay attention to what's going on. This is not an ordinary election. We're facing a true demagogue.**\n\n", "I thought the entire point of DC was that the capital was not in a state at all? ", "He knows but he's incapable of giving a fuck.  As long as you make Trump look good, he doesn't care if you're a crook or a horrible person.\n\nTrump wouldn't know the first thing about draining swamps.  At various points Trump has: cheated his contractors and investors; cheated on his taxes; been mobbed up; been compromised by the Russian government; and been found guilty of discrimination.  Trump is a dirty as they come.  ", "Donald Trump Flat Out Lies ~~About How Obama Reacted to a Protester at a Rally~~\n\nFTFY", "You forgot how they ignored the arrest of three radical right wing terrorists (and huge Trump supporters of course) in Kansas plotting to brutally attack a mosque and Muslim heavy apartment complex. ", "I'm convinced Trump reads /r/the_donald every morning. So it's only a matter of time before Donald calls Hillary a Witch.", "To any disaffected Dem or Liberal considering not voting for Hillary I'm not going to try and change your mind with HRC's qualifications or what a disaster Trump will be.\n\nInstead:\n\nThink about Wednesday, if Trump wins and Republicans hold the Senate and Congress.\n\nThe day after the election, Republican Speaker of the House Paul Ryan and Republican Senate Majority Leader Mitch McConnell will hold a press conference.\n\nThe theme of their speech is going to go something like this:\n\n\"With President-Elect Donald Trump and the Republican victories in both the House and the Senate, the American people have sent a clear message rejecting the past 8 years of liberal policies and the Obama/Clinton vision for America.\"\n\n\"America is a Center/Right nation, and the people have spoken. We have been given a clear mandate to repeal Obamacare, roll back job-killing regulations, cut high taxes, and get rid of liberal social programs.\"\n\nExpect also stated plans to immediately confirm Trump's Supreme Court nominee right after the Inauguration, an intent to defund PBS, revamp Social Security, and cut all federal funding to Planned Parenthood. Oh, the Filibuster? Well, payback's a bitch. Good luck obstructing anything, Senate Dems.\n\nImagine that smug look on both of Mitch and Paul's faces, the empowerment of Congressman like Ted Cruz, and the condescending and self-satisfied tone of every conservative talking head you see on TV for the next few years.\n\nAlso imagine all the \"told you so\" language coming from /r/the_don because this scenario is basically their wet dreams come true.\n\nIf you vote for a third party, you don't exist to this new Republican supermajority. They're not going to say \"thanks Bernie or Jill supporters, we hear you and are gonna consider your wants.\"\n\nYou can help prevent all of this from happening. President Trump is one thing, but if they control the White House, the Senate, and the House, they're going to exact payback on Obama and everything progressives have fought for.\n\nDemocrats will have no voice or seat at the table.\n\nThis is going to be a close election, like Florida in the year 2000 close. I know HRC isn't perfect and the DNC has had problems, but you have two choices for the next 4 years:\n\nBe frustrated your President isn't liberal enough and work to pull her to the left, or be ignored entirely.\n\n\n\n", "'Thug' is another popular substitute", "I waited in line for three-and-a-half hours to vote on Thursday.  Totally worth it.", "Trump is too stupid to know tapes exist. His followers are too stupid to view them.", "There's stupid. Then there's ignorant stupid then dangerous stupid, then there's Trump.", "Trump brags about winning in Texas... thats just fucking sad.", "Hillary Clinton is an accomplished American stateswoman.\n\nDonald Trump is the worst piece of garbage that America has every produced.\n\nThere's no reason to complicate the matter.", "She has a lot of different paths to 270: of the competitive races she only needs to win one or two of them.  Trump needs to win all of them.", "THANK YOU (from Canada)", "If Trump loses but it's close the next election will see someone who plays to the same crowd but is more competent. And that is the really scary part.", "Nah dude. *Be that guy*.", "That's right.  Too many classes acts from ya'll qaeda.", "He was a known piece of shit ever since 911.\n\nHe is directly responsible for the death of every emergency responder that didnt hear the call to evacuate before the second tower came crashing down.\n\nHe had previously stopped an upgrade to the walkie talkie system ($$$ is more important to him than the lives of emergency responders)  that was requested after the first world trade center bombing attempt when it was found the ones in use did not get any reception inside the stairwells.\n\nRudy giuliani might as well have shot every one of those police and firemen dead hes just as responsible for their deaths as if he had.", "[Gresham's Law](https://en.wikipedia.org/wiki/Gresham%27s_law). \n\nIt's an economic concept but it applies here perfectly, too: so long as someone is tampering with the well and not playing by the rules, you're facing nearly insurmountable odds if you play fair. Economically, if someone is cutting their product and selling it as whole, they're going to be at an advantage in terms of profits (they can keep prices the same and have a higher profit margin, or they can lower prices and cut into competitors), which might lead to a slippery slope where most or all merchants are forced to either raise prices, water down their product, or go out of business.\n\nBasically, what you're saying: so long as you continue trying to play fair while the other side is using increasing polemics, you're fighting an uphill battle. I mean, shit, look at [Obama defending a Clinton hecker](http://www.wsj.com/video/obama-defends-heckler-at-clinton-rally/B63AE0C7-BD1B-41D5-894F-E9C86579BEA1.html) and compare it to [Trump's description of the event](http://www.nbcnews.com/storyline/2016-election-day/fact-check-trump-claims-obama-scolded-protester-video-shows-otherwise-n678351).", "Why isn't the White community speaking out against this? Where are the White leaders? Undoubtedly several whites knew about his intentions... why didn't they approach authorities? Whites always play the victim card... where is the responsibility they have for their community? ", "Taxation without representation.  Still relevant. ", "\"Naggers\"", "They're still obsessing over [this guy.](https://i.ytimg.com/vi/-7rkSmdDIIU/hqdefault.jpg)", "Exactly. Extreme nationalism and jingoism demonization of the other, reactionary utopianism, conspiracy thinking, inability to accept change, romantization of an imaginary past, rejection of facts and reason, contempt for liberal values and democracy, authoritarianism, simplistic solutions. They are essentially the same. And Trumpism is much more dangerous for America than Radical-Islamism.", "Who me? No way? I've been shit posting ", "I have a feeling that Trump just reads headlines. He doesn't have the patience to read further. He sees a headline \"Obama deals with protester,\" and extrapolates from there to fit his own narrative.\n\nIt's really not surprising that most of his supporters seem incapable of reading beyond headlines and memes. ", "Pieces of shit clump together...", "It is completely unprecedented for anyone in Trump's position from mid-october to come back from that much of deficit and win it.", "im frustrated with hillary but im not a complete psychopath i compromised and voted blue. we cannot afford regression we need progress however so slight, progress needs to be made! ", "Don't get me wrong Bernie's good. I like him. But he had some weaknesses that were never really tested. \n\nHis plans were, to say the least, unrealistic - both in terms of what can feasibly be accomplished in the current political environment, and what would actually work. Like for instance, raising taxes massively to pay for single-payer health care is simply not an option if you don't have a supermajority Senate and control the House, and some of his economic plans assumed years of 5% growth (most presidents get a few years of 3-4%, if we're lucky). \n\nHe and his supporters also made one of the biggest mistakes that white progressives have been making for 60 years - they pretty much took racism, sexism, etc and effectively said \"it's *economic* injustice that's the most important right now, all of that can come secondary.\" That meant his message struggled to resonate with groups that Clinton does well with, black voters and latino voters, etc. (This is effectively the reason he lost the primary.)\n\nHe's also not much for the meat of politics, the making-the-sausage. He has a reputation as a scold, as an if-it's-not-this-way-it's-a-moral-failing guy. That's fine if you're in the Senate looking to be a progressive lion, but it doesn't work for President. Hillary is much better at the playing politics.\n\nTo be honest, Hillary would probably be more effective at getting Bernie's policies realized than Bernie would have. Which is why I think, as an American progressive, a scenario with Hillary in the WH, beholden to the Bernie contingent to win reelection, and being pestered by Bernie and Liz Warren in a Dem-controlled Senate is pretty much the best possible outcome. ", "Bush is a genius compared to Trump ", "You're welcome!  Those of us with sense are as concerned as the rest of the world is believe you me.", "&gt;islamic\n\nIt's Islamic to attack the police? What?? ", "\"The most dangerous thing\"\nLittle bit of hyperbole there I think. \nIt's true that there are definitely a lot of people in this country who are afraid of Muslims just because the are Muslims and that is a problem. It is also true that a lot of genuine criticisms of islam get buried under the name of islamaphobia. \nEither way racial and religious tensions in the US run far deeper than just \"islamaphobia.\"\n\nEdit: I just looked at a bit of your post history and realized you are actually a big part of what I would consider \"the problem with this country.\"\nInstead of lifting people up to be equal, you think people should be forcibly dragged down to equality. That's not progress. ", "i.e. an asshole\n\n&gt; the man was 46-year-old Scott Michael Greene, a white man with a history of carrying around the Confederate flag and harassing African Americans", "When this is all over I'm going to kick Nate Silver's ass just for scaring the shit out of me so badly.", "Polls have underestimated Dems in Nevada for years. In just about every election the Dems over-perform the polling there by quite a few points. Part of this is because hispanics are difficult to poll (less likely to answer the phone / language barrier), some of it may be because a lot of service sector workers in Las Vegas have irregular hours, working at the times of day that pollsters try to call people at home. \n\nBut Ralston isn't looking at polls, he's looking at the actual early voting results. Compared to the same early voting in 2012, the numbers for Dems look good.", "I love the people responding to you like \"nuh uh no way you're the puppet you're a towel!\"\n\nI've never seen this many lies about a candidate before. Even when republicans tried to spread the rumor that our first black president was a foreigner (you know, because conservatives are evil as FUCK like that) it wasn't this bad. ", "He knows he's fucked. ", "If he knows the leaks are coming *he should be firing the people doing the leaking,* not sending vague letters to Congress and sitting on his hands. AKA doing his job instead of engaging in partisan politics.", "Trump has no real path to 270 without Nevada. ", "your standard trump supporter.  ", "They want revenge on liberals. If that means the whole country suffers too so be it.\n\nIf they knew *for a fact* that every single thing would get worse under Trump they would still vote for him. It's not about policy, or the economy, or crime, or wars, or any of the shit they claim. By every margin we are better off under Obama than we were under Bush. It's not even a question. And that makes them even angrier.\n\nThey were promised an Obama apocalypse that never came. And that pisses them off to no end. So they just pretend like Obama ruined everything despite the fact that everything is obviously better.\n\nIt's about revenge on liberals for \"taking their country\" and making fun of them. They lost every single social war and they feel oppressed. They want an asshole to go in and undo everything that Obama did, consequences be damned. The worse the fallout from a Trump presidency the happier they will be.\n\nTrump is a revenge candidate. He's promising to fuck everything up. And since everything is trending away from them, they are perfectly fine with that.", "He wasn't so sure before Comeygate. So he wants to celebrate. ", "And then you get The_Donald ", "Because that might force them to look in the mirror. ", "Conservatives did this on Iraq too, and still do.  When the topic of Iraq comes up-- and specifically the lies that led to it-- you'll get a lot of deflection, bs about WMD achshually being found (and the biased press refusing to report on it)...\n\nBut then they'll go from that and pivot to the concept that, 'Well, Saddam was evil anyway, and he treated his people bad, so it was noble of us to go there anyway, regardless of how it started.  Why are you so hung up on the past?  Are you opposed to fighting dictators?  Wow!'\n\nThe fact that we were lead into a war that ended up costing trillions of dollars, killing hundreds of thousands of civilians, destroying an entire country, and creating an environment for ISIS to be created... and that we were lead into all of that by proven and indisputable lies doesn't matter now.  It's literally like it never happened.  Never.\n\nClassic revisionism... and it fucking works on so many people, so why stop?", "Now if Latinos would only do the same in Florida. Miami Herald reported this morning that just under half of Florida's registered voters have participated in early voting and that as of Saturday morning, Dems were leading. \n\n(http://www.miamiherald.com/news/politics-government/election/article112771418.html)", "Yup. Go to 270towin.com and fill in Nevada and Michigan blue. That's a guaranteed Clinton win even if Trump wins Ohio, Iowa, Florida, Georgia, North Carolina, New Hampshire, Arizona, and the extra districts in Nebraska and Maine.\n\nEdit: removed New Mexico and Wisconsin those are safe blue states Trump has no chance of winning", "Holy shit.  Trump is not a person.  Trump is a disgrace not just on people he's a disgrace on all animals on Earth.", "I'm actually at a point where I wouldn't mind if the southern states seceded again. They can have their small government big corporation diabetes filled racist shithole of a country that they dream of. \n\nI'm so sick of pandering to the religious rubes of America with their Christian version of the Taliban. My state pays out more in federal taxes than it gets back. Conservative states on average don't. I no longer have any interest in propping up places that don't consider me a \"real American\" but turn around to praise Russia. Get fucked. All of them. ", "It's infuriating to see polls saying people think Hillary lies more as Trump in unique in that he just says whatever strikes his fancy which generally means that the truth is a rare happenstance.  ", "I've voted enough times now that I can laugh at how every election honestly feel like *the most important ever* at the time.  2012 felt like do or die for America but now it seems quaint in comparison to 2016.  ", "Oh I know. But having lived my teens through Bush he makes it hard for me to ever vote for a Republican. Even if he does seem like a Saint compared to Trump. ", "Its not divided north south. It's city vs country.", "It would be like Hillary or Obama bragging about winning California. It's a fucking participation trophy. ", "Yeah I don't want to come down to their level but if we don't we suffer at the hands of reduced representation. \n\nThe BIG problem is that this isn't just a one time problem. This is HOW American elections are going to work more and more often. After 30+ years liberals need to treat the lies and propaganda like the attack against their Democratic rights that it is. \n\nWe have them the chance to be the moral party they claimed they were, even with their racism.. and that was a mistake. You can never let up on immoral behavior. We are only animals, we don't know better without constant peer pressure.\n\nI'm all for peer pressure and I think it's a requirement in an social group. We can't have democracy without peer pressure to make people behavior withing a reasonable threshold. Liberals set the stage to be pushed around by taking the 'higher ground' too often instead of fighting down in the ditches. ", "Also he was despised in NYC prior to 9/11 too.  His record was quite bad", "Not a poll but [this](https://www.youtube.com/watch?v=PspX3VQghaU) might be one of the best campaign closing ads I've ever seen. /tears up\n\nIt's good to have Katy Perry on your team.", "Thank you. It's amazing how much shit she gets when we got a guy like trump running for president of the United States. You would think it's a no brainer. ", "The article isn't saying you *litteraly* don't have the right to complain. It's saying you have no ground to stand on. Like a guy that doesn't brush their\n teeth complains about having to go to the dentist so much. No one *likes* brushing their teeth but if you don't do it or only do it once every now and again decay and rot will set in. Irreversible damage can result. If you still want teeth in 4 years, you gotta brush em now as big a pain as it is.", "Understandable enough especially when you consider the[ GOP gerrymandering](http://www.salon.com/2016/06/13/this_is_how_the_gop_rigged_congress_the_secret_plan_that_handcuffed_obamas_presidency_but_backfired_in_donald_trump/) throughout the country. Haven't read Daley's book *Ratfucked* yet, but hoping to soon and looking forward to it. \n\nStarting with Nixon, you see this sort of smearing, dirty campaign; one of Nixon and McCarthy's guys, [Roy Cohn](https://en.wikipedia.org/wiki/Roy_Cohn#Representation_of_Donald_Trump), even helped a young Trump. Sooner or later, you've got to hit back, because when you consider the long-term transformation it has caused in the Republican party, you're talking about nearly a total one-eighty from [Eisenhower's platform](http://www.presidency.ucsb.edu/ws/?pid=25838), beyond the duties of 'loyal opposition' into undeniable obstructionism. As FDR said, \"It is common sense to take a method and try it. If it fails, admit it frankly and try another. But above all, try something.\" Don't just stand there throwing monkey wrenches into the machine: try something to fix it.\n\n\n\nOr, as Adlai Stevenson said, \"Our nation stands at a fork in the political road. In one direction lies a land of slander and scare; the land of sly innuendo, the poison pen, the anonymous phone call and hustling, pushing, shoving; the land of smash and grab and anything to win. This is Nixonland. But I say to you that it is not America.\" \n\nIt might not have been America then, but Nixon certainly poisoned the well for everyone who came after.", "Also don't try to dominate those around you by telling them whom they should vote for.  Encourage participation, which has its own rewards.", "This bullshit is trotted out every election and I'm sick of it. \n\n*Everyone* has the right to criticize the government. If I don't vote because I don't like any option and think they're bad for the country I don't get to voice that opinion? ", "People like this fucking asshole who bring guns to polling stations to try to intimidate voters need to FUCK OFF\n\nWhen they say *hey I'm just exercising my 2nd amendment rights* they need to FUCK OFF MORE\n\nIt's completely and utterly indefensible.", "Russia is literally a textbook example for political science students studying oligarchy and they are using the term to deride the US? I'm not sure I totally disagree at times but that is some serious projection/lack of self awareness.", "Probably the primary reason I want her to win is so I can listen to Conservatives complain about her because I guess I have a sadistic streak.", "I thought Hilary only needed  Florida to seal the deal ?", "lol nothing must make Trumpers blood boil more than a politician speaking spanish. Can you imagine Sarah Palin's reaction? ", "Wow that was a huge surge, she was somewhat behind Obama's numbers and not looking like she was going to pass them yesterday morning.", "Standing with a gun, blocking a person's path, and asking a loaded question like \"Who are you going to vote for, crooked Hillary?\" qualifies as intimidation in my opinion. ", "It's pretty simple. White republicans are \"real Americans\" trying to defend their country; everyone else is scum. ", "538 also has zero accounting for early voting. Harry Entin said this in yesterday or Thursday's podcast.\n\nSo if the polls fall l to represent latinos the polls fail 538", "\"Riggers.\"", "It was also supposed to be a place where nobody lived full time but now it has over 700,000 permanent residents.", "many of them do but people who don't speak English are less likely to answer a random phone call.\n\nYou can read more about the difficulty of polling Latinos here: http://www.theatlantic.com/politics/archive/2016/02/spanish-and-technology-make-polling-us-latinos-difficult/460263/", "I think it may have been. There was no new solid information there and the obviousness of the political machinations made people very angry.", "I feel you I used to mow lawns and since there was only AM radio in the truck, I'd listen on occasion and laugh about how dumb Savage sounded (this as a teen). Then as a senior, I caught a ride at one point with my buddy and his dad, two white upper-middle-class guys who always seemed super reasonable and respectable. The dad bragged about his physics degree, had a library stacked with pleasure-reading on the subject, and was constantly trying to get his son to study geometry more. Savage comes on and I start laughing at it, \"Oh, man, this guy's a nutjob, you ever listen to him before?\"\n\nDead silence, deathly stares, and a very uncomfortable car ride ensued; I don't think I was allowed back over after that.", "We're nothing like Hitler but if you don't agree with us we'll kill you.", "That's a pretty broad brush there.\n\nSome I assume, are good people.", "O man the ending to the video where the guy say this is America, you're innocent until proven guilty and she responds with, \"like Hillary\" pure gold.", "pretty sure he just reads russian propaganda every morning that roger stone gives him from putin.", "I just don't get it. Why are people forced to line up for hours even for early voting? And why at a grocery store?! I voted early in our election (Canada) and it took 5 minutes. Even on election day you might only wait 1 hour max.  Democracy has to be accessible to be called democracy.", "\"Trump is dead\" is something I've heard many times and each time the person saying it was wrong. I don't care if you're Republican or Democrat but for the love of god do not listen to clowns like this who try and reassure or dishearten the masses with meaningless words. Make sure you vote on the 8th so that you can say you did everything you could for your candidate.", "#YallQaeda\n\n#YeeHawd\n\nLoved these when they applied the description to the Bundys.", "Yes I think we're more likely to see a hidden Hispanic vote than a hidden Trump vote. ", "Maybe not once or twice. But plenty of people are watching this election without actually choosing to take part. Complacency is almost a way of life now.\n\nSo yeah, I do think reminding people to vote is important. And I do believe that there are some people who wouldn't have bothered or taken the time. But then they get on a platform they connect with, like Reddit, then over time the message can start to have more effect.\n\nMore importantly, it's a practically nonexistent investment. With the hopes of encouraging others to take part in the process.", "Watching 538s predictions is giving me a heart attack... and I'm not even American. ", "This! We've been on the slippery slope since Ronnie Raygun", "They won't do shit. All talk no action.", "There's probably going to be an avalanche of polls coming out tomorrow.  All the poll volume right now is owing to pollsters making their final projections before the election.  The final Des Moines Register Iowa poll is expected tonight.  The Columbus Dispatch Ohio poll is coming tomorrow.  CNN will be releasing its final national poll tomorrow.  ", "He's playing Hungry Hungry Hippos and thinks if he bashes it hard and fast enough he will win.", "He could win all BG states and flip a Michigan or Pennsylvania. Would be tough though.\n\nGo vote !", "But what's impressive is that out of the Dem EVs 82.5% (!!!!) of EV hispanics are unlikely voters.  Which means that Clinton should overperform polling on ED.", "Now they tacitly support it from what I can tell.", "&gt;\"I'm asking you to dream big.\"\n\n...while giving you no policy ideas whatsoever because I think you're too stupid to realize I want to deregulate and privatize every single one of your \"corrupt\" institutions (i.e. all of them).", "People are energized.", "I'm pretty new to politics but has that ever happened before where someone came back from a distance and won all the swing states they needed? Is that even possible with Trump? Hope not."], "links": ["5b9k8l", "5b9dv5", "5b9dv5", "5b9iud", "5b9eu1", "5b9iud", "5b9eu1", "5b89up", "5b7nvh", "5b89up", "5b9eu1", "5b9eu1", "5b9dv5", "5b86k2", "5b9hfp", "5b89up", "5b9eu1", "5b9cf8", "5b9hfp", "5b7nvh", "5b9ei2", "5b9eu1", "5b86k2", "5b9dv5", "5b7xl8", "5b89up", "5b7nvh", "5b9ei2", "5b9iua", "5b9cf8", "5b9cf8", "5b89up", "5b9h3b", "5b7nvh", "5b7gmo", "5b89up", "5b9i4m", "5b9eu1", "5b86k2", "5b9ei2", "5b89up", "5b6y8s", "5b7xl8", "5b89up", "5b86k2", "5b89up", "5b9iua", "5b9hje", "5b9c7u", "5b9hje", "5b7nvh", "5b89up", "5b6y8s", "5b9cf8", "5b8ilr", "5b6y8s", "5b7nvh", "5b7nvh", "5b7nvh", "5b89up", "5b89up", "5b7gmo", "5b9ei2", "5b83ja", "5b83ja", "5b9h3b", "5b89up", "5b9c7u", "5b9ei2", "5b6y8s", "5b9f1s", "5b9i4m", "5b83ja", "5b7nvh", "5b9bic", "5b9h3b", "5b86k2", "5b9c7u", "5b9c7u", "5b9iud", "5b9ei2", "5b9i4m", "5b9f1s", "5b7nvh", "5b9bic", "5b6y8s", "5b83v3", "5b6ch7", "5b9f1s", "5b9i42", "5b9ei2", "5b0i9u", "5b89up", "5b9k8l", "5b9k8l", "5b9k8l", "5b9k8l", "5b9iud", "5b9iud", "5b9k8l", "5b9iud", "5b9dv5", "5b9iud", "5b9dv5", "5b9k8l", "5b9iud", "5b9iud", "5b89up", "5b9cf8", "5b89up", "5b9iua", "5b9iud", "5b9o75", "5b9o75", "5b9iua", "5b9k8l", "5b9eu1", "5b9m4x", "5b9hfp", "5b9k8l", "5b9o75", "5b89up", "5b9dv5", "5b89up", "5b9iud", "5b9eu1", "5b89up", "5b9cf8", "5b89up", "5b9o75", "5b9pqj", "5b9ouv", "5b9dv5", "5b89up", "5b89up", "5b86k2", "5b9iua", "5b9k8l", "5b9iud", "5b89up", "5b9pqj", "5b9iua", "5b9eu1", "5b9iua", "5b9hfp", "5b9dv5", "5b9ouv", "5b9k8l", "5b9iua", "5b9eu1", "5b9k8l", "5b7gmo", "5b9iud", "5b9eu1", "5b9ouv", "5b9ouv", "5b86k2", "5b7xl8", "5b89up", "5b9pqj", "5b9dv5", "5b9iud", "5b9pqj", "5b9eu1", "5b89up", "5b86k2", "5b9iud", "5b89up", "5b9cf8", "5b83ja", "5b86k2", "5b7xl8", "5b9o75", "5b9o75", "5b89up", "5b9pqj", "5b86k2", "5b9kl1", "5b9dv5", "5b89up", "5b9k8l", "5b9rgo", "5b9rgo", "5b9mlq", "5b9eu1", "5b9hfp", "5b7nvh", "5b9dv5", "5b8en3", "5b9k8l", "5b9s7l", "5b9k8l", "5b9s7l", "5b9k8l", "5b9dv5", "5b9s7l", "5b9yh4", "5b9uhe", "5b9iud", "5b9xs9", "5b9iua", "5b9iud", "5b9k8l", "5b9uhe", "5b9s7l", "5b9xfr", "5b9rs6", "5b9upu", "5b7nvh", "5b9uhe", "5b9s7l", "5b9s7l", "5b9iud", "5b9uhe", "5b9xfr", "5b9uiq", "5b9wux", "5b9iua", "5b9cf8", "5b9wux", "5b9m4x", "5b9upu", "5b9iud", "5b9iua", "5b9iud", "5b9t8w", "5b9iud", "5b9s7l", "5b9eu1", "5b9upu", "5b9t8w", "5b9k8l", "5b9iud", "5b9sbc", "5b9k8l", "5b9s7l", "5b9iua", "5b9iud", "5b9t8w", "5b9k8l", "5b9xs9", "5b9vw0", "5b9iud", "5b9o75", "5b9k8l", "5b9o75", "5b86k2", "5b9uhe", "5b9uiq", "5b9uhe", "5b9cf8", "5b9dv5", "5b9iud", "5b89up", "5b9iud", "5b9s7l", "5b9iua", "5b9eu1", "5b9hfp", "5b9uhe", "5b9ouv", "5b9ouv", "5b9iud", "5b9o75", "5b9iua", "5b9iud", "5b9iua", "5b9k8l", "5b9o75", "5b9x3t", "5b9sbc", "5b9k8l", "5b9s7l", "5b9iud", "5b9o75", "5b9m4x", "5b9eu1", "5b9eu1", "5b9zyz", "5b9dv5", "5b9iua", "5b9xfr", "5b9x3t", "5b9x3t", "5ba1vt", "5ba1vt", "5ba1vt", "5ba1vt", "5ba1vt", "5ba1vt", "5ba1vt", "5ba1vt", "5ba430", "5b9k8l", "5b9k8l", "5b9k8l", "5b9k8l", "5ba1vt", "5b9k8l", "5ba1vt", "5b9iud", "5ba1vt", "5b9k8l", "5b9k8l", "5ba1vt", "5b9yh4", "5ba430", "5b9k8l", "5ba430", "5b9k8l", "5b9k8l", "5ba1vt", "5b9k8l", "5b9s7l", "5ba83z", "5b9k8l", "5b9iud", "5b9k8l", "5ba1vt", "5b9k8l", "5ba83z", "5b9cf8", "5b9xs9", "5b9s7l", "5ba1vt", "5ba1vt", "5ba430", "5b9dv5", "5b9k8l", "5ba430", "5ba83z", "5ba1vt", "5b9k8l", "5b9k8l", "5b9s7l", "5b9dv5", "5b9k8l", "5b9k8l", "5b9k8l", "5b9iud", "5ba6yx", "5ba1vt", "5b9k8l", "5b9k8l", "5b9xs9", "5b9k8l", "5b9s7l", "5b9k8l", "5b9s7l", "5ba39r", "5b9k8l", "5ba6ro", "5ba39r", "5b9iud", "5b9iud", "5ba0sk", "5ba430", "5b9dv5", "5b9eu1", "5b9k8l", "5b9uhe", "5b9xs9", "5b9k8l", "5b9s7l", "5b9k8l", "5b9k8l", "5b9k8l", "5b9k8l", "5ba39r", "5ba1vt", "5b9xs9", "5b9hfp", "5b9iud", "5b9upu", "5b9wux", "5ba0sk", "5b9iud", "5ba2bd", "5b9k8l", "5b9k8l", "5b9dv5", "5ba1vt", "5ba1vt", "5bahyc", "5ba1vt", "5ba9zi", "5ba9zi", "5ba1vt", "5bahif", "5ba1vt", "5bahif", "5b9yh4", "5bahif", "5ba1vt", "5bahif", "5ba8dp", "5b9k8l", "5ba1vt", "5bahif", "5bahif", "5ba1vt", "5b9xs9", "5b9k8l", "5bafjz", "5ba1vt", "5ba1vt", "5b9k8l", "5b9yh4", "5ba1vt", "5bahif", "5ba9zi", "5b9iud", "5bahyc", "5b9cf8", "5ba1vt", "5bahif", "5babzr", "5b9k8l", "5ba1vt", "5ba6yx", "5ba1vt", "5b9iud", "5b9k8l", "5b9xs9", "5bahif", "5b9s7l", "5b9k8l", "5b9k8l", "5b99k5", "5b9k8l", "5b9dv5", "5ba0sk", "5b9iua", "5b9iud", "5b9k8l", "5b9k8l", "5b9dv5", "5ba6yx", "5b9dv5", "5ba1vt", "5b9dv5", "5b9k8l", "5bahif", "5ba1vt", "5b9dv5", "5ba1vt", "5b9k8l", "5ba6yx", "5b9s7l", "5b9k8l", "5b9yh4", "5b9k8l", "5bafjz", "5bahoo", "5bafjz", "5ba6ro", "5baehv", "5b9upu", "5bahif", "5bahyc", "5bahif", "5b9k8l", "5b9k8l", "5ba83z", "5b9iua", "5b9k8l", "5b9k8l", "5ba6yx", "5ba9pz", "5ba8dp", "5ba9pz", "5ba6yx", "5bahif", "5b9uiq", "5b9iud", "5b9dv5", "5balae", "5ba1vt", "5balae", "5bahif", "5ba1vt", "5bahyc", "5balae", "5balae", "5baly5", "5bahif", "5ba9zi", "5bahyc", "5b9yh4", "5bahyc", "5ba1vt", "5b9k8l", "5ba1vt", "5ba1vt", "5b9iud", "5ba1vt", "5ba1vt", "5ba1vt", "5ba1vt", "5balae", "5baly5", "5ba9zi", "5bahif", "5b9k8l", "5bahif", "5bahyc", "5ba1vt", "5ba1vt", "5ba1vt", "5bahif", "5bahyc", "5b9s7l", "5b9k8l", "5b9k8l", "5ba9zi", "5bap7r", "5bafjz", "5baly5", "5baly5", "5ba1vt", "5b9s7l", "5bahyc", "5ba9zi", "5ba1vt", "5b9k8l", "5balae", "5bahif", "5bahif", "5b9k8l", "5baly5", "5ba1vt", "5b9k8l", "5bahif", "5bahif", "5ba8dp", "5ba1vt", "5bahif", "5ba8dp", "5bap7r", "5b9eu1", "5b9s7l", "5ba9zi", "5bamg2", "5ba9zi", "5bap7r", "5ba1vt", "5bahyc", "5ba1vt", "5b9iud", "5bahyc", "5ba9zi", "5ba1vt", "5bap7r", "5bahif", "5babzr", "5balae", "5bal3o", "5bahyc", "5ba1vt", "5bahif", "5bahyc", "5bahif", "5b9yh4", "5bahif", "5bahif", "5baly5", "5ba9zi", "5bahyc", "5ba1vt", "5bam9p", "5ba9zi", "5ba9zi"]}