{"comments": ["The Daily Beast is owned by IAC media and Chelsea Clinton sits on the board of directors there", "Want to know what incentive looks like? This woman has been witch hunted demonized and smeared for thirty years. Her own husband embarrassed her before the whole world. Yet she's only a policy wonk who simply wants to be given a chance to prove that she will do a damn good job, not only to beat those thirty years of witch hunting, but for all women, for she would be the first of many to come. \n\nI charge that Hillary Clinton is the most incentivized politician in history to do extremely well.", "Kanye West vs. Mike Pence vs. Hillary Clinton\n\nKanye West wins for the Kanye West Party\n\nCalling it now", "Fuck this subreddit", "Cue /r/The_Donald crying about a new conspiracy of fraudulent stick figure voting. ", "It's only wrong if \"certain groups\" are voting", "&gt; “White students said in class that they were scared of brown people and thought all Muslims should be removed from the country” she says. “The two Muslim students were bullied and called ISIS fighters. My Black students were being called n-words.” \n\n&gt;  Meanwhile, back east, even proudly liberal enclaves like Newton, Massachusetts, have been convulsed by bias eruptions. Michael Zilles, President of the Newton Teachers Association, says the district’s schools have been rocked by instances of anti-Semitic graffiti, bigoted comments directed to an African-American student group, and a Confederate Flag—“here in Massachusetts!”\n\nThis is Trump's America.", "Which is why Hillary's debate compliment on his children was a serious burn. ", "Your mistake is you're looking for logical consistency. It's not about it making sense even given the crazy priors. It's about the feel of the message. The narrative of the story. \n\nHere, the message is \"corrupt Democrats are cheating and rigging the polls\". That's it. Don't try to look deeper, because there is nothing deeper. It's a superficial message design to simply create the impression of corruption in the minds of people who either can not or do not bother to think critically about it.", "I resent the living hell out of the Republican party.\n\nThey've cultivated an environment of fear paranoia, and anger, just as she said. Far from advocating the government taking a light touch and diminished role in our lives, they've advocated for overbearing, reactionary legislation like the Sarbanes Oxley Act, the Patriot Act, and many others. They've tried to legislate aspects of my life that they shouldn't have a say in. \n\nMost of all, I resent them tilling the soil, planting the seeds, and growing the monster that is Donald Trump. He's an angry, paranoid, vain, anti-intellectual candidate who has espoused big-government policies and dangerous foreign policy. I disagree with Hillary Clinton on many key issues and I resent the hell out of the Republican party for making me hope she wins this election and becomes president.", "I think she stands to inherit more from her marriage than from Trump's hemorrhaging business ventures. Her husband is actually good at the real estate business and worth $200 million at 35 while his company has $7 billion in assets. Trump was down to licensing out his name to make money and now he's destroyed that brand. She'd be better off jumping on the Kushner ship. ", "This is the second thing Beck has done that's come dangerously close to making me respect him slightly.\n\nI don't like it.", "Randall Munroe &gt; Scott Adams", "Say what you will about Hillary but she is one tough woman. So many republicans over so many years tried to destroy her and her husband and yet here she still stands after 30 years of this shit running for the most stressful job in the world at normal retirement age.. ", "Surely the clinton supporters grew organically directly after the Democratic convention right? /s", "Next on [Celebrity Deathmatch](https://en.wikipedia.org/wiki/Celebrity_Deathmatch) Randall Munroe v. Scott Adams--a bareknuckle fight to the finish.", "Women: It's almost like they're people!", "Don't speak in the past tense yet. Everyone still has to vote! Let's get this done fellow citizens! ", "Obviously people don't know their history. Neither do you or politifact apparently. What Kaine was trying to get at was immediately after the signing of the Declaration of Independence the first words spoken in the room were by Ben Franklin and he said, \"Ay, caramba. I can't believe we're really doing this.\" ", "\"Scott Adams withdraws due to extreme loss of testosterone after hearing of a Clinton victory.\"", "I keep one very vocal Trump supporter front and center on my faceobook feed so that I can monitor what \"normal\" people are saying on their actual accounts with their real names.\n\nIt's pretty frightening. \n\nMy favorite from this morning: he posted that Comey's FBi is a joke and a stain on the legacy of Hoover.\n\nI've also seen a number of comments \"not calling for violence but this is the last chance we have to take back America and keep the World free.\" They actually believe this, folks. Last week, some of his commenters were saying that they firmly believe that Trump will get 470 electoral votes, and that if he does not get at least 400, then it was clearly rigged and completely invalid. These people are questioning how anyone could possibly review a huge batch of emails as a batch, disbelieving pretty standard election polling processes (never perfect, but still fairly accurate), and acting like anything based on math or algorithms is a liberal conspiracy.", "**Spoiler: He is** or he wouldn't be there like so many others aren't. Snowden is a legitimate (so far) trophy to hold up to the world and say \"America has problems.\" He's useful. World leaders aren't pretending Putin's Russia is a bastion of freedom--they know it isn't because they aren't stupid and didn't forget about the past 2 decades. Snowden is safer in Russia than in the USA. That message sells itself. Paired with the USA's outed wire-tapping of other G6 leaders... Well, again, that sells itself.", "Not at all. Sometimes they're bragging and sometimes they're bullying.", "Put this woman in the White House lads.", "i don't disagree but you forgot: Eric Trump vs. Donald Trump Jr. vs. Ivanka Trump vs. Robo-Donald in the Trumpublican primary", "[Ahem.](https://xkcd.com/1171/)", "Genuinely don't understand how people can vote for trump. How are you gonna make him the leader of the most powerful nation when hr has no political experience? He needs babysitters for twitter and even then doesn't listen to them. How will he listen to the presidential cabinet?", "&gt; started\n\nlol you're cute", "This should be the only endorsement that reddits cares about.", "If we're being pedantic it would be San Miguel de Gualdape in present day Georgia no? The settlement only lasted a few months, but it predates Pensacola by almost 35 years.", "Let's hear it for the Mormons the only element of the Christian Right that give a damn about their principles.", "Wow... When he tells his wife to \"be a woman\" and let him handle it. Just...wow", "The article was written by 1 journalist: Bill Curry\n\nHe was talking for himself not the entire publication.\n\n*Edit: If you want proof that Bill Curry is being genuine here - [These](http://www.salon.com/writer/bill_curry/) are the articles he has written for Salon.com*", "\"United states is a laughing stock in the world\"\n\nYou are to thank for it Donnie.", "NPR this morning\n\nsteve inskeep asks tucker carson what the republicans can do about the latino vote changing things forever against them - he meant engage learn to work with them, of course.\n\nCarson answered: \"immigration control\"\n\nThe lady who often plays the democratic side to this conversation, I forgot her name, said…\n\n\"immigration control can't help you. You will need birth control to make a difference. Good look with selling Republicans that.\"", "&gt; At a rally in Sarasota Fla., the day before 2016 Election Day, Republican presidential candidate Donald Trump repeatedly said \"the system is rigged,\" and called the United States \"a laughingstock.\"\n\nI hadn't really thought about how much Trump will blame everyone but himself when he loses, because I've been so focused on him claiming that the election was rigged and that he won. Now he's saying, \"I did my thing; I worked,\" and it's clear that he'll take none of the blame when he loses.", "They have this copypasta post ive seen spammed with screenshots of little reddit snoos in nooses claiming that on August 31 paid astroturfing took over.  They don't mention is that 8/31 is the day Spez announced a rule for the T_D about not posting links to this sub and banned thousands of IPs found to be vote manipulating.  ", "I was very jealous when my brother (14 years younger than me) told me he was learning powerpoint in middle school. I had to take a college course for that! (For a certification requirement)\n\nWtfman.\n\nNow kids in elementary are using chromebooks and doing all sorts of stuff on their computers in the classroom. Just reminds me of the scene in Star Trek where a kid ~12 or so was learning calculus like it was normal.", "Don't boo or egg. Vote. ", "Yeah I'm surprised a young sprightly 70 year old Donny is still with a 47 year old hag like Melania. I figure it's about time he started creeping on Ivanka's friends. ", "Strong. Asked for the vote differentiated herself from her opponent without going negative, looked and sounded not just Presidential, but world leadery. Good stuff.\n\n", "Tomorrow night I find out if I'm gonna become an alcoholic for the next 4 years or not.", "The most relevant XKCD of them all.", "Dear low information voter: We love you.  We really do.  Not for your vote or your Patriotism or in some condescending way.  We want you to have a long comfortable life full of freedom and liberties.  \n\nAnd I will say this in the least condescending way I can: We want you to be more curious.  We want you to no just accept what somebody tells you because it matches how you feel.  We want you to ask questions like \"how come I'm so upset that Doug (D) had an affair but the fact that Rick (R) had an affair doesn't bother me?\"  We want you to have see the world as a complex, amazing place.  We want you to verify statements like \"this country is now more violent than ever\" before you believe them and repeat them.\n\nWe don't want you to be broke or miserable or constantly in crisis with no solution in sight.\n\nPlease remember this the next time somebody tells you how liberals are all evil: We love you for your humanity, warts and all.  Now go look up three things you believe you know for certain before you vote.  And yes, we want you to vote.\n\n~~ Liberals", "It seems like Trump has given up winning and is now focused solely on getting America out of the EU", "As if bankruptcy were uncharted territory for the guy!", "Remember when CNN was leaking debate questions to the Clinton campaign to help her destroy Bernie?\n\nRemember when they did it more than once?\n\nThey all set out to sabotage Bernie. The DNC and the media colluding together.\n\nThey are crooked beyond belief.", "man that sounded like a concession speech....", "###[Irrelevant xkcd](http://xkcd.com/1278/)\n\n\n\n**********\n\n I'm a bot bleep bloop", "No. No puppet. No puppet. You're the puppet!", "&gt; He just doesn't have the stones to play DC hardball.\n\nThis this this.\n\nHis supporters think he is some lion-hearted god emperor. I think that's absolutely the opposite of the truth.\n\nI think he's too weak in character to play with the big dogs and would quickly become someone's puppet.", "Looks like it'll hinge on New Hampshire and looking at the polls it appears to be a complete toss-up, maybe slightly favoring the GOP. Absolutely amazing to think about the enormous ramifications coming from the decisions of potentially a very small number of voters in one state.", "Makes you feel bad for Snowden. Not that he's some perfect figure but he's still an American IT guy who thought he could really make a difference and has had to pay for it by leaving his home and loved ones. Now he's used as a tool against us and can reasonably assume he'll never be truly safe at home again. \n\nThat's just gotta suck.", "I assume you're not happy with the endorsement but that's definitely not what \"jump the shark\" means.", "Some ridiculous idea about watching women on TV lowers testosterone.\n\n&gt; I have after all my reading, come to be skeptical of Adams’ predictive powers. He guessed that Trump would win the Iowa caucus, and then when he didn’t, Adams spent 1,000-plus words laying out the case for its having been rigged. He predicted that the Democratic Convention, due to its testosterone-dampening effects, would lead to history’s first post-convention anti-bounce.\n\nhttp://www.slate.com/articles/news_and_politics/politics/2016/09/dilbert_creator_scott_adams_gets_trump_like_no_one_else.html", "More like this I would think:\n\nhttp://xkcd.com/1425/", "I can't wait to vote tomorrow. Pulling that lever to make the orange chump disappear forever (one can dream) will give me such great satisfaction. \n", "I think they gave up on hiding it a few years ago.", "Defend daddy or be cut from the will.", "Hell he was born on third base and thinks he *invented baseball*.", "&gt;the Cuban vote is pretty evenly split b/w Hilliary and Trump\n\nThis is in her favor. They usually lean conservative.", "As a non-American I think y'all are actually going to pull this off and redeem yourselves.\n\nGo out and vote -- up-ballot down-ballot, and referenda!", "It's been months since I've seen a \"how is Trump racist?\" challenge reply.", "She should just go by 'Ivanka'.\n\nShe really doesn't even need a last name. When someone says \"Ivanka\" everyone knows who they are talking about.", "You overestimate my amount of caring.", "I think people were bashing him for delivering a speech entirely in mexican. \n\nEdit: it's a joke relax. ", "Trump supporters are already burning all of their own bridges as they go out swining this election. They've made EVERYONE AND EVERYTHING an \"enemy.\" That is how you marginalize yourself. The media is the enemy. The establishment is the enemy. Minorities are the enemy. Woman are the enemy. Obama. Democrats. Private citizens who criticize Trump. The FBI. The entire nation's intelligence organizations. Judges. Etc...\n\nWhen they just make enemies of group after group after group those groups start to band together to some extent in opposition to them. It's self-marginalization fueled by the inability to accept that their beliefs and views put them in the minority and won't win them elections.", "Clinton up to 68% on 538. She's turned Nevada Florida and North Carolina blue. Hope it sticks.", "Let's see how they actually like it once there is no more safe space for racist dummies. ", "He was still talking about the \"produce department\". His subconscious betrays him all the time. ", "A very long but insightful article about [Donald and Ivana in Vanity Fair from 1990.](http://www.vanityfair.com/magazine/2015/07/donald-ivana-trump-divorce-prenup-marie-brenner)  \n\nGoes a bit into the kids and one blurb regarding your question. Jr didn't talk to his dad for a year and had his male bonding with his maternal grandfather in Czechoslovakia:\n\n&gt; She had been completely humiliated by Donald through his public association with Marla Maples. “How can you say you love us? You don’t love us! You don’t even love yourself. You just love your money,” twelve-year-old Donald junior told his father, according to friends of Ivana’s. “What kind of son have I created?” Trump’s mother, Mary, is said to have asked Ivana.", "He wouldn't. He'd load it up with people who only tell him what he wants to hear and fire anyone who challenges him. He just doesn't have the stones to play DC hardball.", "Take solace in the fact that no matter how well schools teach him ms office he will still have to take the college course to prove it to his future employers.", "smart people are smart", "[Most of the \"Viking\" artifacts found in the area which is now the United States are largely considered to be Native American in origin](http://muse.jhu.edu/article/51011). There is evidence of Vikings reaching what is now Canada and they did have a colony in Greenland, though.", "And the Latino vote is GONE. ", "That post was dripping with insincerity and sarcasm. ", "It's the small things like that that's going to make me miss Obama.", "You're actually using logic to explain something that these people wanna FEEL is wrong... stop that =P", "I'm in CA which is solidly blue, and where Bernie is a valid write-in candidate. My boyfriend has already voted and written Bernie in and I'll be doing the same later today. I will be voting democrat downballot, but I will not vote for Clinton.\n\nI've been registered as an independent since 1988 and voted 3rd party until 2004 (edit: I voted for Kerry). I voted for Obama and donated heavily to both of his campaigns. If the DNC wanted my vote this year, they really screwed up. \n\nAnd as for the army of Clinton supporters telling independents they MUST vote for her, I find it ironic since we were told over and over during the primaries that she didn't need our votes but now that we're in the general, they seem desperate for those votes. Funny, that. \n\nIt's pretty simple. If you don't want people to turn away from your candidate - pick a better candidate.", "To which Kasich delivers the knockout: \"well some people put party first. Me, I put country first.\"", "Everyone's allowed to disagree even when they're wrong.", "Chris Christie is like a real life Luca Brasi with none of the actual intimidation skills", "He means geopgraphically as in languages spoken by people who lived here, within our modern borders, not necessarily as citizens of America.", "&gt; She's pretty much been raised by her mom \n\nThat's true for all of his kids.", "I'm having the same problem. I don't know how to combat such ignorance when they don't trust any source other than FOX/the Drudge Report/Breitbart. Telling them how those sources flat out lie half the time get you nowhere. Showing proof that they lie just get the response \"yeah well that's exactly what a liberal source would say\". Bringing up a video showing undeniable proof of the lie just makes them shut down and want to change that she subject.\n\nI ask for a reason to vote for Trump and I just get \"he tells it like it is\" or \"he's not a politician\". Ask for details and you get \"well Hillary is just more of the same\". Point out that the Republican congress has been the reason for the gridlock and you just get \"yeah OK Republicans are totally at fault for everything your just a brainwashed liberal\"\n\nI tell them about the importance of taking climate change seriously and I get arguments like \"well the ice takes up the same volume as water so the water levels won't rise\". I ask why they think 99% of scientists never thought of that and I just get \"probably bought by Hillary\".\n\nI ask why they think lowering taxes on the wealthy even further would help when inequality has massively increased since Bushes tax cuts. They say \"yeah well a flat tax on everyone would poll be better\". I show them articles about Nobel prize winning economists talking about how both those ideas are idiotic and would damage the economy and cripple the government. I get \"well BBC is a known liberal news channel\".\n\nI tell them about Mexico being 1 of our only 2 neighbors and how important to our national security it is to keep them friendly. I tell them how abandoning NATO will leave a power vacuum that China or Russia will exploit. How disbanding the WTO would lead to a massive reduction in global GDP and increased rivalries between nations, leading to more international wars down the line. To this I get \"hey man, why dont we all just vote the way we want and leave it at that\".\n\nIt's so fucking infuriating and depressing. These are friends and family I grew up with and it takes so much effort to not just come right out and call them fucking idiots. I hate this fucking election and Trump for driving wedges so deep into our society just to gain so votes.\n\nI have no doubt, that if we don't snap out of this craziness and American democracy just gets worse and worse, we will look back and see Trump in the same way many see the Gracchus brothers of Rome. The first step towards the end of the Republic.", "The replies to his [tweet](https://twitter.com/GenFlynn/status/795392694411468800) were entertaining. \n\nhttps://pbs.twimg.com/media/CwnnIQtVIAAhTXl.jpg\n\n\n\n", "Puppet Don got the shackles put back on. Someone else really is controlling him it seems. Sad! Low energy. ", "Why? I mean this in no disrespect to her but I don't think she a particularly moral individual. I can't know this but I assume she married out of personal interest rather than love. But I don't say that as it were fact. She may truly love the man and if so then so be it. \n\nI don't think she is like her husband. Not at all. But I don't think she is an innocent victim. She knew who she was marrying and why. \n\nAt the end of the day I am glad she hasn't been attacked by the left like Michele has by the right (called a man and ape). \n\nYes she was mocked for plagiarism and rightly so. And then again for bullying speeches and again rightly so. But I aside from ugly comments here and there on social media I don't think she has been viciously attacked. \n\nI believe she cares about her children. I hope after this election she can do whatever good she wants to do. Cyber bullying is a good cause despite the irony and I hope she still can fight for it. \n\n", "we apologize that it even got to this place.", "We live in a post-fact society. A random white supremacist on Twitter has the same credibility as the New York Times. So I'm not surprised that people are so pro-Trump. ", "Plus we spoke Dutch and English at the beginning of this country and German was pretty commonly spoken until World War II.  \n\nWe have one million us citizens in PR. What's wrong with Spanish?  ", "Well he is a whiney little bitch", "Many of the Founders came from the aristocracy of the colonies: slaveholders rich landowners, merchants profiting off the triangular trade. They were terrified of a rule of the people because they realized that political power in the hands of the people would be a threat to their wealth and property- the people would clamor for an equitable distribution. The US has always been dominated by an oligarchy of capital. \n\nMadison:\nThe man who is possessed of wealth, who lolls on his sofa or rolls in his carriage, cannot judge the wants or feelings of the day-laborer. The government we mean to erect is intended to last for ages. The landed interest, at present, is prevalent; but in process of time, when we approximate to the states and kingdoms of Europe, — when the number of landholders shall be comparatively small, through the various means of trade and manufactures, will not the landed interest be overbalanced in future elections, and unless wisely provided against, what will become of your government? In England, at this day, if elections were open to all classes of people, the property of landed proprietors would be insecure. An agrarian law would soon take place. If these observations be just, our government ought to secure the permanent interests of the country against innovation. Landholders ought to have a share in the government, to support these invaluable interests, and to balance and check the other. They ought to be so constituted as to protect the minority of the opulent against the majority. ", "http://i.imgur.com/9vw5l2e.gif", "Upvoting Glenn Beck for being the voice of sanity.\n\nThis fucking election man.", "At this point the #Bernitdown holdouts aren't going to change their mind.   They don't care about what he has to say or whats at stake.  \n\n Good on Sanders for trying though.", "I don't believe it...\n\n&gt; “I did a lot of freaking out about Barack Obama” Beck told Schmidle. But, he added, “Obama made me a better man.”\n", "You can't make voter suppression efforts a key part to your electoral success and expect it to work over the long-term. People adapt.  People learn the new rules and work around them.\n\nEventually you have to get stricter with your suppression efforts and eventually you hit that point where the Supreme Court steps in and mandates federal oversight.  ", "It may come as a surprise to people that have listened to her skewer Trump and his surrogates over these last few months but she has always been a REPUBLICAN pundit.  ", "Did Glenn Beck get a benign brain tumor removed without telling anyone?", "He is right vote for Hillary and then work with Bernie to be the progressive thorn in her side over the next 4 years.  ", "Yes since the invention of **square** watermelons, they can pack an infinite amount of them in a cubic box.  Great packing efficiency!", "&gt; Upvoting Glenn Beck for being the voice of sanity.\n\nWhat in the actual fuck... this cannot be the real world. I must have gone crazy and am living in a twisted nightmarish bizzaro world delusion.", "/r/politics: \"How about I just not vote at all then blame Clinton when shit goes wrong, then tell people that Bernie would have done it better when shit goes right?\"", "I think it is important to remember and praise people like her. Donald Trump is a unique threat a truly disgusting individual who ran a campaign based on hate and fear and lies and nothing else. And nearly every one on the right side of the aisle let it happen, I remember after the third debate when he refused to accept the election results, watching his two surrogates talk about how it makes him smart. \n\nDo not forget that when our future as a country was on the line, these weasels picked Trump. They are traitors to the vision of America, each and every one of them.", "And Trump was furious that those voters who were in line when the polls were scheduled to close were actually allowed to vote before those polling stations finally closed for the evening. \n\n\n\nThe HORROR!", "I respect her. My respect for her really went up on the day pussygate broke. Her impassioned response on CNN was great. And she didn't let Trump or his surrogates off the hook on that issue in the days that followed. ", "Moderate republican women are as well. They just aren't telling their husbands", "I agree with Glenn Beck. I want off 2016's wild ride. ", "(furiously rubs eyes)", "I remember always seeing pictures of him making [this](http://twt-thumbs.washtimes.com/media/image/2016/10/03/campaign_2016_trump_apprentice_c0-0-4389-2559_s885x516.jpeg?b338e6a8b0df15c98f85fdca2ddbe68c4739e067) exact same pose literally every time a camera snapped his picture during the apprentice days and thinking he was a tacky caricature of a rich guy with zero self awareness even back then.  It was so cringey that he thought that pose was cool and badass.", "If you're anything other than a white male and you're voting for Trump your mental gymnastics must be at an Olympic level. ", "I believe this is the silent majority. ", "Ana Navarro Tara Setmeyer, and S.E. Cupp are the three I have new respect for after this election. All 3 are right wing pundits that refused to get on the Trump train from day 1.", "Take a listen to some of the recent episodes of the NY Times' \"The Run-up\" podcast. They talked to an author who interviewed Trump extensively for a biography and the guy said that Trump really doesn't know who he is. Everything he does or says is just what he thinks a New York billionaire should do or sound like. \n\nIt's kind of depressing to think about. ", "From what I've heard the real upper crust people absolutely HATE him for being so tacky.  Those people have fortunes from like the 1700s and you are only supposed to be in the paper three times, bred, wed and dead.  ", "I bet Trump wishes he was on Twitter right now.  \n&gt;*Glenn Beck is a loser and his survival kits are terrible!*", "Republican areas didn't have lines. Probably because they had more polling stations. I read somewhere that a county in Ohio with 800000 registered voters had one polling place and 4,000 people in line; but a different county had 140,000 registered voters and 5 polling places", "Beck has gone through this bizarre reformation.\n\nI think he actually realizes that he paved the way for Trump and he feels legitimately bad about it.", "How DARE people vote OUTSIDE OF BUSINESS HOURS!", "The GOP benefits from low voter turnout. Those who have to sacrifice something (a non-trivial quantity of time and/or energy and/or money) to take the time to vote and thus have to decide whether they'll vote, tend to vote democratic, so making the decision less balanced (i.e. weighting the \"don't vote\" side of the decision) is in their best interest. The GOP don't want every American voting. They want their base voting. ", "http://i.imgur.com/M9aNjO5.png", "My mother is one of them. She smiles and nods when Dad goes on his rants she didn't complain when Dad put up a Trump sign, but when I asked, she was quite proud to say she was NOT voting for Trump. I don't think Dad has even asked her what she thinks, just assumes she agrees.", "Extremely wealthy white male nothing he says or does are in my best interests either.", "Much to my surprise I've even formed a slight grudging respect for Glenn Beck.", "There was an election related incident at my kids school just last week.\nMost of the kids are pretty chill but there are a handful of kids that walk around parroting their parents \"views\" on politics. \n\nAnyways, this little group of assholes decided it would be hilarious to beat up the one Somali kid. While one of them had him pinned to the ground the others spit in his face, they were also telling him all about how he was \"going to be deported.\" \n\nThankfully one of the monitors broke up the fight. Everyone got a note from the teachers asking that they please talk to their kids and explain why this wasn't ok. \n\nThis shit is real.", "John Mulaney was on one of the late-night talk shows (I forget which one I think Fallon or Conan) and said pretty much exactly this. That Trump is what a hobo living under a bridge thinks a billionaire looks and acts like.", "So how about this.  Stay with me.  Its a long con by Kushners to get to Trumps buildings for the real estate.  It would be some epic Montague-Capulet style shit but...Jared marries Ivanka.  No big deal. She's hot smart, seems cool and holds her own.\n\nNext Donald runs for president, giving the Kushners the express pass they didn't know they'd get to destroy Trump.  Jared becomes a senior advisor.  Gives all kind of terrible advice.  Trump loses and his brand is decimated.  \n\nKushner family steps in and \"saves\" Trump as a favor, thus getting his prime real estate locations.  Trump disappears and the Kushners now become ridiculously wealthy.", "**Tomorrow** the salt will flow............", "I mean I was a Republican all my life until last December when I bailed after Trump and Matt Bevin of Kentucky.  ", "&gt;*Editor’s note: Donald Trump regularly incites political violence and is a serial liar rampant xenophobe, racist, misogynist and birther who has repeatedly pledged to ban all Muslims — 1.6 billion members of an entire religion — from entering the U.S.*\n\nNot that I disagree with it, but that's one hell of an editor's note. ", "[Trump? Tacky?](https://67.media.tumblr.com/8ec2f7ce5c6af1aa19ec5308199902e4/tumblr_inline_o1nbskIiEs1qz4eqq_1280.jpg)\n\nNever heard of such a thing...", "Voter fraud voter intimidation and voter disenfranchisement. It's the only way Trump can win and his supporters know it.", "I live in Tennessee and they kept ours open super late during the primaries. Not a lot of fucking democrats here...", "I'd like to point out these people literally got busted for racial voter suppression and nothing was done to them.\n\n\n&gt;&gt; The federal court in Richmond found that the primary purpose of North Carolina's wasn't to stop voter fraud but rather to disenfranchise minority voters. The judges found that the provisions \"target African Americans with almost surgical precision.\"\n\n&gt;&gt; In particular, the court found that North Carolina lawmakers requested data on racial differences in voting behaviors in the state. \"This data showed that African Americans disproportionately lacked the most common kind of photo ID, those issued by the Department of Motor Vehicles (DMV),\" the judges wrote.\n\n&gt;&gt; So the legislators made it so that the only acceptable forms of voter identification were the ones disproportionately used by white people. \"With race data in hand, the legislature amended the bill to exclude many of the alternative photo IDs used by African Americans,\" the judges wrote. \"The bill retained only the kinds of IDs that white North Carolinians were more likely to possess.\"\n\n&gt;&gt; The data also showed that black voters were more likely to make use of early voting — particularly the first seven days out of North Carolina's 17-day voting period. So lawmakers eliminated these seven days of voting. \"After receipt of this racial data, the General Assembly amended the bill to eliminate the first week of early voting, shortening the total early voting period from seventeen to ten days,\" the court found.\n\n&gt;&gt; **Most strikingly, the judges point to a \"smoking gun\" in North Carolina's justification for the law, proving discriminatory intent. The state argued in court that \"counties with Sunday voting in 2014 were disproportionately black\" and \"disproportionately Democratic,\" and said it did away with Sunday voting as a result.**\n\n&gt;&gt; **\"Thus, in what comes as close to a smoking gun as we are likely to see in modern times, the State’s very justification for a challenged statute hinges explicitly on race — specifically its concern that African Americans, who had overwhelmingly voted for Democrats, had too much access to the franchise,\" the judges write in their decision.**\n\nThey literally admitted to it.", "\"Just an election\" \n\nTell that to drug users in the Philippines.  Tell it to all the Brits who didn't want to leave the EU.  Tell it to Germans circa 1933.", "You said the same shit about Obama. \"He'll take away our guns!\" you cried. He didn't. \n\n\"He's wasn't even born in the USA he'll peddle African ideas!\" you bawled. He proved to be more American than the blathering right. \n\n\"He's a commie Nazi!\" you whined. Turns out he's a level-headed guy with a sense of humor, quite aware of the restrictions of the bully pulpit. \n\n\"He's Satan incarnate!\" you bleated. Turns out he's just a good guy.\n\nForgive us if we don't buy your bullshit this time around.", "Was it in the shape of an elephant?", "She said she was writing in her mom unless it was a close election.\n\nAs Florida is close she won't take the chance.", "Ill vote for Baron; he's the only Trump kid that understands the importance of cyber security. ", "and the alt-right are eating it up", "Dude my Facebook is a Trumpland cesspit. I have otherwise reasonable family members posting stuff about how if Hillary is elected she will legalize the sale of children and make Christianity illegal. These are full-grown adults posting this nonsense.", "Its been on every article coming out of the huffinton post for the past 18 months...", "One of these is not like the others...", "Those schools should remind the kids of how [un-American that is.](https://pbs.twimg.com/media/CW-xBNbUwAAOJsl.jpg)", "She is. Anyone who's seen the powerful PBS documentary about the two candidates knows what she went through from being a highly progressive college fighter, to accepting what her husband had done to her ... and yet still choosing to remain with him, even donning the armor of a conservative woman.\n\nShe's not a gifted orator like Obama, but there is a lot there that, once given the chance, will inspire people. Not to mention, she has a wealth of experience and has certainly developed some clear insights into the system and how to make it work better.\n\nTrump tears things down. She wants to fix things and make them better. The difference could not be more stark.", "why are always people shocked by this as it's some sort of travesty of the system? THIS IS LITERALLY THE POINT OF THE SENATE. Every state gets an equal vote in the upper house. California makes up an 8th of the House of Representatives like it was designed to but that never gets brought up in the MUH SENATE circlejerk\n\nTalking about population gradients is ridiculous. Even if California had a population of every person in the US minus 147 people and those 147 people were each distributed amongst the remaining states, they would STILL get two senators because as I mentioned, THAT IS THE WHOLE POINT. Without the Senate being structured this way, the least populous states get railroaded into oblivion. Yes, each citizen in Wyoming technically has more of a voice in the Senate than someone in California, but that's literally assigning points and math to something that was not designed and intended for such a purpose. ", "Oh look average Trump voter. \n\nEdit: Lol that complete idiot missed the point of The Boondocks in the worst possible way\n", "There's something just a little bit odd about trying to prevent millions of people from voting to prevent a couple of dozen people from trying to potentially vote twice.", "Hillary's closing ad: America is great but we need to work together to secure and advance all the progress we've made. \n\nTrump's closing ad: THE JEWS DID THIS", "You know it's bad when Glenn Beck says you're crazy ", "Idk about that Mark Cuban clearly supports Hillary 100%", "What happened to him? Did he go on medication or something?", "Are we on Earth 2 by any chance?", "For those who argue that Trump wouldn't be a disaster because a President can only control so much here's your perfect example of how harmful he can be even *without* winning.", "White males too. Not all of us are innately unreasonable.", "I can't fucking believe this is the most damning part of the 2012 election. ", "damn that was actually pretty savage of her. ", "From the article she said FL is close and she remembers 2000. She felt she had to do it.", "Oh absolutely. Her husband is no doubt the wealthier one in that marriage. Kushner is a *huge* name in the industry.", "Which just goes to show what a god awful person Trump is that he is having to bite a bullet ", "Binders. So many binders.", "Just encase any Trumpets want to argue that his is the first time he has had a comic that is just a political endorsement without any jokes or whatnot: http://xkcd.com/1005/", "&gt;She told Iowa Public Radio she was worried that her first ballot would be changed to a vote for Clinton.\n\n&gt;“I wasn’t planning on doing it twice; it was a spur-of-the-moment [decision]” she said. “The polls are rigged.”\n\noh, the polls. lets not even get started about the damn polls. but rigging the voting machines is a completely different thing. In simplifying everything to the point of nonsense (oh, sorry, I mean \"truth-telling\"), Trump has left his base uneducated and uninterested  in facts- including basic facts like how to vote and what polls are, and what is election fraud and what is not. ", "You can be critical of someone and still vastly prefer them to the other.\n\nI'm not going to let Trump win if I can help it. It took me a while to understand just how much more dangerous he is but the 2nd amendment solutions statement brought me over to vote for her, and damn, he's done everything in his power to ensure me voting for her.", "I'm actually surprised by this.  She had said she was writing in her mom.  ", "this video could earn him a trump cabinet appointment", "There's a woman with integrity.", "or pivoting for the demographic shift he senses. the man is in business of selling things after all.", "&gt; They kept a poll open ‘til 10 o'clock at night so a certain group could vote. You feel free right now?\n\nYes. That is exactly what freedom looks like. People being free to cast their votes in an election. How the fuck can someone ask this question and expect a response in the negative to it? How is hell is allowing more people to vote **not** freedom?", "No but ever since we split with the Berenstein Universe, things have gotten kooky.", "&gt;“This guy is dangerously unhinged” Beck told the New Yorker. “And, for all the things people have said about me over the years, I should be able to spot Dangerously Unhinged.”\n\nGlenn Beck deserves a tiny bit of credit for that quote. But just a tiny bit.", "&gt;Yes the same Trump who avoided the draft at least four times because of a foot spur. *He doesn't remember on which foot*.\n\nClearly the one permanently lodged in his mouth.", "You know how wasps and yellow jackets get more aggressive in the fall because winter is coming and they are growing desperate and fearful of not surviving?  For the GOP winter is coming.", "I fail to see how anyone thinks it's OK to make voting this hard for any legitimate voter.", "you are right barron really gets the cyber. he is so good with these computers, it's unbelievable.", "Man from her tweets for the last year, I would have had no idea...", "It is definitely not a small amount of women.", "When the constitution was written I'm not sure anyone imagined the population gradient that would exist among states.  If LA County were a state it would be the 8th largest state in the US.  If Orange County CA were a state it would be the 30th largest State. San Diego County would be 29th.  But all of these places are in Calfornia, so together they all only get 2 senators while Wyoming (with it's population of 500,000, 5% of LA County) also gets 2 senators. ", "Totally agree. I should state I am a white male. The only interests Trump is worried about are his own and his kids. ", "It was more likely Marla as she is the one possible source who could legally provide the returns validating the NYT statement about legally obtaining them.", "Well played. You've earned this.", "She's not going to get primaried.  She'll likely be a two term president she polls well when she's not campaigning.  She might lose  the general in 2020, but barring something actually illegal being proven she won't be primaried.  ", "&gt;My favorite from this morning: he posted that Comey's FBi is a joke and a stain on the legacy of Hoover.\n\nTheir attitude/approach to Comey is just amazing and worrying.  It really illustrates what a binary view on the election they have:  Either someone is a Trump supporter, or they're part of the evil conspiracy.  *There is no in-between.*  And it's been so clearly shown with how Comey has come and gone from their good graces repeatedly.\n\nThat sort of attitude is dangerous for all sorts of reasons.", "It was just about the nicest thing she could say without actually complimenting him.", "That's how they talk in that sub *all the time.*", "We need Ana's Greatest Hits compilation on CNN panels. Starting with the one where Scottie asks her to stop say pussy because Scottie's daughter might be watching. LOL. ", "Pretty sure it was a crayon that he shoved up his nose when he was a kid ", "GOP in 2013: we need to do better with Hispanics.\n\nGOP in 2016: 14%", "Hahahaha that Polish guy - \"I don't like his comic so he must be a PAID SHILL!!\"", "Regardless of who you support this is unacceptable and disgusting. Specifically designing voting methods and cutting locations and hours in such a way to deliberately harm one demographic is inexcusable and it is not what this country is supposed to be about. You can't \"make America great\" if you are deliberately undermining our democracy.", "That's just such a myopic voter perspective. He's going to have more influence on legislation than Hillary if we elect Hillary with a democratic majority in the senate. He's going to be empowered by electing Hillary. Either way this election has been a way for Sanders to have a louder voice. People bitching and moaning about him not being president are cutting off their nose to spite their face.", "Bernie has now failed the Bernie purity test.\n\nRemember it was never about the person it was about the issues.\n\n*Well what about this person who's almost completely aligned on his major issues*\n\nWell no I don't like that person.", "From the article Mecklenburg county dropped down to only 4 early voting locations. \n\nFor comparison's sake, a trip to the DMV to get a state issued license in Mecklenburg County can take upwards of 4-6 hours, easily. People take days off work to get this done. When I switched my out of state license to a NC license in 2010, they stopped taking new customers in the line at noon because *they wouldn't get to those people within that business day.*\n\nThere are 8 DMV locations in Mecklenburg County.\n\nThis is asinine. I've lived there. Only 4 open locations would be a nightmare.", "&gt; Eventually you have to get stricter with your suppression efforts and eventually you hit that point where the Supreme Court steps in and mandates federal oversight.\n\nHence why the GOP is refusing to fill Scalia's seat and leaving the Supreme Court at a 4-4 split.", "Why does the GOP hate democracy?", "I don't get it. Look at the race. Trump has an actual chance to win and people are still resisting the reality and gravity of the situation.\n\nI was a big Bernie supporter -- both my wife and I were max donors to his campaign. I'm not excited to vote for Clinton but I won't hesitate for a second when I do.", "Because their policies are regressive. They have no future. They're dinosaurs rapidly approach an extinction-level event and they know it.", "Good people of North Carolina. Please go to the polls tomorrow and reject the Republican party. You can say a lot about the Dems but it seems only the GOP wants to curb voting rights.\n\nVOTE", "And bizarrely it's only happening in places where *those* people vote! You know, those places where we closed down most of the polling locations. For some reason the few that remain have to stay open late to serve everyone! It's all an evil plot by the democrats and not the most blindly obvious and bald-faced stupid revelation of our own actions having the exact consequences everyone predicted including us!\n\nSigh. I want off. Stop the ride.", "I don't agree with you.  I was furious after the primary and promised myself that I would vote third-party no matter what.  Up until recently I waffled back and forth about that promise, eventually breaking it when I voted for Clinton last week.  I've come to forgive myself for breaking that promise, given that I'm in Indiana - which has a small chance of swinging.", "I sort of grew up with Glenn Beck -- my family listened to him on WFLA before and after his show went national and I watched him develop into a Fox News pundit because my family exclusively watched FNC over the years when it got more and more biased, particularly after Obama was elected -- and I have to say, I've always had this begrudging respect for him, even as he severely and repeatedly embarrassed himself in front of the whole country.\n\nI need to point that out because, on some level, I'm not surprised he's come around on this.  I'm also not surprised he said that Obama has made him a better man.  I think, despite all the craziness, there's a nugget of seriousness and a desire for actual, non-biased truth that exists deep in his brain.  I wouldn't be surprised if, by the time he's an old man, he'd have developed himself into an actual intellectual (I know, I know, hence all this attempted validation) just based on the shear range of beliefs he's held, and the impression I've gotten from hearing his system of thought develop over years of following him.\n\nI guess what I'm trying to say is, the fact that he's brave enough now to piss off his bat-shit supporters by coming out for BLM, and acknowledging his ignorance of black culture to boot, validates those years of begrudging, inexplicable respect.\n\nEDIT:  If there's any response to this comment, I fully anticipate a backlash of people shitting on it, but again, I feel a need to voice an opinion from the weird perspective of having listened to him develop from an obscure, mostly comedic, and really funny, actually, radio show host, rife with anecdotes of substance abuse and personal tragedies, into what I might call a nationally prominent pseudo-intellectual, and finally a full-blown embarrassingly genuine proponent of world-wide conspiracies, and I think most people only know the last manifestation of Glenn Beck.  It's just not that surprising from this perspective, and I think the general feel of 2016 craziness is spilling over onto him.  If this were a really normal election, but heated with BLM protests and police shootings of unarmed people of color, I think he would still make the same move.", "I love how KellyAnne Conway and others tried to allege favoritism when really they just keep the polls open until everyone in line has voted.", "Exactly and I'm glad that I know exactly zero of these people irl. I and most of the people I know caucused for Bernie and they all voted Hillary. Anyone dumb enough to switch from Bernie to Trump isn't worth pandering to anyway.", "Who knew the Beyonce Jay Z concert would be so triggering for him. How many times in a row has a brought this up now at rallies?", "Bowie died the Cubs won the World Series, and Glenn fucking Beck is the voice of relative sanity. At this point I fully expect to see flying pigs before Christmas.", "http://1.bp.blogspot.com/-9qSfrEZI45Y/VFkXUVAkK4I/AAAAAAAAABw/t4xiWpZsuk0/s1600/Screen%2BShot%2B2014-11-03%2Bat%2B4.46.09%2BPM.png", "Nah I don't think there's any backlash to give here. I get it.\n\nI don't like Glenn at all, but I was surprised when he did [a segment on black history in the U.S and how our history books suppresses it.](https://www.youtube.com/watch?v=uCsBqbE-RZE)\n\n\nOn Fox News.\n\n\nDuring peak Glenn Beckness.\n\n\n\nGenerally speaking, Fox News is one of the least racially diverse news network on TV that caters to another least racially diverse audience. But Beck dropped a lot of knowledge a lot of us have known and read for years to a predominantly white, conservative audience without flinching. \n\nNow, Glenn Beck ain't woke and I still think dude is crazy. But I accept things aren't just black and white.", "He's a huckster looking for an angle and nothing more. He did everything to violate our trust for years.  I'm not so quick to forget the chaos he ruled over.", "A repost of my standard comment:\n\n[VOTE BY MAIL](https://en.wikipedia.org/wiki/Vote-by-mail_in_Oregon).  \n\nALL of this bullshit goes away.  Just goes away.  It really ought to be national.", "This has been going on a long time with heavily Democratic counties not having enough voting machines, and *lines as long as 12 hours* occur.  Ohio was the deciding state in 2004 between George W. Bush and John Kerry.  [Robert F. Kennedy Jr wrote a very comprehensive article](http://www.commondreams.org/views06/0601-34.htm) describing what went on in Ohio in 2004, and how the system was rigged in favor of Bush winning.\n\n", "This a thousand times over. I wish I could up vote this harder. The daily beast is a part of a part of the Clinton machine. Weather that's good or bad is up for discussion but it's not transparent.", "I genuinely think he just found Jesus.  And I mean like hippy sandal wearing \"Love Thy Neighbor\" Jesus, not Republican Jesus.\n\nAnd by that I mean he's finally found his moral compass, and surprisingly enough, it points north just like everyone else's, which is shocking to him because all this time he thought North was the *other* way.  He's seen the error of his ways.  I guess Trump was just too much for him to not sober up, and like Dr. Frankenstein, look upon his creation horrified and ask God \"What have I done?\"", "I know one person that went Bernie -&gt; Johnson. Says he can't stomach voting Hillary. Asking him how Johnson's ideals align with Bernies or what Hillary's done to be intolerable just goes nowhere. His stance isn't a logical one; it's an emotional one.", "But a lot of self proclaimed Bernie supporters from The_Donald told me to write his name in. They seem more credible than Bernie himself. ", "https://www.washingtonpost.com/news/post-politics/wp/2016/08/15/glenn-beck-urges-conservatives-to-understand-black-lives-matter/\n\n&gt;\"All of us are sitting around a table and we're all friends,\" he said. \"It's time for dessert, and everybody gets pie except for me and you. And you say, 'I didn't get any pie.' Everybody at the table looks at you and says 'I know. All pie matters.' You say, 'but I don't have any pie! What about my pie?'\"\n\nHe totally gets it too.", "Quick is it Berenstain Bears, or  Berenstein Bears?", "A bunch of states don't even consider write-ins. It's just a futile gesture in place of doing something with a practical benefit to liberal causes.", "[Come back mop bucket!](http://imgur.com/dVWDWEg)\n\n*Edit:\nI wanted to add color but [here's the old one too](http://imgur.com/Dngsc3A)", "Donald Trump REALLY hates black people.", "Yeah but thanks to their inaction on climate change we'll be following them in a global extinction event...", "\"Hillary is in the pockets of Goldman Sachs!\"\n\n(Meanwhile Trump literally wants to appoint a Goldman Sachs banker as secretary of the Treasury)", "Now keep in mind one of the main reasons why Hitler gained power was because Germany's economy was in shambles. Could you imagine if our economy was doing a little bit worse? There would be a strong possibility he'd be elected and its outrageous that the contest is still close. Shame on the fools who cast a vote for Orange Hitler.", "And I'm concerned with the message I'd send the DNC if I vindicated their shady tactics during the primary corrupting our democracy. Someone needs to dissent to send a message it wasn't right.", "My mother-in-law is definitely not. She will blatantly call her husband an idiot for supporting Trump and voting against his own interests.\n\nEDIT: He has come around and is now voting for Hillary.", "As much as I may disagree with his policies I also gained newfound respect for Mitt Romney.\n\nHe never supported Trump, not even for a second, and worked incredibly hard behind the scenes to try and dump him. Even when he was heavily pressured by the RNC to give tacit support, he outright refused.", "Yup. If Hillary doesn't make every progressive dream come true it's her fault and 'we told you so'\n\nAnd if she does accomplish anything for progressives it's not because she's been pretty liberal her whole life it's because people shitposting on Reddit pushed her!", "&gt;Our founding fathers set up a government of checks and balances. We can and have survived presidents with bad judgment. But I fear the effects on America of a president with bad character.\n\n&gt;I worry that Trump brings out the worst in America. Division. Hostility. Racism. Bigotry. Misogyny. Things we used to hide. Feelings we used to try to overcome. **Under the guise of not cowing to political correctness some people are no longer embarrassed or ashamed to show the warts on their souls.**\n\nPretty good summation of why this election has really, really damaged my faith in people. I had more of it than I realised, and I miss it.", "TBF he was never on the Trump train. \n\nThat said he was a big Cruz guy so was supporting a candidate that would be just as big of a disaster if elected.", "\"The tweets that claim to be “paid for by Hillary For President” could also be in violation of Federal Election Commission law.\"\n\nOh boy oh boy! ", "Here's my simple reasoning:\n\nI'm in CA my vote has 0% impact on who will be elected President in 2016, and so I have no opportunity of harming Hillary's chances as a CA voter.\n\nWhat I do have is the duty to vote my conscience, and that means I wrote in Mr. Sanders as my choice.  I will not add my vote to the mandate that both the DNC and Ms. Clinton are getting from those fearful of Trump.  I have no fear that my vote will cause Trump to win, so I can simply cast my vote with my convictions for who I'd prefer to lead the country.\n\nMy view is that both parties have [betrayed this country](http://YouTu.be/fV1Afh-g42M) in the service of Corporate Interests (the DNC only slightly less so than the GOP) so I will **not** be falling in line behind the DNC's forced choice in this horrifying puppet show.  My vote is to clearly call that out as a protest against the DNC.\n\nNow, I will fully admit, if I were in a battleground state, or even a red state, I'd be holding my nose as Mr. Sanders is responsibly indicating voters should.  \n\nBut I am not, so I will not.", "There is no point. Trump thinks this is what a rich person's living room looks like so this is what his living room looks like. He really doesn't seem to have any personal preferences or likes whatsoever. He's a living stereotype. ", "Can't convince them to vote for you then don't let them vote. #GOPLogic", "And likely people can't afford to take the day. Also why can't we just have an ID now done via app and a selfie. State can verify and mail the ID to you. ", "yeah this quote is pretty mind boggling.  In his ideal world does \"freedom\" mean less participation from the public in democracy?  I think I understand what he really means:\n\n\"evil liberals want to take away your freedom by forcing you to have abortions and get gay married and denounce Jesus Christ and take your jobs...so by letting more of them vote we are taking away your freedom because then they might win, which isn't fair because we want to win\"\n\nI really hate 2016", "No no he doesn't hate black *people*. He hates black *culture*.\n\nSee, it's not racist. He doesn't hate them because of their race, just everything *about* them.\n\n/s", "Every election we hear Republicans bragging about rigging the election against the party of minorities. I don't understand how they keep getting away with it.", "Everyone seems to be falling in line and selling out their own beliefs in fear of Ronald McDonald. \n\nIt's sickening how the leaders of the DNC got to pick the US president years ago and everyone is letting it happen.", "I'm expect all the dolphins to leave any minute now.", "&gt;gay programming seminars.\n\nso a bunch of people get together and churn out FABULOUS code?\n\n", "What next Ted Nugent endorsing PETA?", "&gt; please talk to their kids and explain why this wasn't ok.\n\nThe problem is the parents of these children probably don't know why this isn't ok. I would not have said this in the 2012 election, but I am starting to believe that extremist views are \"normal\" now.", "And they certainly don't have an ulterior motive. I think we can trust these guys.", "That long term Big Tent^^TM  GOP outreach continues to go great!", "It's a sad day for the Republican Party when having common sense makes people think you must be a liberal", "\"Congratulate your friend on his 5 year work anniversary as a fry cook!\" ", "Paul Ryan said Donald Trump is \"The textbook definition of racism\".  Yet he voted for and endorses Donald J. Trump. So obviously he has no problem with racism or at least doesn't consider racism a disqualifying factor.\n\nLet's make sure they don't forget that.", "There's nothing odd about it.   Jim Crow was justified as defending the security of elections too.", "They know a thing or two about dangerous fascists ", "Southern white male voting for Hillary here. Yup we exist.", "I'd still be concerned about the message not stomping down a Trump-style candidate has on future nominations. At this point I basically consider it a moral imperative -- something that I couldn't have fathomed a year ago.", "If Republicans win the senate once again the message from the American electorate will be \"fuck all the minorities but as principled people we draw the line at sexual assault\"", "I supported and listened and agreed with Bernie on almost every issue. He was a genuine man with an outstanding vision for the future. He was one of the only candidates to be real about climate change and would help to end corruption and greed in the political process. But once he supported Hillary Clinton I decided all of that good will he built with me over the course of a year was completely ruined. He betrayed me, and now I stand at the precipice of sacrificing my political principles for a woman that I abhor. I'm so ashamed of Bernie Sanders.\n\nTherefore, I'm writing in....his name?\n\nedit: just because I feel like I've missed my intended audience: this was *sarcasm*. I thought the last sentence ending in a question mark gave it away :/ sorry", "The man who brought you [this book](https://www.amazon.com/Agenda-21-Glenn-Beck/dp/1476716692/ref=asap_bc?ie=UTF8) is now the voice of reason.", "&gt; \"certain groups\"\n\nBackstreet Boys for example.", "Another driver almost hit my mom so she did a small beep at him.\n\nHe followed her and got out of his car and started walking towards her.  She told him to stay away he yelled something like 'Fuck you, when Trump is president he'll send you back to where you came from!'.  We're hispanic.", "It's both.\nhttp://www.thedailybeast.com/articles/2016/11/07/north-carolina-s-racist-voter-suppression-is-working.html", "GOP loves democracy when its in their favor.\n\nIts vile when democracy is NOT in their favor.", "All these conservatives trying to regain esteem by hopping off the Trump train are ghouls every bit as bad as he is.", "Indeed. A strange time when I have to up vote Glenn Beck.\n\nWill there be a time when we upvote Sean Hannity? Probably not. Too far gone.", "\"The Clinton Foundation is crooked!\"\n\nTrump's foundation is under investigation as we speak.", "I've said the same too, in my personal life to others.\n\nAnd, if we want to assume she's truly just a self-interested and self-aggrandizing woman... we still have every reason to believe she's going to try and ace this President thing.\n\nHistory remembers our Presidents well.  Very well.  And for generations after they're done, pop culture still remembers the flavor of them--warranted or not.  Bill Clinton is still the New Democrat and \"Cool Bill\" of the moderately successful 90's.  George W. still gets seen as the cowboy who f'd up our foreign policy.  Carter still seen as a well intentioned failure.  Reagan still as our shining grandpa.  Oh, there's always groups that want to fight those images or don't buy into them, but look at how our leaders are enshrined and parodied and imitated... that's \"legacy\".\n\nClinton owns being the first woman President.  Being the last Clinton President.  Being the only spouse of a President.  She carries the qualification of any future Secretary of State to the office (a SoS twenty years from now has to compete with being compared to her either positively or negatively, if they want to be President).  If she doesn't do well... and do VERY well... she runs the risk of going down in history as a national mistake (Bush) or disappointment (Carter) and sets back a lot of people... women, particularly.\n\nShe has to do the job better than the average Joe.  And that means she's got to produce Results (employment, income, winning military conflicts, etc.) and Praise (favorability, general contentment in the population).  Not one or the other.\n\nI think she's going to go for not just First Woman President, but set the tone of it as \"And was one of the best\" (based on Results and Praise).  That's her goal.  Anything less is more or less just hype and hype and hype and then a mediocre movie--which gets labeled \"crap\" because of all the hype.  I believe she wants to be the left-wing Reagan.  Shining City.  The center-liberal Thatcher.  She wants to be famous.  For generations.  She wants a whole dimension of American political theory to be \"Clintonian\" and mean her and not Bill.\n\nAnd selfish ego, if nothing else, for that will drive her to go hardcore on this shit.", "The old rich know that when the peasants finally revolt and kill all the rich people they know not being in the papers/on television is going to be advantageous.", "The removal of sunday voting is total bullshit. Being proud of what they have done to a community of people is bullshit. Really this whole election cycle has been bullshit.", "&gt; Donald J. Trump is calling for a total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what the hell is going on. \n\nDirect quote referring to himself in the third person included.", "I don't understand how Hillary or Trump could be the next POTUS since Obama is 100% definitely going to declare Marshal Law cancel the election, and serve a third term, all the while literally coming to the houses of every American taking their guns.", "I wouldn't give Clinton my vote if she personally begged for it.\nI will never vote for the candidate who colluded with the DNC to cheat in the debates and steal the primary from Sanders. He was our candidate. Bernie supporters who plan on voting for Hillary should be ashamed of themselves. I would rather give the Presidency to Trump than reward Clinton and the DNC for what they have done.\nClinton is Bernie's antithesis. Do you think Clinton will wage war against the corporate leaders of Wall Street for us? She will be grabbing so many briefcases under the table it would make Nixon blush.", "Wouldn't have happened if the Nazis hadn't won around 40% of the vote in the elections first though.", "What's the point of a room like that? Like honestly it hurts my eyes just looking at it.", "Ignoring the plight of minorities is an American tradition.", "Wife -  \"Come on let's go, I'll suck your dick at home and make life better\"\n\nTrump supporter - \"Woman shut the fuck up, can't you see I'm yelling?\"\n\nBlack dude in car thinking - \"Yeah video taping this just in case I get shot\"\n\nTrump supporter - I'ma turn my  hat around cause I'm hard! Also flash my muscles!\n\n\nI kinda hope this goes viral and this asshole loses any job potential.", "Huh. Eddie Vedder must have been wrong. You just have to know where to look.", "Well technically it's wrong because the United states didn't really exist until much later. \n\nNow if he said the first European language in The Americas he would be right.  ", "Yes. The type of person I am is the type of person who has no room in my life for someone who would defend hatred under the guise of Christianity. ", "&gt; His support for BLM\n\nYou're shitting me", "Seriously.  I can't stand all this \"Oh yeah good on him, glad he's seen reason.\"\n\nFuck that.  He deliberately constructed this for his own personal financial gain, and now that it's getting hot over there he just wants off the boat.  And *now* he wants some kind of recognition for being such a big guy.  He made this shit, he can sit in it.", "They don't hate them. They just don't think they are reasonable enough to vote. /s", "I don't know if people ever really listened to him to begin with.  He was never the type to support a Trump but his conversion to Mormonism was a big change for him, if you are asking.  His support for BLM is right up his core beliefs even before the conversion", "Jokes on you I know exactly who he was, when he was born, his early life, his career, and his... oh fuck wait he's not real nvm.", "'o shit trump is president time to start drinking'\n\n'woooo yeah, Hillary won, time to start drinking'", "I got one just the other day. It felt like seeing Springsteen play Born to Run. \n\n\"Oh shit the Trumpettes are breaking out the greatest hits!\"", "David Fahrenthold of the Washington Post has called over 450 charities looking for proof of donations and has found 1 &lt;$10000 donation that may be a bookkeeping error.\n\nhttps://twitter.com/Fahrenthold/status/795699667287818240", "False. The United States didn't exist at the time.", "It's a really useful room in Luigi's Mansion if I remember correctly. Tons of money chests in there", "Coincidentally Macedonia is where Donald's future wife was just born.", "Really comes down to where you live. If it's a \"safe state\" you can give Hillary and the DNC the finger with no worry about swinging the election.", "Actually she's advocating for \"a diplomatic strategy aimed at resolving Syria’s civil war\"\n\nWhich is what the world has been trying to do while also minimize the amount of his own people Assad kills.", "Reagan closed out his term with a scandal of selling advanced weaponry to Iran in order to fund right wing death squads in central America. \n\nI guess Republicans were just mad at Obama for making the Iran deal because it didn't include the US funding death squads anywhere. ", "Republicans were promised an Obama apocalypse that never happened.\n\nHe was suppose to:\n\n* Take away all your guns.\n* Create \"death panels\" for your grandparents\n* Put conservatives in FEMA camps.\n* Make Islam the official religion of the U.S.\n* Establish Sharia Law\n* Turn the U.S. into a socialist country\n* Declare martial law to cancel all elections.\n* Take over Texas. Yes really...\n\nTurns out they were wrong about literally everything. But I'm expected to believe them that Hillary worships Satan and is some kind of super criminal international mob boss that has people killed left and right.\n\n\n\n", "At the end of his term Reagan had left an S&amp;L scandal the Iran Contra scandal, 200 dead Marines in Lebanon unavenged, a failed SDI program, and other 'minor' scandals like South American Death Squads killing nuns and ignoring the AIDS crisis.\n\n", "One of the oddest strategic moves of this election was at the end of the last debate when in his closing remarks, Trump told Americans that if they wanted another four years of Obama, they should vote for Clinton.  Yes, please.", "my 2c history will look back very fondly on Obama.", "&gt; I guess Republicans were just mad at Obama for\n\nbeing black.\n\nFTFY\n", "Good maybe we can rename all the airports and whatnot after Obama. ", "It's because the brave Republican Congress stopped him!", "Trump supporters are hopelessly ignorant to irony.  Claim the election is rigged rigs election.  Too much.", "In light of Trump history is taking a more sympathetic look at the Dubya", "This is the thing that I can never understand. The GOP has turned him into some sort of mythical demi-god but he, uh, wasn't a good president?", "We should name them all after him. \n\nI'm flying the red eye from Obama to Obama with layover at Obama.", "Well that's it I guess. I'm going home, hugging my gf and watching the end of the world. I wonder if there will be live streams of frozen hell, or If i'll just have to wait til I get there to see it.", "They called him the 'Teflon President.'\n\nNo matter how many scandals there were he always stayed popular.\n\nAlso, the GOP had a huge interest in creating a mythic figure to rally around.  The Dems had FDR and Kennedy as secular saints and the GOPs wanted in on the action.", "Um don't you remember when he instituted Islamic Socialism and took all our guns in the massive forced simultaneous gay marriage and abortion ceremony?", "People like the idea of voting for who they want to be president", "My God this thread is ridiculous. Everyone can vote for whoever they want to for their own reasons without literally being the devil.\n\nAnyone who thinks Trump is a good alternative to Bernie is a fool.\n\nAnyone who thinks Hillary is a like-for-like for Bernie is a blind fool.\n\nThis is a *DEMOCRACY* everyone has a right to an opinion without being harassed or harried, no matter what that opinion is.\n\nI'm not voting for Hillary or Trump, anyone who can do so on good reason is either lying to themselves or playing the \"I'M NOT VOTING FOR X, I'M VOTING AGAINST X!!\" Neither should be up there and everyone knows it.\n\nI haven't decided what I'm personally going to do yet, but it'll either be a vote for Jill Stein or writing Bernie in.", "At the very least for failing to produce any of the scandals or crises that they blamed him for before he had even taken office.", "Don't forget that he raised taxes 11 times and created trickle down economics. ", "I also like the idea of not voting for a corrupt politician. ", "I don't really understand why they don't point to Eisenhower. I think he's viewed from both sides of the aisle as a good president but one that didn't make a ton of noise. Just too boring, I guess?", "I almost had an aneurysm when I turned to Fox news around the time of the \"hostage scandal\" and Sean Hannity had Ollie North on his show being sanctimonious about Obama delivering the unfrozen assets that belonged to Iran back to them calling it a \"ransom\". \n\nReally just watching that moment probably permanently raised my blood pressure.", "conservative who was for bush mccain, romney.\n\ni would gladly vote for obama 3rd term", "Barry will have so much clout and he's only 55 I expect him to campaign for Democrats for at least the next 4 election cycles.", "You're telling me that a Kenyan Muslim space lizard is viewed more positively than Ronald \"The second coming\" Reagan?", "&gt;“Look if African Americans voted overwhelmingly Republican, they would have kept early voting right where it was,” Wrenn said. “It wasn’t about discriminating against African Americans. They just ended up in the middle of it because they vote Democrat.”", "&gt; Reagan closed out his term with a scandal of selling advanced weaponry to Iran in order to fund right wing death squads in central America. \n\nThis. In fact George H.W. Bush ended up getting screwed over in 1992 as [Caspar Weinberger was indicted just 4 days before the election](https://en.wikipedia.org/wiki/Caspar_Weinberger#Iran.E2.80.93Contra_affair). The case was thrown out just 5 weeks later, but certainly, the damage was done. Reagan actually was a liability to Bush in 1992 due to the Contra affair.", "Hey when you're committing the crime you can be pretty confident about the existence of criminals.", "Voter IDs are just a tool to restrict voting rights. There is no reason every citizen with a SS# shouldn't be automatically registered to vote at age 18.", "A project veritas (/barf) person just wore a niqab and tried to vote as Huma Abedin.  They appear to have given her a provisional/affidavit ballot.  Which is pretty much SOP for people not on the voter list.  Sounds like voter fraud by PV to me though.\n\nEdit: [link](https://np.reddit.com/r/politics/comments/5bogyq/undercover_journalist_in_full_burka_is_offered/)", "My understanding is that Obama has all that stuff in the works and Hillary is going to finish it off", "This is sick this is wrong, and this shows just how badly the Supreme Court fucked over their country when they decided to gut the Voting Rights Act. This is reprehensible and hopefully with Clinton in the White House and either Garland or her nominee on the bench that decision can be challenged.", "[93% of Bernie supporters have already voted or have a plan to vote so I don't know why you're conflating them with non-voters.](https://today.yougov.com/news/2016/11/02/yougoveconomist-poll-october-30-november-1-2016/)\n\n(Click the detailed PDF at the bottom of the page)", "He would be called a cukc and a globalist.", "Perhaps but he'll always be tied to Cheney. I can't really envision a future where Cheney is viewed fondly.", "&gt; Well what about this person who's almost completely aligned on his major issues\n\nLook I voted for Hillary, but I don't think this take is quite accurate. \n\nBernie has a lot of progressive stances that Hillary doesn't support,  like single-payer healthcare, tuition-free public 4-year college, a financial trade tax, reinstating Glass-Steagall (and no, I'm not saying the repeal of Glass-Steagall single-handedly caused the Great Recession), a less interventionist approach to the Middle East (a no-fly zone and safe zones aren't as benign as they sound), just to name a few. \n\nWhen Trump is the other option, Hillary is an easy vote for me. But there's still a pretty big difference between Hillary and Bernie's platforms. ", "Shhh RBG! In case the election ends in a ~~tie~~ contested election and goes to the Supreme Court for the decision, we need to to appear impartial enough that Trump and the GOP can't demand that you recuse yourself from the decision!", "Ronald Reagan would've been knocked out before Iowa if he tried to run for the GOP nomination this year.", "the alt-right has been waiting for the silent majority to show their faces but it wasn't who they thought it was going to be", "\"Don't listen to me if I ever tell you who to vote for\" - Bernie Sanders.  ", "And deservedly so. Ronald Reagan is completely unworthy of his lionized reputation. He was in fact one of the worst presidents this country has ever had.", "Man I'm one of the \"GWB should be in jail\" people but that is a ridiculous use of that quote. \n\nFull quote: \"I told all four that there were going to be some times where we don't agree with each other. But that's OK. If this were a dictatorship it'd be a heck of a lot easier, just so long as I'm the dictator\"\n\nHis point: democracy is messy, the alternative only sounds great if you happen to be the one in charge.", "That same third probably couldn't tell you who Vladimir Lenin was if Their lives depended on it. ", "The Swift Boating of Kerry in 2004 was pretty nauseating.\n\nI do agree though that the elevation of a non-white and a non-male to the highest office have brought out the worst in white male traditionalist who feel like things are passing them by.", "Vote suppressors don't want it to go away.\n\nThere was an article about Oregon's vote by mail law on the local news.  Some election official from North Carolina was giving his \"expert\" opinion on why Oregon's method is flawed and ripe for fraud (it isn't).  Then when asked if he ever votes by mail laughed and said (paraphrased), \"all the time, its totally convenient\".", "The take over Texas one was that all the rage during those widespread US Army exercises? When everyone thought they were placing themselves to conquer the state. I member!", "GOP - the party of projections.", "Personally I'm going from Bernie to Johnson. But I live in Tennessee so I have that luxury. Non-interventionist policy, LGBT rights, Roe v Wade, drug decriminalization are all similar between the two.\n\nBut the biggest reason is trying to get that 5% unicorn for a third party. Worst case, nothing changes. Best case, Libertarians take over as the new GOP, which is a huge shift towards the left on social issues. Then you have something in the middle where it bleeds voters from the right and splits the conservative base for years to come.\n\n", "All with the sweet sweet side revenge of humiliating Chris Christie the prosecutor who locked up Kushner's dad.", "Lol what /r/politics have you been visiting? It's 90% pro-Hillary here... ", "&gt; it's about sending a message that his sort of campaign is unacceptable\n\nAnd I feel the same for her sort of campaign too.", "RINO Ronnie? Are you kidding me? This guy was so soft on immigration so soft! Soft. No real republican. No republican.", "I admit that I am irrationally upset and salty that the best performing public high school in Milwaukee is Ronald Wilson Reagan College Preparatory HS and the worst performing one is Barack Obama School of Career and Technical Education HS.", "I was promised fun with my fact :(", "Hmm. I could see an Obama airport in Chicago. Possibly Hawaii. ", "I actually was just talking with some friends last night about how volatile the elections have become in the last 3-4 elections. Our conclusion ultimately, was that the anger didn't *really* become prominent until 2008, the first election that had a non-white male nominee. Between an AA candidate (twice) and now a woman, the GOP sure does display their hostility far more than I ever recall w/ Gore or Kerry. \n\nNote: Sorry, as a 27 year old, I really don't personally remember the details of any election prior to 2000. I *do* remember the overall campaign of Clinton/Dole, but no details of it. I mean, I was only 7, give me a break. ", "I don't want to see Donald Trump or Hillary Clinton become president so I'm not going to vote for either of them and nothing will change this opinion.\n\nDon't tell me what the \"rational and responsible\" or the \"right\" thing to do is since that's just an opinion.\n\nThe true right thing to do here for *everyone* in this nation tomorrow is to go out and vote for the candidate which best represents you. ", "They changed it from \"too uppity\" after running it past some focus groups.", "I read here recently that polls are indicating that a greater percentage of Bernie voters will be voting for Hillary than there were Hillary supporters that voted for Obama.  Can anyone confirm that for me?\n\nEither way I'm sick of Bernie supporters being constantly scapegoated for Hillary's struggle to win support.  It's her fault she's unpopular.", "Especially since a voter registration card is an acceptable form of ID. ", "As he should be. Considering the candidates we have now I'm wishing he could just go for a third term. ", "But Obama is also viewed as the worse President since Lenin by a third of the country.", "it doesnt matter how easy you make unnecessary obstacles to voting you shouldn't be making obstacles in the first place. show me some numbers that demonstrate a legitimate problem and a solution that has the most minor side-effects and maybe we can talk, but it should be a real big fucking red flag that the only party that cares about this statistically insignificant \"fraud\" is also the only party to directly benefit from disenfranchising these specific demographics.\n\nvoter ID's are the modern-day [Literacy tests](https://en.wikipedia.org/wiki/Literacy_test) whose only purpose is to keep elections nice and white. Democrats want you to vote for them, Republicans don't want you to vote at all, and that should worry you", "&gt;You know those places where we closed down most of the polling locations\n\nYeah my area went from like 24 polling locations to 5 --- the lines were hours long for the primaries and then early voting only had one location within a 30 minute drive --- the line there was a few hours long each day I stopped by on my lunchbreak. \n\nI don't care who wins tomorrow --- can we all agree that voting should be easier than going to the DMV???", "Reagan was a shit President", "I loved Sanders and nothing would please me more then to vote for him if he was the nominee.\n\nBut anyone with half a brain can see that a Trump victory would literally set the progressive movement back decades.  It's insane to think that somehow Sanders and the left-wing of the democratic party wouldn't take the blame and \"liberal\" would go back to being a dirty word that gave us Trump.\n\nNot to mention three decades more of a conservative Supreme Court.", "Lenin B. Johnson wasn't it?\n\n\n\n\n/s", "Nor should they be able to vote.  They're not 'Nsync with the rest of society.", "Also Indiana and went through the same thing ultimately voted Clinton. Pence is on the ticket of her direct opponent, just ended up feeling like unless I voted directly against that I was helping them. And fuck them. ", "Also in Indiana where Trump will definitely win regardless, but yeah I've been back and forth between 3rd Party Pres / Dem down-ballot or just straight Dem ticket.\n\nWhere oh where does my conscience lie...", "&gt; Will there be a time when we upvote Sean Hannity?\n\nYou would know if you would just call him. Why won't anyone just call Sean Hannity?\n", "Dude you've been full on hating Bernie this entire election.", "&gt;Republicans were promised an Obama apocalypse that never happened.\n\n&gt;He was suppose to:\n\n&gt;* Take away all your guns.\n* Create \"death panels\" for your grandparents\n* Put conservatives in FEMA camps.\n* Make Islam the official religion of the U.S.\n* Establish Sharia Law\n* Turn the U.S. into a socialist country\n* Declare martial law to cancel all elections.\n* Take over Texas. Yes really...\n\n&gt;Turns out they were wrong about literally everything. But I'm expected to believe them that Hillary worships Satan and is some kind of super criminal international mob boss that has people killed left and right.\n\n\nSo as a remedial measure they elected Trump. /S\n", "Cruz was the only candidate in the field unequivocally worse than Trump.\n\nYeah Trump might accidentally bring about the apocalypse. But Cruz would be actively trying to make it happen.", "Yes. Yes and yes. \nCasual racism is rampant. It's almost expected. Speaking out causes me issues here in my area. Nothing violent but have had plenty of people yelling at me. ", "Con Don Jr. lies like his daddy.\n\n&gt;Image on Donald Trump Jr.'s controversial Skittles tweet deleted\n\nhttp://www.politico.com/story/2016/09/skittles-image-deleted-trump-jr-tweet-228830\n", "Don't believe the hype get out and vote to make it happen.", "Sure if you ignore the fact that there's evidence of systemic voter suppression and gerrymandering, and no real evidence for \"massive voter fraud\".", "Anyone who is against having polls open is against the right to vote. There's no reason polls have to or should follow \"normal hours\" considering most people work during the week anyways! They should be open as long and as frequently as possible.", "Most of my Mexican-American family that lives in the south are very conservative some are evangelicals the others have children in the Military. Judging by their facebook post they are defiantly voting for Clinton. The Republicans really fucked this up, older Hispanics are really socially conservative.", "Welcome. I left the party in the early 90s.", "So a Project Veritas \"reporter\" made a video of themselves committing voter fraud? Looks like more prison time for those clowns. ", "LOL. Fantastic? WTF!! I clearly remember you r/ZeOppositeOfProgress constantly posting Anti-Sanders crap through out the entire primaries....FANTASTIC? Nobody who studies Clintons history thinks she is fantastic. She is absolutely a horrendous corrupt no foresight having POS but Trump is actually worse. Fuck this rigged corrupt system..FANTASTIC??  LMAO..", "I wrote the damn facebanking guide in the sidebar of /r/sandersforpresident and I was excited to cast my ballot for Clinton last week in CO. Compared to Trump, she and her policies are a progressive powerhouse.", "The DNC leaks show Hillary was chosen as the candidate. Sanders wasn't allowed to win.", "Anyone live in NC? How pronounced is casual racism/racism in NC? Does it feel present daily? I'm genuinely curious.", "&gt; Max doner to Bernie here. \n\nYou know it's easy to look at your comments right? I see a bunch of anti Bernie. Going so far as putting blame on him if Clinton loses the election. ", "&gt; Beck who says he met with Trump at Mar-a-Lago, the Republican nominee’s resort in Palm Beach, Florida, tells The New Yorker’s Nicholas Schmidle that Trump directed Beck to one room of the resort and then phoned him from the next room: “We had this weird, almost Howard Hughes-like conversation,” Beck said. He left convinced that Trump was nuts. “This guy is dangerously unhinged,” he said. “And, for all the things people have said about me over the years, I should be able to spot Dangerously Unhinged.”\n\nThis is genuinely disturbing. Like, _really_ disturbing.", "There have been what five actual cases of voter fraud since like 2000 Iirc. We've almost seen 50% of that already in this election.  \nThe polls are rigged but apparently it's the GOP doing the rigging. ", "That's encouraging but my butt wont be unclenched until it's official.", "I want to cry it's going to be so long to see this change happen but it'll be so glorious when it does, and all started by a disheveled old man roaring about poverty and systemic injustice the past thirty years.\n\nJesus Christ, I miss him so much.", "Same with drug testing welfare recipients. That is also non existence but they spent millions to prove themselves wrong. ", "November 7th 2012:\n\nUpon losing the election, Republicans are performing a postmortem on the losing campaign.  Minority outreach is seen as the primary reason for the previous two election losses to Obama.\n\nNovember 7th, 2016:\n\n24 hours before the election, Republicans are fired up as Hillary \"only has one state\" protecting her election effort.  Minority outreach has been effective... at driving out the Democratic vote.\n\nNovember 8th, 2016:\n\nUpon losing the election, Republicans are performing a postmortem on the losing campaign.  Minority outreach and women's issues are seen as the primary reason for the previous three election losses to Obama/Hillary.\n\n\nRepublicans are going in the wrong direction... but its not all bad.  With every Republican loss America becomes a better country.", "Cruz would have tried to turn the country into Kansas. That would be a disaster but they still have the rule of law free and fair elections, etc. Trump is going to try to turn the country into Russia.", "At least I can trust Ted Cruz to concede if he loses instead of trying to incite race riots.  Christ.", "Is expecting immigrants to learn the language of the land really that bad of an idea? It just seems a reasonable thing to expect some stuff is really inconvienent to have bilingual. I had a discussion with some conservative family members once, me taking the liberal stance that we shouldn't have a legal national language, one of which was a grade school teacher and I couldn't get past the difficulties bilingual classrooms presented for both students and teachers.\n\nThe ideal is that everyone comes here to become Americans and it's hard to justify not speaking the language with that as a goal.", "&gt;My mother-in-law is definitely not. She will blatantly call her husband an idiot for supporting Trump and voting against his own interests.\n\nI wish I could meet your MIL. Give her my thumbs up.", "God that thread was infuriating to read. 40% complaining about Clinton and 40% claiming /r/politics doesn't let you complain about Hillary. It's like a black hole of cognitive dissonance.", "He doesn't even say the quoted headline anywhere in this article! Holy shit this subreddit is absolutely unreal...", "But Hillary is the non-transparent candidate you guys! \n\nNever mind 30+ years of tax returns.", "The only Sanders quote in this entire article is \n&gt;“I am asking you here today not only to vote for Secretary Clinton but to work hard to get your uncles and your aunts; to get your friends to vote,” Sanders told a crowd at the University of New Hampshire on Sept. 28, before he embraced Clinton onstage.\n\nand it's from **September**.", "We can kiss this tradition a fond goodbye. Trump likely won't lose in a landslide. So future candidates will chalk up his loss to his fatal personality flaws not to breaking this tradition. ", "people are gonna downvote you but shes literally the most transparent candidate ever. Intentionally/indirectly or not. We've seen almost everything of her. ", "31 Hours he will *probably* break tradition and not recognize the winner\n\nedit: Al Gore was a special situation where he actually won the popular vote (and according to many the electoral college vote due to FL). However that election night and subsequent trial was anything but traditional. If this is what happens tomorrow then yes Trump should wait to concede.", "r/politics is hillaryclinton.com", "This is even worse than allowing an article from hillaryclinton.com lmao", "Including internal campaign emails. We have never seen internal campaign emails during the election before. \n\nThe last time internal party materials were stolen and the crime came to light the masterminds lost the White House. ", "This is what I'm worried about with civil presidential debates. He's kind of ruined a lot of \"the way things are\" traditions and I can easily imagine future debates where it's considered normal to viciously attack and demean each other", "- Not a billionaire.\n\n- Gives zilch to charity.\n\n- Has financial ties with Russia (and Russian mafia).\n\nChoose as many as apply. (Protip: they all apply)", "And he faced zero consequences for doing so\n\n[Edit] Hey people consequences doesn't mean jail", "I love all the condescending Hillary supporters in here trying to put down those of us who refuse to vote for Hillary or want to vote our conscience. ", "You forgot:\n\n* Hasn't paid taxes in ~20 years\n* Uses Trump Foundation $ for personal use\n* Writes off charitable donations of others as his own.", "Get used to it because we're looking down the barrel of *four years* of this kind of open misinformation and propaganda. They are trying to use our greatest tool and leverage - the Internet - against us. ", "Nothing wrong with a protest vote. This election is unprecedented with the quality of the candidates. Protest with pride people. ", "To me Dubya seemed like a good person who was in over his head and got led around by the neo-cons. I disagree with him on almost any issue, but unlike Trump, I believe he was a kind and honorable man. ", "It's you Donald the world hates you.", "Nice guy bad President.", "Because he continued the New Deal and social security and saw himself as more of a \"progressive conservative\" and was really into infrastructure.", "Reddit should be absolutely pissed off at the propaganda that is being used on this website!  It's shameful it's deceitful and most of all it ruins the integrity of this place that is supposed to be a forum to discuss issues without a bias. ", "Reminds me of the classic [comic about Ronnie Raygun](http://crooksandliars.com/files/imagecache/node_primary/primary_image/15/09/remembering_reagan.png).", "my parents literally say the only reason he didn't do all that was because he was afraid of an armed uprising", "I am afraid so. The genie won't go back in the bottle. Shouting matches yelling \"wrong!\", making demonstrably false claims in presidential debates are here to stay I am afraid. \n\nThe first debate I watched was Bush vs. Gore, when I was visiting the US while living in another country. It really increased America's prestige in my mind. I can't see an immigrant seeing this year's debates thinking the same way about this country. ", "Oh he will declare himself the winner and give a victory speech. At that time he will call for the summary execution of HRC and BHO, and their families.\n\nThen he will try to set up a government in exile and call for civil war against all things liberal, good, decent and light.", "The Interstate system is pretty great.", "Yeah this alone makes for an incredible legacy. Shame we get a Hollywood actor as God of the Republicans instead of a 4-star general.", "He wasn't talking to you.", "Article is so misleading. He never actually said that. \n\n&gt; I am asking you here today not only to vote for Secretary Clinton but to work hard to get your uncles and your aunts; to get your friends to vote\n\nThat is **very** different than claiming Bernie said not to \"waste\" your votes on him.", "The best part is admins doing nothing about it and mods pretending it doesn't exist", "Would love to know why...", "Nope. Not going to vote for Clinton.  No way not going to happen, ever. ", "how is it unclear who is worse", "Dude they added like 15 new mods about a month ago, most of which were under a year old; with one having full abilities while only being a day old. This sub has been *purchased*.", "Not high enough. Vote.", "I would have voted Hillary had it been a fair primary fight. Clearly the DNC had coronated HRC. Why should I stay loyal when they held a corrupt election? I live in a solid blue state so if HRC loses, then she's definitely lost the election anyways. My mail in was notched for Stein simply to make a feeble attempt to show the DNC that you shouldn't ram a candidate down our throat, particularly one with serious ethical concerns. ", "And for those who complain she didn't release transcripts of speeches note that we only know about most of those speeches because they were listed on her voluntarily released tax returns! So Trump is saying that tax returns don't tell you much while ceaselessly slamming her for what was in her tax returns.", "He actually did recover from some serious brain problems: http://www.eonline.com/news/597044/glenn-beck-reveals-5-year-health-struggle-my-brain-was-functioning-in-the-bottom-10th-percentile", "If anyone - a Trump supporter Hillary supporter, or third party supporter tries to tell you what the 'right' choice is or tells you how to vote, tell them to Fuck Off.", "Yeah great job sending a message meant for your extreme base during the most televised moment of the campaign while Obama's approval is in double digits positive area. ", "I remember being at a gun range in 2008 just prior to Obama's election shooting some clay pigeons with a 12 gauge I inherited from my grandfather.   A guy was there who was married to a woman I worked with and we struck up a conversation.   He absolutely assured me that if Obama were elected I would have to surrender that gun because it held multiple shells.  He didn't say maybe it would happen, he was positive. I was skeptical, but he had his AR-15 and I didn't argue.   I'm typing this right next to the closet where I still keep that gun, the government never did get around to kicking my door in and taking it.  I'm assuming he still has his AR-15 as well. ", "Doctor: [Aladeen rewrote the language so his name means both \"positive\" and \"negative\"] Do you want the Aladeen news or the Aladeen news?\nPatient: The Aladeen news?\nDoctor: You're HIV-Aladeen.\n", "What a bullshit post. Crap like this is EXACTLY what a Clinton Presidency would look like. She sucks and as a lifelong Dem I'm ashamed she is my party's candidate. Jesus she sucks.", "His loss will have little to nothing to do with not showing his tax returns", "*sigh* - is there a less biased political sub anywhere?", "What a nasty man. ", "It sort of implies Bernie sanders has said don't waste your vote on me tho doesn't it? Or am I completely off base here..", "...his funeral", "Republicans haven't updated this attack line I don't think they realize how popular Obama is right now.", "Doesn't matter at this point. Still a loser still being voted for by losers, still going to lose.", "Nader and Stein have been nothing but absolute poison for both US politics in general and the Greens in particular. The obsession with going for the presidency without building the party up in proper fashion displays just how delusional and impractical they are while creating a risk of real danger due to vote-siphoning as we saw in the 2000 election. The party needs a makeover and furthermore if it wants to help create a more multi-party-friendly voter system they need to work with Democrats who already share many of their basic positions. Going it alone does nothing but create a mess for everyone that the Republicans exploit.", "In a better world we'd sentence these morons to 35 years in prison. Here they get promotions", "And his supporters still try to convince people he's not hiding anything by not releasing them.\n\nLiterally the only reason he has for not releasing them is that he's hiding something. ", "Hate to break it to you but they mostly hate us because of people like you, Donnie.", "They are her electorate. Bullies fear mongers, thugs, and hypocrites, and most importantly, group thinkers. She embodies the people who helped advance her agenda.", "Seriously. Like everything. And not even just her, her inner circle as well.\n\nWe have never, and will never, know more about a candidate than we do Hillary.", "He is going to lose so I think he will face some consequences. He never should have been nominated though. ", "I've voted Green in the past and after briefly flirting with the idea of Stein this election, more exposure to her was completely alienating. I'd love to see that party headed by someone more interested in running effective down-ballot races and building party infrastructure than her sheer tilting-at-windmills opportunism.", "If only they had some sort of voting system where members of the party could chose who they want to represent them in the general election.....", "&gt;His presidency isn't over yet! Get ready to hand in your gun on January 19th.\n\nGuy  who was married to a woman you worked with", "NO VOTE IS EVER WASTED UNLESS IT IS THROWN DIRECTLY IN THE TRASH.\n\nWhether it's a write in third party or one of the main two that just didn't win your vote mattered and your voice should be heard. Don't let anyone tell you otherwise.", "What's the opposite of teflon?  Because that's Hillary Clinton.  She's like my first cat.  Somehow everything seemed to stick to him.  I mean where the hell did he find a peppermint candy?!?  I hate peppermint candies I never buy peppermint candies, but there he his, a peppermint candy stuck to his fur.  Baffling.\n\nEDIT:  Apparently I'm supposed to post a picture of my first cat.  Sadly I don't have a picture of my first cat.  I think this makes me the worst person on the planet.  I am a monster.", "Trump's lack of impulse control alone should disqualify him.  That is a quality extremely dangerous in a world leader.", "lol voting for a candidate that isn't Hillary or Trump is a) doing something about it and b) voting anyways.", "You have no proof what so ever he has Russian Mafia connections that is a ridiculous and baseless claim.\n\n*Just Kidding!* He [met with a Russian Mafia boss](http://www.politico.com/story/2016/08/donald-trump-russia-felix-sater-227434) in Trump tower privately in July of this year.", "GOP MADE Trump.\n\nThey have spent the last 40 years courting religious fundamentalists to the neglect of everyone else. They have spent the last 24 years vilifying any concept that might be considered liberal. They have spent the last 8 years suggesting that the Democratic President (who turned out to be a pretty good leader!) isn't American and wants to destroy the USA. Own it! \n\nBirtherism anti-immigrant, anti-black, anti-latino (except Cubans), anti-woman's right to choose, anti-Planned Parenthood, anti-social program, anti-tax, bomb the Iraqis....The Republicans made Trump in their own image.", "\"Hillary supporters are as honest as her.\"", "&gt;  I have Lincoln Roosevelt, and Eisenhower\n\nThe one the South hates for freeing the slaves, the one who disrupted unbridled capitalism with trust-busting, and the one who said the military-industrial complex was pure evil and built the highways? ", "Because he's not a real billionaire. He's a bullshitaire.", "I'm a conservative who refuses to vote Republican until disenfranchisement stops being part of their election strategy.", "ITT: CT R disguising themselves as former Bernie supporters.", "None of the others got any Christie got there first.", "It actually pissed me off during the primaries that Bernie and his supporters spent 6 months ripping on her speeches when he didn't even release a partial tax return for a single year until late April.\n\nIt was a huge double standard.", "Ike built a highway system sent troops to the south to defend civil rights and negoiated an end to Korea.  He'd be out of today's GOP in a hot second.", "Instead of releasing his tax returns he gives out a financial disclosure which no one wants\n\nInstead of a medical records he gives a letter from his doctor and a shitty episode of Dr Oz\n\n&amp;nbsp;\n\nAnd now he will give the Republicans defeat instead of victory", "I think we will see the nuclear option unleashed.  The Republicans have stated outright that they are not interested in governing (by saying in advance that they won't hear SCOTUS nominations).  This is the sole remaining avenue.\n\nEdit: Excellent description here: https://www.reddit.com/r/politics/comments/5bnq8z/slug/d9q7v29", "I found it easy to justify my conscience considering a Bernie write-in is a vote purely for the sake of my own pride, whereas a vote for clinton puts my pride aside for the sake of all people's whose lives I personally believe would be adversely affected by a Trump presidency. (Basically everyone aside from white males, and maybe even them, too).\n\nI would have preferred Bernie to Clinton, but writing in Bernie just so I can smugly leave the polling booth just felt wrong, considering that by doing that I would also be helping to shaft millions of people.", "It's exactly that. [The American Dad bit](https://www.youtube.com/watch?v=lFV1uT-ihDo) is crude and simplified but essentially true.", "Please. He's an incredible speaker.", "He's one bad hombre.", "sounds like you'll be voting for Hilary then ", "Same here. If they had won fair and square I wouldn't have had much problem falling in line. Everything shows that the nomination was rigged and stolen. So I'm all good on your shitty candidate.", "Oh if only he was allowed to use Twitter you'd be in for it Bigley!", "Insofar as they refused to release tax returns and were pretty hypocritical yes.  Obviously they're not the same otherwise.", "&gt;I don't get it.\n\n&gt;Trump has an actual chance to win and people are still resisting the reality and gravity of the situation.\n\nYeah because democracy isn't based off of voting for who you want to lose. This two party bullshit is forcing people to vote for representatives that don't, and will not, represent their beliefs. That's not democracy, that's nonsense.\n\n\n", "Ignore it. Just get out there and vote. Do not Brexit America.", "Oliver North violated his oath to office. Then instructed his secretary to shred all incriminating evidence. The guy is a gutless POS. If he truly believed in what he was doing, he would stand by it, not shred it. ", "HW pardoned most of the Reagan staffers caught up in the scandal so fuck him anyway.", "&gt;which is a huge shift towards the left on social issues  \n\n  And a huge shift to the right on economic and environmental issues. You're starting from a candidate who supports universal healthcare free public higher education, increasing taxes on the wealthy and corporations to reduce tax burden on the middle class, and increasing environmental protection laws. Then you're ending at a candidate who supports defunding all government entitlements including medicare, defunding the Department of Education, implementing a flat tax that would dramatically shift tax burden off of the wealthy and onto the middle class as well as eliminating the corporate tax, and defunding the Environmental Protection Agency and trusting corporations to \"self regulate\" their environmental footprint. Bernie and Johnson's platforms mix about as well as oil and water.", "We cannot make it a legal requirement without Constitutional amendment and really there are higher priorities. But as long as we are saddled with political parties acting as private organizations while gatekeeping for public service positions, we could put the requirement on them, that candidates not make it through the primary cycle without adequate financial disclosure.", "Dude a quarter of this country HONESTLY thought that the federal government was going to bus and train people to Texas Walmarts where secret FEMA camps were built underneath. It's so fucking crazy and terrifying how many people KNEW it was happening. They fucking KNEW! These are the same idiots that say they KNOW hillary is a criminal and will destroy the country. Fucking clowns.", "Like the neo-nazi at a Trump rally complaining about all the racists.", "The headline isn't a quote. There's an easy easy way of telling this. You see how the headline doesn't have quotation marks? That means it's not a quote. ", "The size of the US economy doubled under Reagan. People remember their money because it affects them.", "If anything we should make it a legal requirement if running for office.", "Too bad Trump got his Twitter taken away this is prime Trump triggering material.", "As a Clinton supporter I agree. \n\nAs a Stevie Ain't Blind Truther, I disagree. ", "Do you know why Stevie Wonder can't see his friends?\n\n\nHe got married", "r/politics is fucking garbage. ", "Don't upvote. **VOTE!**", "He absolutely won't.  Donald Trump is a coward and when challenged on anything -- *anything* -- he always backs off.  Once he loses the election, he'll give a backhanded concession speech, probably throw in things about \"rigged\" and in the coming days, start declaring \"I didn't want to be President anyway.  If I was serious about being President, I would have won.\"  The man is allergic to responsibility.\n\nThe very qualities that make him the worst Presidential candidate in history will keep him from stirring up much trouble after losing.", "The important lesson isn't 1939-1945\n\nIt is 1929-1933", "That comment made zero sense during an election when most people are voting for the lesser of two evils.  Obama would beat Trump by a larger margin than when he beat McCain in 2008.", "I think what Bernie supporters should do is to vote whoever the fuck they want in the presidential race but GO OUT THERE AND SUPPORT HIS POLICIES. Vote in the midterms, support local candidates who support his policies, just get out there and put your vote where your mouth is.\n\nI'm so tired of people who blindly vote on personality, regardless of whether it's Trump, Bernie, or Clinton. Look at what actual laws the candidate supports and get those laws into the system. THAT is how change happens. \n\nEdit: Several people have pointed out that yes, Clinton and Sanders do have several overlapping policies. I'm not saying it doesn't matter who you vote for-- obviously there are things like the Supreme Court nominees to worry about. My point is, regardless of which policies you DO support, not everything lies on just this one vote. Vote often, speak often, whatever it is you support. ", "I'll admit that back in high school I rolled my eyes when our history teacher said we spent so much time learning about the Holocaust so something like it would never happen here. I thought times had changed and no leader especially in America could be so evil or even close to it. Clearly, I was wrong. \n\nIt's bad enough Trump made it this far. I actually think if he made it into office and actually tried to sieze all power for himself, he'd have a shocking amount of support from his base and possibly the military.", "My moms also bat shit crazy don't worry.", "We're trying so hard", "Florida is looking better by the day.", "I hoping this election will be called as soon as the polls close in CA I'm so ready for this to be over. ", "I'm curious to see the spin he will spin to make himself a winner out of this somehow. He WILL NOT walk away from this a loser. \n\nBut alas a loser he will be. ", "Donations to NAMBLA..?\n\nI'm not saying he donates but I've heard people say that. Smart People.", "Such a nasty auditor. ", "Completely agree. I do think he was \"great\" in terms of immediate post-9/11 America - not Iraq and everything that followed in that sense but him at the wreckage yelling \"you might not be able to hear me, but they can sure hear you!\" and when he threw a *strike* at the [first pitch at the World Series in New York](https://www.youtube.com/watch?v=bxR1tZ08FcI). His calm Texan charm just felt so *American* and I think that's just what we needed.\n\nBut then it all went downhill.", "If Clinton wins FL MI, PA there may be little reason to wait for the west coast results.", "Seems to have triggered his supporters already judging by the amount of people that wandered away from their safe spaces to come here and bitch.", "If you sub /r/The_Donald and /r/politics then they cancel each other out on your front page", "Well. Don't let the first one stop you from doing the second at least. ", "It's because they've been told over and over again that \"the democrats commit massive voter fraud.\" They believe that poor people and illegal immigrants are bussed around by the thousands and all vote multiple times and no one notices so they think \"since it's so easy we have to do it to make it fair.\"\n\nIt's a direct result of people forming their own reality and then trying to live in it.", "Obama is popular among Democrats and left-leaning independents. Republicans (for the most part) still think he's horrible for our country. Telling Republicans that Hillary is four more years of Barry O cements their vote for Trump.\n\nMy family and many of my coworkers are Republicans who listen to right-wing radio and get most or all of their news from Fox. They live in a different world with different facts. Its like what Obama said in his interview with Maher the other day.", "I'm sorry but an oil fire and a methane fire do not cancel each other out.", "Good. The Affordable Care Act came just in time for me at the time of the diagnosis of a chronic lifelong condition. Without it I would have lost my insurance once I turned 21 and it would have been very hard for me to land insurance coverage because of a pre-existing condition.\n\nI have never *disapproved* of him because he basically saved my life. Thanks, Obama.", "If people think that strategy will win then they will go for it but Trump was being Trump and that boorish behavior was already built into his personality. A career \"clean-cut\" politician will have a much harder time trying to be bombastic if they didn't already set the bar for themselves otherwise it will come off as insane. ", "Same with his \"Hillary is like Merkel\" comment.\n\nAll the political geeks were confused thinking a) no-one in America knows who Merkel is, and b) those that do know think she's one of the most talented and effective politicians alive.\n\nBut they didn't realise that in alt-right circles Merkel is the evil sellout that has handed Europe over to the brown-skinned muslim hordes and people who believe that were who Trump was selling to.", "Obviously the economy was a huge issue but Bush collapsed because of 'read my lips'. Romney collapsed because of '47%'.\n\nTrump though, he just keeps on trucking, it's terrifying. He could be caught masturbating with Old Glory and his supporters would claim it just showed how patriotic he was. ", "My wife and I early voted in Mecklenburg. One location - closest to lower income neighborhoods - had lines wrapped around the building. Another location in a very affluent area had no wait and plenty of open machines. ", "I don't get it. Is Stevie Wonder known to be a bad driver or something?", "President Obama plans to dedicate his post-presidency to helping Democrats win elections nationwide by tackling redistricting reform — and he’s hand-picked Eric Holder to lead the charge.\n\nhttp://www.politico.com/story/2016/10/obama-holder-redistricting-gerrymandering-229868", "5 star*", "The difference between /r/politics and /r/the_donald is that here a comment slamming the article is upvoted to the top. I doubt you see that in the_donald. ", "Nader was heavily responsible for a long list of environmental safety, and consumer-protection legislation and was a boon to this country with well-reasoned and researched ideas and opinions on both domestic and foreign policy.\n\n\nJill Stein is a Putin/Assad bootlicker with badly researched, pandering opinions and has accomplished nothing for the country as a whole. The comparison is insulting.", "He's never going to appeal to the people who care about logic.", "The polls were pretty close last time I checked but since early voting tends to favor Dems this is heartening news. ", "&gt; Cook’s bail was set at $20000, and she now faces up to five years in prison for each of her two felony charges. Another local paper, the Belleville News-Democrat, quoted the Madison County state’s attorney as saying Cook will lose her job as an election judge.\n\nShe was an election JUDGE?!?!  We are so screwed.", "This is a fascinating insight into the way the modern conservative white person views racism. They *refuse* to look more than one step removed from the result. \"We didn't do *X* *explicitly because* of their race so it isn't racist.\" In their view having a policy that is anti-black that thus prompts blacks to not vote for them *and then* taking those non-voters rights away is not an anti-black or racist policy. Both steps have plausible deniability, so, therefore, does the sum of the steps.", "I've been posting this a lot but I think its sort of important so whatever.\n\nFor those who think that these warnings about anti-semitism in the alt-right are over blown, this is a response I got from someone in r/politics like 3 days ago:\n\n&gt;Explain how all the top owners of nearly everything important to controlling society are Jews then. Because you aren't a well connected millionaire it means all there isn't Jewish nepotism at high levels of government, finance, and media? Why is it a contradiction to have Jews advocating nation wrecking laws for the nations they want to wreck but not their own nation? Being Jewish there is really no point in arguing with you.\n ", "I think he made it stronger. The easiest way for Republicans to weed out people like him in the future will be requiring that the candidates have to release x years of tax returns to be in the primary. Democrats would probably follow suit. ", "Oregon just switched to automatic voter registration when you get your drivers license. In addition we have universal vote by mail. These two changes should be made nationwide.\n\nEdit: order of words in last sentance", "/r/NeutralPolitics ", "Future candidates can now always refer to The Donald if they don't want to release their tax returns.", "&gt; In fact George H.W. Bush ended up getting screwed over in 1992 as Caspar Weinberger was indicted just 4 days before the election. \n\nThat election was going to be a landslide anyway.  The \"read my lips\" quote basically sunk him.  Weinberger was just piling on at that point.", "I hope him and Romney team up and tour for electoral reform.  ", "Where are the mods to take this down for \"Altered Headline\"?\n\nOr is that only for Trump threads?", "He'll get arrested the second he calls for the execution of the President. ", "That's not a bad thing. It wasnt for Reagan and it isnt for Obama. Until it hits an absurd amount (based on ability to pay it off) a la Greece its usually a good thing. Financing through debt is usually cheaper than other means. It saves money in the long run. That's why a company like Apple, with 700 billion in cash, finances everything through debt. \n\nFor several reasons, debt financing is just way cheaper than cash, if you can handle the payments. And, spoiler alert, America (and Apple) can.", "And i'v been told over and over that \"Santa Claus exists and brings you presents every christmas\" but i was smart enough to stop believing it at some point. At some points these people have to take responsibility for their own ignorance and blindness, and lack of ability to adapt to today's changing America. They are acting like children, wanting the whole of society to change to fit their personal worldview rather then putting in the effort, like the rest of us, to change their worldview to accomodate the ever changing reality of the world.", "I haven't even seen his supporters doing this more they just dodge answering by saying \"But Hillary did _____ why don't you mention that?\" and proclaim themselves the winner of the argument.\n\nThis entire election has shown some very ugly sides of America.", "It's what happens when they've been taught that critical thinking is evil and liberally biased. They live in a post reality bubble.\n\nI used to think arguing with Christian fundamentalists was the most infuriating thing in the world because any evidence contrary to their beliefs is a \"trick from the devil to test their faith.\" \n\nNow I realize that this subset of Trump supporters is worse. The fundamentalist will say the dinosaur fossil is a trick from the devil, but some of the Trump supporters will deny its existence entirely, even as you wave it in front of their face. \n\nHow do you teach someone like that critical thinking?", "I am completely shocked by this revelation. ", "Doing away with the filibuster is \"the nuclear option\" in this context. The filibuster is part of the rules of the Senate but it's only there by tradition. The Senate approves of its rules of order after each election. The only thing keeping the filibuster around is reluctance to break with tradition, but as it's  been used exponentially more in recent years, there's been building pressure to toss it out entirely.", "Yeah but you didn't account for Feels so therefore your reality is wrong.", "Now I'm imagining a team of lawyers following my cat around throwing things at him to see what sticks.  My poor poor cat.", "I didn't see it before.", "Exactly the greens need to get a couple senators and then form a coalition with the dems. Dems with the larger block pass what they want on the condition that they throw bones in for the greens. Win win. \n\nYou don't build a party by screwing the party you need to form a coalition with.", "Yeah that is the only realistic path for this tradition to continue. RNC and DNC need to make this a prerequisite -- before the first caucus / primary release at least 10 years of taxes. ", "Nah O'Hare is too iconic. If we renamed an airport it'd probably be Midway. It's closer to where Obama actually lived to boot.", "Clinton released *30 years* of tax returns when she announced her candidacy in *May 2015.*\n\nSanders released part of *1 year* of tax returns in *late April 2016* after spending the previous 6 months accusing her of hiding something.\n\nIt *was* hypocritical and it *was* a double standard, and people should admit that.", "And it's not like a flood of white people are the ones coming out in greater numbers.", "Probably by his own secret service agents. ", "Nah I'm not hanging out with him.\n\nI'll take a major dickbag who is a great president", "I hope she gets some jail time. They need to send a message that this shit isn't okay regardless of party affiliation, excuses, etc. \n\nIronically, as a felon, she'll lose her right to vote for a long time.\n\nEdit: words are hard.", "Reagan's mental decline was also a widespread topic of discussion/speculation. \n\nThe deification of Reagan is total revisionism. He was hated by a lot of people. I doubt that any one president has been the subject of more protest songs than Reagan. Tons and tons of punk bands had anti-Reagan songs.", "Which is bizarre because they were the ones that supposedly taught us to not believe everything you read or see on TV... Yet here they are, twenty/thirty years later doing exactly that. ", "Because this sub has a narrative; blame bernie if clinton loses tomorrow.", "He won ww2 for the western allies though. \n\nA great general in the biggest war on earth. Victory of good against evil.\n\nSeriously in the cold war, Eisenhower should have been The Man. But I guess he was too patriotic and loved Americans and not money...", "You're bonkers if you think Bernie was hurt by his presidential campaign. He went from being a blip not even on most people's radar and will return to the senate as probably the most powerful senator in the country.", "The man had a concealed sign!!! **Everyone** knows Hillary is a ninja assassin--the only thing that stopped this shill from paper cutting Dear Leader to shreds was the brave actions of some obese patriots!", "Maybe because thanks to the dumbass electoral college the only votes that matter are the ones in Florida/Ohio/Nevada/Pennsylvania/etc.\n\nI voted here in Tennessee but it doesn't fucking matter. ", "Hillary supporter here. Disagree with a lot of Bernie's further left positions but gladly welcome the healthy ideological diversity his supporters have brought to the party. We don't all want conformity and group think. There are a lot of us out here who value a strong party with both center-left and progressive coalitions. The worst possible scenario is a big enough fracture between us that the GOP takes power and makes none of our shared goals possible. \n\nDon't vote for Hillary if you can't stomach it I understand. But there are a lot of Hillary supporters out there who value you all and are eager to work together toward our common goals. Don't write us all off as neoliberal sellouts. ", "Yeah that'd be like renaming the Sears Tower.", "You're the racist party!\n\nYou're the party of corporate interest!\n\nYou're the warmongering party!\n\nYou're the anti-science party!", "I don't see him wining it either Stevie.", "I had to laugh at this. Yeah 60000 20 year olds dead but my goddamn premium increased by $50!!", "George H.W. Bush was forced to raise taxes because Reagan's trickle down economic policies and deregulation were so bad that it led to a massive deficit and a recession when he began his term and he had no choice but to raise taxes to pay off the deficit in order to prevent an economic collapse.  ", "Jesus fucking Christ they had Oliver North on the show to call it a ransom???\n\nThat irony is fucking earth shattering. I need to lie down.", "Oh there is!  The whole world now knows he is a grifter scam artist, liar, money launderer, rapist and general all around scumbag.  I don't think he will ever make another dime doing business and will just continue to lose his millions bit by bit until he's dealing three card monte in pissed pants on a street corner somewhere.", "The mods are what will eventually bring down Reddit or at least the larger communities on here.", "It's anything but random.  It's a pattern whose historical roots stretch back centuries...", "Why would you gladly vote for Obama but not for the person who had a major role in his administration has his enthusiastic support and has a very similar platform to him?", "Perhaps you didn't get it but the above poster is referencing Watergate.  Where Nixon, the Republican president at the time, got caught red handed orchestrating the breaking and entering of the DNC headquarters to steal campaign documents.  He lost the White House because of it.  \n\nThe implication is that the DNC hack is actually worse for the Republicans than for the Democrats. ", "*wooooooooooooooo^oooooooo...STOP.*", "10% chance of Trump victory is too high. ", "A sentence I could only type in 2016: Glenn Beck is who the party needs to emulate if they want to survive in the future. \n", "It could have been three times that except they won't let him on Twitter any more.", "&gt; We cannot make it a legal requirement without Constitutional amendment\n\nSure we can. We already require financial disclosure. http://www.fec.gov/ans/answers_candidate.shtml\n\n&gt;**Do I need to disclose my personal financial information?**\n\n&gt;Yes. Candidates for federal office must file disclosures of their personal finances.\n\nHere's Trump's: http://www.cnbc.com/2015/07/22/inside-trumps-finances-read-the-full-fec-report.html", "Bernie sent me a private message he said write him in on November 9th!", "The only final poll that counts is at the ballot box. Don't fuck this up America.", "He also strongly cautioned against the rise of a military-industrial complex (although he partially helped foster the MIC's rise). Comparatively, Reagan dumped millions into the defense budget, as a way to bankrupt the USSR in the arms race.", "Eisenhower is one of my favorite presidents and he was a Republican. Nixon and Reagan came along and completely fucked up the whole party for generations to come.  ", "And as narcissistic "], "links": ["5blmi4", "5bndbz", "5bn0fq", "5blmi4", "5bnhm8", "5bme15", "5bni2k", "5bmog7", "5bme15", "5bndbz", "5bmog7", "5bnl7d", "5bnhm8", "5bndbz", "5blmi4", "5bnhm8", "5bmg5p", "5bmog7", "5bn154", "5bnhm8", "5bme15", "5blqkn", "5bme15", "5bndbz", "5bn0fq", "5blqkn", "5blsws", "5blsws", "5bnhm8", "5bn154", "5bnl7d", "5bn7gd", "5blmi4", "5bnc0c", "5bn5hg", "5bnc0c", "5bnhm8", "5blqkn", "5bn0fq", "5blsws", "5bndbz", "5bn0fq", "5bnhm8", "5bmvmf", "5bn0fq", "5bn6ic", "5blmi4", "5bnc0c", "5bnhm8", "5blsws", "5blsws", "5bn0fq", "5blqkn", "5bnhm8", "5bnhm8", "5blqkn", "5bn0fq", "5bme15", "5bmog7", "5bmeo0", "5bmml2", "5bn0fq", "5bme15", "5bmog7", "5bn154", "5bn154", "5bmvmf", "5bn0fq", "5bmvmf", "5bme15", "5bmog7", "5blsws", "5blqkn", "5bnhm8", "5bn154", "5bnnpn", "5bmml2", "5bn0fq", "5blqkn", "5blmi4", "5bn0fq", "5bnhm8", "5blqy2", "5bn154", "5bmog7", "5bmvmf", "5bm962", "5bmoy1", "5blsws", "5bn0fq", "5bn0fq", "5bn154", "5bme15", "5blmi4", "5blqkn", "5bnvpb", "5bnvrr", "5bnvpb", "5bnq8z", "5bnnpn", "5bnvpb", "5bnvrr", "5bme15", "5bnvpb", "5bnvrr", "5bnnpn", "5bnq8z", "5bnnpn", "5bnnpn", "5bnvpb", "5bnvpb", "5bme15", "5bnnpn", "5bnnpn", "5bnnpn", "5bme15", "5bme15", "5bnvpb", "5bme15", "5bnl7d", "5bme15", "5bnq8z", "5bnhm8", "5bnnpn", "5bnnpn", "5bnnpn", "5bni2k", "5bme15", "5bmog7", "5bndbz", "5bnnpn", "5bnvpb", "5bme15", "5bnn2b", "5bme15", "5bnttl", "5bmvmf", "5bndbz", "5bnvpb", "5bnnpn", "5bn0fq", "5bnzwq", "5bme15", "5bnvpb", "5bnhm8", "5bni2k", "5bndbz", "5bn0fq", "5bnvog", "5bnq8z", "5bncii", "5bnvpb", "5bmml2", "5bnnpn", "5bnvpb", "5bni2k", "5bnnpn", "5bnnpn", "5bmog7", "5bnnpn", "5bmog7", "5bnhm8", "5bnnpn", "5bnhm8", "5bnn2b", "5bnhm8", "5bnnpn", "5bnvog", "5bnnpn", "5bnl7d", "5bmw45", "5bnvpb", "5bnl7d", "5bnnpn", "5bndbz", "5bnq8z", "5bn0fq", "5bnnpn", "5bnnpn", "5bn0fq", "5bnnpn", "5bmog7", "5bme15", "5bnvrr", "5bme15", "5bmog7", "5bnhm8", "5bnnpn", "5bnvpb", "5bnu9g", "5bnhm8", "5bo6g3", "5bnvrr", "5bnvrr", "5bo6g3", "5bnq8z", "5bo6g3", "5bnvrr", "5bo6g3", "5bo6g3", "5bme15", "5bnvrr", "5bnvpb", "5bme15", "5bnvrr", "5bo6ty", "5bnvpb", "5bnq8z", "5bnvpb", "5bnvpb", "5bnq8z", "5bme15", "5blmi4", "5bnnpn", "5bnvrr", "5bnvrr", "5bnnpn", "5bnvpb", "5bnvrr", "5blqy2", "5bo6ty", "5bo6g3", "5bo1u6", "5bo80p", "5bnvrr", "5bnnpn", "5bnnpn", "5bnvrr", "5bnnpn", "5bnvpb", "5bnxkz", "5bnvrr", "5bme15", "5bo6g3", "5bo6g3", "5bme15", "5bo6ty", "5bo6g3", "5bnvrr", "5bnvpb", "5bme15", "5bnvpb", "5bni2k", "5bnvrr", "5bo83k", "5bnnpn", "5blqkn", "5bmog7", "5bnq8z", "5bo80p", "5bnnpn", "5bnvrr", "5bo6g3", "5bnvrr", "5bnvpb", "5bme15", "5bnvog", "5bnq8z", "5bo6g3", "5bnvpb", "5bnvpb", "5bo1u6", "5bndbz", "5bme15", "5bo6g3", "5bnvpb", "5bme15", "5bnvrr", "5bmvmf", "5bme15", "5bo6g3", "5bnvog", "5bnvpb", "5bn154", "5bmvmf", "5bnnpn", "5bnvpb", "5bo6g3", "5bnnpn", "5bn154", "5bn0fq", "5bme15", "5bn6ic", "5bn154", "5bme15", "5bnzwq", "5bnvrr", "5bnvrr", "5bofor", "5bofor", "5bofor", "5bofor", "5bofor", "5bofor", "5bofor", "5bofor", "5boksx", "5bofor", "5bofor", "5bofor", "5bnvpb", "5bofor", "5bofor", "5bnvrr", "5bnvrr", "5bofor", "5bofor", "5bnvrr", "5bofor", "5bofor", "5bofor", "5bofor", "5bofor", "5bo6g3", "5bofor", "5boksx", "5bo6g3", "5boksx", "5bofor", "5bo83k", "5bnvrr", "5bofor", "5bofor", "5bnvrr", "5bon8w", "5bofor", "5bme15", "5bnvrr", "5bofor", "5bnq8z", "5bofor", "5bofor", "5bnq8z", "5bofor", "5boksx", "5bnvrr", "5bmog7", "5bnvrr", "5bnvrr", "5bofor", "5bofor", "5bnvpb", "5bofor", "5bofor", "5bnvrr", "5bomwu", "5bnvrr", "5bo6g3", "5bofor", "5bofor", "5bo6g3", "5bme15", "5bofor", "5bnvrr", "5bofor", "5bme15", "5bnvrr", "5bnvrr", "5bnvpb", "5bnvrr", "5bofor", "5bnvpb", "5bo6g3", "5boln7", "5boezi", "5bo6g3", "5bme15", "5boce3", "5bnnpn", "5bogyq", "5bnvrr", "5bnvrr", "5bnvrr", "5bo6g3", "5bnvrr", "5bnvpb", "5boksx", "5boezi", "5boqyj", "5bo6g3", "5bo83k", "5bnvpb", "5bnvpb", "5bn154", "5bnnpn", "5bnvrr", "5bnvrr", "5bovpt", "5bnvrr", "5bovpt", "5bovpt", "5bovpt", "5bnvrr", "5bnvrr", "5bovpt", "5bovpt", "5bovpt", "5bovpt", "5bnvrr", "5bovpt", "5bnvrr", "5bnvrr", "5bofor", "5bourt", "5bofor", "5bofor", "5bnvrr", "5bofor", "5bofor", "5bovpt", "5bovpt", "5bofor", "5bofor", "5bofor", "5bnvrr", "5bnvrr", "5bovpt", "5bnvrr", "5bofor", "5bnvrr", "5box0z", "5bnvrr", "5bovpt", "5bnvpb", "5bnvrr", "5bofor", "5bofor", "5bofor", "5bnvrr", "5bovpt", "5bnvrr", "5bourt", "5bnvrr", "5bofor", "5bofor", "5bovpt", "5boyr0", "5bo6g3", "5bovpt", "5bourt", "5bnvrr", "5bovpt", "5bovpt", "5boyr0", "5bou9q", "5bofor", "5bnvrr", "5bofor", "5bofor", "5bnvrr", "5bovpt", "5bou9q", "5bnvrr", "5bofor", "5bovpt", "5bo6g3", "5bnvrr", "5bourt", "5bovpt", "5bofor", "5bovpt", "5bnq8z", "5bnvrr", "5bofor", "5bofor", "5bourt", "5bofor", "5bnvrr", "5bourt", "5bovpt", "5bnvrr", "5box0z", "5bofor", "5bofor", "5bnvrr", "5bovpt", "5bofor", "5boksx", "5bnvrr", "5bofor", "5bovpt", "5bpfj3", "5bpfj3", "5bpfj3", "5bnvrr", "5bpdao", "5bovpt", "5bp71v", "5bofor", "5bnvrr", "5bp71v", "5bofor", "5bpdao", "5bpdao", "5bpdao", "5bovpt", "5bovpt", "5bovpt", "5bofor", "5bpdao", "5bpfj3", "5bnvrr", "5bpdao", "5boksx", "5bofor", "5bnvrr", "5bofor", "5bovpt", "5bofor", "5bofor", "5bo6g3", "5bpfj3", "5bofor", "5bofor", "5bnvrr", "5boyr0", "5bofor", "5bpdao", "5boksx", "5bo6g3", "5bp71v", "5bovpt", "5bo6g3", "5bnvrr", "5bovpt", "5bofor", "5bofor", "5bnvrr", "5bovpt", "5bofor", "5boksx", "5bovpt", "5boksx", "5bo6g3", "5bnq8z", "5bp77q", "5bofor", "5bofor", "5boyr0", "5bovpt", "5bofor", "5bovpt", "5bpdao", "5bovpt", "5bofor", "5boksx", "5bofor", "5boksx", "5bnvrr", "5bofor", "5boyr0", "5bp77q", "5bnvrr", "5bnvrr", "5bofor", "5boksx", "5bpfj3", "5bofor", "5bofor", "5bofor", "5bovpt", "5bnvrr", "5bp71v", "5bofor", "5bovpt", "5bnvpb", "5box0z", "5bnvpb", "5bpdx0", "5bovpt", "5bnvrr", "5bp3o8", "5bofor", "5bofor", "5bnvrr"]}