{"comments": ["I mean that's pretty obvious.\n\nHis refusal to release them stopped his other runs but this time was different because Obama triggered him so he ran anyway and just didn't release.", "The funny thing is I bet his entire campaign wishes he did that. Probably could have went a little better for him if he had. \n\nThin skin got the best of him. \n\nThere was 300 other things that went wrong but hey anything helps ", "He is known to be blind.", "Don't worry guys he's going to release them right after the audit is complete, that's what he said and we know Donald never lies.", "She was just trying to save him from himself.", "Same I refuse to believe he can't see. Where's the medical records showing he's actually blind?", "If you pull this off the world will forgive you for every single Florida Man headline.", "I'd trust Stevie Wonder to drive before I'd trust Trump to run the country.  At least I'd know that only the passengers of the car would be at risk.\n\nEDIT: It'd be like one of those fucking bumpers for kids at the bowling alley.  He'd be able to steer a bit but would bounce from side to side never quite picking up the needed momentum to go any real distance or do any actual damage to anyone. ", " The worst fucking part is that we're not even anywhere close to 1933 Germany. We're doing pretty fucking great as a country. But ignorant motherfuckers and conspiracy theorists just can't accept it. They can't accept that America is doing well because then they'd have to give the credit to Obama. And nothing would hurt more than to say you were wrong and that the Globalist secret Muslim from Kenya hell bent on destroying America and taking everyomes guns, actually pulled this country out of the hole it rightly deserved to be in. If a white Republicans did what Obama did we would have elected him King. But because he's a black democrat, Fox News got to talk all the shit they wanted for 8 years unchecked. And now the party wonders why their base is a bunch of Breitbart readers who refuse to listen to anyone.", "I came here to circle jerk. Not to laugh. ", "Oh man. The stakes just got 10 feet higher", "Oh my god what if this actually is the reason he makes sense now?", "Trumpland where reality takes a vacation and everything is orange.", "Libertarians would give him a license. FREEDOM!", "I'm starting to think Trump doesn't know how numbers work", "The only quote from Bernie in the article is from September 28.\n\n\"“I am asking you here today not only to vote for Secretary Clinton but to work hard to get your uncles and your aunts; to get your friends to vote,” Sanders told a crowd at the University of New Hampshire on Sept. 28, before he embraced Clinton onstage.\"\n\nFuck that title so much.", "We've seen that Donald Trump does not accept the results of clear facts. If he loses he's going to call everything about the election into question and demand a special investigation and threaten to sue someone. He may later declare he no longer feels like pursuing those claims but he will not give a concession speech ", "He actually did it. He poked the BeyHive. He's about to get dragged so hard.", "Honestly it might even have helped him considering he's obviously hiding something.", "Make sure we get the long form records.", "But if we've already voted can we continue our shitposting?", "&gt;Oh my god\n\nwhat if Glenn Beck was only using 10% of his brain before and doctors gave him the ability to harness the  full 100%?", "I can even respect an actual filibuster where the senator stands in front of his colleagues and speaks for hours. It takes commitment and a willingness to forego comfort to take a stand like that.\n\nSaying \"I filibuster\" and then everyone goes home is just gaming the system.\n\nEdit: Based on your replies my admiration for a \"real\" filibuster  may be misplaced. Thanks for the interesting comments!", "No national news org will call a state before it's polls close. It might be 'in the bag' before then but nobody will call the entire race until enough states are closed and called.", "I wouldn't be surprised to find that he's owned by Russian oligarchs...", "I feel like pointing out how much like Donald Trump you are will be political suicide in its own right.", "I don't believe he created that but it was definitely front and center during his administration. ", "\"APRIL FOOLS BITCHES!!! As the voting shows, 33% of y'all are sick fucks -- no matter what I tried, you wouldn't stop voting for me. Thank god HRC has tremendous tenacity.\" \n\n~ things I hope Trump says in his concession speech\n\nedit: Whoa - thank you for my very first gilding!! I couldn't be more pleased that *this* is the comment. ", "He didnt create it but he sure as shit did rachet up the the racist dog whistles and increased funding. ", "Or even just listening when people say \"Stevie you're on the wrong side of the road!\"", "This is nothing. Who gives a shit. I just heard him give a speech about how he's going to impose a 35% tariff on imports from China. \n\nAre Americans really so stupid that they can't see the obvious harm of that? Prices would rise massively for all sorts of goods.", "From Trump's [Sheriff's Star](http://www.jpost.com/US-Elections/Was-Trumps-Star-of-David-a-Sheriffs-star-459475) tweets.\n\nTo the use of [Nazi soldiers in his campaign ads](https://www.washingtonpost.com/news/worldviews/wp/2015/07/14/donald-trump-tweets-image-of-nazi-soldiers-inside-the-u-s-flag-then-deletes-tweet/) (instead of American soldiers)\n\n\n\nTo the fact that he and his campaign team are closely [associated with actual Hate Groups.](http://www.motherjones.com/politics/2016/10/donald-trump-hate-groups-neo-nazi-white-supremacist-racism)\n\nAlso he got the [official endorsement of the KKK newspaper](http://www.npr.org/2016/11/02/500352353/kkk-paper-endorses-trump-campaign-calls-outlet-repulsive)\n\nHe got the endorsement of [ex- KKK Grand Wizard David Duke](http://www.politico.com/story/2016/02/david-duke-trump-219777)\n\nAlso hes got [European Neo Nazis 'Golden Dawn' supporting him](http://www.timesofisrael.com/greek-neo-nazi-party-golden-dawn-endorses-trump/)\n\nThen of course there is [Trump spokesperson Katrina Pierson defends her call for a 'pure breed' president](https://www.youtube.com/watch?v=k_2_6_0TzHM) (1mins 39secs video just watch it if you doubt.)\n\nBut you know.  Its got nothing to do with white supremacist Neo Nazis.  There are not copious parallels between Trump and Hitler.  Just an \"undertone\".", "I... suppose. ", "r/politics: Obey and vote for Hillary.", "[There was also this speech.](https://www.youtube.com/watch?v=liudIJFg8UQ)\n\nI didn't remember it; I was in middle school. Someone on Reddit pointed it out. ", "Funny too because Jay and a Beyoncé charge like 200 a head ", "I assume the Breitbart headline is \"Hillary Clinton has Glen Beck assassinated replaced with lookalike\"", "It's also worth thinking about how you poll likely voters. You call people who have voted in the past. Think of all those first-time voters who view Trump as an existential threat to themselves and their families. Latino turnout for early voting is already record-setting and how many of those new voters are in the polling data? They weren't politically active in years past.", "It is known. ", "Even Eminem is urging people to vote against Trump. It's awesome. ", "This election really elucidated the existence of bat-shit-crazy moms. I had no idea that this loving woman who makes amazing chocolate chip cookies was filled with dormant hatred and bigotry. \n\nI've learned to bite my tongue and take solace in the fact that I'm not in a swing state. For the sake of our relationship and the cookies.", "Yeah I have asked quite a few Obama haters why they hate him.  About half can't really say beyond some vague talking points they got off facebook, the other half list off a bunch of bullshit like \"the US has lost most of it's prestige in the world because of him\" or \"Obama has divided the nation between blacks and whites.\"\n\nI can almost understand people who are fooled about the budget and the debt who don't realize that under Bush's administration, the wars were not part of the budget.  But then again, these same people don't understand the difference between debt, budget, or deficit.  For that matter they can't tell what the differences are between federal income tax and FICA.", "Middle-aged+ people think of the filibuster as Mr Smith standing up against political corruption. Or more recently the filibuster by Wendy Davis over abortion restrictions in Texas.\n\nBut as you identify in the senate that doesn't happen, and mr Smith's noble stand isn't why they do it, it's just for pure obstructionism. \n\n", "If it's true that team Trump took his twitter access away then they've basically done the next best thing. ", "That's sort of the point. There's no such thing as political neutrality. We only have fires.", "The thick irony of having the party most aggressively supportive of our military forego championing a former general in favor of deifying a charismatic actor.\n\nEDIT: Though to wit, some of the staunchest Republicans (and Trump supporters) in Hollywood are people like Clint Eastwood, who has cultivated an image as a grizzled hardass in spite of a decidedly mundane military career spent almost entirely in the US. The real military heroes don't tend to posture like that, and they don't seem to want to stand behind Trump, either.", "Numbers work depending on how he feels. ", "Plus Stevie would do everything to learn get assisted driving aides etc.", "Everything is cheating if it doesn't explicitly help Donald win.  ", "Yes", "Any day now BOOM! Sharia law!", "Says the guy who got a star in the Hollywood walk of fame for a fucking reality tv show. \n\nJesus Christ the way this guy bullshits would make Goebbels himself an admirer.", "I know. I am just being an idiot. This is how I deal with my election anxiety. ", "\"We're just celebrating his life.\"\n\n\"...Why is Dubya dancing on the table?\"\n\n\"He just really liked him you know...\"", "The Donald has always been a jealous man he hates the idea of actual celebrities not liking him. He craves the attention and has always sought to [insert himself into their orbits](http://www.nydailynews.com/entertainment/gossip/trump-twitter-pre-2016-celeb-obsessions-robert-durst-sharks-article-1.2746239). \n\nAs Trump would say before his campaign staff took away his twitter access: Sad! ", "Where is Adam Schefter when we need him. ", "It isn't very long. If I remember correctly during that documentary 'Mitt' they dropped him off at his house the day after the election and took off.", "I agree.\n\nI *kinda* got how Hitler came to power but now I see the same thing unfolding and truly get it.\n\nThe polls have Clinton with only a 4-5 point advantage and Trump is an unstable, sexist, racist, petulant, impulsive, scummy bigot.\n\nIf he was anything close to competent like Hitler was(before his descent) then he would win **shudders**", "Oh yeah that would never happen. /s", "&gt;  I despise trump but electing another Clinton is a giant middle finger to all our beliefs in the American experiment  \n\nNo it's fucking not. God grief. It would actually be electing the first woman president who is super experienced, disliked by a lot, and liked by a lot of people too.  \n\nStop with the false equivalency. Trump sexually assaults women and endorses torture. Hillary was dumb about her email server. Not in the same fucking galaxy. ", "I know Obamacare is one of the more visible legacy items affecting everyday Americans but I think the opening of relations with Cuba will be far more reaching in the long term. Showing that we can move past policies that don't work and his attempts to shut down GITMO have opened up huge opportunities for the improvement of basic human rights for one of our closest neighbors. ", "Honestly looking back in a couple years I'm not gonna think \"man, not releasing those tax returns is what sunk Trump\" when there's so much god damn else to use instead.", "Just a little over a day and he'll just be a footnote in our nation's history.", "To be fair I would wager a number of Obama supporters probably couldn't name any meaningful things that he specifically has done (my girlfriend being one). But I understand the main thrust of your argument. The problem is that there are no longer any objective facts in our world. You can't quote a study or paper or anything without skepticism from some view or another. Too many people have grown accustomed to their comfy echo-chamber.\n\nHonestly it just makes me sad. My mom is a reading teacher, and she taught me to read far earlier than most kids my age. I'd like to think because of that I valued the ability to read and learn for myself, a skill that unfortunately many seem to lack. To quote someone smarter than me,\n\n\"The trick is to keep your identity separate from your opinions. They are objects in a box you carry with you, and should be easily replaceable if it turns out they're no good. If you think that your opinions are who you are, then you'll ignore all evidence to the contrary.\"", "Eisenhower also warned of the Military Industrial Complex. And this was the former Allied Supreme Commander talking about that shit. ", "I count myself lucky everyday that both my parents are no right-wing nutjobs like their respective siblings. This election has made me rethink my interaction with the right like I never have before. I have no idea how I could have handled my parents openly supporting someone like him. I just hope something like this doesn't become the norm.   ", "Beyoncé &gt; Ted Nugent.   ", "LBJ other than Vietnam (which, no denying, was a colossal failure and mistake), was a perfect example of this too. Amazing president, especially when he took over Kennedy's first term. Also a complete dong of a person.", "Great. That's all I needed to hear", "And quite possibly the most important piece of advice Trump ignored ", "&gt; “I can’t tell you exactly how we got them because I think people might get in trouble,” Ghalayini says\n\nSaved you a click", "And 538 only says 68%.\n\nThe difference is that he does not assume shifts in voting in each state are independent.  So if Clinton is 2 points ahead in 3 states and can win if she wins any one of the three Nate Silver assumes that if one switches, that increases the odds the other two will as well because the election is actually more national than local.", "And weak.", "Its so much worse than that. He publicly lambasted previous candidates for not sharing theirs. ", "I would think they are still there to protect a losing candidate for some time after the election.", "&gt; .....\"He was hated by a lot of people.\"\n\n**IS** hated ...... I lived through his bullshit administration.\n\nNever forgive never forget.\n", " North Carolina is ground zero for racist voting laws\n\n[they cut early voting hours in minority areas](https://www.google.com/amp/s/thinkprogress.org/amp/p/fcffa0151748?client=safari)\n\n[they eliminated the ID black voters were more likely to have when they crafted their voter ID law](https://www.washingtonpost.com/news/wonk/wp/2016/07/29/the-smoking-gun-proving-north-carolina-republicans-tried-to-disenfranchise-black-voters/)\n\n[emails showed how the GOP specifically targeted black areas to limit early voting](http://talkingpointsmemo.com/muckraker/more-gop-emails-emerge-that-urged-nc-elections-officials-to-limit-early-voting)\n\n[they tried to purge thousands of voters right before the election](https://www.google.com/amp/mobile.nytimes.com/2016/11/05/us/north-carolina-voting-rights.amp.html?client=safari)", "Trump's tax plan favors the 1%", "It took Trump entire's campaign apparatus the entire length of the campaign to finally figure out the optimal twitter approach (taking away Trump's phone) so I wouldn't get all shirty about it. ", "Election judges are really just volunteers. Requirements are being able to vote being able to read and write English, and not being a criminal. They are usually nominated by local political groups then selected by some county-level official.\n\n[Link](http://www.co.madison.il.us/departments/county_clerk/elections/election_judges.php) to election judge information page for Madison County, Illinois", "Wow good way to put it. I love her to death but she quite openly hates people who aren't like her.  She's working to change it as she claims to be a very God driven lady (and oh boy she ain't lying), but it's sad to see the hate flow out and at the end of the day I just feel sorry for her that she has to have those emotions inside of her. It's not healthy or good for the spirit.", "I know. I am just being stupid. ", "I'm sure the 17th Congressional Hearing on Hillarys answers to a \"Which Game of Thrones Character Are You?\" quiz will bring much needed information to the American people", "I have inside sources telling me Stevie Wonder will be the new coach of Michigan", "Trump was clearly talking about Clinton's event last night in Cleveland not when they sell out the Metrodome.", "He admitted to the entire country during a televised debate that his lawyers advised against it. I never understood why that particular quote didn't seem to resonate with anybody. ", "I got banned because I made a comment suggesting that the idea that Clinton would laugh at the thought of gays being murdered might not be correct.\n\nLittle did I know that'd go on to be a popular talking point. =.=", "I want to make a coffee table book of Donald Trump poetry and call it \"No Puppet. No Puppet\". Or alternatively, \"I have the best words\"", "This pretty much says it all:\n\n&gt; “I love you!” an ecstatic supporter screamed.\n\n&gt; “I love you back — I do” Mr. Obama said, interrupting his 25-minute speech to acknowledge the cheers. “But tomorrow, you will choose whether we continue this journey of progress, or whether it all goes out the window.”", "I mean he was also president while we won WW2. It's pretty hard to beat that.", "I think this just shows how prepared Hills was coming in. She knows the fucking drill. Been here done that.  Bernie is staring at Turbotax going, how do I blank out my social?", "I grew up in a Republican household and I followed it until about 2010 or 2011 when some of the things that are really flawed about the GOP and some of the things that helped allow the rise of Trump became more clear to me. Some of the more far right things that my dad would say started standing out more to me.\n\nI'm fed up with the obstructionism too having two parties with different views is good, but not when one of them does nothing but say \"fuck you, blahblahblahblah I can't hear you\" when the other party is trying to do things or even compromise with them. This is not what Government should be.", "I could be wrong but the moment he loses the election they aren't his anymore, I think.", "[Here ya go](https://twitter.com/search?q=%23beyhive%20%23trump&amp;src=typd).", "Shame. Because Stevie wonder is going off on twitter.\n\nhttp://i.imgur.com/KWCERCP.jpg ", "Thanks Obama.", "Since this has been popular and prompted discussion I'm posting an update version of this for the last time:\n\nTo any disaffected Dem or Liberal considering not voting for Hillary, I'm not going to try and change your mind with HRC's qualifications or what a disaster Trump will be.\n\nInstead...\n\nThink about Wednesday, if Trump wins then the Republicans will definitely also hold the Senate and Congress.\n\nThe day after the election, Republican Speaker of the House Paul Ryan and Republican Senate Majority Leader Mitch McConnell will hold a press conference.\n\nThe theme of their speech is going to go something like this:\n\n\"With President-Elect Donald Trump and the Republican victories in both the House and the Senate, the American people have sent a clear message rejecting the past 8 years of liberal policies and the Obama/Clinton vision for America.\"\n\n\"America is a Center/Right nation, and the people have spoken. We have been given a clear mandate to repeal Obamacare, roll back job-killing regulations, cut high taxes, and get rid of liberal social programs.\"\n\nExpect also stated plans to immediately confirm Trump's Supreme Court nominee right after the Inauguration, an intent to defund PBS, revamp Social Security, and cut all federal funding to Planned Parenthood. Oh, the Filibuster? Well, payback's a bitch. Good luck obstructing anything, Senate Dems.\n\nImagine that smug look on both of Mitch and Paul's faces, the empowerment of Congressman like Ted Cruz, and the condescending and self-satisfied tone of every conservative talking head you see on TV for the next few years.\n\nAlso imagine all the \"told you so\" language coming from /r/the_don because this scenario is basically their wet dreams come true.\n\nIf you vote for a third party, you don't exist to this new Republican supermajority. They're not going to say \"thanks Bernie or Jill supporters, we hear you and are gonna consider your wants.\"\n\nYou can help prevent all of this from happening. President Trump is one thing, but if they control the White House, the Senate, and the House, they're going to exact payback on Obama and everything progressives have fought for.\n\nDemocrats will have no voice or seat at the table.\n\nIf you look at the state polls, this is going to be a close election, like Florida in the year 2000 close--Clinton could well win the popular vote and lose the White House. I know HRC isn't perfect and the DNC has had problems, but you have two choices for the next 4 years:\n\nBe frustrated your President isn't liberal enough and work to pull her to the left, or be ignored entirely.\n\n\n\n", "Terrible or not Trump thought whatever info is in there was enough to not get him elected.   ", "I am nervous as hell for tomorrow.\n\nI want everything to go smoothly with no shenanigans from either side. I want everyone to vote without issue or incident and I want both candidates to accept the results no matter what.\n\nI think I'm asking for too much this time around.", "I predict the big winners will be the liquor stores.", "I don't feel good laughing at this but damn, that's funny.", "I have never been this nervous in a very long time and I considered myself a level-headed guy.  I don't want to lose my rights as a gay man.  Usually I am not a single issue kind of guy but this is literally a threat to my livelihood. ", "And this is TRUMP thinking and this is someone who thinks shooting someone is not enough to not get him elected. So this must be crazy bad.", "Look at Donald's proposed cabinet that came out today. Giuliani as Attorney General? Gingrich as Secretary of State? There is no \"swamp draining\". Look at the people Donald surrounded himself with in his campaign. Those will be your leaders if you let him win.", "Fucking vote people, even if you know your state is 99% sure to go to one candidate or the other.\n\nYour voice needs to be heard and there are plenty of other downballot elections and bills that need your attention. \n\nKeep in mind also that statisticians will be looking at the tallies to track trends. Want your voice to be heard on a particular issue, like marijuana legalization or funding for the homeless? VOTE.", "Currently in line for Clinton rally in Philadelphia. It's almost 2 miles long.", "I hate how everyone pretends like both candidates are equally bad.   One represents a worse version of Obama.   The other is fascist who may do away with American democracy as we know it! ", "David Farenthold found evidence of only one donation of 5-10k from Trump to a charity since 2009 with the caveat that it might be a book keeping error.", "Reverse psychology. She provoked him into tweeting a lot.", "The Wednesday morning Trump Twitter Tirade will be glorious.", "Put in another 7 hour shift of GOTV in Florida. Democrats actually seemed excited to 'Slay' Trump at the polls tommorow. Please get out and vote everyone! ", "So......you're asking for a normal election then?", "...you must not have read the same emails that I did haha", "I know it's too much.", "I never said this the entire election, to anyone as far as I can recall, so now seems like a good time.\n\nFuck Trump.", "I think she's cleverer than that. She ensured he absolutely never would delete it because he's a stubborn fool.", "Also if nothing else, think of the look on Chris Christie's, Ted Cruz's, and Paul Ryan's face when they realize they threw their political careers away for the sentient clementine", "All of us \"Secret Hillary\" voters are trying to turn Florida as blue as the rinse in our hair...GO Hillary! Go Dems!", "Fuck Donald trump.", "Wait. Trumps a hypocrite? ", "I mean the Cubs already won the World Series. Hell is probably pretty frosty right now. ", "And I don't understand how people can still say she's crooked or been bought out by anyone willing to pay her. There's nothing in her emails or speeches to support that. \n\nEdit: all the replies shows not much. I mean millions upon millions spent to get something and this is it? She's pretty darn clean then.", "And gun stores.", "/r/the_meltdown", "Thank Christ this is almost over. Just get out and vote. Lets finish this shitshow.", "Whether there is or isn't is kinda beside the point I'm glad to see Clinton making the statement.\n\nIt's a really, really, really bad precedent for a high office candidate - let alone POTUS - to refuse to disclose tax information.  If you want to hold the most powerful office in the world, the voters deserve to subject you to high levels of scrutiny and this includes your finances.  Candidates can't be allowed to get away with just refusing to provide the information and not have it inflict damage on their candidacies.", "America you in danger girl. ", "No blind. No blind. You're blind. ", "I disagree that Hillary is a worse version of Obama. I predict she'll be spectacular and tougher on the obstructionist party than Obama was. ", "Nice! I just waited for 7 hours to see Obama speak in New Hampshire. Definitely worth it!", "*grabs pussy*", "Just a friendly reminder that r/the_meltdown exists", "The most important question: will The Guardian be doing it's animated results tracker for the general?", "He's already been spinning it saying it was rigged. He just has to stick to that. ", "You may have wandered into the end of a North Carolina voting line by mistake.", "Is there a post-election rehab for political junkies? I think I'm going to need one starting Wednesday.", "You earned that one.", "DAWN OF THE FINAL DAY. \n\n-27 HOURS SIXTEEN MINUTES REMAIN.-", "Oh and the climate. Oh, and nuclear proliferation...and torture...and killing the families of terrorists...and all those nutsy alt-right policies...and an uber-hawkish position towards Iran that could throw his much-vaunted bromance with Putin out the window...and likely significant economic volatility up to and including a global recession, which will only embolden anti-American kooks and radicals from ISIS to FARC to Duterte.", "After witnessing the clusterfuck of Brexit in my country and the emboldened far right and ensuing ugliness I am truly nervous of a Trump win. She isn't perfect, but shes not Trump, please America do the right thing.", "I Hillary wins it's time to go buy gun company stocks. Guns sales go up during democratic presidencies.", "You're correct that was one of Nixon's gifts to America.", "I'm thinking that his tax returns will reveal that hes not quite the successful business man that he portrays. A hit to his ego and the image he projects as a member of the ultra rich is much more worrisome to Trump than anything illegal or politically damning. Also if he does give a shit about the politics behind his return, if it does show hes made a lot less money than he boasts, that would destroy the legitimacy of his entire campaign. I'm a rich business man, I'm rich because I'm good at business. I'll run the country like I run my enterprise.", "We also have no health report from him that came from a legitimate doctor.", "&gt;Do you know why Stevie Wonder can't see his friends?\n\nHe was playing No Man's ~~See~~ Sky. ", "And Microsoft embraced open source and is now innovating more than Apple with PCs and Laptops.\n\nAnyone seen any flying pigs yet?", "[deleted]  \n ^^^^^^^^^^^^^^^^0.4661 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/23893)", "&gt;My Brain Was Functioning in the Bottom 10th Percentile\n\nJesus Christ....How is this whole thread not an onion article.", "That would be a miserable swamp.", "For those of us outside the United States this is pretty much the official litmus test for \"How unbelievably ignorant and backwards can the average American be?\" \n\nIt's a choice between an immensely qualified, career public servant; and an extremely self-serving, distasteful caricature of a man. \n\nI'm quite confident that sanity will prevail, and that we'll have the sensible answer to that question. ", "I'm watching this from Germany with great nervousness. I can't think of an election where I have been following the lead up with such interest. I really hope America sets an example against bigotry and hate and lies. My country would benefit from that as we face problems with demagogues of our own and they are desperate for a trump win.", "Hey now he did cut a $10k to project Veritas from his foundation to fund O'Keefe's criminal/fake videos, does that not count?", "No because that's someone else's money that was donated to the foundation. The last year for which there's evidence of Trump donating to his own foundation is 2008. Even his fake donations to fake charities are faker than the first two fakes would indicate.", "They're out in full force all over Reddit. ", "And his supporters. 500 days of this shit we know who he is and we know exactly why they are voting for him, it's not economic distress. ", "It's OK when white people do it. Duh.", "Blind people use the Internet with software assistance. In fact we have blind Redditors.", "It wouldn't work for democrats but I can see it working again in the republican primaries.  The alt right eats this stuff up.  So long as they remain a major force within the GOP along with the tea party then they're begging for another Trump.  ", "We should TOTALLY elect the guy who can't control himself on Twitter lol!", "Today we are CANCELLING the apocalypse!\n\nGo Hillary!", "I disagree you destroyed the GOP, outed racists, drove a wedge between family and friends, embraced a Russian narrative, while also making a majority of America dislike you as a person. Seems productive to me.\n", "&gt;sentient\n\nI see you are feeling charitable today. ", "Just a reminder: Jimmy Carter is eligible for reelection.", "Mail-in ballots should come with those \"I voted\" stickers.", "Seriously.\n\nHow the fuck can anyone think a grown-ass man that gets his phone privileges taken away should control the nukes?", "Would you be willing to add this to your post? [State-by-State Time Off to Vote Laws](http://www.findlaw.com/voting-rights-law.html)", "No it won't. The entire world economy will crash if the dollar crashes. Donald Trump will threaten the world economy not just ours", "Hey just because he threatened to jail his opponent and has a mob of violent supporters doesn't mean he's a fascist! [His Mussolini impressions make him a fascist](http://imgur.com/gallery/jNxTe5L)", "I'm pretty sure Trump supporters do not understand what that tariff would do the middle class and small businesses. ", "If releasing his tax returns would have helped his cronies would have talked him into doing it.\n\nEveryone who's seen his taxes have seen enough to know that it's better in his case to break with tradition and suffer for it, than to show people the terrible things they reveal.", "This election cycle is going to make for an amazing documentary in about 10 years but right now I'm just scared...", "Was the core strategy all along ", "As a Canadian we will welcome you with open arms if Trump wins. Just make sure to leave your guns and religious fundamentalism at home when you leave. ", "&gt;One represents a worse version of Obama.\n\nMore hated not sure about being worse (since she hasn't really got the chance to prove herself yet). I'm incredibly optimistic about her.", "I heard \"The Audit\" won't be completed until 2047...", "Proof that he's an absolute fucking fraud and conman. ", "Engaging in systematic voter suppression should be considered treason and punished accordingly.", "Nevada seems to be Clinton's Florida is having record turnout.  I hope this is a landslide and the Dems take back the Senate. We need 9 justices, an infrastructure bill, and so much else. One can hope.", "I hear cocaine is relaxing comparatively.", "\"When Trump attacked Gold Star family Kremlin halted hack campaign. Believed he was psychologically unbalanced and would withdraw.\" \n\nJesus Christ", "You must be a paid actor. Alex Jones told us all about how Hillary can only fill her rallies with paid actors. /s", "2016 is fucking weird. Super fucking weird. ", "Are you fired up?", "The cities vs everywhere else.", "Pls [no](http://www.tacticalshit.com/wp-content/uploads/2015/12/eagle-scared.jpg)", "**G**rab\n\n**O**ur\n\n**P**ussies", "I love that goddamned thing.", "I've spent the last three hours talking myself out of heading over there but I'm in the mood for some junk food and I'm on a diet so I might do it anyway to curb my appetite.  ", "I'm more concerned with the complete lack of consequences for openly lying as an entire campaign platform. Pence's debate where he said with a smug look \"Trump didn't say that\" to a half-dozen things Trump said *on video* while suffering zero consequences and even being called the winner of the debate is the biggest threat to future debates. There is no reason for any politician to tell the truth as Trump/Pence showed voters don't give a shit about facts.\n\nedit: to all the \"both sides do it! all politicians lie!\" people: no, not like this. We've never seen a campaign whose sole platform was gaslighting the nation. We've never had a candidate and his VP say, repeatedly, that things that we've seen on video didn't happen. We haven't had a VP swear that his presidential candidate didn't say things that he said on camera mere hours beforehand. It's not the same. Trump has told hundreds and hundred of easily disproved lies. He spent the last several days swearing Obama yelled at a protester when the opposite happened. His politifact rating is the equivalent of \"if he's speaking, it's bullshit.\" It's nothing like normal candidate who stretch the truth or hide behind nuance and interpretation. It's pissing on voters and telling them it's raining as a campaign strategy and the voters are thanking god for the rain.", "It's likely a combination of:\n\nDoesn't qualify for \"billionaire\" status.\n\nPaying no taxes.\n\nRussian business connections.\n\nAnd almost nothing in the way of donations. ", "The blind people I've met have all had an excellent sense of humor. They'd probably laugh too. Toph from *The Last Airbender* was pretty spot on. One guy I used to work with got his jollies by pointing things out and waiting for a second while folks looked in that direction. It almost always would work, too, even though we all knew he was blind. And after realization kicked in, he would laugh his ass off at all of us.", "As a gay man I'm more afraid of what Pence could do to our community from the White House. Overturning marraige equality would be the least he might do. What if he gave tax incentives to parents that send their gay children to Conversion (i.e. torture) Camps?", "But so what tho? There's nothing in those speeches and we can see her voting record in the Senate. Unless you can point me to speech she gave where it shows anything crooked. I am more than willing to see it.", "Lol Obama vs Trump would be a slaughter.", "Holy shit. That's the population of a significant town size right there.", "No they wouldn't laugh at this. They can't see it.", "You know that lots of people got paid even more to make speeches too right?\n\nIncluding - shocker alert - Donald Trump.", "We are going to look back at prohibition and be ashamed.\n\nMillions of lives have been ruined billions of dollars have been wasted, and rights have been stripped away and abused all to fight drugs. The war on drugs is an abject failure.\n\nWhat did we get out of it? More drugs on the street, social rejection and less treatment for addicts, more people in prison, criminal organizations making record profits, slow erosion of our constitutional rights, invasion of our privacy, rampant civil forfeiture, out of control militarization of our police, criminalizing personal choice, and distrust in our law enforcement.\n\nFuck prohibition. It needs to end.", "What amazes me about the emails being a \"scandal\" is that we have no baseline of comparison.  If I hear that a guy killed someone that sounds bad.  But if the guy was a soldier doing his job in wartime, then it is good.  I need the context, and I need to be able to understand how the job normally works.  With the emails, I don't have that basis of comparison from other politicians to work with.  Is she equal to, better than, or worse than other politicians?  I have no idea.  ", "Or seen the price tag on those speeches...", "And one of Hillary's most strongly held positions is that citizens United needs to be rolled back.  She will take the money but if she has her way she will make future elections less contingent on it. ", "It must be killing Trump that he cant make fun of someone's handicap.", "As a Clinton supporter in WV (Trumpland) my vote won't count. But I fully plan on voting. You can't bitch later if you didn't participate in the election.", "[A picture of the rally](http://i.imgur.com/QGxWxWY.png)\n\n&gt;[Using top comment to post this better link for info of the rally](http://www.straitstimes.com/world/united-states/some-40000-people-at-clinton-obama-philadelphia-rally-new-record-for-democrats)", "I'd disagree. That's way too late. By 1929 while it still isn't the case that The Nazis were inevitable I think it's fair to say the fall of the democracy was, and it was likely going to fall into some sort of dictatorship.  \n\nTo really get a solid picture you probably need to start with the revolutions of 1848, but more reasonably with Otto von Bismarck coming to power in 1862. So much of the Nazi appeal was based on the Bismark era, and his Second Reich. This was the 'Great' era that conservative Germans wanted to return to when they spoke of making Germany great again. It also saw the split between Social Democrats and Communists which was so fateful in the fall of the Wiemar Republic. In this period Germany also had it's industrial explosion which catapulted it to neck and neck competition with the other great powers of the world and the beginning of modern colonialism, two factors which were of major importance in the lead up to the first world war. \n\nThe War itself can't be understated either. Though it was incredibly demoralizing, many German's believed that victory was always just around the corner because of the control on media reporting by the military and monarch, so when they finally lost it was a total shock to most. \"Defeat snatched in the last second from the jaws of victory\", and it was this shock, and inability to cope with such a sudden and unexpected result, along with the empire falling and becoming a republic, which created the [Stab-in-the-back myth](https://en.wikipedia.org/wiki/Stab-in-the-back_myth) which became a main plank in all far-right rhetoric afterwards. \n\nThe other factor that many people either seem to not know, or simplify away is that antisemitism was endemic far before WWI. Too often a hear garbage like '...and then Hitler convinced the german people that the jews were the cause of all their problems', which is utter nonsense. The Nazis merely played on an incredibly common, though mostly either casual or abstract, prejudice, and were by no means the first in politics to have success doing so. As far as ideology goes, the nazis didn't really invent anything new. They just sampled and blended things that were already in the air. Frankly their rise isn't a story of strict ideologues coming to power through astute argument, but rather a group bent on power and willing to say just about anything to win support. More broadly their targets were Jews, Marxists, 'cultural Bolsheviks' (uncomfortably similar to 'cultural Marxists' if you ask me), feminists, sex educators, department store owners (who were mostly jewish for historically contingent reasons), social democrats, modernist artists, and much much more. \n\nOther important lead-up events include the Kapp Putsch, the hyperinflation of '23-'24, The Beer Hall Putsch and the following trial, the ever present street fighting between paramilitary organizations from the communists, social democrats, nazis, and conservatives, and then the Depression. \n\nTo me, that's where the important history is, far more than the politicking and campaign strategies that got the nazis from a protest vote party to being in power. The political environment that gave birth to the nazis was a long time in its creation, and even the simple picture I gave above doesn't nearly capture all the important threads that went into why what happened happened. I just want to try to show how history is long and the past has a huge bearing on the outcome of the future.  ", "I think it's more accurate to say Clinton's after party will be EVERYWHERE", "As far as deleting emails there was a baseline based on previous SOS. Bush said publicly the other day that he deleted tens of millions.", "&gt;\"Low energy. So sad.\"\n\nDonald \"It's a Disaster\" Trump.", "You know what's worse? Say goodbye to bipartisanship. This will be last time for a while for a Democratic president to make a Republican the head of FBI. Hillary sure as hell won't let any Republican into her administration. I don't blame her; GOP fucked up by being children. ", "Yeah man. Being paid for your craft is fucking corruption at its worst. As a liberal I personally never understood why people had a problem with this sub, until I saw people crying about paid speeches.", "Holy shit if she actually did it to ensure he would keep digging his hole on twitter, that's... uh... 3D chess?", "Eichenwald has been borderline heroic this campaign.", "Relax there's nothing to worry about. Other than the fact one candidate has actively encouraged his supporters to guard election booths and do everything \"legally\" possible to ensure that voting is being done in his favour. Also the same candidate has implied that he could reject the results if he loses and has been trying to convince people to rise up against a rigged system. Plus the same candidate earlier in the year seemed to encourage people to exercise their right to the second amendment. But I'm not worried. I'm just sitting here, calmly waiting for the election results to come in. http://i.imgur.com/miezzfz.gif", "And mention how being the President is [\"actually a step down\"](http://thehill.com/blogs/blog-briefing-room/news/301929-trump-jr-says-running-for-president-is-a-step-down-for-his-dad). These people have their heads so far up their own asses that they think being the most powerful person on earth is somehow a step down.", "[Libertarians would abolish the need for licenses.](https://www.youtube.com/watch?v=0Psp0A-zJgU&amp;t=3m21s)", "3 years from now he will confidently state that he never ran for President.", "Yes.  I guarantee you she won't waste any time trying to get Republicans to compromise or \"change the tone\" in Washington.  She knows they'll be obstructionist and will plan her strategies accordingly.", "I'm not so sure of that as grim an outlook as I have on the matter. \n\nTrump's rise to power was an intersection of a lot of factors including a global shift towards rightwing politics, his incredibly abrasive and boorish personality, his personal wealth and \"brand\" prestige with the American public, and so on. \n\nYou couldn't just pick another rich asshole to replace him in four years for another round of Establishment Democrat vs. Trash Talking Right Wing Billionaire. \n\nTrump is a bizarre American figure a solid 40 years in the making.", "God: new phone who dis", "So... I remember hearing claims that Hillary couldn't fill a stadium. Heh. ", "&gt; You start out in 1954 by saying “Nigger, nigger, nigger.” By 1968 you can't say “nigger” — that hurts you. Backfires. So you say stuff like forced busing, states' rights and all that stuff. You're getting so abstract now [that] you're talking about cutting taxes, and all these things you're talking about are totally economic things and a byproduct of them is [that] blacks get hurt worse than whites. And subconsciously maybe that is part of it. I'm not saying that. But I'm saying that if it is getting that abstract, and that coded, that we are doing away with the racial problem one way or the other. You follow me — because obviously sitting around saying, “We want to cut this,” is much more abstract than even the busing thing, and a hell of a lot more abstract than “Nigger, nigger.”\n\n-- Lee Atwater (GOP Strategist) in the early 80s.", "&gt; If you vote for a third party you don't exist to this new Republican supermajority.\n\nthis.", "Yeah it's honestly disgusting how shittily the Republicans treated Barack Obama considering he spent his whole first term being almost pathetically bipartisan and open-handed towards them. Lesson learned. Fool me once.", "If you haven't already take some time to familiarize yourself with the downballot and local elections, and any propositions there might be. \n\nAll that stuff is important and has a much bigger day-to-day effect on our lives than who is in Washington DC.", "Yes and we can also see the millions of dollars in donations to her campaign from Wall Street. Not all malign influence is illegal.", "I have many reasons for supporting Hillary against Trump despite how much I distrust her. But there's mainly been one reason driving me. It's a stupid and petty one, but I can't help it.\n\nIs it because he's a racist, sexist demagogue with fascistic tendencies and has the potential to ruin the world and our fabric of democracy? Sure.\n\nBut I mainly just can't stand the thought of his supporters gloating if he wins. I want to drink their tears when he loses. It will be glorious.", "Still waiting on that Melania Trump press conference to prove she was never illegally in the US.........two months and counting. ", "Donald Trump Breaks 227 Year Old Bipartisan Tradition By Being The First Presidential Candidate To Be Involved In Over 3500 Lawsuits, Including The 75 He Faces After The Election\n\n", "Oh. *Sonoma County* mail-in ballots should come with those \"I voted\" stickers.", "you don't need a law. both major parties are private organizations. All you would need is to have the RNC pass a new rule that says every candidate must release tax information before even running in the primary. As a private organization they can do whatever they want.\n\nIMO, they pass this new rule sometime early next year.", "People will sacrifice jobs and wellbeing for the stupidest of causes.", "I just hope there is a law that is passed that forces all candidates to release their taxes in order to run for presidency. I have a sneaky suspicion especially if Trump doesn't lose big league, that he will try in 2020.", "Yeah but both candidates are bad though, right?", "Just lynching room banter. No biggie.", "Exactly what I'm thinking. No way he's a billionaire. He's probably a 'several hundred millionaire' which isn't bad of course but he's no Buffet or Cuban. Notice he never gets into dick sizing fights with actual billionaires, it's always media people he can bully, other politicians, etc.", "I think that's absolutely fair to be single-issue when it comes to that. As a bi trans girl I'm deathly afraid of what'll happen to my rights if Trump/Pence wins", "So if I'm Jewish how do I get into these wealthy connected positions of power cause I'd really like to know?", "More peopl voting is historically a good thing for democrats. \n\nLess people voting is historically a good thing for republicans henc their massive nationwide suppression attempts. \n\nBlacks people are on track to surpass their 2012 votes in Florida at least.\n\nThere is that article that 30% of the early voting republicans voted for clinton(the Cubans). \n \nNormally i would dismiss this if rubio's campaign manager didn't say that their internal polling showed the same. They were voting Clinton for pres but him for senate.\n\nHispanic vote is up.\n\nFlorida is sounding better by the day.", "Let's all troll Trump with the same Tweet Wednesday morning: delete your account", "Just one amongst dozens of really bad precedents set during this election.", "Exactly. It's just hollow opportunistic, hypocritical attacks. Trump wouldn't be 1/10th as rich as he is without massive corruption (see: Pam Bondi for just one example), links to the mob, hiding cash overseas, tax evasion, and plenty of other shady shit.", "It is a false equivalency. The Clinton Foundation used the money for charitable causes Donald lined his pockets with it.", "Ever watched parks and rec? Aziz gets a court order to suspend his phone usage but his withdrawls are so bad that he makes a cardboard iphone to pretend tweet and pinterest.  I am envisioning Donald doing this and fantasizing about punching that sweet satiating insult into his twitter and sending it off an a wave of euphoria at 3 AM on his golden toilet.", "I prefer living legends that didn't go blind as a child and overcome adversity to create beautiful things in the world that millions of people worldwide derive joy from and have gladly paid to experience.", "My guess is that money looks bigger in his tiny hands so he thinks it's worth more if he has it. He values a $10 bill at between 23 and 35 dollars depending on his mood and overall orangeness.", "Someone told me rally size equals winning so...yay!", "All of Manhattan will be celebrating Clinton's win tomorrow. ", "He's broke", "&gt; when Trump is on a known twitter sabbatical.\n\nYou mean when man-child had his twitter privileged grounded?", "Wow! Amazing! So many of you not seeing each other! And so fast! Mind blown!", "Well exactly Gary is a sellout shill for the statist interests running our country into ruin etc. True libertarians defend to the death the right and duty of Stevie Wonder to drive blind.", "I'm Canadian and I took tomorrow off from work because I knew I'd be too anxious. So did my mom.\n\nLook what you Americans are doing to us!!", "Being under investigations doesn't automatically mean you're guilty. Maybe in whatever third world shit hole you live in but not in America. An actual conviction after an investigation means you're guilty. ", "&gt; Hillary Clinton's campaign sent cease-and-desist letters to broadcasters advising that they shouldn't air ads from pro-Donald Trump PACs that include the claim that Clinton is \"under investigation by the FBI.\" \n\nAfter all of Trump's threats it will be ironic if Clinton ends up suing over lies in ads. ", "Don't tell that to his supporters they might lynch you.", "I look forward to the article with the headline \"Donald Trump's Concession Speech Proves America Made the Right Choice\"\n\nThough to be fair, Trump has defied our expectations so far. We thought he'd make Hillary look a fool in the first debate (he didn't). We *then* thought Debate 2 would be a repeat showing of Totally Unhinged Donnie from 1 (it wasn't). Every time we think, \"Donald couldn't say anything more ridiculous,\" there is, nigh unfailingly, a tweet within 24 hours proving us wrong.\n\nSo, while the *schadenfreude* of a bitter and spiteful Trump concession speech would feel really nice, I'd far prefer a graceful Trump concession. If Trump wants to impress people on his way out, his speech will talk about how he brought out record numbers of Republican voters in the primaries. He'll point out any battlefield states he may have won. He'll talk about the pain and fear many Americans are really, truly living in (bonus points if he doesn't lay the blame at the feet of Muslims or Mexicans), and reassert that listening to so many on the campaign trail has opened his eyes to the plight of ordinary Americans. He'll inform them that his commitment to fighting for the working class has not ended, merely changed. If he wanted his concession speech to go into legend, he'd end it with a line like, \"Making America Great Again was the goal of this campaign. And now, it's in your hands—the hands of the American people.\"\n\nOf course, I'm not expecting any of that, but I've been pleasantly disappointed before, and I certainly hope to be again.", "That's pretty hilarious \n\nThat being said who gives a fuck who Stevie Wonder supports?", "Seems high. Are hey rounding up or something?", "\"3 years ago a madman ran for president and Donald Trump stopped him\".", "Drug prohibition is a jobs program. Police district attorneys and the whole court system, jails and prisons, rehab programs, and probations officers to name a few base their livleyhoods around drug prohibition. You have to slowly change the system and we are seeing it happening right now. Marijuana started as medical initially and has spread and is turning recreational. I'm looking forward to my medical LSD and MDMA. ", "I was hoping someone would hand him off a phone deep throat style.", "...except Russia", "Trickle down was actually was [created by Tories](http://www.presidency.ucsb.edu/ws/?pid=75174). The very types of ideology our nation had discarded along with British monarchy in 1776. \n\nBack then the code words were \"leak through\" and \"sift through\"\n\n&gt; There are two ways of viewing the Government's duty in matters affecting economic and social life. The first sees to it that a favored few are helped and hopes that some of their prosperity will leak through sift through, to labor, to the farmer, to the small business man. That theory belongs to the party of Toryism, and I had hoped that most of the Tories left this country in 1776", "This is the guy who thinks he's going to unseat Elizabeth Warren. ", "But Trump loves the blacks! ", "I've been mostly silent on the internet regarding my political opinions. I've had a few comments here and there but I have liked to stay out of the fray. I did this because of the utter toxicity displayed from both sides when it has come to this election. That being said I am a Progressive Democrat so I see the left's toxicity in a different context than the right's. In my opinion the rights's toxicity has revolved around ignorance, anger, and a contempt for change. I may be wrong and skewed in my views, but this is how I view it.\n\nI want to put something out there on the very off chance anyone who is open and not decided views it. I understand the frustration with Clinton, during the primary I loathed the lies and tactics used against Sanders. I still do. I don't agree with all of her policies, and I certainly don't agree with all of her actions. \n\nThat being said two weeks ago I mailed out my ballot with her as my pick for President of The United States of America because I value that position. I value the fact that someone will have to deal with the worst and best of what America has to offer on a daily basis. I value the extremely difficult and multi-faceted choices that person will have to make. I value the wide diversity of this country and people.I value those who practice their constitutional rights to those who give their lives for those rights. \n\nI do not believe trump gives value to these things. I do not believe Trump will admit when he is wrong and seek the advice of others. \nI do not believe he will be open with the American people and understand what they want and need to protect their livelihoods. I do not believe Trump cares about anybody but Trump. \n\nHillary is not a great person, she does have a questionable judgement and her actions in the past deserve scrutinization. (Not everything mind you, this is where intelligent thought and insight is required. To weed out the truths of here actions and the propaganda toted against her) But, someone who was fully self-absorbed would not have done some of the things she has. They would not have helped as many children and women as she has. They would not have dealt with the constant barrage of accusations and attacks like she has. They would not concede when they are wrong like she has. \n\nI understand the hate. I understand we need new leaders in these positions, but tearing it all down is not the way to fix this. Giving a major voice to racists and bigots is not the way to solve this. \n\nAt the very least, please, please examine your thoughts and actions and understand where they came from and what motivates them. Accept when you are wrong, and move on. We are imperfect, we make mistakes. Understanding our errors in actions and thinking is how we develop into better human beings. Please try as hard as you can to be a better human being than you were yesterday. ", "If he loses keep a close eye on his Twitter. There'll be an amazing meltdown 3-4 days later.", "But where is Ja? \n\nSomeone call Ja Rule so I can make sense of all this!", "Trump supporters would LOVE North Korea. Its right in line with everything they want. \n\nNo press deport/kill if you don't assimilate. If you dont praise their lord they silence you... \n\nJust like The_Donald. To me its a perfect representation of what those supporters want. ", "The problem is that State and most of the federal government, didn't use technology/the Internet seriously before the Bush administration, and they were unusually dishonest (e.g. lying about evidence for Iraq, outing a CIA agent, and, yes, hosting emails with the RNC and deleting about 20 million messages). Hillary is the first Secretary of State expected to take tech seriously, given that the entire Obama administration was portrayed as uniquely tech literate.\n\nOur only baseline is the Bush administration which is mostly irrelevant since this is a new problem anyway. That said, given a choice (stick with government tech or use her own out of convenience/avoiding transparency/something nefarious/whatever), she made the wrong one and the choice went unchallenged. This will no longer be a choice politicians can make, thankfully.", "My 7th Presidential election as a qualified voter and this is the first time I've ever been genuinely afraid if one particular candidate wins. \n\nIn all other years it's been: \"Not my choice, but they can't screw things up too much worse...\" ", "I'd rather the moon just crush us and let it be over. ", "So sad thinking of all the North Carolinian families who will miss out on jobs and economic growth all because right wingers needed to hate trans people", "Some of us are trying.", "He's certainly likely to stamp his feet.", "Impossible. He has the best temperament of any Presidential candidate ever. He even said so himself.", "GOP logic.\n\nDems being the slavery party in the 1800's=incredibly important and relevant to today.\n\nDonald talking about 'grabbing the pussy' ten years ago=ancient history.", "The emails don't hold weight when compared. The fbi combed over THOUSANDS and haven't found anything worth bringing to court. We don't even get to see Trumps tax report which he can release at any time. I honestly think its intellectually dishonest to conflate the two at this point.", "With Trump's character throwing tantrums as battleground states go to Clinton.", "Has anyone suggested he may be deducting child support payments for illegitimate kids? It sounds like the sort of thing he would do publicly hiding paternity while still dilligently making sure he got a tax writeoff for every dime he had to pay out. ", "Found Bomani Jones' account.", "I hear Eichenwald is on the short list for a Pulitzer at this point. The man's a goddamn hero -- without his well-researched exposes on Trump America's future might have been much, much darker.", "[It's the fifth most favorited tweet of all time.](https://favstar.fm/all-time-most-favorited-tweets)", "If only people got as angry at their politicians as they do video game developers. If only they followed politics like they followed patch notes.", "First that's a kid. Second, he's fucking disabled. He was protesting the candidate they like, I get that there would be some anger, but when did everyone lose the ability just to shut up and deal with it?", "I am holding my children close to me on the eve of this election at the end of this turbulent campaign season.\n\nI mean, I don't actually have any kids. So I'm just kind of clutching my balls, but boy am I worried. ", "Lol. If Trump loses it won't be for the sake of saving the GOP, who created him, nursed him, and supported him. It will be for the sake of saving the United States and all the diverse and beautiful people who call it home.", "No error. No error. You're an error. ", "Republicans hate it when people vote. It means they lose. ", "As a fiscal conservative nothing angers me more than government intervention directly or indirectly hampering an economy. He then had the tenacity to claim that liberals made him do it.  I don't care if Trump loses tomorrow, as long as McCrory gets voted out of office I'll be happy.", "30 years of Republican-led witchhunting and they've still got nothing. Even the Republican FBI director couldn't actually make charges because she never did anything illegal. So either she is the smartest person who has ever lived and Republicans are really fucking incompetent, or she is innocent.", "The chair didn't have white wall tires I assume?\n\nWhy is it that people different than his base encourage hate? You claim to want to make America great but America is great when we are united. Tell me how kicking a wheelchair does that.", "As a reminder [Here’s Every Time Donald Trump Has Said He Would Release His Tax Returns](http://www.nationalmemo.com/showusyourtaxes-heres-every-time-donald-trump-has-said-he-would-release-his-tax-returns/)", "Let's turn it around: He's doing everything listed unless his taxes prove otherwise.\n\nEDIT: Comment must be making traction, as \"b-b-but emails\" comments are starting to happen.", "As a straight white male, the thought of this is sickening. ", "[deleted]  \n ^^^^^^^^^^^^^^^^0.6346 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/23238)", "and hot local singles!", "This is why my eyes roll so much that they detatch from my skull whenever people talk about wanting a president they can have a beer with or someone they like.\n\nI don't care about liking my president. I care that they're fucking competent and will make my life better and the country better. They can be furry Satanists that cheat on their spouses for all I care. Fuck personability. Get results.", "It's extra funny because it's the least American flag in the history of our country. Might as well fly an Isis flag. I hope these heroin addled individuals start looking for work and get on the path to have CPS return their children. God bless.", "But... but... but...  Hillary...  email...  Hillary had an email...", "&gt; As Cuban pointed out with an S-corporation, \"the entire financial performance of his company becomes part of his tax return.\"\n\n&gt; According to the Internal Revenue Service, S-corporation shareholders must \"report the flow-through of income and losses on their personal tax returns and are assessed tax at their individual income tax rates.\" And S-corporations are responsible \"for tax on certain built-in gains and passive income at the entity level.\"\n\n&gt; \"His personal tax returns would show the financial performance of his development projects,\" Cuban wrote. \"Not good given how much he gets sued.\" ", "Absolutely. /u/AdmiralShawn jokes but let me quote the most recent post I made on /r/GWBlind. NSFW obviously.\n\n&gt;Image: https://i.imgur.com/EkvZxqg.jpg\n\n&gt;Gonewild Thread: https://www.reddit.com/r/gonewild/comments/5bm7qo/suspender_skirt_f/ from /u/whimsicalkitten\n\n&gt;In this photo we have a woman shown from the neck down. She is standing in front of a white door with a mauve or light colored pastel purple wall to the right. \n\n&gt;She is wearing a sharp looking pleated maroon skirt that has two straps across her otherwise bare belly and black high heels. She is standing with one foot in front of the other and her back leg is bent with the toe of her shoe touching the floor.  \n\n&gt;Her large full breasts are completely exposed. Both of her hands are closed, pressing slightly into her breasts on both sides, arms bent at nearly 90 degrees. It is assumed that she is holding the straps to suspenders but they are not visible and appear to be blocked by her hand placement and her dark brunette hair that is hanging in front of her shoulders on either side. \n\n&gt;Her skin tone is light but not pale and gives a nice contrast with the darker colored skirt and hair. We can see from her thumb that she has long fingernails but the color is not visible. Her areolas are mid sized, perhaps a little bigger than a half dollar. Her nipples are thicker than a pencil eraser and compliment her large breasts nicely. \n\n&gt;The light switch is off.", "His staff literally took away his Twitter account. ", "The perfect invisible hand of the free market will deter raging alcoholics from repeatedly driving.... uh huh...", "Screw them. They spent year culturing this. I don't need to save Frankenstein from his monster. ", "Thugs punks, bullies, bigots, ass holes with attitudes all encouraged by trump. Now they are out in the open, not hiding under their rocks. ", "I like how this sub has become \"look what celebrity said something bad about Trump\" shows the shallow thinking of the left and obvious bias of the sub.", "According to Trumpettes this means that hillary is going to win", "[David French on Twitter: \"I'm trying to imagine the GOP hysteria if the nation was about to elect a Dem with the kinds of ties the Trump movement has to Putin.\"](https://twitter.com/DavidAFrench/status/795737683180011521)", "But it's one thing to get donations and another to do business. Isn't it? I mean getting money for nothing versus doing business should speak to a different tone no?", "Unfortunately it's clearly enough to at least get him close to being elected... It doesn't look like a landslide at the moment.\n\nThat's really fucked up when you think about it.", "Na it's being held at the local library.  It's taking up the whole 2nd floor.", "They see democracy as the enemy.", "At this point I think it just all joke because nothing anyone says will change anyones vote by tomorrow.  \n\nDont take life so seriously.\n\nAlso this sub has been biased for the last 9 years+.  What makes you think this year would be any different?", "✓ Goal achieved.", "68 year old man can't be trusted with a twitter account so his handlers take it way.\n\nYes, yes.  Let's give this person all our nuclear launch codes.", "I don't fault people like those at Redstate. They have principles they actually believe in. Prior to this election they actually believed that they were fighting for a good cause. And towards the end of this piece he actually acknowledge his role in \"helping create the problem.\"\n\nI wish people like this the sane Republicans, luck in their coming civil war as I would prefer to have two reasonable choices in an election. Now I feel like I am obliged to vote Democratic because the Republicans are completely insane.", "Sex tape tweet ", "He's like a kid without a book report that's been stalling for time half a decade now.", "It's what got me off the Trump train. I was entertaining voting for him in the spring purely on his non-interventionist stance as I thought there was very little damage he could do domestically given the balance of powers and as a millennial I'm convinced our overseas adventures are the cause of 90% of our domestic problems. However when he refused to release his returns, I realized there was zero backup for any of his claims: he says he's good at business, he says he's a good negotiator, he says he'svery successful... but then refuses to prove it. \n\nMade me realize even if you like his policy, you can't actually trust he means it. Hillary is untrustworthy, but she's so plugged into the political system I trust she will pursue her policy positions just out of electoral necessity. Trump is just a blank slate. For all I know 100% of his wealth is from his daddy+ tax breaks he got on other people's money. That's not a resume worth electing prez.\n\nOf course once the rest of the bullshit on Trump came out over the year, in particular all the nuclear expansionism and his arguments about occupying and looting the middle east, I realized he's exactly the kind of guy who would launch a foreign war, so my position has only hardened.\n", "The most heinous thing about Trump not releasing his taxes is the fact that he's gone on and on and bitched and moaned for months on end about Hillary's emails (which the FBI **again** found no foul play in,) yet he is so righteous and justified in not releasing his taxes, and makes up a crock of excuses for why he can't. ", "No bot. No bot. You're the bot.", "My fellow Americans\n\nI love all of you. \n\nEven those whose ideas and convictions I find utterly repellent and loathsome, as human beings I care about you. \n\nI ask only one thing of you: do no harm to your countrymen and women. We are brethren, regardless of skin, or gender, or education, or belief. We *must not* harm one another to achieve political ends. If we do that thing, we are no longer a nation with any semblance of greatness.\n\nI, living in Florida, convicted decades ago of felony, cannot vote tomorrow. For anybody. So I come here now only say this:\n\n*Love your neighbor.*", "Trump made lots of s corporations to get a lower corporate tax rate.  They have to be filed as part of his personal returns.  If he released personal returns hed also be flooding info about there companies out there.  Besides embarrassing for how bad he's done, it could help the parties suing him over those companies.  So VERY against his self interest.\n\nFunny that's where he draws the line.", "Which emails did you read? I thought I'd been following the leaks pretty closely and I haven't seen anything that implied that she's crooked or bought. ", "I'm trying to think of Trump's worst tweets from this whole election cycle and I'm thinking it was the Khan feud. What else was there?", "\"Your application has been rejected for the following reason: required form missing - tax returns\"", "How about tweet him \"You're Fired\"? ", "There has been a hilarious yet disgusting double standard seen in this campaign. ", "Aaaand now I'm laughing at this.\n\nDamn you and damn me.", "https://twitter.com/kurteichenwald/status/795766721533673476\n\n&gt; Kremlin has file of compromising information on Trump with surveillance videos taken while he was in Moscow, including in his hotel.", "&gt; The other factor that many people either seem to not know or simplify away is that antisemitism was endemic far before WWI.\n\nExcellent post, and I'd like to emphasize that the eugenicist ideas that the Nazis used to justify their genocidal anti-seminism *weren't invented by the Nazis*. This, I think, is something that is *massively* neglected when we teach kids about the World Wars and it's really, really important to know.\n \nThe kind of racism the Nazis espoused was socially acceptable across the *entirety of Europe* for a long fucking time to the point it permeated academia and the work of respected scientists, people we'd like to think are immune to irrational beliefs.  \nIt was, in part, a symptom of Colonialist, imperialist violence that had been raging for hundreds of years, but most of us are taught like it was an isolated incidence of madness on part of the Germans and Hitler was a guy that arose in some kind of vacuum.  \n\n*Racism: A History* the BBC documentary series describes the intersection of Colonialism and eugenics and how it led to Nazism really well.  \n\nWhat we're dealing with now I think is some kind of neo-nazi cancer starting to metastisize across Europe and the USA again now that we're far enough removed from the mid 20th century to have grown complacent. It's far too simple to say ''DAE Trump = Hitler?'' because it's really less about Trump and more about the global social atmosphere that is allowing him to rise. Acknowledging that and dealing with it is how you stop people like him gaining power in the future.  \n\nIt's scary that the racists have been emboldened, but I'd say one major sign we're learning from the past is that scientists and academics aren't unanimously on their side anymore, like they were a hundred years ago. We have that, at least.", "talk about low energy.. /s", "He is not complaining that the average is +4. The fishy thing is the variance around the average. Outliers should  exist but no polling firm wants to be the outlier for the final poll of the cycle. ", "No he wasn't talking about Trump. ", "No it means it's rigged. ", "Build! Those! Stakes! ", "That's exactly what I would say if I was wishing to be paid for it.", "it wouldn't it didnt even happen for Obama in 2008 when he had clearly won before the west coast states polls closed. ", "Him and David Fahrenthold are the two silver lining in this awful election. ", "Let's hear it for Thinks He's At Church Man who doesn't know he's being picked up by the Mic but keeps shouting agreements. ", "This right here. Take note Donald-supporters: Hillary winning doesn't put anyone's individual rights in jeopardy the way a Donald victory would.", "Silver is suspicious that a whole slew of national polls released today all show Clinton +4:\n\n&gt; It’s worth raising an eyebrow though, when the polls (other than the L.A. Times) show a range this tight at the end of an election, especially given that they’d diverged so much earlier in the campaign. That probably reflects some degree of herding — for instance, because pollsters stick surveys that seem to be outliers in a file drawer rather than publishing them. So the tight range of polls shouldn’t be taken to mean that everyone’s figured exactly how to poll this challenging election just in the nick of time. Still, the polls clearly agree that Clinton is the favorite, and perhaps has a slight wind at her back for Election Day.\n", "Can't it be both?", "Nate Silver sounds like he's trying to hedge his bets in case of a possible systematic polling error.\n\nA lot of people points to his mistake on Trump in the primaries but his numbers weren't wrong on Trump, his punditry was. If anything it'd probably be Michigan, where all the polls were wildly off.", "I want Florida to be able to count their votes successfully by the end of the night", "I demand a re-mail.", "You and I have very different memories of how Reddit was during Bernimania", "do you believe in the ability of video to accurately depict real events?", "&gt;no shenanigans from either side\n\n&gt;I want both candidates to accept the results no matter what.\n\nCome on you *know* if there's gonna be any shenanigans, or questioning of the results, its going to be coming from one particular side only. \n\nLet's just keep it real, there's no need to do the whole \"both side are equally bad\" song and dance.", "How are we going to make America great again if everyone's smokin' the devil's lettuce?", "People will bitch but she HAS to take the money.  You can argue against how the game should be played, but you've still got to play the game and win before you can change the rules.  ", "Yeah you've got all these pundits acting like Trump still has a chance then you swing over to TheDole and see all caps rants about Lady Gaga being satanic with 3500 upvotes so...", "Were I a betting man I'd say the major polling outlets have probably missed the latino vote in FL, AZ, NV etc. bigly.\n\nThe Latino Decisions and Univision numbers seem much more reflective of what we've seen from early voting than the majors.", "It must be killing him that a deeply respected highly successful *black* person is mocking him and he can't lash out in a fit of pathetic rage.\n\nSad.  Failing.", "Same tune when none of that happened with Obama. \"Oh the next Democrat will be the one true Satan for real!\"", "Do you have a second to look at a Breitbart article or perhaps a 40 minute youtube video that proves she's the devil???", "I'm really jealous of Trump supporters. We've been miserable for an entire year of horrible campaigning while they get to all high five each other in their alternate reality and only actually have to spend a couple weeks disappointed.", "It is \"known\"\n\nI just found out there is a conspiracy about his blindness and I immediately jumped onboard.", "i do remember. i was working on his campaign in Ohio. the election wasn't \"called\" officially. ", "With all those celebrities she's a *cheater*.", "I hate polls. However I'm proud to have voted for Clinton. Someone can mark that down in an exit poll somewhere. ", "Not even close to equivalent even though wikileaks leaked her speeches already and man are they...non inflammatory", "Trump is the biggest tax dodging welfare queen in the US history.", "Look in a different race with a candidate other than Trump, I'd be a lot more charitable and even-handed. But Trump's aides have to hide his phone from him like parents take away a child's toys. People close to him literally don't trust him with a Twitter account.", "Funny enough the red states that do everything in their power to cut benifits to the poor keeping their rural whites impoverished are the same states that will vote red because they believe it's Obama's fault.", "You are on the wrong side of history.", "Yep he really cares about America so much that he can't even donate any of his \"billions\" to charity. I'm sure he'll be just as generous with us.", "It's making fun of Trump saying he prefers soldiers that aren't POWs", "Actually.. this is a great argument why after 2016 he's done... \n\nHe can't run in 2020 saying that he's still being audited for 2016 tax returns. \n\n", "Obama's speech was critical because it framed it historically. How democratic presidents bolstered the economy while Republican presidents keep it flat. \n\nI remember that day when he was elected, and that dog joke he said to his daughter. Fucking hell, how the assholes obstructed him.\n\nBut as in the movie Contact, \"Small moves, Ellie.\"\n\nProgress is long and slow and takes multiple presidencies. Hillary is the most incentivized president in history to do well. She's also the most experienced.\n\nAs the first possible woman president in the most powerful office in the world, I wish her luck.", "It's the sexual repression. We need to find better ways to release our frustrations. \n\nI think the Republicans should try jerking off sometimes mellows me out a ton and I haven't been struck by lightning, yet.", "Since a majority of us Berners are now voting for her grudgingly makes sense.", "If only there was a single entertainer in America that supported Trump then we could compare who had the better live performance and concert. Then we could decide who to vote for! Darn. ", "It didn't work for Rubio. His numbers immediately tanked when he made the penis joke about Trump.", "oorrr... it's \"look how we *and* celebrities are having a good laugh mocking Trump\" because he's a horrible bastard who deserves lashings of his own mean spirited bile and it's fun.", "2 days ago Nate said the fact that all of the national polls showed Clinton up 2 or 3 was proof that his model was spot on. Now that the polls show Clinton up 4 or 5 he claiming that they are cooked...\n\nI've been defending Silver lately but this is just dumb. ", "If he loses November 9th will be the day to rub their noses on it. No one will be able to control him anymore, even to the limited extent they have. He'll be at his ugliest and most pathological in the same moment he loses his only reason to hold back\n\nWhen that happens, it'll be time to turn the heat on all the people who allowed or even aided him to get this close (and praise the tiny number of Republican leaders who didn't soil themselves by endorsing him.)", "Different audiences.  Rubio appealed to what used to be mainstream republicans.  They don't like that sort of thing but they're now a minority within the party.  He embarrassed his own supporters and wasn't crazy enough to win over Trump's so his little experiment failed.  They were never going to switch to Rubio.\n\nWhat I'm saying is that there is an audience for this type of thing.  You just have to make sure that it's your audience.  ", "I don't think all do - but many people weren't born blind it happened over time. It's probably geared towards them.", "Of course he lied about this.\n\nWhy wouldn't he lie about this?", "Text of Belichick's letter:\n\n\"Congratulations on a tremendous campaign. You have to help with an unbelievable slanted and negative media and have come out beautifully. You have proven to be the ultimate competitor fighter. Your leadership is amazing. I have always had tremendous respect for you for the toughness and perseverance you have displayed over the past year is remarkable. Hopefully tomorrow’s election the results will give the opportunity to make America great again.\n\nBest wishes for great results tomorrow,\n\nBill Belichick.”\n\nI have some doubts...\"tremendous\" (x2), \"unbelievable\", \"beautifully\", \"remarkable\" ", "Its fallen by the wayside in this election b/c of the vitriol towards Clinton. But I find it remarkable that there are women voting tomorrow for her that were born before they had the right to vote. In their life time they've gone from fighting for the ballot to voting for a woman on one. \n\nIdk. Kinda a big deal. ", "The question is why would a sane person lie about something like that knowing they could get called out on it so easily. At this point, I think it's likely he's a pathological liar on top of being a narcissist.", "This reads like Macs letter to chase utley", "Whoa if the fact that Trump is a compulsive liar comes out before tomorrow this could SERIOUSLY harm his chances at winning the presidency!", "&gt; why would a sane person lie about something like that\n\nYou answered your own question. Trump lives in his own reality one which he's constantly constructing as he goes along.", "Imagine if something crazy happened like there was some evidence of him *bragging* about sexually assaulting a woman. Like, not just saying he abuses power, but he literally says something about grabbing women by their vagina? How crazy would that be, now *that* would definitely be a campaign ending event, right?", "He also said that Bill Belichick endorsed him which as a die hard Patriots fan I'm calling bullshit on. There is no way BB would endorse Trump in the middle of the season if that meant a media shitstorm causing a distraction to his team. ", "&gt; I'm more concerned with the complete lack of consequences for openly lying as an entire campaign platform. Pence's debate where he said with a smug look \"Trump didn't say that\" to a half-dozen things Trump said on video while suffering zero consequences and even being called the winner of the debate is the biggest threat to future debates. There is no reason for any politician to tell the truth as Trump/Pence showed voters don't give a shit about facts.\n\nThis is the real issue. All that matters is that it sounds plausible to the uneducated masses that support him. That's it.\n\nRemember how he claimed that Obama screamed at a protester? Even telling people to go watch it themselves? The guy could lie to you about something that he is CURRENTLY DOING, and the people who support him would not care.", "When trump read that belicheck letter outloud I turned to my wife and said, \"yeah.....that sounds like something trump wrote himself. \"", "Second greatest common characteristic of Trump supporters is hate.  \n\n", "Like...I can't believe I'm saying this but there's no way he'd just fucking fabricate something like this.  It's just that it reads nothing like how I'd expect a Belichick letter to read, and it seems like it's insanely out of character for Belichick to do something like this.  I honestly think Belichick would let the world burn to the ground before putting a win in danger so I'm just not sure why he'd risk any type of discord in his locker room.  I can't find anything on him ever doing anything political before.", "Way to get the Pittsburgh vote Donald.", "I want Clinton's victory to be absolutely merciless. ", "Did you see the letter Trump is claiming that Belichick wrote? It's written in very clear Trump speaking style with repeated use of \"tremendous\", as well as other classic Trumpian adjectives. It's just so pathetically, transparently obvious that it's a forgery. Like, who the fuck does this buffoon think he's fooling?", "Women also covered Anthony's grave with these stickers during the New York primaries. Even if you don't support Clinton you gotta admit it's pretty cool. People online always dismiss our enthusiasm but this wasn't an ordinary election season to many of us.\n", "Sure my supporters are as cartoonishly evil as villians in an afterschool special, but isn't the real monster here a woman who had an email server? -Trump", "Like someone said one day he will look directly into a camera and say he never ran for president. ", "Nah only if a dozen or more women came out, many with corroborating witnesses, and said that he actually *did* that stuff to them would it guarantee him losing almost every single state.", "\"I do not condone his views on the Jews but I still support Hitler for president\" - Paul Ryan", "Low IQ.", "The letter from Belichick according to Trump:\n\n&gt;\"Congratulation on a tremendous campaign. You have dealt with an unbelievable slanted and negative media and come out beautifully.\n\n&gt;You've proved to be the ultimate competitor and fighter your leadership is amazing. I have always had tremendous respect for you but the toughness and perseverance you have displayed over the past year is remarkable. \n\n&gt;Hopefully tomorrow's election results will give the opportunity to make America great again. \n\n&gt;Best wishes for great results tomorrow, Bill Belichick\"\n\nBelichick *may* have sent a letter but 100% guarantee that this isn't it. This is written in pure Trump speak. \n", "&gt; May 2014: ...**[I]f I decide to run for office I’ll produce my tax returns, absolutely and I would love to do that...**\"\n\n#\n\nHow in the fuck has this guy gotten this far? ", "In a state where the margin is razor-thin an extra percent or two makes all the difference.", "Too many people are ready to jump on you for even acknowledging that you're voting for a woman. As though we can't objectively decide a candidate is superior while appreciating the historical nature of her candidacy. It's been 43 men in a row but the one time it's a woman suddenly we're being \"irrational\"...\n\nThere's a word for it, but it triggers half of Reddit.", "How about this one: https://twitter.com/realdonaldtrump/status/769571710924263424\n\n&gt;Dwyane Wade's cousin was just shot and killed walking her baby in Chicago. Just what I have been saying. African-Americans will VOTE TRUMP!\n\nWho the hell reacts that way to a murder???", "Lol. When I heard Trump say this I literally thought to myself that he probably made this up. Came on here and confirmed.", "Brady's a smart guy and keeping who he supports private is probably a good thing for him.\n\nWhether he's going to vote for Trump or not, I definitely can't see him wanting Trump to go out and announce that publically", "I'll **never** forget the hateful scum bags that supported Trump.  Never.\n\nPlease everyone be safe tomorrow.  Trump supporters are dangerous hateful, and ignorant.  If attacking a disabled boy like this isn't beneath them, nothing is.", "A husband is a Trump supporter. The husband expects his wife to vote for Trump. She doesn't. He doesn't know.", "This may not be Trump's *worst* tweet but one his most infamous was [the one on Cinco de Mayo](https://twitter.com/realdonaldtrump/status/728297587418247168?lang=en). He promoted Trump Towers' taco bowls, and declared that \"[he] loves hispanics!\"", "[Asians lean towards Clinton](http://time.com/4346730/hillary-clinton-donald-trump-asian-american-poll/) although they make up a ~~minuscule~~ small but important portion of the electorate in those states: \n\n~2.5% in FL\n\n~4% in AZ\n\n~5% in VA\n\n~2.5% in NC", "It makes me proud to know my little daughter will grow up knowing she could be President some day.", "Same reason he lies about everything. He can get away with it because he's speaking in an echo chamber to a crowd that hears only what they want to hear.", "I agree. It's incredible that such a huge accomplishment has been mostly ignored. It feels like she isn't really allowed to talk about it but it is momentous ", "How is this politics?", "He's the only train left going to Hillaryisthedevil Town", "...did you just create this subreddit just to make this post? So you made the subreddit created the first post, wrote up this description, and posted it here, just to make a joke? God damn, that is commitment. ", "I seriously don't understand who this buffoon thinks he's fooling with this letter. A fucking 10 year old could figure out that this didn't come from Belichick.", "You must be new here", "It appears to be that some people (\\*\\*cough** Paul Ryan \\*\\*cough**) care more about the Republican Party than the country.", "As a person with no African American heritage I was incredibly proud of America in November 2008. As a man, I hope to be proud of our progress tomorrow. It is a big deal!", "The first is.... Orange? ", "Not a Clinton supporter obviously.\n\nStill, this stirred my feelings.", "A narcissist like trump would like nothing better than to have an excuse to show his tax returns to the world **if** they didn't contain something **very** embarrassing.", "Man the war on christmas is going to come as such a relief after this election", "I think it was clear in the debates that Clinton was playing chess while Trump was playing tic-tac-you-puppet.", "I think if the media were more honest the fickle voters would have more consistently punished trump in the polls for his behavior. But the media needs a horse race and \"trump still losing\" isn't going to get clicks. \n\nThat is what Trump has exploited. The fact that no matter how far down the rabbit hole he went the media followed him and tried to find a way to create a narrative that both sides are pretty close. While Trump had a steady stream of new and interesting scandal, just as much time was dedicated to whatever fault of Hillary they could find. That's why her email scandal became so repeated, because it was really all there was to work with. \n\nAnd every time Trump made up some insane claim about Hillary, the media made sure to report it. Treating his rants as \"Trump says Hillary will invite 650 million Syrian refugees if she wins\" instead of \"Trump lies again about Hillary, this time involving Syrian refugees\" or even the more neutral \"Both candidates' actual plan for Syrian refugees\". ", "I stopped by it today and since NY does not have early voting there weren't any stickers on it yet. Tons of flowers, letters, stones and stuff though.\n\nOne lady who looked 80 was hanging out there telling a young couple about surviving breast cancer and having to get a mastectomy because pre-Obamacare insurance wouldn't cover treatment. She was pretty badass.", "So... he just sold property to them. And they paid Hillary around $25 million to influence her decisions. How dense do you have to be to not understand the distinction between the two?", "As someone else in this thread said writing a letter like this (which is guaranteed to create a political shitstorm around the Pats) is a gigantic distraction to the season and *definitely not* something Belichick would normally do", "How deflating it must be for Donald that Tom didn't vote for him.", "It's amazing the people that you'll get to support you when you're the only thing standing between the US and an authoritarian dystopia.", "I remember 8 years ago, being disappointed with Hillary Clinton for the fabrication she gave us about landing under fire in...what was it?... Bosnia. It was so clearly forced and unnecessary. Trump pull one of these whoppers out of his rear end every other day. \n\nI have high hopes that Belicheck will make one of his understated, flat statements about this. Something like: \"Never happened. Trump made the whole thing up. I think he's an idiot.\" ", "Nothing else comes close to this the one after the Pulse shooting. At least in terms of an utter lack of human decency.\n\nhttps://twitter.com/realDonaldTrump/status/742034549232766976", "Yeah it's much more powerful to be able to say, \"See, you can be president too.\" than \"Maybe you'll be the first\"", "Well you have to remember if Hillary wins 55-45 that's a landslide. a Solid 40% of people are hardliners to one party or the other. I'd hazard the absolute maximum possible vote split if 60-40 and that would be basically if George Washington was running against Hitler.", "I thought the same. Way to pander to the four electoral votes. Lol", "Thank you for taking the reasonable position as a conservative. I mean that sincerely. My biggest issue here in NC is the gerrymandering. Both parties made a trainwreck of our district lines and the partisan obstinacy about it on both sides is shameful. We need to *fix the lines* in 2020 or we're doomed to have a non-representative state government. My worst political fear for NC is the gerrymandering never ends.", "I would love to put a vote sticker on the museum house of Alice Paul who actually led the suffragettes. THEY were arrested and sent to the Occoquan prison, led hunger strikes, and were beaten and force fed. It's in DC:\nhttp://nationalwomansparty.org/learn/\n", "She's smart *and* innocent of a crime? We need to keep her out of the White House at all costs!", "5% is a lot. That's like Trump's chance of winning right now", "Minorities all across the U.S. are realizing that if it's the mexicans and muslims first it can easily be them next. First they came for the....", "Sure he can. He hasn't released his 2012 taxes or his 2008 taxes either. His arguments don't make any sense already. It won't make a difference in four years.\n\nWhat WILL stop him is that a lot of his supporters think of him as a winner an alpha male. Losing to a nasty woman will make him look weak in a very primeval way.", "I don't know man. It feels like Tom Brady voted for Trump. That's good enough for me.", "Please do. Let's defeat this hate machine with big numbers. Go and vote. Even if you think she'll win just go vote. Let's make this a huge number. ", "No need to cough. Say it loud **PAUL RYAN**. It's unfortunate he's so loved in Wisconsin. I wonder how much longer that will last?\n\nI found [this list](http://www.theatlantic.com/politics/archive/2016/11/where-republicans-stand-on-donald-trump-a-cheat-sheet/481449/) on *The Atlantic* last night and was *not* amazed at who supports Trump and who doesn't. ", "I can't speak for anyone else but I living in a firmly red state. I'm voting Hillary but I wouldn't slap an I'm With Her bumper sticker on my car. I know several people that have had their vehicles vandalized.", "When people talk about conservative areas being left behind by the modern economy I feel like what's always left out of the discussion is that for lots of workers and entrepreneurs socially conservative areas are just terrible places to live and work. They wouldn't be so left behind economically if they weren't so deeply alienating to so many skilled and educated workers.", "&gt; Asian-American voters have increased across the board in key states being targeted by both presidential campaigns. That's according to an analysis by Catalist a Democratic analytical firm.\n&gt; \n&gt; The racial group in more recent presidential elections has tilted heavily Democratic.\n&gt; \n&gt; Ballots from Asian-Americans have roughly doubled in Florida, Arizona, Virginia and North Carolina.\n&gt; \n&gt; In Georgia, ballots from the group have almost tripled.\n&gt; \n&gt; Smaller in population, Asian-Americans typically make up about 1 percent to 2 percent of a state's vote share. But they have become more pivotal in closely fought battleground states with larger numbers of their communities, such as Nevada and Virginia.\n\nSounds like good news for Clinton, but don't be complacent: VOTE!", "&gt;We've come a long way. We have a long way to go.\n\nI just went in to a mini existential crisis. \n\nWhat is out destination? Where is the end? Your statement is always going to be true for humanity as a whole. No matter how far we go.\n", "Well it should make everyone upset.\n\nThe problem is for about 40-45% of voters in this country it's more important to them that (1) rich people they don't know have their taxes lowered and (2) women they don't know no longer have a choice.\n\nDon't accept their denials because it's a *fact*, GOP voters don't give a *shit* about the civil rights for anyone not White, Straight, Male, *and* Christian, and I mean you have to be *all 4* of those things. If you're not then fuck you, you're just a single issue voter.\n\nThe GOP needs to be stopped from continuing to ruin our country. When that party wants to wake up and join us in the 21st century, then I can cautiously consider giving a secular, moderate conservative my vote.\n", "Republicans like you give me hope for the future of the party.", "That's why its called progress. ", "This. This is totally politics. Front page material! A+ r/politics! May your unbiased stance on all things political shine like the light of justice through the murky filth that reddit has become!", "How many lights do you see? ", "Was it Romney that said something along the lines of \"whatever's in those taxes it's even worse than shooting someone on 5th avenue\" ?", "¿por qué no los dos?", "The RNC isn't an organization that has shown a history of learning from its past mistakes.", "Who knows. Maybe this Trump TV will be as successful as Trump Steaks.", "Can't wait to cast my first vote as an American Citizen tomorrow for Hillary Clinton.", "And Ghandi beat his wife and Hitler was a vegetarian and loved animals. Do you want to bring up any other historical trivia in some 10th-grader-who-has-read-a-few-books effort to paint people as hypocrites?", "There... Are... Four... Lights!\nhttps://www.youtube.com/watch?v=o_eSwq1ewsU", "Not possible.\n\nTrump never pays the people he hires.", "&gt;Might as well fly an Isis flag.\n\nY'All-Qeada", "Fascism 101", "There is 0% chance this is true.", "I wholeheartedly agree. Everyone should go and vote.", "This horse is _impossibly_ dead.", "*Leaning into steering wheel*\n\n\"Wrong.\"", "\"Oh man I'm craving a steak, pass me that Sharper Image catalog.\"\n\n-Nobody.", "And may God help us all. ", "No. No they can't. It just *feels* like there are some particularly damning emails in there.", "Lol that \"doctor's note\" he tried to pass off was the most laughably transparent thing ever. He couldn't have written it in more obvious \"Donaldese\" if he tried. \"MY PATIENT IS IN TREMENDOUS HEALTH ABSOLUTELY TREMENDOUS. HE HAS THE BEST HEALTH. HE'S THE HEALTHIEST PERSON EVER TO RUN FOR OFFICE, GUARANTEED\". It was literally that stupid. I'm starting to think being a great conman is not really about being clever with your trickery, it's just about being confident and brash that you are feeding someone a shit sandwich and they are going to eat it. ", "It really lets the air out of his campaign ", "This is amazing.  Trump completely fabricated this letter.  He's gone off the deep end.  He wrote the letter himself.  There's no way in hell Belichick doesn't call him out on this.  \n\nUpdate: Yahoo! News reporting: https://twitter.com/hunterw/status/795848178650202112\n\n&gt;Records show Tom Brady's voter registration is currently inactive and he's not enrolled in a party.\n\nUpdate: https://twitter.com/hunterw/status/795844534366306304\n\n&gt;Bill Belichick just hung up on me.\n\n&gt;As I asked about the letter Belichick said \"I'll get back to you later\" and hung up. He has not answered a followup text.\n\nUpdate: https://twitter.com/ESQPolitics/status/795829791417106432\n\n&gt;Belichick known for being a quiet supporter of D pols and liberal causes. I smell an orange-maned rat behind that letter.\n\nUpdate: Tom Brady's wife says they're not supporting Donald Trump\n\nhttp://profootballtalk.nbcsports.com/2016/11/08/tom-bradys-wife-says-theyre-not-supporting-donald-trump/\n\nUpdate: @AdamSchefter: Tom Brady agent Don Yee on speculation of Brady vote: “Tom does vote but like many Americans, prefers to keep his preferences to himself.”\n\n", "Bill Bellichick did not write that letter. As a Patriots fan for over 20 years that is not how Bill speaks. In addition, Bellichick would never do something to intentionally bring media distractions to his team. \n\nI'm 100% certain that this is as valid as his medical history. ", "Trump's campaign just announced that he did not quote Belichik's letter accurately and the original text is below:\n\n&gt;\"Congratulations on a tremendous campaign. You have dealt with an unbelievable slanted and negative media with blood coming out of their wherever -- sad! -- and have come out beautifully. You proved to be the ultimate competitor and fighter, and your hands are so bigly I would hire you as a wide receiver. Our brilliant team doctor agrees you would be in the best shape on our team and are totally not obese. Your leadership is amazing and a lot of very smart people are saying you would be the best head coach of the New England Patriots. I have always had tremendous respect for you but the toughness and perseverance you have displayed over the past year shows more stamina than every player in the NFL combined, believe me. By the way, Melania is a total 10 and clearly there is no problem downstairs. \n\n&gt;Your best friend who totally wrote this himself,\n\n&gt;Bill Bellechek\n\n&gt;P.S. Tom was telling me in the locker room you can grab Gisele by the pussy anytime. We always talk about things like that in the locker room, that I can tell you.", "https://twitter.com/hunterw/status/795848178650202112\n\n&gt;Records show Tom Brady's voter registration is currently inactive and he's not enrolled in a party.\n\nRemember the imaginary NFL letter Trump said he got?\n\n&gt;Donald Trump complained Friday that Hillary Clinton and her fellow Democrats were rigging this fall’s presidential debates by scheduling them alongside NFL games. That claim was easy to disprove — the debate schedule was determined almost a year ago by a private group made up of both Democrats and Republicans.\n\n&gt;“I’ll tell you what I don’t like” Trump told George Stephanopoulos. “It’s against two NFL games. I got a letter from the NFL saying, “This is ridiculous.'”\n\n&gt;Just one problem with that: The NFL says it never sent him a letter\n\n\n\nhttps://www.washingtonpost.com/news/early-lead/wp/2016/07/30/nfl-refutes-trump-claim-that-it-sent-him-a-letter-bashing-debate-schedule/\n\n", "An excuse for hate is still hate. Doesn't matter if you support Trump or not they committed a hate crime. Law and order is not subjective.", "Think how this would divide his locker room.  Belichick had nothing to do with this letter.  Donald Trump completely fabricated this letter.  It's really quite amazing that this is where we're at. ", "Trump couldn't vote for himself then.", "You don't appreciate what you had until it's about to be gone.\n\nRepubs are realllllly gonna be wishing they hadn't tried to stonewall every one of Obama's moves.", "He's not going to concede. I wouldn't be surprised if he just pretended he won and told his supporters that he's president now and he'll be making his own laws now for them to follow. ", "We've pretty much established what they might contain anyway:\n\n- His charitable giving is non-existent\n- He hasn't paid a dime in federal taxes for 18 years\n- He's got extremely dodgy financial ties to Russian and other foreign money-men\n- His net worth is substantially less than a billion dollars\n- His business acumen is seriously lacking\n- He's used tax-avoidance techniques that he was warned about and are now illegal\n\nAnything else?\n\nThere's proof for all of this from other sources so we don't need to see his returns to know these things for sure.\n\nAny of those would have been considered a bomb-shell in an ordinary campaign, but... here we are.", "This election really brought to light just how many people still have such violent and racist tendencies and beliefs. It's truly sickening. ", "My 97-year-old gran died last month. She was a New Deal Democrat. She took great pride in the letter she got from the Obamas on her last birthday. She grew up in a shitbox outside of Boston. I don't know if she did an mail-in ballot before she went but either way my vote tomorrow is for her. ", "This letter reminds me of when I tried to forge my parents response/signature to a note home in first grade.  ", "It boils my blood that people immediately say that gender and race shouldn't help a person get a position whenever a woman and/or person of color is chosen for well, *anything.* \n\nFirstly, it implies that there's no other reason why someone besides a white male would be chosen. As if they couldn't possibly have been the best candidate. Secondly, it suggests that race and gender have never factored into the decisions *before.* As if all X number of people on the board or whatever else just *happen* to have been all white and male for X number of years. Hahaha...", "Republicans cant deny who their base is anymore. The plausible deniability of the Bush years is over. \n\nNo more \"how dare you insinuate that! You're the hatefull ones; the PC police!\". No more race baiting and playing dumb. \n\nYou have to acknowledge your parties problems or admit that you are one of them. ", "Such a nasty error. ", "\"Hitler never said he wanted to kill the Jews that's ridiculous.\"\n\n-Mike Pence", "This blows my mind. Even if it was legit (it's not) why would he align himself with one of the most hated teams in pro sports for a chance at 4 electoral votes. \n\nThis whole thing is just the final joke of an absurd campaign, beginning to end. ", "Same as the debates. The pundits were mostly just \"Trump just fell apart!\" without noticing that, like, this did not happen in the primary debates. None of the other 16 candidates could pull it off. \n\nClinton planned out how to get Trump to go ape and then executed the plan. The Khans and Alicia Machado didn't \"just happen\", they were carefully-plotted traps. ", "Yeah there is no world in which Bill Belichick writes a letter to Donald Trump out of the blue and use the words that this letter contains.", "Trump would absolutely fabricate something like this.\n\nIt could hardly be more obvious that this is a fabrication if the letter used the word \"bigly\" three times and complimented Trump on his sexual prowess and the size of his hands.", "If we research every single Washington politician with the microscope that people have looked at Hilary Clinton her emails wouldn't even be a top 100 or 1000 concern. \n\nEven disregarding Trump being Trump, should we really talk about emails when we're a country that can't even pass a budget adequately? When we spend millions Benghazi investigations and repeal Obamacare but have trouble passing law that give medical help to 9/11 first aid responders? \n\nFor fuck sake on the list of Hilary Clinton concerns her emails isn't even top 10 for me. Off the top of my head, her warhawk tendencies in foreign policy, her being free trade but lack the follow through to help the poor hurt by such deals, these are the things that actually matter. FUCK EMAILS. Can we talk about some legit concerns with Hilary if that's the problem with her.\n\n", "And these are the people who always complain that others are too \"easily offended.\" Then a disabled kid shows up and protests their candidate and they fucking attack him. Jesus Christ.", "I'm going to miss the The_Donald tough talk.  None of you dorks are fighting for anything \"in the streets\".  You'll all sit online and whine about it like you've done for the last year because that's all you're capable of. ", "Jesus Christ how bat-shit is Coulter.\n", "Trump finally united the country. Republicans and Democrats agree there's no fucking way Bill Belichick wrote that \"letter.\" That is just not how he rolls. I am amazed that I am amazed by this. ", "Neither could his kids.", "You're right.   We won't be tolerating the racism sexual assaults, hate speech, and threats the trumpsters have been dishing out.  ", "When Trump endorses himself as another person...", "Its anti trump. The only qualification needed for this sub. Im sure a video of his hair flailing in the wind would make front page. ", "No they won't. Have a feeling they will double up on Clinton.", "[This 102-Year-Old woman slayed by voting for Hillary in a pantsuit](https://www.yahoo.com/style/102-year-old-arizona-woman-casts-early-vote-for-clinton-wearing-a-pantsuit-145648646.html?soc_src=social-sh&amp;soc_trk=tw)", "He did confirm in the interview this morning where he said that he hadn't voted yet that he will tell them next week who he voted for.  As a Pats fan, this does make me a little nervous.  They are friends.  ", "Good first draft needs some revision.  Unbelievable dialogue, too coherent, too many syllables, unrealistic level of self-awareness.  \n\n-Teacher", "People are recognizing what they've had and that he'll soon be gone.\n\nDamn 22nd Amendment. \n\nBut, in Clinton, at least, we have a chance to elect someone who will give continuity to Obama's policies rather than uproot them. That way, we can continue to make progress instead if having to have to first undo damage before we can move forward again. The [Democratic Platform](https://www.demconvention.com/wp-content/uploads/2016/07/Democratic-Party-Platform-7.21.16-no-lines.pdf) that Clinton committed to through negotiations with Bernie is the most progressive in history. There's reason to be legitimately hopeful and excited. We will need to organize both to force her to fight for it, and to exert pressure on Congress to act.\n\nIdeally, we'd give Clinton a Democratic House to work with, as well. But, in any event, this election is a chance to reject not only the politics of Trump, but the maximalist Republican obstructionism that eroded trust in our democratic institutions and enabled his rise. \n\nThat's why President Obama is campaigning so hard for her. \n\n", "The \"people\" who did this to her are lower than whale shit. I hope they get exactly what's coming to them.\n\nA taste of Trump's America folks.", "It demonstrates something about his speeches and preparation. \n\nIt's patently written by Trump himself maybe even made up on the spot. However, if he wanted something more convincing, then Bannon or Conway or Ivanka or even his pilot could have written something more plausible in two minutes. Easy. \n\nBut *he won't listen.* He has to be right all the time.\n\nTrumpists reading this know he fabricated it. I guess truth doesn't matter.", " North Carolina is also almost ground zero for racist voting laws\n\n[they cut early voting hours in minority areas](https://www.google.com/amp/s/thinkprogress.org/amp/p/fcffa0151748?client=safari)\n\n[they eliminated the ID black voters were more likely to have when they crafted their voter ID law](https://www.washingtonpost.com/news/wonk/wp/2016/07/29/the-smoking-gun-proving-north-carolina-republicans-tried-to-disenfranchise-black-voters/)\n\n[emails showed how the GOP specifically targeted black areas to limit early voting](http://talkingpointsmemo.com/muckraker/more-gop-emails-emerge-that-urged-nc-elections-officials-to-limit-early-voting)\n\n[they tried to purge thousands of voters right before the election](https://www.google.com/amp/mobile.nytimes.com/2016/11/05/us/north-carolina-voting-rights.amp.html?client=safari)", "I hear this narrative getting pushed a lot and you know what?\n\nI just don't fucking buy it anymore. I'm so fucking sick of it.\n\nI've heard over and over and over that she's \"shady\" or \"crooked\" or whatever you want to say, but I haven't seen any of this damning evidence that everybody seems to think is so obvious. I've been hearing this about her for the 15 years I've been following politics, that she's shady and \"crook\", but I have yet to see any actual proof. \n\nI wanted it to be true. I honestly did, I was a former bernie guy (even caucused for him), and I was seething with anger at her when he lost. I wanted a bombshell to sink her career. But everything I've seen is just pathetic, circumstantial, desperate grasping at straws. \n\nShe's been vetted more thoroughly than any candidate in history, and they've got *fucking nothing on her.*\n\nShe's not \"almost as bad\" as Trump. She's *fine.* That's just an attempt to drag her down to his level and make him seem more legitimate.\n\nAnd I'm a redditor of about 6 years, by the way.", "I cant get enough of these", "Yes. It's evil (and blatant favortism/suppression) when NRA membership cards are counted towards an ID yet college/school IDs are not. ", "Like he literally just runs up to the window threateningly shouting \"Trump, Trump, Trump, Trump, Trump!\" Like it is some magical word that banishes black people, before calling him the n word a few dozen times.", "Yup! It was just purely coincidental that all previous presidents have been male. Really statistically amazing streak but purely coincidental. So, understanding that none of our previous elections (including the congressional elections that might be stepping stones to the presidency) have been influenced by people voting based on gender, I'm just appalled that in 2016, for the first time people are now voting based on gender - and doing so to boost a female candidate over a male candidate who is clearly more qualified (he is obviously the one who would win if we were blinded to gender)! /s", "This election had been horrible for my heart but great for dank memes. ", "Even before safe spaces I'm pretty sure kicking a disabled kid's wheelchair was frowned upon.", "It better be. But if its anything like RCP's [No Toss Map](http://www.realclearpolitics.com/epolls/2016/president/2016_elections_electoral_college_map_no_toss_ups.html) projects were in for a long November. A large margin is key to shutting down any skepticism. No Bush v. Gore stuff.", "Beautiful. Tremendous. \n\n\n", "Meh people are entitled to vote for whomever they choose. I'm interested to see if Trump told the NH rally that Brady was going to vote for him without Brady's permission", "Each and every ballot could be litterally counted one by one by one in front of his stupid orange mug and he'd still question the outcome. The man does not live in reality nothing will convince him to change his mind once it's made up. He's a child.", "We should all take a step back and realize we're in an election where two candy companies have disavowed a nominee for president.", "His campaign staff have worse tweets...\n\nhttps://twitter.com/KatrinaPierson/status/160181303680040960", "I personally liked \n\n&gt; I don't even have a social media account you know why? Because White lives matter\n\n...What?", "Not just a pantsuit a WHITE pantsuit. (White was the colour of the suffragettes)", "just a couple stops more down the list:\n\n&gt; So today I was lookin at a girl bcuz she had a piece of lettuce in her hair &amp; she looks at me and said \"I have a boyfriend\" ok lettuce head", "Incredible. You'd think he'd at least donate for the tax dedu-\n\n...Oh.", "&gt;...  Jennifer lived with other models in the Trump Model Management's East Village duplex known in the business as a \"models' apartment,\" where she shared a basement bedroom packed with bunks and models from all over the world.\n\n&gt; \"It's the worst place I've ever lived in my life,\" she recalled. \"Jails are cleaner than the Trump model apartment.\" Here, like the other women Mother Jones interviewed earlier this year, Jennifer paid sky-high rent for her bunk, fees that were later subtracted from her overall pay for agency-booked gigs. Jennifer doesn't recall the precise amount of rent she paid \"but it was way too overpriced, for sure,\" she said. (A detailed financial statement provided by Blais showed that Trump's agency charged her as much as $1,600 a month for a bunk in a room she shared with five others.)\n\n&gt; \"I never made any money with Trump, not because I never worked, but because my expenses were always higher,\" Jennifer said. Her description of paying exorbitant fees that swallowed up her modeling income matched claims made by other former models, ... \n\nThis is touching on [indentured slavery](https://en.wikipedia.org/wiki/Indentured_servitude_in_the_Americas). ", "The funniest thing about this is that Trump's mother was born in Scotland. That means that Trump and all of his kids couldn't vote under Coulter's plan (not to mention Melania) but Hillary, Bill and Chelsea could.", "BB is friends with Trump and I wouldn't be surprised if he voted for him.  Actually I take that back I would be surprised, because there's about a 45% chance Belichick doesn't even realize there's an election going on.  There's no way he'd introduce this potential distraction mid-season.", "As if you can show Trump anything contrary to his feelings.\n\nBut let's bury him in a hillslide to show every other wannabe authoritarian fascist they can't win the day in America.", "*When I'm gone (when I'm gone)*\n\n*When I'm gone (when I'm gone)*\n\n*You're gonna miss me when I'm gone*\n\n*You're gonna miss me by my walk*\n\n*You'll miss me by my talk*\n\n*You're gonna miss me when I'm gone*", "Can we start calling out the confederate flag as the racist symbol of slavery that it is?\n\nor rather can we continue to do so? ", "Have you seen the other post with the text of the supposed letter? Not a chance in hell that it was written by Bellichick.", "At least one day too early. Let us see who gets closest to the margins in each state.", "And yet nearly every corner of the Globe wants HRC to be POTUS...\n\nExcept Putin and Kim Jong Un.... they both endorse Trump. ", "One party's supporters regularly fly the flag of traitors to the United States wonder whose they are?", "&gt; God damn that is commitment.\n\nHonestly, reddit should seriously consider funding the /r/GWBlind for ADA compliance.", "Contrary to the bs peddled by trump Asian Americans overwhelmingly support Clinton.  They will be voting in droves for her.", "Yeah one is getting money for an International charity that helps fights AIDS. The other is personally enriching yourself from connections in a corrupt country. \n\nTrump's is worse. ", "I assume you have evidence that they influenced her decision right?\n\nIf so, you probably should have turned that over to the press or the FBI, for when they were all investigating the Clinton Foundation and found zero evidence of a \"pay for play\" scheme.", "I'm one of those people who voted for Bernie during the primaries but is voting for Hillary now.  I remember laughing with my friends over the weirdness of being excited to vote for the old white dude instead of the woman candidate and how enthusiastic we all were about it.  And, yeah, how disappointing it was when Hillary won.  I was upset about it, which is natural, I think, when someone you supported and liked doesn't win.\n\nSince I was young when she was FLOTUS and didn't really pay attention to her until after Bernie lost the primaries, I didn't really know anything about Hillary and her accomplishments beyond, \"took Bill back after he cheated.\"  I did a little research and, since I've seen so many people asking what Hillary has done, I decided to share some of it.\n\n**What Hillary has done through the years:**\n\n* In 1972, after graduating from law school, Hillary Clinton [went undercover to expose secret illegal segregation](http://www.nytimes.com/2015/12/28/us/politics/how-hillary-clinton-went-undercover-to-examine-race-in-education.html?_r=0)\n* In 1973, she went door to door for the Children's Defense Fund and found out that the main reason people didn't send their children to school was because the school couldn't handle the child's disability or there were laws specifically excluding children with certain disabilities from attending school.  Hillary then [researched and helped prepare the CDF report that became a major catalyst for enacting what is now known as the Individuals with Disabilities Education Act](http://www.childrensdefense.org/newsroom/cdf-in-the-news/press-releases/2013/honoring-hillary-clinton.html)\n* In 1975, after she was appointed to defend that rapist by a judge (she tried to rescue herself and was denied, plus he pled guilty under her counsel), she [helped launch the first rape crisis hotline in Arkansas and started an educational campaign about sexual violence against women](https://www.themarshallproject.org/2015/05/01/a-more-or-less-definitive-guide-to-hillary-clinton-s-record-on-law-and-order#.LkumoZANx)\n* in 1977, worked for [the Legal Services Corporation](https://en.wikipedia.org/wiki/Legal_Services_Corporation), a non-profit corporation established by the government to ensure low-income people would be able to get legal assistance if needed.  Note that the LSC was **hated** by conservatives because it [advanced goals of \"homosexual activists\"](http://www.heritage.org/research/reports/1995/10/bg1057nbsp-why-the-legal-services-corporation) in the 1970s.\n* As FLOTUS, in 1995, Hillary [brought attention to the issue of health care for Gulf War veterans](http://www.nytimes.com/1995/08/15/us/hillary-clinton-urges-attention-to-gulf-war-ailments.html) when the Pentagon said there was no evidence for a [\"gulf war syndrome\"](https://en.wikipedia.org/wiki/Gulf_War_syndrome)\n* 1997, she helped shape and advocated for the [Children's Health Insurance Program](https://en.wikipedia.org/wiki/State_Children%27s_Health_Insurance_Program)\n* Also in 1997, the [Adoption and Safe Families Act](https://en.wikipedia.org/wiki/Adoption_and_Safe_Families_Act)\n* In 1999, the [Foster Care Independence Act](https://en.wikipedia.org/wiki/Foster_Care_Independence_Act)\n* After 9/11, she introduced a bill [to help get medical care for the first responders exposed to the toxins at Ground Zero](http://www.aflcio.org/Blog/Political-Action-Legislation/A-Growing-Number-of-9-11-First-Responders-Support-Hillary-Clinton)\n* In 2002, Hillary introduced a bill [to require prescription drug manufacturers to do specific research on the effects their drugs have on children and label accordingly](https://www.congress.gov/bill/107th-congress/senate-bill/2394), which passed committee but died out after that\n* In 2003, undetered, she came back with bipartisan help and the [Pediatric Research Equity Act](https://www.govtrack.us/congress/bills/108/s650/text/is) which accomplished her goal, which led to testimony from pediatricians on how this led to [real improvements in the care of children](http://www.pharmexec.com/kid-tested-government-approved)\n\nThis isn't all of it, of course.  Just during her time as Senator, she sponsored [77 bills that actually became law](https://www.congress.gov/member/hillary-clinton/C001041?q={%22bill-status%22:%22law%22}), and she sponsored or co-sponsored more than 3000 bills total - this, with a Republican President and Congress.  These are the ones that jumped out at me as clearly being part of a pattern, where she really shows her commitment throughout the decades.\n\nAdd the fact that she believes in climate change and doesn't deny science like the other 3 candidates, I'm good with having her as my President.\n\nEdit: Forgot how to spell in my haste, I guess.  Sorry Arkansas, I knew it was Ar-kansas but I got it wrong anyway.", "At the very least they're wrong about Nevada. Their version of no toss ups seems to mean give everything to Trump. ", "What will conservatives do now? Say it was her doing for money because she is transgender? But then she is a disable vet so will they paint that group bad?\n\nThis is gonna be a tough one for them to use for spreading their hate.", "Meth addiction.", "That guy wasn't a boomer Gen X at the most, he actually looked  young enough to be millennial. ", "&gt;“God willing we are going to win this, but there are a lot of people who are going to vote for Donald Trump,” Biden said. “We have to figure out why, what’s eating at them. Some of it will be unacceptable, but some of it will be about hard truths about our country and about our economy.”", " The heavy piling on about Brady being the best guy ever seemed like he was trying to make it hard for Brady to call bullshit. Calculated lying I think all while burning some last bridges.", "Yeah I just read it. No way BB wrote that, his vocabulary exceeds that of a 5th grader which that letter doesn't.", "At first I was disgusted. Then I realized a lot of old people and even their middle aged kids were alive when racism was still prevalent in the world. Naturally some of that anger and hatred is going to fester underneath and slowly die out. As this is one of the boomers' last stands it's only natural that they're acting out. \n\nWhat's important to remember is that culture takes a long time to change. These people supporting Trump ARE absolutely disgusting people. No question. However their ideologies and beliefs will die out over time. No doubt the world will be a more tolerant place in 20 years than it was 20 years ago, and as long as we keep moving forward no amount of prejudice can stop the wheels of social progress. ", "it's not this subreddit is STRAIGHT cancer", "Some would say racism. Personally I think it's stupidity. ", "Yet apparently he pays as many personal expenses out of it as he hopes he can get away with.", "holy fuck that's almost worse than the sex tape and pulse nightclub tweets combined", "You're just now figuring out that libertarians are morons?", "Not bat-shit click-bait. She knows how to make money--by preying on a portion of the population.", "Nah it was actually Doctor Bornstein who wrote it.", "Belichick writes in mumbles.  That's not from him.", "My exact thought. A political subreddit is now taking advise from celebrities....", "Breitbart = bullshit journalism", "I'm 28. This is my first vote. Voting for Hillary in Florida. Been volunteering a lot. Doing 6 hours tomorrow.", "&gt;So if I oppose free trade abortion, and gun regulations I'm a disgusting person?\n\nAt least on the last two, yes. Well, if you oppose abortion enough that you think your opinion on it should change the law.\n\n&gt;I served alongside blacks, hispanics, and a guy that was half Lebanese \n\nLove this part. What does this have to do with anything? This is just a \"I am tolerant because I have black friends\" argument.", "Bullshit. Trump is not a normal qualified Republican candidate. He's an aspiring autocrat with zero knowledge of governing or our government. He's shit through the Overton Window and into outer space.", "Just goes to show you Hillary is in big candy's pocket.", "Except.... Trump was a private citizen whereas Clinton was Secretary of State ", "I never would have imagined an election would be this toxic. \n\nOn the brightside this is good practice in case I ever want to learn that League of Legends game.", "Ya but that thing that he might think is worse then killing some one might be people learning he has way less money then he says he does. His standards of what's important seem sort of fucked up.", "\"That's called being smart.\"", "This has less to do with Trump and more to do with the internet. Trump is just a side effect. Racist assholes like this just don't feel isolated anymore. For a couple decades outright racism became really taboo so racism morphed into a subtle, almost passive form that was always just under the surface and never acknowledged. \n\nBut now, the quiet racists recognize that they still have a massive community that thinks the same way they do. And they have a major party candidate to get behind. It was always there, anyone who grew up a minority in the South knows it. They know they just don't have to hide anymore.", "An ID law where you actually ensure everyone has ID first?"], "links": ["5bpsnq", "5bptu4", "5bpfj3", "5bpsnq", "5bptu4", "5bpfj3", "5bpdao", "5bpfj3", "5bp71v", "5bpfj3", "5bpdao", "5bnvpb", "5bpnu4", "5bpfj3", "5bpnu4", "5bnvrr", "5bovpt", "5bpnu4", "5bovpt", "5bpfj3", "5bpdao", "5bnvpb", "5bnq8z", "5bpdao", "5bpsnq", "5bovpt", "5bofor", "5bovpt", "5bofor", "5bpfj3", "5bovpt", "5bp71v", "5bpdao", "5bnvrr", "5bofor", "5bpnu4", "5bnvpb", "5bpdao", "5bpfj3", "5bpnef", "5bofor", "5bofor", "5bnq8z", "5bptu4", "5bnvrr", "5bofor", "5bpnu4", "5bpfj3", "5bpnef", "5bofor", "5bofor", "5bpnef", "5bpfj3", "5bofor", "5bpnu4", "5bpfj3", "5bovpt", "5bp71v", "5bpdao", "5bofor", "5bofor", "5bovpt", "5bpnu4", "5bofor", "5bofor", "5bofor", "5bpnef", "5bofor", "5bpdao", "5bptu4", "5bpmv9", "5box0z", "5bovpt", "5bovpt", "5bovpt", "5bofor", "5bo6g3", "5bofor", "5bptu4", "5boksx", "5bofor", "5bpfj3", "5bovpt", "5bpfj3", "5bpnu4", "5bovpt", "5bnvrr", "5bovpt", "5bpr1b", "5bofor", "5bovpt", "5bnnpn", "5bovpt", "5bpnu4", "5bpfj3", "5bpsnq", "5bpzkl", "5bpsnq", "5bpzkl", "5bpzkl", "5bpfj3", "5bpzkl", "5bpsnq", "5bpzkl", "5bpzkl", "5bpzkl", "5bpzkl", "5bpsnq", "5bptu4", "5bptu4", "5bpzkl", "5bpzkl", "5bovpt", "5bpzkl", "5bpzkl", "5bptu4", "5bpzkl", "5bpdao", "5bpzkl", "5bq26a", "5bnvpb", "5bovpt", "5bpzkl", "5bptu4", "5bpzkl", "5bpsnq", "5bpzkl", "5bpfj3", "5bpzkl", "5bpzkl", "5bpzkl", "5bpzkl", "5bpzkl", "5bovpt", "5bpzkl", "5bpzkl", "5bpsnq", "5bpzkl", "5bpzkl", "5bpzkl", "5bpzkl", "5bofor", "5bpsnq", "5bovpt", "5bpfj3", "5bnvpb", "5bp71v", "5bnvpb", "5bpzkl", "5bpzkl", "5bpzkl", "5bpsnq", "5bpsnq", "5bpfj3", "5bpzkl", "5bq3xq", "5bpfj3", "5bovpt", "5bptu4", "5bpzkl", "5bq1j4", "5bpzkl", "5bpzkl", "5bpzkl", "5bptu4", "5bpzkl", "5bpzkl", "5bpzkl", "5bovpt", "5bovpt", "5bpzkl", "5bptu4", "5bpzkl", "5bpzkl", "5bpsnq", "5bpsnq", "5bo6g3", "5bpzkl", "5bpzkl", "5bq5p0", "5bpzkl", "5bnvpb", "5bpzkl", "5bovpt", "5bpzkl", "5bq26a", "5bpzkl", "5bptu4", "5bovpt", "5bpsnq", "5bpfj3", "5bpzkl", "5bovpt", "5bofor", "5bqdc0", "5bpfj3", "5bovpt", "5bq6r0", "5bovpt", "5bovpt", "5bovpt", "5bpfj3", "5bpzkl", "5bqdc0", "5bp71v", "5bqa8w", "5bovpt", "5bqdc0", "5bq6se", "5bovpt", "5bptu4", "5bqc41", "5bpzkl", "5bovpt", "5bpfj3", "5bovpt", "5bpzkl", "5bovpt", "5bpzkl", "5bqdc0", "5bo6g3", "5bpzkl", "5bq6se", "5bpzkl", "5bovpt", "5bpzkl", "5bq3xq", "5bovpt", "5bpzkl", "5bpsnq", "5bqe7j", "5bpsnq", "5bqbyf", "5bqbyf", "5bpsnq", "5bpzkl", "5bp71v", "5bpdao", "5bptu4", "5bpsnq", "5bovpt", "5bq26a", "5bpfj3", "5bpfj3", "5bpsnq", "5bqdc0", "5bqa8w", "5bpsnq", "5bqc41", "5bpfj3", "5bpfj3", "5bpzkl", "5bovpt", "5bq3yr", "5bq26a", "5bovpt", "5bpfj3", "5bq8om", "5bovpt", "5bq6r0", "5bpfj3", "5bqa8w", "5bofor", "5bqdb9", "5bofor", "5bpzkl", "5bpfj3", "5bpfj3", "5bqbyf", "5bovpt", "5bpzkl", "5bpzkl", "5bqe7j", "5bpzkl", "5bovpt", "5bptu4", "5bqc41", "5bpsnq", "5bpzkl", "5bpsnq", "5bpfj3", "5bq6se", "5bptu4", "5bofor", "5bqq0d", "5bpzkl", "5bqpnk", "5bpsnq", "5bqmb2", "5bqe7j", "5bpsnq", "5bqq0d", "5bpsnq", "5bpsnq", "5bpzkl", "5bpzkl", "5bqj1q", "5bofor", "5bqmb2", "5bpsnq", "5bpsnq", "5bpfj3", "5bptu4", "5bpfj3", "5bqpnk", "5bqq0d", "5bpfj3", "5bqdc0", "5bqj1q", "5bq26a", "5bpsnq", "5bqdc0", "5bqmb2", "5bpfj3", "5bpfj3", "5bptu4", "5bqpnk", "5bptu4", "5bpsnq", "5bovpt", "5bpsnq", "5bqj1q", "5bpzkl", "5bpsnq", "5bovpt", "5bptu4", "5bptu4", "5bptu4", "5bqj1q", "5bpfj3", "5bqc41", "5bp71v", "5bqdc0", "5bqibz", "5bqibz", "5bqdc0", "5bpdao", "5bqlqw", "5bpdao", "5bqc41", "5bqdc0", "5bpzkl", "5bqibz", "5bpsnq", "5bqibz", "5bpzkl", "5bpzkl", "5bovpt", "5bqq0d", "5bpzkl", "5bqija", "5bovpt", "5bptu4", "5bqibz", "5bpfj3", "5bqibz", "5bpzkl", "5bpzkl", "5bpfj3", "5bpdao", "5bqdc0", "5bqibz", "5bpsnq", "5bovpt", "5bqeq7", "5bp71v", "5bqibz", "5bpsnq", "5bpfj3", "5bpsnq", "5bpzkl", "5bqe7j", "5bqdc0", "5bqdc0", "5bovpt", "5bpfj3", "5bqibz", "5bptu4", "5bovpt", "5bpfj3", "5bqv66", "5bqv66", "5bqsvt", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bovpt", "5bqv66", "5bqq0d", "5bqv66", "5bqv66", "5bqw65", "5bqv66", "5bqsvt", "5bqq0d", "5bovpt", "5bqv66", "5bpsnq", "5bqq0d", "5bqv66", "5bpsnq", "5bqsuh", "5bqsvt", "5bptu4", "5bqv66", "5bqv66", "5bqq0d", "5bpdao", "5bptu4", "5bqsuh", "5bqsvt", "5bqv66", "5bqsvt", "5bpfj3", "5bpsnq", "5bpfj3", "5bqv66", "5bpfj3", "5bqpnk", "5bqsvt", "5bqq0d", "5bqsvt", "5bpsnq", "5bqmb2", "5bptu4", "5bovpt", "5bqsvt", "5bq26a", "5bqv66", "5bqv66", "5bqdc0", "5bqv66", "5bptu4", "5bqsvt", "5bpsnq", "5bqv66", "5bqe7j", "5bqsvt", "5bpsnq", "5bqsuh", "5bqsuh", "5bpsnq", "5bqv66", "5bqw65", "5bqpnk", "5bpdao", "5bqe7j", "5bqsuh", "5bqsvt", "5bpzkl", "5bpzkl", "5bqsvt", "5bpfj3", "5bovpt", "5bpsnq", "5bpfj3", "5bpsnq", "5bqw7f", "5bpzkl", "5bqsvt", "5bovpt", "5bpzkl", "5bqmb2", "5bqmb2", "5bqv66", "5bqsuh", "5bpfj3", "5bpfj3", "5bpdao", "5bpsnq", "5bovpt", "5bovpt", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5br7ls", "5bqv66", "5brbk8", "5br2qc", "5bqw65", "5bpsnq", "5br5pr", "5bqsvt", "5bqv66", "5bqsvt", "5br7ls", "5bpsnq", "5bpsnq", "5bqv66", "5bptu4", "5bqv66", "5bqv66", "5bpsnq", "5bqq0d", "5bqw65", "5brbk8", "5bqv66", "5brbk8", "5br88g", "5bqv66", "5bpfj3", "5br2qc", "5bqsvt", "5bqv66", "5bqq0d", "5br2qc", "5br7ls", "5bqv66", "5bqe7j", "5bpsnq", "5bpsnq", "5bqmb2", "5br5pr", "5bqsvt", "5bpsnq", "5bqq0d", "5bqw65", "5bqv66", "5bqv66", "5bqw65", "5bptu4", "5bptu4", "5br5pr", "5bqsvt", "5bptu4", "5bpsnq", "5bq3xq", "5brbk8", "5bqv66", "5bqw65", "5br2qc", "5bqmb2", "5bqv66", "5br1dx", "5br97l", "5bqmb2", "5bpfj3", "5bqsuh", "5bq26a", "5bq26a", "5bpzkl", "5bqw65", "5br7ls", "5bqq0d", "5br5pr", "5br8a9", "5bqv66", "5bqv66", "5br5pr", "5bpfj3", "5bqq0d", "5bpsnq", "5bptu4", "5bpfj3", "5brbk8", "5bqv66", "5bqv66", "5bpfj3", "5br97l", "5bpdao", "5br5pr", "5bqpnk", "5bptu4", "5bq26a", "5br5pr", "5bpsnq", "5bpsnq", "5br5pr", "5bqmb2"]}