{"comments": ["They're the ones who are always criticizing the celebrities who support Clinton. That they're \"rich and don't live in the real world\".\n\nYet when people like Jon voight Clint Eastwood, Tom Brady support they're BASED.\n\nI haven't seen autism on a level so high on that of the_dobald before. ", "Just so we're clear. Mitt Romney currently has more votes than Jill Stein. ", "What is the poor guy to do? They took away his phone. He has to write letters.", "The_Donald is eating it up. ", "If I was tom Brady I would lie about voting if I actually voted trump.", "2016 is the most bizarre year ever.  We're all questioning our instincts.  It's obviously a made up letter....but wouldn't that be the dumbest thing anyone has ever done?  Like pretty much ever on this stage?  So he couldn't have really done that, right? ", "What a strangely precise part of Trump's greater personality disorder to now have faked multiple letters from the NFL.  \n\nMaybe it goes back to the failed USFL?", "Lol.  Anyone who's seen BB in a press conference (or in any channel of public communication really) knows that he's one of the most sardonic individuals on the planet.  There's no fucking way dude would use language that Trumpian.\n\nMaybe this is a Bill Belichick from that parallel universe NFL that sent trump [this letter](https://www.washingtonpost.com/news/early-lead/wp/2016/07/30/nfl-refutes-trump-claim-that-it-sent-him-a-letter-bashing-debate-schedule/)", "This is like one of those letters where after the kid has had a rough few months being made fun of in school, dad writes a letter to his kid *pretending* to be someone the kid looks up to. The kid is uplifted and instantly feels better, knowing that his hero spent those few moments to share those thoughtful words of encouragement. But instead of the kid taking the message to heart and being silently reassured by that letter when times get tough again (as dad had intended), the kid takes the letter to school to rub it in the bully's faces. And it is in the moment where he proudly passes the letter around that the other kids all (quickly) notice what the kid was too trusting of his father to see; that the letter from \"Mr. Bob Ross\" was written in the kid's dad's handwriting... leading to even more humiliation and shame.\n\nExcept in this case, Trump wrote it himself to make himself feel better... but he forgot that he wrote it and gave himself permission to read it, and now everyone knows that it was written by Trump yet he has no humiliation or shame because he doesn't realize what everyone is laughing about. ", "They're going to have to invent a name for the phenomena whereas Trump criticizing someone for X only reminds everyone that Trump is actually much guiltier of the behavior he is criticizing others for.  Kind of like when Trump was accusing Obama of screaming at a protestor the other day and 100% of people listening were thinking that's what YOU do, nobody does that more than you, nobody.", "[Here are some excerpts from that Wellesley speech.](https://www.youtube.com/watch?v=2CAUOa5m5nY) It's the best audio I could find. What I find remarkable about it is that this is Hillary from before she became a politician and it immediately reminds me of John Kerry's famous testimony before Congress before his own conversion to the tempo of sound bites and poll-tested speeches.\n\nI first met Hillary way back when she was First Lady of Arkansas and I never saw this side of her before. This part was tucked away and hidden for years in service to Bill's career. It's crazy all the shit she's had to do between there and here.", "Dix out for Hillary", "There's a big difference between selling a piece of real estate to a Saudi and taking donations in exchange for political access/favors while serving as a 'public servant'. That much should be pretty obvious. ", "&gt; why\n\nTake a look at the_doofus they're absolutely loving this. Everyone's praising Brady right now. Apparently Brady's endorsement of Trump means they won New Hampshire. \n\nI get the feeling Trump's strategy now isn't winning the election, it's strengthening his cult following so he can get their business afterwards. \n\nI mean, check out that \"letter from Belichick.\" It sounds like one of those parody Trump comments you see all over Reddit.  There's no way Donnie didn't write that himself, possibly one-handed.", "And Donald Trump is off to the races with a strong one vote lead over Mitt Romney!", "The Dark Lord Bellichek would never comment public on politics outside of the NFL this is such a joke", "\"No Jew. No Jew. You're the Jew.\"\n\n-Donald/Adolf", "&gt;  Like who the fuck does this buffoon think he's fooling?\n\nTens of millions of Americans", "Clinton 4\n\nTrump 2\n\nJohnson 1\n\nRomney 1 (LOL)\n\n", "&gt; Clinton however, was so provoked by the senator speaking before her that she threw away that speech. The speech she gave - the one you linked - was merely some words scribbled down and lots of adlibbing.\n\nI remember first knowing this watching the Frontline documentary and then checking it out. And I was both happy and sad at the same time. Happy that there exist an amazing person of Hilary Clinton behind the robotic monologues and lawyer-speak. But also saddened that politics has turned such a person into a jaded, conspiracy-theorist, secretive person today.\n\nIt's funny that as a guy, and someone whose views much more in line with Sanders than Clinton, that I actually \"like\" Clinton more than I agree with her policies. I'm especially not fond of her foreign policy, and I'm not sure I truly agree with her views on Wall Street. But I have a lot of respect for her. Because if I faced even 1% of what she had to face as a politician, I would've folded like a cheap suit and cried myself to sleep every night. No matter what else, I do believe she will fight for America. And in the end, I have voted \"for\" her because of that. ", "She's a criminal fucking mastermind and with the popularity of anti-heroes in recent movies I'm surprised she's not more popular.\n\nThe only person who can take down such an awful man... is such a nasty woman!", "He could have made this up to get the last second NH support. Bill and Tom may not be able to get the word out quick enough to disprove it. It's so late in the game and he thinks this won't affect him..\n\nIf this is true trump is literally clinically insane. ", "They were able to \"shut up and deal with it\" when that nutjob was chanting \"JEW-S-A!\" at one of the rallies. They can tolerate bigots more than they can tolerate disabled kids with an opposing opinion.\n\n", "No but the perps can be prosecuted under the Matthew Shepard Act.", "He said there were 28000 people in attendance, the arena can only hold around 12,000. \n\nHe lies about easily fact checkable things. Sad!", "She just invoked the Grandfather clause. That is pretty racist.  \nThe grandfather clause was used to keep black people from voting.  \n\"The term originated in late nineteenth-century legislation and constitutional amendments passed by a number of U.S. Southern states which created new requirements for literacy tests, payment of poll taxes, and/or residency and property restrictions to register to vote. States in some cases exempted those whose ancestors (grandfathers) had the right to vote before the Civil War, or as of a particular date, from such requirements. The intent and effect of such rules was to prevent poor and illiterate African-American former slaves and their descendants from voting, but without denying poor and illiterate whites the right to vote. Although these original grandfather clauses were eventually ruled unconstitutional, the terms grandfather clause and grandfather have been adapted to other uses.\"", "Ah but does Tennessee law protect transgender people against hate crimes? I don't think it does.", "Brian Williams was hilarious deadpan he says, \"One thing certain, we can definitely say Mitt Romney tonight, outpacing projections.\"", "What is a \"tell\" for me is the opening sentence attacking his enemies in the press.  Trump just cannot resist slamming those he feels undermined him. So he pretends Belichick finds the liberal press abhorrent as well.", "It's not the vocab that's alarming it's the grammar.  \n\n\"Competitor fighter\"? Since when does competitor modify fighter?  \n\nHe has to \"help with a slanted media\"???\n\n\"I have always had tremendous respect for you for the toughness and perseverance you have displayed over the past year is remarkable\" -- by the end of this (short) sentence he's already forgotten how he began it.  \n\nScary.", "I'm a gay person.  \n\nThis line of attack is just gross and stupid. Trump's campaign is insanely anti-gay. The U.S. is officially allies with Saudi Arabia. I hate their government as much as anyone else but if they want 25 million to go to charity and they THINK they're getting access and influence, I don't give a shit.  \n\nIt's much more damning that Trump CHOSE to do business there and profit off a corrupt monarchy that kills gays. Trump praises Putin as well and won't say a thing about the way Putin is anti-LGBT. Trump has Pence as his VP.  \n\nHillary Clinton is an LGBT ally, and just saying Saudi Arabia and Clinton foundation doesn't magically make Hillary corrupt, it doesn't make her anti-gay, and it doesn't make the anti-gay Trump campaign any more fucking pro-gay. It makes them gross politicians who think they can basically lie about Hillary to cover up how terrible they are about gay rights themselves. ", "One person wrote in Mitt Romney. That made me laugh.", "Surprise surprise. The people who have actually lived and worked with Trump don't want him to be president. \n\nThere goes the \"favorite son\" bump from NY.", "You mean: accurately?", "You know who else doesn't know? Scotty.", "I watch BB's conferences frequently and this is nothing like his usual tone. Not to mention it sounds like Trump's too.", "Thanks to all three of you. I didn't know the Matthew Shepard Act would supercede state law (or the lack of it). That's encouraging.", "*Jim Ross voice*  \nWait a minute... that's... that's MITT ROMNEY'S MUSIC!", "Did you directly copy and paste that?  If I was a 7th grade English teacher I'd give that a D- for grammar.  Whether it was Trump or Belichik it's disturbing to think either one of them expresses themselves that poorly", "&gt;##71. For Trump Chicago building Trump obtained financing from George Soros. (Means nothing, but it terrifies conserv conspiracy theorists.)\n\nI love this one.", "lol.... Do you really think that Saudi Arabia gave Hillary's charity money out of the kindness of their fucking hearts?\n\nThe country that kills gays decided to give Hillary $25 million for AIDS?\n\nThis is such a fucking joke.", "Alternative headline: husband puts arm around wife. ", "The fact that he's all but lost Nevada due to early vote makes NH almost irrelevant. He needs to flip something bigger now like Michigan or Wisconsin. NH is only important if he wins Nevada too. ", "Loved that the reporters were laughing at the Romney vote. This election needs some humor.", "&gt; Minorities all across the U.S. are realizing that they will get mistaken for mexicans and muslims and be shot at.\n\nFTFY  \n\nFun story:  Bearded Jewish guy and a Korean guy I knew were on a road trip and got literally chased out of some small Montana town by a group of angry rednecks screaming \"Get those fucking Mexicans\".\n\n", "These are the same people that think posting memes and scouring WikiLeaks for links between Clinton and witchcraft are a better use of their time than phone banking and going door to door. \n\nIf there's any violence after the election it'll come from white nationalists and militia types, not the alt right. ", "I came in here to say the exact same thing.  Picking Tom Brady is such a Donald Trump thing to do too.  I bet Trump thinks they have the same face.", "Both. He would accomplish both of those things  ", "He's definitely a pathological liar. There's no other possible explanation. All politicians lie but usually there is at least *some* basis, or there is at least a reason behind it. With Trump it's just constant, regardless of anything else. ", "Romney beat expectations by 100%! ", "Sanders would be in charge of domestic and foreign policy. Kasich would be making America great again.", "Not just this but it could have the Pete Wilson effect. Essentially bitch slapping the Hispanic sleeping giant into waking up and vehemently HATING Republicans even more now cementing Latino/Hispanic vote for Democrats for the foreseeable future, like CA. \n\nThe slow erosion of bright red states in the Southwest should also be a concern for the GOP with some states looking much more purple and light blue than they did 8 or even 12 years ago. \n\nAnd to think, that there is an entire generation of Hispanics and young Asian Americans (#2 and #1 fastest growing populations, respectively) who are more liberal than conservative and are going to have the ability to vote in the next 4 years. \n\n", "Hillary is not after your fucking guns. Just like Obama wasn't after your guns. ", "&gt; Too many people are ready to jump on you for even acknowledging that you're voting for a woman. As though we can't objectively decide a candidate is superior\n\nEspecially in light of the fact that a patronizing selection of an abysmal female vp candidate in order to boost female votes didn't turn out so well.\n\nMost women don't simply vote for candidates because they share their gender though some men vote against them simply because they don't.\n\n*ghost edit to add \"most\" instead of the implied \"all\"\n", "Romney better get his act together fast if he wants to recover from this", "Ok ? And the donations were to Clinton Foundation which is a highly respected transparent and audited charity out there. What's your point ?", "ROMNEY WITH A COMMANDING 12.5% OF THE VOTE ", "He hasn't seen all those emails. ", "So far the voter fraud AND suppression has all been Republican.", "The Bad Hombres are waking up and they won't rest until every corner has its own taco truck. ", "No no, he was clearly chanting \"Joo-S-A\" so the Hispanic voters didn't feel awkward when they chanted in their accents!\n\nHahaha God, I fucking hate this election. ", "I fucking love Dixville Notch. 1 Romney write in. Never stop being amazing. ", "But muh heritage!!1!\n\nBut for real it pisses me off. I actually study history and will be doing graduate work studying the history of white supremacy. The fucking Civil War was about slavery. Sure about state's rights (to slaves) and the economy (based on slaves). It all comes back to slaves and white supremacy. History denial is so prevalent and such a goddamn pain. So much research has been done but idiots believe some stupid Facebook meme over the facts. ", "If Wikileaks really cared about transparency in government they would have found a way to leak Trump's tax stuff by now. Instead, they think it's BREAKING NEWS to prove that someone who knows someone who knows Clinton once got an invitation to a performance art show.", "The only ones who feel 'threatened' by a woman as president are those alpha-wannabees from The_Cuckold.", "I'm actually pretty surprised this was never played at the DNC. It's quite good and has vivacity that everyone said Clinton lacks.", "Well technically there were the Chinese Exclusion Act and Japanese Internment first but point taken.", "Someone wrote in \"Kasich / Sanders.\" So... like... co-presidents or...?", "What's hilarious is that this isn't hyperbole. He's [literally said that](http://www.newsweek.com/how-much-trump-worth-depends-how-he-feels-384720).\n\n&gt;*“My net worth fluctuates and it goes up and down with markets and with attitudes and with feelings, even my own feelings, but I try.”*\n\n&gt;*“Yes, even my own feelings, as to where the world is, where the world is going, and that can change rapidly from day to day. Then you have a September 11th, and you don’t feel so good about yourself and you don’t feel so good about the world and you don’t feel so good about New York City. Then you have a year later, and the city is as hot as a pistol. Even months after that it was a different feeling. So yeah, even my own feelings affect my value to myself.”*\n\n...\n&gt;O'Brien: *“When you publicly state what you’re worth, what do you base that number on?”*\n\n...\n&gt;*“I would say it’s my general attitude at the time that the question may be asked,” Donald responded. “And as I say, it varies.*", "This makes so much more sense than secret Trump voters.", "Everyone likes the punisher but when the president of the Phillipines does the same stuff it makes people uncomfortable.", "You do know the donations went to Clinton foundation which is a trusted and transparent organization (unlike the shady trump foundation) and it's different from giving Hillary money ?\n\nAnyway if it is about principles it doesnt matter if its legit money as businessman - he would have refused it. Thing is Trump doesnt know the spelling for the word principle.", "If Trump doesn't win NH it'll be really hard for him to get to 270.", "Mitt Romney is currently on 12.5% in New Hampshire in votes cast.", "Can you imagine the logistics and manpower used to secure this event? The President plus the Democratic nominee? Crazy. ", "Ummm.... how about \"Trump syndrome\".", "The Punisher exists in a world that revolves around his narrative. That's a luxury of impersonal perspective that's only afforded in fiction.", "It's interesting because other Republicans who aren't 100% committed to Trump will see this in the news and they will get the idea of doing the same. They probably hadn't even thought about it. I certainly hadn't.", "I voted last month by absentee ballot.  I choose to believe that your grandma cast her vote at the same time before she passed.", "Wait I can both 'boo' *and* vote? This changes everything!", "No you're wrong on this.  People still assimilate, they just don't do it fast enough for you.  Look how long it took the Irish to assimilate.  Remember all those \"No Irish\" signs that used to be up in shop windows and at hotels?  No?  Of course not, you're not 150 years old.  \n\nThere has been no sea change in the behavior of immigrants.  What has changed is that we now expect instant results.  That it took over a generation for people to assimilate in the past was a simple given.  It has always taken time for people to assimilate.  Hell, Chicago still, to this day, has Irish neighborhoods where you can drop in a guy from Donegal and it will be like he never left Ireland.  I've been to them.  I've known guys who came here from Ireland and moved to South Side neighborhoods and I've asked them, \"why did you even come here?\"  It's like they never left.\n\nWhat has changed is that we are now an instant gratification culture and if new immigrants don't immediately dump everything of their past and culture - not to mention convert to Christianity - people freak out.  Also, the old immigrants were _your people_.  The new immigrants are not.\n\nRelax.  Next time you see a woman in a hijab on the streets of America remind yourself that her granddaughter will be half Latino and will walk around in shorts and a t-shirt.  It takes time.", "&gt; A taste of ~~Trump's America~~ the Republican party folks.\n\nFTFY\n\n", "Prediction: Clinton 322-216. It's not even going to be close.\n\n\n\nThank you Latinos (and Democrats, women, blacks, LGBTs, college graduates, literally every other minority, and suburban whites).\n\n\n\nLove,\n\n\n\nA reasonable Republican who's voting straight Democrat for likely the only time.", "And my axe!", "My dad won't stop laughing. ", "family inbreeding", "Yeah buddy I'm sure you'll be in the streets fighting if the election is close. I'm sure you guys will totally take the white house by storm and put Trump in power by force. That's totally what's gonna happen buddy. I believe in you. ", "This speaks volumes for your humanity and yes, your masculinity.\n\nYou realize that these events don't diminish you in any way, but just advance us all.", "Trump's 4D chess skills turned out to be nothing more than projection.  \n\n\"Hillary Clinton says awful stuff about little girls.  She once saw a 10-year-old and said she'd be dating her in ten years.  Hillary also has ridiculous orange skin and when she stops talking her mouth looks like a tiny, little, butt hole.\"", "It is about personal responsibility. If you walk outside you know you will be hit by drunk drivers, the free market will get rid of people walking in the way of drunk drivers. FREEDOM!", "&gt; getting his policies taken up by Clinton\n\nDid you read [this email](https://wikileaks.org/podesta-emails/emailid/5423) from John Podesta? The one where he said that all they had to do was \"throw a bone\" to Sanders and his \"self-righteous ideologues\" so that \"his people will think they've 'won' something from the Party Establishment. And it functionally doesn't make any difference\"? The Clinton camp will be laughing their asses off as they get gullible Bernie supporters to \"work their asses off for Hillary\" and get nothing in return.\n\nPeople like you are being played like a fiddle - Hillary would do nothing to get Bernie's policies passed. How can you honestly believe she would after all the crooked crap they pulled in the primaries and all that's been revealed through WikiLeaks?\n\nVoting for Clinton will marginalize Bernie's movement, since if she wins then all the crap the DNC and Clinton campaign pulled will have been vindicated, and they'll make damn sure to never let a Bernie-like movement ever get off the ground again.", "DIXVILLE NOTCH NH HAS SPOKEN!\n\n4 votes Clinton, 2 Trump, 1 Johnson* and 1 write in for Mitt Romney lol", "And to think the Johnson and Romney voters are probably Republicans. If Trump weren't utter shit, it would have at least split 4-4.\n\nTrump supporters will rue this day.", "I'm an old person who has time and again chastised young people for being racists.  It's bigotry to assume that old people are racists and that young people aren't.  ", "I'm going to miss all the hyperbolic \"deflect and project\" behavior I've grown so *fond* of this year.  ", "in a weird way i get Trump's voters. this has to be real, real hard for them to accept. i remember when Barbara Bush set aside her presidential aspirations for her son to run in 1999. i just turned 30. *that's how shortly ago it was.*", "One thread was seriously discussing whether this \"endorsement\" would be enough to flip Massachusetts New Hampshire, and Maine.", "&gt; there's no way he'd just fucking fabricate something like this\n\nThat's been his whole campaign. He is an UNPRECEDENTED LIAR in politics. Normal politicians have to manipulate facts and figures and appearances to lie. Trump has absolutely no relationship with reality. It's hard to wrap your head around but he can say LITERALLY ANYTHING, with absolutely no basis in fact, and his supporters will believe it. He has no deterrent, no consequence, because despite all the lying, half the country will vote for him no matter what he says or does. ", "As a mainer hahaha nope. oh man. hahahhaa. Nope. Nope. Sorry, no.\n\nedit: Comment was before the election results. Edit is from after. Maine did NOT vote for Trump.\nI wish other states also had not voted for Trump. :( makes me sad.", "~~If I was tom Brady~~ I would lie about voting if I actually voted trump.", "Having listening to Belichick speak to the press since becoming the Pats coach I can say with 100% certainty the letter was written by Trump and it contains the same 5th grade vocabulary Trump mumbles on Twitter and in his speeches. \n\n\n\nEDIT:  Some legit Boston media are confirming Belichick wrote a letter to Trump but no confirmation it was the actual letter Trump read.  Still sounds like Trump wrote the actual words to me, but we will see.  I would like to say if this is true As a longtime Pats fan I have no issue with Belicick supporting whichever candidate he wants privately, but how can you preach no media non football related distractions and then pull this shit.  This goes against everything Belicick stands for and I would lose a lot of respect for what I still consider the greatest NFL coach of all time.", "Apparently the Russians don't understand Massachusetts politics very well. ", "He also insulted NFL players for being \"soft\" because of complaints around head trauma and brain disease.", "I'm on my phone right now actually.", "Those Senate seats are the meat in this cheeseburger. Please oh please, let us vote in a Democratic Senate. Please, please, please. ", "Every generation has \"their president\". My parents had JFK.  I had Obama.\n\nHe hasn't been perfect but one of my greatest honors was voting for that man twice.", "Hated but absolutely respected.", "The 'rewritten' letter contains \"tremendous\" twice in a five sentence statement. No fucking way did BB write that.", "It's like the kind of lie a kid would tell to try and get out of showing a report card to their parent. \"Uhh well... my teacher wrote this letter saying I got all Zs, the best letter in the alphabet!\"", "\"Tell the jury what he did after the election.\"\n\n\"He thanked his staff and then called Clinton to congratulate her\"\n\n\"May I remind you KellyAnne, you are under oath?\"\n\n\"Alright, alright, he drove around tweeting online polls and asking people to call Sean Hannity.\"\n\n\"Now, I ask you, does that sound like a man who isn't insane?\"", "Trump's jealous. He's childish and he's trying to trot out his own celebrity endorsements (even tenuous ones) while also blasting Clinton for hers. He also probably furious at all the Scot Baio jokes people have been making", "Not feeling great about the senate but I hope it happens or we'll be doomed to 4 years of gridlock", "History will be kind to Obama and his supporters.\n\nWatch - in 20 years these people who are calling Obama a Muslim terrorist will attempt to revise history to pretend that they supported him.", "And the taco bowl ended up being from a restaurant next door :/", "Wrong.", "Jesus Christ he's a stupid motherfucker.", "More important tweets are actually here:\n \nThe Bling Dynasty\n‏@BlingDynastyNE\n@hunterw How does it feel to have the greatest coach in the history of football hang up on you? Could you sense the greatness?\n\nHunter Walker ‏@hunterw  2h2 hours ago\n.@BlingDynastyNE I'm a Giants fan.", "The_Donald is a complete hoot these days if people aren't checking it out they're literally making memes of Clinton holding bloody goat's heads with headlines like \"SEND THIS TO EVERYONE THIS WILL MOVE RELIGIOUS PEOPLE TO VOTE!\"\n\nI believe the context is that John Podesta went to a spoooooky modern art performance.\n\n**edit:** everyone should check it out, it's full of unintentional comedy. For instance, nobody realizes that this headline:\n\n&gt;Amish Trump supporters request 20 cars to drive them to drive them to the polls. They get 1500 volunteers\n\nis a sorry description of trump's nonexistent ground game. That is 1500 eager Trump supporters who have nothing better to do on election day than drive 20 cars worth of Amish. They have no other plans, and it's the day of.\n\nYou can be sure on the other side, rides have already been sorted out, and you don't have 1500 idle volunteers ready to man 20 cars. That's like, 1480 volunteers too many, or cars too few.\n\nor:\n\n&gt;ATTENTION ISSUES VOTERS: Trump pledges to drain the swamp and impose Congressional term limits (5-point ethics-reform plan) -- Hillary would NEVER in a million years propose something like this\n\neven on their own sub, they have to distinguish between \"issues voters\" and the...rest.", "I've listened to Belichick speak for my entire life there is no freaking way he wrote that thing. ", "Well he also said the NFL sent him a letter about the debates when they didn't.", "Vote counter: \"This vote is written on a napkin!\"\n\n(Glares at Trump)\n\n\"And it still says Hillary!\"\n\n\"And Hillary is spelled wrong!\"", "As if I needed another reason to hate Tom Brady. He probably met Trump at a summit for rich men with foreign model wives ", "You were your parent's \"happy accident\".\n\n-Ross", "Trump. Trump. And it isn't even remotely close. ", "Probably surmised that Bill wouldn't be able to say anything about it for the same reason he wouldn't send a letter in the first place", "I think you forgot about his NAMBLA donations.", "He openly stated that he'd bomb another countries ship for gesturing at us during the first debate. If you don't think that'd cause retaliation you're insane. \n\nMore corruption? Seeing as he wants to cut taxes on the wealthy (which supposedly includes himself) he's going to contribute to income I equality and the expanding 1%. There's a reason nobody in academia supports him. It'll benefit him, and his other \"billionaire\" cronies. Sounds pretty corrupt to me. \n\nSources: First debate. Trump's tax plan.", " \"yall fuckers better get to 51 seats. I dont want any of that shit\" - Tim Kaine probably\n\n", "Lmao at \"you've come out beautifully.\" \n\nCouldn't Trump break down and at least find a thesaurus to use some synonyms for tremendous etc? \n\nHe really has one limited vocabulary.\n\n", "...just to be clear this is exactly what I said.", "As a Michigander I'm fucking terrified. I have seen lots of enthusiasm for Trump and against Hillary. I'm UAW. I know a lot of liberals. And a lot of them fucking hate Hillary. They're smart people. Good. Honest. Hard working. I constantly direct any political conversation to what our union as put out. That Trump thinks we make too much money. \n\nIt's going to come down to hate. They hate her. Can they overcome that for their own interests? ", "&gt; and Hillary's e-mail server is a legitimate concern\n\nIt really really isn't. It's a run-of-the-mill \"government is incompetent with technology\" facepalm at worst. It's worth an audit, and the audit was done, and it was determined to be neither malicious nor criminally negligent. Case closed.\n\nIt's not the sort of heartstopping scandal that should be headline news for months on end, and it wouldn't be if the 24-hour news media weren't so desperate for ratings that they'll bite on every baseless insinuation coming out of the right-wing noise machine.", "What kind of political access/favors? Only thing the Saudis give a shit about is not being bugged about human rights violations and I'm sure Hillary will pressure them more than Trump ever would", "Lol give it an hour and they'll be spam posting about how the dems rigged Brady's brain with a mind-control device to make him forget about voting for trump. When asked for proof project veritas will come rolling out with a new, extremely edited video of a former grounds keeper at the patriot's stadium swearing up and down that he saw huma abedin shoving a piece of metal into Brady's brain via his right ear. ", "No the same foundation that is rated A by independent third party reputed auditors, the same foundation that is responsible for giving the most HIV vaccines to the affected in Africa etc unlike the Trump foundation which only claim to fame is buying a 6 foot potrait of Trump himself. I mean seriously who the fuck does that ?", "With only the Senate it'll still be gridlock.... but at least nominees will probably get confirmed.", "Not really. They are hated because of their overwhelming success and obnoxious fans. It's not like they are assholes and I think most NFL fans believe the whole deflate gate shit was stupid as hell and overblown. \n\nAlso Goodell is the most hated person in the league.", "not in NH", "Well the real gonewild for blind people is right this way -&gt; /r/Gonewildaudio\n\nSo its not like reddit doesnt have it.", "Being really good friends means you have to support the same candidate? Huh. TIL.", "Lol especially in the middle of football season. I can't believe he made this up. ", "Wouldn't it be funny if Belichick wrote that letter in Trump's grammar and then denied the whole thing?", "Far easier to get things accomplished when you aren't facing an obstructionist supermajority. ", "So what you're saying is: You aren't familiar with Michael Jackson", "Breitbart may do that too.", "&gt; I also remember when if you were married it was nigh on impossible to accuse your husband of rape\n\nIt legally wasn't rape in some places--until the 1990s in NY IIRC.", "It's not an appropriate comparison though because Millsfield (the big Trump town) didn't do midnight voting in 2012.", "Are you aware that presidentclinton.com doesn't exist? Additionally it's the acknowledgement of an investigation, not confirmation of those things being true in any capacity.", "Or maybe they just don't want to argue about politics?", "\"Benghazi\"\n\n", "Oh wow that could only sound more like Trump wrote it if he'd worked in big league and said best wishes for the results on the 28th.", "Final Projections: Trump TV's first guest will be Vladimir Putin on a bear. ", "It's true. It's true. Really. It's true. Believe me.", "I'm too cynical to accept these results but thanks Princeton..", "The closer we are to election the higher the peak in delusion from the_dipshit becomes before a disastrous crash on election night. ", "Tbf he did beat out the establishment golden boys, the religious nut, and the sane but kind of nutty old guy before he hitched the witchillary train.", "Asian Americans *love* Bill Clinton.", "I have this picture in my mind of you with your spouse at the grocery in about twenty years or so and during a conversation your spouse turns to you and says \"Yeah, it was like that time when Trump said [insert something he actually said here],\" to which you reply, \"Get the fuck out of town, really?\" Then the two of you go home and get on the internet and look it up and then reminisce about that one year America almost lost its fucking grip right before you two have the best sex you've had in months.", "I read their twitter. Their methodology is literally just \"unskewing\" the polls just like Romney fans did.", "Whoa that's a passionate article. \n\n&gt;As he continued to rise, common sense told so many of us “no way. This can’t happen.”\n\n&gt;That common sense was based on the idea that decent people with large microphones would surely inform the masses they were being used and taken advantage of. That their righteous rage had become the toy of a billionaire and his nationalist base.", "LOL you gotta be careful Buzzfeed may pick it up thinking it's legit. ", "They've lost their way it's all about pandering to religious assholes who want to take away people's rights instead of focusing on the economy &amp; building the middle class.", "If he did something illegal wouldn't the IRS pick up on that?", "To be fair there's a difference between saying, \"These guys have gone off the rails and are blinded by partisanship,\" and how way too many Republicans apparently think Hillary Clinton and Barack Obama areactual, LITERAL demons. Like, supernatural beings of evil.", "I'd fire on another country cause their sailors gave our sailors the finger.\n\nWho do you think would start a war?!??!!!@!@!\n\nI didn't pay taxes cause I'm smart.\n\nWho do you think is corrupt?!!!???!?!?one!??@!!\n\nThe fuck did it get to this point?  Really. How? I don't understand.\n\nEdit: On top of this, why would the leader of a secret globalist cabal go around starting global wars?  ", "This is who she is when she wears her emotions on her sleeve:\nhttps://www.buzzfeed.com/rubycramer/hillary-clinton-wants-to-talk-to-you-about-love-and-kindness?utm_term=.tfmRQNXr6b#.poXQlyxqmZ\n\n(She doesn't speak this way normally because people laughed at her and being laughed at doesn't advance your policy goals unless you're a cultural critic like Jon Stewart or something.)", "As far as I know that was exactly what you said.", "She was wearing Michel Jackson's coat. lmfao I knew this was gonna happen.\n\nFEM NAZI!!!", "Despite my preference for Bernie overall, I do think HRC will be a good president for womens issues. Bernie would not have been bad, and I think they would both get pretty high scores from womens groups, but I somehow think she might be better on that issue.\n\nGive her all the crap in the world for corporate ties and voting for Iraq and all her flaws. But it's hard for me to argue that HRC will be a bad president for womens rights issues. I could be wrong, since she's not always been supremely honest to us, but I think that's one thing she will do well.", "And he could do it in just his first term!  High energy.", "Trump just walked off from his rally.  Hillary still going hard.  Anyone wanna talk about Stamina?", "From her record racial justice, health care, education, and climate change. (Her Senate voting record tracks Bernie's pretty well, and one of her first gigs was investigating the segregated 'academies' that sprang up when public schools were integrated in the South, then there were her activities as First Lady of Arkansas ...)", "I don't follow NFL but aren't the Pats and Belichick like, the most hated team and person in the league?", "If 40% of voters will always vote one way and 40% the other, then the race comes down to the final 20%. If one side wins the vote 55-45 then they pulled 75% of undecided voters which is a landslide.", "And the letter from the NFL... and donating to 9/11 charities... and Obama screaming at protestors... and global warming being a Chinese hoax... and not having said that global warming is a Chinese hoax... and on and on. \n\nWhats so interesting and unique about Trump is his willingness to make up lies on the spot about small things that don't teally benefit him, and which are easily disproven. Why even bother claiming that Brady voted for you? Why impersonate an imaginary spokesperson to call reporters and praise yourself? What is the benefit of the NFL letter lie?\n\nMost politicians at least have the decency to lie for self-aggrandizement. This random pathological stuff is just weird.", "Ooh I got it! Was it *nothing*?", "&gt;Trans people just sort of get caught in the middle of measures meant to add extra punishment and potentially deter rape.\n\n**Are you fucking serious**?  \n\nThis is absolutely **not** about rape in any way.  That's a cheap pandering excuse--this is bigotry and persecution of trans people. That is the beginning and end of the discussion of this law's rationale.  \n\n&gt;Some women don't want that on the basis that male-on-female rape has the uniquely feminine consequence of a potential pregnancy. \n\nBecause rape is only traumatizing if you get pregnant.  Right.   ", "One guy I knew took a swimming class with us. We were asked \" What happens if you see your feet during a turn?\" and he answered, \" A friggin miracle.\" Never laughed so hard.", "Especially as trump is going to lose. A lot of republicans can see the writing on the wall and they know that Trump will be considered a pariah after this election. Nobody will want to have to tell their grandkids in 20 years that they voted for someone like trump over the first women president.", "Pretty low. Need to undo years of gerrymandering.", "But still impossible to get any laws passed... especially if Paul Ryan gets voted out as speaker and a member of the Tea Reich gets voted in.", "&gt; You have ~~to help~~ dealt with an unbelievabl~~e~~y slanted and negative media and have come out beautifully.\n\nI think this is the actual quote", "The difference in the tone of speeches was night and day. \n\nHillary's was a message of positivity and progress Donald's was doom and gloom. ", "I'm saying Belichick hates creating distractions for the Pats he just wants them to focus on the next game. That's why I'm not buying that he writes a letter like this because it's a distraction.", "\n\n&gt;Obama just endorsed Crooked Hillary. He wants four more years of Obama—but nobody else does!\n\n@realdonaldtrump 11:22 AM - 9 Jun 2016\n\n&gt;Delete your account.\n\n@hillaryclinton, 11:27 AM - 9 Jun 2016\n\n5 minutes.  It took them 5 minutes.", "&gt; he\n\nShe", "She gracefully conceded in 2008 in the primaries and you have absolutely no reason to think she'll question the outcome this time, but knowing your type, you're probably not too keen on using facts from the past to predict probabilities of events in the future.", "The killing blow came at 4:46 in the video: \"Why don't you release Trump's taxes if you believe in transparency?\"\n\nCheck and fucking mate you fucking short-fingered orange Oompa Loompa defender.", "Proof?", "The depths this guy will go to pander to the crowd oh my fucking god. Bill would never in a million years write a politically charged letter during football season and it sure as hell wouldn't sound anything like that. ", "&gt;Lady Gaga dressed like a nazi at Hillary rally. \n\nNo.\n\n&gt;Foreshadowing? \n\nNo.", "Belichick is also really good friends with Bon Jovi and tonight he played at Hillary's rally.", "Shouldn't he be saying \"take it from me the electoral college counts\"? He won the popular vote. ", "He just barely lost Florida though. Every vote counted there.", "This is crazy even for Trump. I mean would he really just make up a phone call, two endorsements, and a fucking letter that can so easily be disproved by Tom or Bill? Like is there any way he's *that* fucking stupid?\n\nIf he actually made this shit up, Brady and Belichick have an obligation, in my opinion, to come out and refute this. I know that goes against how the Patriots organization usually conducts itself, but they should really deny this if it's not true. The Gisele comment on Instagram is certainly interesting...\n\nPart of me believes this has to be true, because the level of idiot you would have to be to lie about this would be on a whole new level.", "That and he always has the old fallback: he could just show all the billions upon billions of dollars he makes - merely by releasing his tax returns.", "It amazes me how much has changed i didnt know. \n\nFor example a couple weeks ago i was looking up some information on past candidates like Trump. George Wallace being one. I came across the [story of his wife.](https://en.wikipedia.org/wiki/Lurleen_Wallace#Governorship_and_illness) After the birth of their last child in 1961, the doctor found evidence of cancer. Instead of informing her, they informed him and he told them not to disclose the information to her. He never told her (he did disclose it to his campaign staff the next year, nice guy he was). She found out in late 65, and died in early 68 (somehow the fact that his wife was dying didnt stop him from mounting his first presidential bid). Who knows if the fact that she went without care for 3 years changed her fate or not, but it amazes me that this was even in his hands, not hers. ", "I'm just going to spam this comment from user OneYearSteakDay until Tuesday.....\n\n#DON'T LET THESE FUCKERS OFF THE HOOK.  \n  \nCongressional Republicans didn't rescind their endorsements [when Donald was calling for killing innocent civilians](https://youtu.be/I1eXRXL0nkk?t=1m13s) or when [he doubled down on killing civilians](https://www.youtube.com/watch?v=m_qEBwwET0s), when [he called African-Americans thugs,](https://twitter.com/realdonaldtrump/status/592910662424223744) when [he asked gun owners to do something about Hillary Clinton,](https://www.youtube.com/watch?v=ELL-aYFgkXI) when [he questioned my President's ancestry and religion,](https://www.youtube.com/watch?v=FlpaEXWe3Zs) when [he implied that vaccinations cause autism,](https://www.youtube.com/watch?v=G23Y8R-KcKA) when [he promised to ban a religion from immigrating to the United States,](https://www.youtube.com/watch?v=eh7XaJlvJIg) when [he invited Russia to hack a US citizen,](https://www.youtube.com/watch?v=gNa2B5zHfbQ) when [he advocated for torture,](https://www.youtube.com/watch?v=oxZv1Wq2c28) when [he demeaned women (pick one),](https://i.imgur.com/sYqvfDR.png) or when [he said that Mexico was sending us rapists and criminals.](https://www.youtube.com/watch?v=apjNfkysjbM)  \n  \nTheir endorsement stood through each and every indefensible thing he's said or done.    \n  \n#DONALD TRUMP WAS UNACCEPTABLE BEFORE THE FIRST ENDORSEMENT WAS EVER GIVEN.\n  \nAny sitting politician who endorsed this man before, during, or after this campaign deserves to lose their job.  Donald Trump has been an unacceptable choice since day 1, since before we heard *any* of this, but they endorsed him anyway.  House and Senate Republicans were willing to risk the wellbeing of the American people, and nominate a madman, in an effort to preserve the appearance of party unity.  They care more about obeying the Eleventh Commandment than they do protecting their constituents.  \n  \nWhat we heard today might very well be his last offensive comment, but it's certainly not his first.  \n  \n#ANYONE WHO SUPPORTS THIS MAN IS WORKING AGAINST THE AMERICAN PEOPLE.  PERIOD.  \n  \nDonald Trump didn't change tonight, he's still the same man he was when Paul Ryan, Mitch McConnell and Reince Priebus endorsed him.  \n  \nIt seems to me that congressional support for Trump is symptomatic of a much bigger problem within the GOP.  \n  \nIs a Republican Congressman endorsing Donald Trump in the name of partisanship and party unity ***that substantially different*** from a Republican Governor turning down a fully funded Medicaid expansion just to spite Obama and the ACA?  \n  \nThe Republican party has been pulling shit like this for the past six years, they've been electing people like Trump since the Tea Party burst out of their chest.  [Donald Trump actually looks normal compared to some of the Republicans on the state level.](https://www.youtube.com/watch?v=UB1bSJB3n10)  \n  \nAt some point you have to put country over party, wouldn't it have been nice if they had figured that out *before:*  \n  \n * [Enacting restrictive voter ID laws.](http://www.latimes.com/opinion/op-ed/la-oe-hajnal-voter-id-research-20160908-snap-story.html)  \n * [Closing schools to pay for tax cuts.](http://www.msnbc.com/rachel-maddow-show/more-kansas-schools-forced-close)  \n * [Detoothing Dodd Frank financial reform.](http://fortune.com/2016/09/13/republicans-dodd-frank-act/)   \n * [\"Papers please\" laws in places like Arizona.](https://www.dailykos.com/story/2012/6/25/1102974/-Supreme-Court-invalidates-most-of-Arizona-s-papers-please-law-leaves-papers-please-intact)  \n * [Cutting public benefits to pay for tax cuts.](http://www.govexec.com/pay-benefits/2016/03/house-republicans-double-down-nearly-300-billion-savings-feds-expense/126952/)  \n * [Firing public employees to pay for tax cuts.](http://www.motherjones.com/rights-stuff/2011/06/who-getting-screwed-ohio-budget-cuts)  \n * [Rolling back abortion rights across the nation.](https://www.washingtonpost.com/news/the-fix/wp/2016/06/01/14-states-have-passed-laws-making-it-harder-to-get-an-abortion-already-this-year/)   \n * [Turning down Medicaid expansions to the states.](https://www.advisory.com/daily-briefing/resources/primers/medicaidmap)  \n * [Refusing to enforce the recent gay marriage ruling.](http://www.politico.com/story/2016/07/trump-vp-pick-mike-pence-evangelicals-225623)  \n * [Cutting infrastructure spending to pay for tax cuts.](https://www.washingtonpost.com/news/dr-gridlock/wp/2016/07/20/the-irony-of-the-gops-new-promise-to-cut-mass-transit-funding-donald-trump-loves-trains/)  \n * [Preventing Elizabeth Warren from heading the CFPB.](http://www.politicususa.com/2013/01/29/gop-blocked-elizabeth-warren-director-cfpb-senior-senator-massachusetts.html)  \n * [Refusing to set up public exchanges on the state level.](https://www.dailykos.com/story/2013/9/29/1241710/-Better-Dead-and-Red-How-the-GOP-blocked-health-care-for-red-state-Americans)  \n * [Remember the trans-vaginal ultrasound laws?  Still a thing.](http://www.forbes.com/sites/davidkroll/2013/07/07/state-mandated-transvaginal-ultrasounds-where-are-the-medical-societies/#be692e26c74f)  \n * [Voting more than fifty times to repeal the Affordable Care Act.](https://thinkprogress.org/gop-lawmakers-vote-to-repeal-obamacare-again-on-groundhog-day-6f0c931a8549#.wrdaey3v3)  \n * [Wasting taxpayer money on repeated investigations into Benghazi.](http://www.nytimes.com/2016/06/29/us/politics/hillary-clinton-benghazi.html)\n * [Appointing Emergency Financial Managers to replace elected officials.](http://www.theatlantic.com/politics/archive/2013/05/does-michigans-emergency-manager-law-disenfranchise-black-citizens/275639/)  \n * [Preventing the most popular of gun reforms...](https://fivethirtyeight.com/features/most-americans-agree-with-obama-that-more-gun-buyers-should-get-background-checks/)  \n * [...or even allowing gun violence to be studied by the CDC.](http://abcnews.go.com/Health/cdc-launched-comprehensive-gun-study-15-years/story?id=39873289)  \n * [Preventing the appointment of a Supreme Court Justice...](https://newrepublic.com/article/131700/republicans-block-obamas-supreme-court-pick-violating-constitution)    \n * [...or any of the hundreds of other Judicial vacancies in our country.](http://www.thedailybeast.com/articles/2016/05/16/it-s-not-just-merrick-garland-republicans-are-blocking-so-many-nominees-it-s-caused-a-judicial-emergency.html)  \n * [Almost shutting down the federal government...](https://en.wikipedia.org/wiki/United_States_debt-ceiling_crisis_of_2011)  \n * [...before ultimately succeeding...](https://en.wikipedia.org/wiki/United_States_debt-ceiling_crisis_of_2013)  \n * [...and causing the first ever downgrade of the United States credit rating.](https://www.washingtonpost.com/business/economy/sandp-considering-first-downgrade-of-us-credit-rating/2011/08/05/gIQAqKeIxI_story.html)   \n * And generally standing in the way of any bill, law, or amendment proposed by someone with a [D] next to their name.  \n\nCongressional Republicans have blocked more bills, and passed fewer, than ***any other Congress in American history.***  \n\nHow many jobs could have been created if Congressional Republicans had allowed proper public investment?\n  \nHow many more Americans would have health insurance if Congressional Republicans hasn't killed the public option?  \n  \nHow much more secured would our infrastructure be if Congressional Republicans hadn't blocked spending on road and bridge repair?  \n  \nAnd this is just off the top of my head.  If someone wanted to take the time and do the research they could easily double or triple the number of things that State and Congressional Republicans have royally fucked up over the past eight years.  It sure would have been nice if they had been working for the benefit of our nation instead of just working to stop Obama.  \n   \n[And](https://leanleft.com/2016/03/21/to-our-conservative-friends-if-gop-policies-are-so-great-please-explain-kansas-and-louisiana/) [Kansas.](http://nymag.com/daily/intelligencer/2016/03/gop-must-answer-for-what-it-did-to-kansas.html)  [Poor,](http://www.chicagotribune.com/news/opinion/zorn/ct-kansas-conservative-brownback-economic-disaster-zorn-perspec-0518-jm-20160517-column.html) [poor](http://washingtonmonthly.com/2016/07/03/kansas-experiment-in-right-wing-economics-is-still-failing-miserably/) [Kansas.](http://www.motherjones.com/politics/2016/05/sam-brownback-kansas-tax-cuts-trickle-down)  \n  \nEdit: Please watch and share the first video in this post.  I could ask the same of all the videos above, as I do think they're all worth watching and sharing, but that first video just sends chills up my spine, and I think it's important that other people see it and understand exactly what he's saying.  It's 40 seconds long.  \n  \nEdit 2: If you have RES, Reddit enhancement suite, you'll see a button at the bottom of this post that says \"Source.\"  Clicking that button will bring up a raw, unformatted copy of my comment that can be copied and pasted for future use, or use in other Reddit threads.  You have my permission to copy or link anything and everything here.  \n  \nEdit 3:  Thank you for the gold!  I love gooooold!  Stop giving me gold.  Seriously, I appreciate the gold, but give the money to hurricane relief or donate to a Presidential candidate that can defeat Donald Trump.  What I want more than gold, far more than gold, is to see these ~~assholes~~ Republican politicians get what they deserve this November: [Unemployment benefits.](http://www.cnn.com/2014/02/06/politics/unemployment-insurance/) ", "If Trump had claimed \"Rex Ryan wrote me this letter..\" I would *totally* believe this shit. But you're trying to tell me Bill Belichick - THE Bill Belichick - wrote that letter? Get the fuck out of here.\n\nI'll even give you that Bill and Tom might be voting for him - lets put that aside for now. There's no way Bill wrote a fucking endorsement letter during week 9.", "Did you know that we have been allies with Saudi Arabia since before Clinton's Husband was in the White House?\n\nDid you know we have been giving them money and arms deals for alot longer then she was SoS?\n\nOr do you just like misleading people with false information in hopes that your lies persuade them to go against something you don't like?", "He wins even if he loses. His brand is his greatest asset and thanks to this election, he has millions of new people willing to follow him and what he says. My money is on the Trump TV idea, where he will make himself the voice of the alt-right, and use that voice to promote his brand. And with that brand sell a bunch of subpar quality crap to people dumb enough to buy it. ", "Why tell the truth to a crowd that will boo you for it? Donald Trump beat 16 other Republicans by being the only one to tell the base that all their fantasies were true.", "That's probably the absolute worst part of the GOP voterbase cult around Trump how they keep insisting he's so _honest_. In fact, he's probably the most dishonest candidate to date. Every time he claims someone else said or did something, they pop up and go \"uh, no, that didn't even happen\", and yet his obsessed following refuse to accept the obvious: Trump is a pathological liar.\n\nSadly, the group he lies the most to, is the same group who thinks he's the most honest...\n\nThis election will definitely go down in history as one of the greatest American shitshows ever.", "A fifth-grader who just had a vocab quiz including the words tremendous unbelievable, beautifully, and remarkable.", "Everyone is forgetting about Trump's publicist [John Miller.](https://www.google.com/amp/s/www.washingtonpost.com/amphtml/politics/donald-trump-alter-ego-barron/2016/05/12/02ac99ec-16fe-11e6-aa55-670cabef46e0_story.html)", "lol.\n\nFirst off -- at this point way too late to matter except, I guess, for his conscience.\n\nBut more importantly -- who gives a shit about Ari Fleischer's endorsement?\n\n", "Honestly I find it ridiculous that people would recognize being of working class backgrounds gives politician an important perspective on their constituents' lives but the minute you point out black people or women can feel the same about a black or female candidate all of a sudden it's some kind of tribalism or irrational.", "I feel like that this and so many other things are in this category of \"Trump is really weird right?\" that we just haven't spent enough time on. Like the guy is really fucking weird, right?", "I bet you Trump has been planning this for a while. He knew to wait until the day before the election to come out with this because when Brady and Belichick come out and say it's not true, it will be too late. He'll be President-elect Trump at that point, and when asked about it, he'll just say someone handed him the letter and he didn't know it was forged. \n\nThis was his master plan. Because of course the voters all love The Patriots and will vote however they vote. After all, they are called The Patriots. You have to do what they say otherwise you're not a patriot.\n\nHoly fucking shit. Every day he drops further in my estimation. Today he went down another two notches, reading this and reading that he doesn't use a computer. ", "We know how the Clintons have become relatively wealthy. Speaking engagements and their books. It's not through their foundation. Good grief.\n\n&gt; hey certainly don't seem any more altruistic than Trump  \n\n The Clinton Foundation is literally an A-rated International charity. I don't care at this point what it seems like to you it's clear they ARE more altruistic than Trump. And unlike Trump they even donate to their charity.  \n\nGood grief. ", "[Yeah it's not like she presided over a massive arms deal with Saudi Arabia when she was secretary of state or anything.] (https://web.archive.org/web/20101205012554/http://www.jcpa.org/JCPA/Templates/ShowPage.asp?DRIT=1&amp;DBID=1&amp;LNGID=1&amp;TMID=111&amp;FID=376&amp;PID=0&amp;IID=5177&amp;TTL=Arms_for_the_King_and_His_Family:_The_U.S._Arms_Sale_to_Saudi_Arabia) It's cool though I'm sure that none of those weapons were involved in [Saudi Arabia's invasion of Yemen] (https://en.wikipedia.org/wiki/Saudi_Arabian-led_intervention_in_Yemen).", "I will gladly own it. I'm for diversity. ", "They actually voted on Supreme Court nominations ", "If only you were the real Tom Brady. This could've been gold GOLD JERRY!", "&gt; His net worth is substantially less than a billion dollars\n\nI think this is the big one he doesn't want people to know. He doesn't want to ever have to admit this in public. \n\n&gt;Edit: Apparently you can't tell NET worth from taxes. Also you must do thorough research before posting opinions about a pathological liar. Also I am one of \"you guys.\" Whoever we are. Go team!", "Leading to my favorite response from her team\nhttps://twitter.com/hillaryclinton/status/750868980299104256\n", "Blind trust: voting for Donald Trump", "Honestly it's Jeb Bush's fault. Great GOP candidate on paper, very well funded, but was a wet towel early in the primaries that got hung out to dry.  That said, many of the reasons Jeb was a great candidate on paper (former governor of a swing state, apparently intelligent, bilingual, married to an Hispanic woman, but solid on conservative principles) became anathema to a critical mass of republican primary voters because he lacked charisma.  The plurality of republican voters wanted an ostensibly rich, outwardly racist snake oil salesman, and no other candidate could weather it.  ", "*sniff*", "&gt;If lawn signs are any guide\n\nStopped reading right there.", "Thank god someone finally called Sean Hannity.", "Is it supposed to be a racist quote? I mean I don't doubt that she was because history, but this quote just demonstrates an uncompromising effort towards women's suffrage. Classic idealism: She won't put women's suffrage behind that of another group of men, even if it might be a nice intermediate step towards achieving her goals.\n", "The unpopular health care reform that lead to its main proponent being reelected in a landslide? That one?", "&gt; If Trump did try to cause carnage the American system of government is designed to stop him, says Freddy Gray\n\nGreat subtitle, great argument, really. So vote for the him, and hope the system protects you from his tantrums.  \n\nGood thing he is not running on some tear down the system platform, and that he hasn't sorounded himself with sycophant and enablers.", "Every family has that one dickhead. They probably need a hug or something. ", "I was saying Joo-urns.", "Waste it on Gary Johnson instead.", "Tremendous bigly.", "What's even more absurd about this is that trans people have always gone to the bathroom of the gender they preferred. It was a non-problem since basically forever. ", "Saying we are winning does not encourage complacency. People like voting for winners. There's studies that say being perceived as winning helps you win. That said what is important here is honesty and honestly Clinton is more poised to win than Trump according to all the data we have at our disposal. ", "&gt;Barbara Bush set aside her presidential aspirations \n\nWait was she seriously itching to get into politics?", "&gt; at this point way too late to matter except, I guess, for his conscience.\n\nForget conscience, he's cynically trying to put down a marker for history.\n\n\"You supported a madman for President!\"\n\n\"No I didn't\"\n\netc", "Yup. That's why I voted. I am in calif and my vote most likely won't matter anyways but i want him embarrassed ", "This is what I exactly don't get how come this cycle the line up was this poor? I mean from all those you could push forward this is what you got? The Republicans (hopefully) deserve to be destroyed but by no means this was any campaign as a non American I enjoyed watching but for worse got seriously nervous about even the idea of having a nutjob like Trump in the white house. I mean this is the most powerful position a man or woman can have, and then there is a chance he gets into that seat. Seriously Americans get your asses out your seats and vote. This is not an option.", "Who can blame her? Big Candy always knows how to sweeten the deal.", "You owe an apology to children everywhere for that analogy", "Confirmed 2 fairly liberal female Supreme Court justices.", "&gt; In WikiLeaks entire existence they have not leaked fake material\n\nYes they have. Their most famous video release was heavily doctored to fit a narrative.", "Did you even read your own fucking article?\n\n&gt; **CNN said it does the same with Republicans** as part of efforts to present the best interviews.\n\n&gt;“When preparing for interviews we are regularly sent suggestions from rival campaigns and political parties, both solicited and unsolicited,” said CNN spokeswoman Lauren Pratapas. \n\nThis is normal and unremarkable. ", "Well they voted for Duterte so yeah.", "Complacency empowers Trump. I like that we are all confident in a Hillary victory but it's unnerving that people think this election is not as tight as it actually is...", "Having been in Trump's camp this long I'm surprised at this point he just didn't wait until CNN called Florida, or some key battleground State. \"I've done some deep soul searching over the past 30 minutes or so, and I can no longer, in good conscious support someone so divisive, temperamental, and ill-suited to the Presidency of the United States...\"", "Here in California both of my senate choices are democrats, which is interesting.", "This is a really silly comment to make. \n\nFirstly Donald Trump is an elite. He's worth over 3 billion dollars. The average American is worth $301,000. The median American is at $44,900. \n\nSecondly, *the people* are both Trump supporters, and Hillary supporters. To suggest that the people only support Trump, while all Hillary supporters are 'elites' is asinine.\n\nThirdly, they wouldn't be rightful in their anger. They're *willingly talking about voter intimidation* - ignoring and infringing upon the rights of the people. Once they do that, they have no moral or legal standing to be upset about someone else's actions, least of all a Supreme Court judge who refuses to recuse herself. ", "&gt; It feels like she isn't really allowed to talk about it\n\nI hope she talks about it tomorrow. ", "Name a single president who has managed to piss off every single demographic besides uneducated white males.\n\nWhat other demographic is going to vote for him?\n\nThe blacks? Yeah right.\n\nThe record turnout of Hispanics and Latinos? Totally!\n\nMuslims? \n\nMilitary Families/Gold Star Families?\n\nLGBT?\n\nWomen?\n\nYou catching the drift by now?", "&gt;Conservatives who for 8 years sowed the dragon's teeth of partisan politics are horrified to discover they have grown an actual dragon.\n\n\\- Stephen King", "Yeah dude the Saudi's are not Iran... If she personally pushed for arms sales to Iran or North Korea you might have something but I mean the Saudis fly a first world Air Force sold to them by us. Would you rather the Russians or Chinese sell them arms? ", "\"I was traveling across Mali Cote d’Ivoire, and Sierra Leone when Trump escalated his comments suggesting that he’d try to put Hillary Clinton in jail and doubled down on his assertion of “rigged elections.” People there knew exactly what he meant, because they have heard that rhetoric before. This is the language of lands without strong institutions, bereft of the mutual trust that glues our democracy together. It’s the language of civil wars.\"\n\nhttp://qz.com/827376/america-is-more-fragile-than-you-think-a-marine-corps-officer-on-why-voters-must-defeat-donald-trump/\n\nThat sums it up pretty good for me.\n\nDemocracy is an institution. It can be undermined and destroyed just like any other institution. To deny that some of Trump's messages have openly attacked the institution of American Democracy is folly. It's your right to believe that it's not that serious, but I argue that it is.\n\nI personally believe that twelve to twenty years of Presidencies like a potential Trump Presidency would be enough to end American Democracy. Electing him would be the beginning of an extinction level event.\n\nYou saying that it's nonsense doesn't dismiss my fears, nor the fears of the past five living Presidents who agree with me (Carter, Bush, Clinton, Bush, Obama). \n\nI'd love to expand my argument if you feel up to it. I'm just as passionate about it as it appears you are about your opinion.", "no but Im anti Pussy grabbing so the choice is clear!", "Shut up Gary. We're in the middle of something. ", "https://www.opensecrets.org/pres16/contributors?cycle=All&amp;id=N00000019&amp;type=f\n\nTop 5 contributors to Hillary's 2016 campaign:\n\nCONTRIBUTOR\tTOTAL\nPaloma Partners\t$20116,500\nRenaissance Technologies\t$14,034,550\nPritzker Group\t$12,626,207\nSoros Fund Management\t$10,553,418\nSaban Capital Group\t$10,050,438\n\n\nBut now we've gone from \"Well Saudi Arabia donated $25 million so they own her\" to \"Well JP Morgan, Citigroup, and Goldman Sachs donated a bunch of money, so they own her.\"\n\nLike, what if Saudi Arabia says \"do this\" and JP Morgan says \"no, do this\"? WHAT HAPPENS THEN? IT'S ANARCHY I TELL YOU!\n", "&gt;But CNN said it does the same with Republicans as part of efforts to present the best interviews.\n\n&gt;“When preparing for interviews we are regularly sent suggestions from rival campaigns and political parties, both solicited and unsolicited,” said CNN spokeswoman Lauren Pratapas. “Casting a wide net to ensure a tough and fair interview isn’t just common media practice, it’s smart.”", "Assange has been using Wikileaks to conduct a personnal vendetta against Clinton for years now. I refuse to believe there aren't any Russians leaking info about their corrupt regime when shit like the Panama Papers got leaked outside of Wikileaks. Assange has become a political tool.", "Gladly.", "I could stand about 3 minutes of it. It's cognitive dissonance. Republicans have been working their asses off to undermine workers eliminating their unions and even the minimum wage raises if they could have. Walmart not only does not pay enough to their workers, but then gets their workers on government assistance to help them to afford living. It is wrong to undermine workers. More so out of spite for the liberals.\n\nSean Hannity has a bright future in either Trump TV or Breitbart TV or KKK TV, whatever comes first.\n\nOf course voters own the results of the elections. Even if Trump would not like to concede it. That's Democracy 101. That's also why they would not willingly risk it on Trump. \n\nThis election is shaping up to be a major country side vs urban centers contest. Either one would have a hard time believing the results when they lost it. Trump is right that this is not a from scratch election, as states that always vote Democrat or always vote Republican don't even care about the nominee that much, they just care for the party. It is rigged insofar as people will stick to what they know.\n\nPundits have had a wild ride this election cycle. They profited a lot.\n\nAbout the gridlock, well guess what Wall Street, banks etc like gridlock. So that Republicans don't allow Democrats to raise taxes or to come up with new regulations.", "So if there's been extreme voter fraud on the Dems why are only Trump supporters getting caught committing voter fraud?", "How on earth has \"multiculturalism\" made your life miserable? Especially because you're only 17 and *oh that actually explains everything*. ", "Brady has talked about how he is friends with Trump constantly. A Make America Great Again hat was in his locker. \nBelichick was out with Trump for dinner in the spring. \nActual endorsements from either of them is not far fetched at all\n\nhttp://www.cbssports.com/nfl/news/bill-belichick-knows-how-to-smile-proves-it-in-photo-with-donald-trump/\nDonald Trump might not win the Massachusetts vote during the election in November but he's definitely going to sweep the New England vote. The New England Patriots, that is. \n\nNot only is \"The Donald\" friends with Tom Brady and Patriots owner Robert Kraft, but apparently, Trump is also \"good friends\" with Bill Belichick. \n\nThe Patriots coach was in Florida over the weekend, where he had dinner with Trump. Belichick's longtime girlfriend, Linda Holliday, also attended the dinner and she shared a few pictures of the get-together on Instagram.", "The problem isn't that people call Trump Hitler it's that Trump is really similar to Hitler.", "I cast my vote last week without even having heard *of* this speech. I'm starting to truly think I did myself and my vote a disservice in the attitude I wore. Thank you.", "&gt; unlike the Trump foundation which only claim to fame is buying a 6 foot potrait of Trump himself.\n\nNow that's just false.\n\nHe also paid a $7 Boy Scouts membership fee with it.", "Holy fuck you're serious. So you are saying that her neighbors who might know her on social media would forget where she lives because she was on social media?", "Literally the very first sentence of the article:\n\n\"Tom Brady was asked Monday morning on a Boston radio show whether he’d taken advantage of Massachusetts’s early voting period which ended Friday.\"", "&gt; \"He's kind of an idiot but I think that's what we need.\"\n\nThis fucking election...", "Trump makes money by ripping people off -- it's no secret never was.  That just shows how \"smart\" he is.", "The information is not wrong but you are presenting it as if the only reason Saudi Arabia received the arms deal was because of her and thus any US made weapons used in Yemen must be her fault.", "Actually his voodoo economics set us on course for 35 years of rising inequality.  He also believed that trees cause pollution, with unsurprising results re: his cabinet's environmental policies.", "Without a democratic Senate no judges will get appointed to the Supreme Court. Republicans have said they will continue to be obstructionist and refuse to confirm any of Hillary's nominees.", "Kellyanne is going to kick off her shoes and have the biggest fucking glass of wine today and revel in the fact that she doesn't have to spin his idiocy anymore.", "He's gonna pretend it was an imposter. ", "I think quite the opposite it is a sign of pure respect. ", "stuff like this really makes me cry.  wish my great grandmother could have lived to see this ", "&gt; If you receive money you are influenced. No ifs or buts about it.\n\n“They spend $40 million $50 million. Am I supposed to dislike them? I like them very much.”\n\nBy your logic, is Trump is Beholden to the Saudi Kingdom for upwards of $50m?", "We have mnemonics for a reason: MRA\n\nMisogynist\n\nRacist\n\nAuthoritarian\n\nhttp://www.vox.com/2016/11/1/13480416/trump-supporters-sexism", "This is a real thing and this makes it a very unfortunate economic vicious cycle. ", "We get to vote for the top two from the primary. Republicans don't stand a chance. ", "Among all the other racist rhetoric....probably not going to help Trump that he managed to raise the specter of interment camps housing Japanese Americans during WWII as some kind of justification for...I don't even remember now. Was it kicking out Muslims or putting Mexican immigrants into similar camps or something? Maybe it was someone else. \n\nAnd then the incessant scapegoating of China for any and all economic maladies. I don't imagine Chinese Americans would find themselves drawn toward that talk either. \n\nSo many chickens could come home to roost tomorrow. I hope so. ", "In the past decade Asian Americans has voted Democrats over Republicans by roughly 2:1 margin, and the gap has been widening.\n\n* http://fivethirtyeight.com/features/asian-american-voters-are-diverse-but-unified-against-donald-trump/\n\n* http://www.dailymail.co.uk/news/article-3888888/Asian-American-voters-Republican-turning-Democrat.html\n\n* http://nymag.com/daily/intelligencer/2016/10/asian-americans-return-to-or-stay-with-democrats.html\n\n* http://www.huffingtonpost.com/latino-decisions/asian-american-voters-in_b_12637044.html", "The primary is not a governmental thing it's a thing organized by the parties, I'm upset that Sanders didn't get the nomination, but it was a party and a business decision. Do you go with the person who has worked for your organization for 30 years or do you go with the guy who (while he has voted in line with our views) just joined the organization? This is politics at its most basic form. It would be nice if you helped us rack up the margins to defeat the most immediate threat, but considering that \"millennials\" make up the largest voting block in the United States, we can change the party structure by sheer occupation (the political revolution Sanders believed in starting).", "for fear of being called partisan and choosing sides etc.\n\nLet them have their little hole then remove it when the election is over.", "That speech he gave was absolutely incredible imo. Enjoyed every bit of it gonna miss him.", "Gary: \"Vote for me and flush your ballot down the toilet. It's the same outcome\"", "Even more unethical than grabbing women by the pussy without consent running a fraudulent university, paying off AG's to drop lawsuits against him, making racist statements about Federal Judges, attacking a gold star family, making fun of the handicapped, denying apartments to black people, lying +20 times a day, colluding with the Russian government whom his campaign manager is under FBI investigation for, advocating for gun owners to \"do something\" about his opponent, allegedly raping a 13 year old, sexually assaulting a dozen women, forcing a porn star he had an affair with to have an abortion, joking that his building was now the tallest in Manhatten on 9/11 where 3,000 people were killed, n record of any donations to 9/11 funds within at least a year after, bankrupting 6 companies, losing a billion dollars in 1 year, suggesting climate change is a hoax perpetrated by the Chinese government, suggesting that we stop regulating poisoned dog food (yes poisoned, so it would be a okay if it kills your dog), attacking football plays who receive concussions, claiming someone who was captured and tortured for 5 years in a POW camp wasn't a war hero, going on a 3 AM twitter rant telling people to look up a former Miss universes sex tape because he thought she was fat...\n\nAnd that's just scratching the surface.  Whatever is in Trumps tax returns is worse than all this.  ", "If a few hundred more people in Florida voted for Gore he would have won the election. Do you guys not understand my original comment?", "Lol sure even if she resigns the next day she would go down as a great president who did a great service for the American people saving them from Trump. ", "Millsfield wasn't included in them in 2012. Millsfield went 16/5 in 2012.", "If by everybody you mean trump supporters then yes but the vast majority of every one else do not lash out violently to anyone let alone a disabled kid.", "The US have been allies with Saudi Arabia since before BILL Clinton was in the White House.  \n  \nThe US has been giving them money and arms deals for a lot longer than what she's ever been in a position to even try. ", "It seems like Gore learned the wrong lesson from 2000... \n\nThe real lesson: \n\nVotes in Florida count triple.  Fuck everyone else. ", "Maybe he shouldn't rephrase anything because we all know exactly what he meant and who this was directed toward.", "&gt;Think how this would divide his locker room.  Belichick had nothing to do with this letter.  Donald Trump completely fabricated this letter.  It's really quite amazing that this is where we're at. \n\nBill is hating this letter from beyond bipartisanship and straight into \"are you fucking with my playoff run?\" \n\nBill won't even hint at injuries in the coming days but he'll make public a political position that will divide his locker? Even if Bill did vote for Trump he would keep that private and not make it a distraction. ", "&gt;This is like I don't know...sending yourself flowers.\n\nOr calling the tabloids pretending to be a friend of yours expressing amazement at how many women you sleep with and how good you are in bed.", "I've been saying this all along. Trump doesn't lie because lying would require him to know fact from fiction. Trump lives in a narrative that he makes up as he goes along and uses his money to make sure everyone around him maintains his fantasy.", "But Republicans are always a bit forgiving on gender issues - now imagine the hot water he'd be in if he insulted Gold Star Families or attacked POWs?", "Michelle put it best when she pointed out that the true victory is not that young girls think they can be president but when they don't think it's a big deal. ", "&gt; \"I'll get back to you later\" and hung up\n\nnow that sounds more Belichick", "You don't understand Bill Belichick if you think there is a chance he would write a letter in trump speak endorsing such a divisive candidate in the middle of football season. ", "&gt;Birther bullshit\n\n&gt;Calling Mexicans rapists\n\n&gt;Muslim ban\n\n&gt;Make fun of disabled\n\n&gt;Scam University\n\n&gt;Racism against Judge\n\n&gt;Pussy-gate\n\n&gt;Endless stream of sexual assault accusations\n\n&gt;And a million other fucking things\n\nNot enough for Fleischer.\n\n&gt;Clearly about to lose election.\n\nThat'll do it.", "I'm somewhat of a Pats fanatic. Was a fan long before Bill took the reigns. I've soaked up every press conference football lecture, film breakdown, and documentary he's done. I can confidently say that the letter doesn't sound like anything Bill would write. It's so full of Trump buzzwords... the only way it would make sense is if Trump wrote it himself or if Bill truly is a big fan of ol' Donald.\n\nBill has never gotten involved with anything like this before, so I'm leaning towards not believing at the moment.\n\nHe also hung up on a Yahoo reporter when he called Bill to verify. Probably because Bill is an old man and goes to bed early.", "EXACTLY. You can offend gays women, disabled, minority groups and people are just supposed to get over it. If you dare say an offensive word against my blatantly offensive candidate though that's where I draw the line!! It boggles my fucking mind. What coward attacks a handicapped person.", "Meanwhile Trump fans are fantasizing about the 50 state sweep he'd have if only men could vote. I'm a man but thank god for Susan B. Anthony.", "&gt;In 1990 one of Trump’s lieutenants told me ““The thing you don’t understand about Donald Trump is that he’s mentally ill.”\n\nhttps://twitter.com/kurteichenwald/status/795700258022035456", "Maybe he should rephrase it to \"Every vote in a swing state counts\"", "&gt;Data from insightus has shown that black people are turning out to vote at 91 per cent in the counties where voting is “unimpaired“ and in the 17 counties where voting rights are \"impaired\", voting goes down to 72 per cent turn out.\n\nThis is actual election rigging. ", "Which is absolutely classic considering how those shilltrolls constantly spew butthurt whinefests whenever a celebrity endorses Hillary.\n\n\"What does Ja thin--- Hey everyone, TOM BRADY IS AN ALPHA JUST LIKE US!!\"", "Look I've spent 15 years having this man be the bane of my existence and I can tell you right fucking now there is no way in hell Bill wrote it. When he gives a shit about something he will give a very intelligent and well thought out response. This letter was written by a moron. A moron who peppers in multi-syllable words to make a half assed attempt at sounding smart. A moron who is one \"Bigly\" short from giving himself away.  \n\nIt doesn't matter what Bill's personal politics are because between the months of August and February the man is a living breathing, coaching machine. He will not stand for distractions nor will he give any real comment on anything that isn't about football. Ask the man a dumbass question and if you're lucky he may acknowledge your presence with a smart ass response. Ask him a smart question about football and he will light up like a Christmas tree and talk shop. This is horseshit. \n\n\nEdit: annnnnd it's been confirmed. Fuck this election so hard ", "So they're for Hillary?", "&gt;Probably because Bill is an old man and goes to bed early.\n\nAre you kidding?  Bill was probably furiously dissecting the game film from the Monday Night game since Seattle is their next opponent.  \n\nBut on a more serious note, Belichick has vaguely self-identified as a Democrat.  ", "Wasn't Deflategate by definition, underblown...?", "Most Tennesseans didn't spray paint \"TRUMP\" on their hate crimes when they committed them before Trump ran for president.", "&gt; If this is true trump is literally clinically insane.\n\nNope just understands perfectly that he can say anything and half the country will believe him.", "and for no reason!!   He'll lie about meaningless things no one cares about!  That is what astounds me. ", "We have the best errors folks. We have errors that you wouldnt even believe.", "As Trump's lawyer reminded us over the allegations that he raped his wife", "Except there's a ton in common between the two and the two have been [widely compared.](https://www.google.com/search?q=george+wallace+trump&amp;oq=george+wallace+trump) \n\nI wasnt even really connecting these particularly terrible acts of Wallace to Trump merely explaining how i stumbled upon the story of Wallace's wife. ", "&gt; Bearded Jewish guy and a Korean guy I knew were on a road trip  \n\nThis sounds like a fantastic TV pilot. ", "Just missing the \"I love your hair\" bit", "&gt;despite all the lying half the country will vote for him no matter what he says or does.\n\nI agree 100% with every word you've written.  The pathetic part is that Clinton has managed to instill enough hatred to make it so.  I keep praying that I'll wake up some morning and discover this entire election has been some sort of macabre fantasy.  Oh, how I wish we still had Hunter Thompson to put all this weirdness in the proper perspective!\n\nEdit- Older Trump supporters who are contemplating retirement should consider how their retirement accounts made out during Bill Clinton's presidency.", "What's more respectable is the strong sense of independence in married couples when it comes to choosing who to vote for. I have a friend of mine who is in this \"predicament\" trying to convince his wife to support Trump and getting a stone cold no. \n\nOur democracy will be half as good if you as an individual won't exercise your rights based on your judgment. \n\nI am excited for the turnout tomorrow. I'm definitely with her - all the way.", "The disaster intervention in Haiti was a mess I'll give you that. But disaster relief in third-world countries is notoriously prone to problems, and Haitian-Americans still support Hillary 19-to-1. \nhttp://www.miaminewtimes.com/news/trump-is-wrong-little-haiti-goes-for-hillary-19-to-1-8864099", "No it didn't that David sirota article was debunked and he lied in it. He used Foreign Military Sales and Direct commercial sales (which she has no control over) and added them together plus kind of left out half of it was negotiated under bush. Nice try though!http://electionado.com/canvas/1471468240377\n\n&gt; 5) SAUDI ARABIA\n&gt; \n&gt; According to the IB Times US arms exports to Saudi Arabia were ~$4.1 B in 2006-2008 and roughly doubled to ~$8.1 B in 2010-2012. However, just like in the case of the UAE, the IB Times failed to recognize that a lot of the arms exports to Saudi Arabia in the Obama era are traceable to arms deals that were incubated during the Bush administration.\n&gt; \n&gt; Let's start with this article from September 2008:\n&gt; Saudi Arabia, this fiscal year alone, has signed at least $6 billion worth of agreements to buy weapons from the United States government — the highest figure for that country since 1993, which was another peak year in American weapons sales, after the first Persian Gulf war.\n&gt; So, Saudi Arabia signed agreements worth $6 B in 2008 but the IB Times listed $4.1 B as the ENTIRE arms sales to Saudi Arabia in 2006-2008 - which means that the numbers for the 2008 deal must have been accounted for in subsequent years during the Obama administration. \n&gt; \n&gt; In fact, the eventual value of all the deals with Saudi Arabia during the Bush era was much larger. \n\n\nHe literally goes thru sirota's hack job shit post and fire bombs it. Also if you don't think sirota is a hack, he wrote an excellent piece on how Hugo Chavez is a great leader! http://www.salon.com/2013/03/06/hugo_chavezs_economi\nc_miracle/ boy he was spot on with that one! Facts are pesky things for people with CDS.\n\n", "The real question is why someone would vote for him.\n\nThese are the insane people not him.\n\nIf you're fooled by a person so fool like Trump, then what're you?", "I mean seriously. A guyb unning for president made up a fake person to brag about himself and we didn't tell him he had to go home. ", "I could see him becoming this bitter old man declaring vengeance on his enemies while constantly playing down his historic defeat. He'd grow a beard go all gray, ramble, and get ignored by everyone other than his most loyal supporters. Everyone else who voted for him would pretend he never happened, or start whistling mid-conversation.", "\"Centenarian for Hillary\"\n\nThat's just.. so cute for some reason. How many people are that like 20?", "This sub is pathetic; posts like this prove it.", "you tried", "I know this is Reddit but the Clinton Foundation actually is a very well-regarded global health and disaster recovery charity. They spend something like 90% of the money they raise on charitable programs, and they have an A rating from several different charitable ranking organizations. They do good work. https://www.charitywatch.org/ratings-and-metrics/bill-hillary-chelsea-clinton-foundation/478", "Is it though? Maine has voted solidly Democrat over the last 6 presidential elections and not a single major poll has Drumpf beating her. Seems like a solid bet.", "If he wins?  \"I won despite rigging against me I have a mandate.\"\n\nIf she wins narrowly? \"She only won because rigging.\"\n\nIf she wins by a blow out margin?  \"They really rigged it, folks.  That kind of margin of victory isn't possible.\"\n\nI just can't imagine a scenario where he accepts anything other than his winning as a fair and true result.", "Such a disgrace. I'm not even American but this is outrageous. \n\n\nIn Australia we got rid of voter suppression, electoral manipulation and gerrymandering since we have independent electoral commissions and compulsory voting.\n\n\nI know yanks can't do the exact same thing, but I hope a liberal Supreme Court can at least put a stop to the GOP's anti-democratic shit, so the U.S. can have a healthier democracy without the cheating. ", "So what you're saying is that Republicans are lousy at committing voter fraud unnoticed", "Your vote matters!  \n\nMillions of others have votes that matter too, though, so, y'know ... math ... \n\nBut yours matters!  It's the one day where the government comes to you and asks you what you think.  You might as well tell them.  Even if your single vote doesn't sway the presidential election one way or the other, you're still voting for Congress and local elections (state house, city council, etc.), and the people in those offices are much more likely to have an impact on your day-to-day life.", "It wasn't \"taking $25 million dollars\" it was her families charity foundation (Which she wasn't even on the board of, so didn't have the ability to accept or refuse) receiving a donation. And she wasn't running a presidential campaign at the time, she was doing her job which involves sucking up to foreign leaders.", "They had a lot of economic anxieties. ", "It's not favorable treatment for cash it's a long relationship that started before you and I were born. Check out youtube documentaries on the history of Saudi ARAMCO. We used to own them, now it's at least somewhat mutually beneficial relationship. Notice the Saudis didn't try to invade the Israelis during the six day war", "You mean when it's not against Republicans. No Republican called it a false flag when a Trump election headquarters was burned.  And Democrats never use the term false flag to begin with. It's Republicans who believe everything is a conspiracy against them.", "Canadian hockey fan here and even *I* would bet my life Belichick didn't write one word of that supposed letter", "I read a breakdown of his vocabulary and literally the word \"tremendous\" is the only 3-syllable-or-more word he uses regularly", "He advocated a national stop-and-frisk program where police would be able to arbitrarily take people's guns away (because of course, they'd be non-white people), so he doesn't believe in the second amendment either. ", "Because she believes in climate change Trump doesn't.   That's pretty well known. ", "Obama is the worst president!!! We deserve better one! \n\nOk here is  our brand-new 2 candidates! \n\nEmmmm actually Obama is not so bad...", "I just avoid visiting mine around election time.  My dads not too bad as a big business type republican and as a right leaning independent we can usually find some safe common ground to talk about.  My mother though, has fucking lost it.  She has freed the beast of her inner racism and now proudly says things like, \"If not liking Mexicans and blacks makes me a racist, then I guess I'm a racist!\"\n\nYes mother, that absolutely makes you a racist, that's the very fucking definition of racism!\n\nFuck this election.  I'm not looking forward to my moms texts tonight.", "&gt;But no public servant should ever become rich... \n\nThat's a nice idea but it's never going to be true. For starters, as a president Bill Clinton makes $400,000 a year for life. On top of that there are book sales, speaking fees, etc, and the investments they make with the money they earn. And speaking fees aren't some big sinister payola thing, most former presidents get paid big bucks for giving speeches even though their political days are well over. A former president and first lady/senator/secretary of state can make tons of money completely legitimately. Also, the last time I looked, Hillary isn't the one who refuses to release her tax returns.", "It's also probably a response to Lebron James publicly speaking for Hillary. Trump wants people to think he has an athlete on his side too.", "Inb4 they just spin off to another debunkable line of attack.", "Yeah but Rex Ryan lost tonight. Trump prefers coaches that don't lose.", "Hold your ground! Hold your ground!\n\nSons of logic of science, my brothers,\n\nI see in your eyes the same fear that would take the heart of me.\n\nA day may come when the voting of men fails,\n\nwhen we forsake our friends\n\nand break all bonds of fellowship,\n\nbut it is not this day.\n\nAn hour of votes and divisiveness,\n\nwhen the age of men comes crashing down,\n\nbut it is not this day!\n\nThis day we fight!!\n\nBy all that you hold dear on this good Earth,\n\nI bid you vote, citizens of the States!!!\n", "Please list reliable sources that show how and when did Hillary put the coal miners out of business and when did she let the illegal immigrants in to steal yer jerbs.", "I doubt Trump is capable of that reasoning. I think the simple answer is Trump has never had to face a single repercussion for lying so he doesn't see any reason not to.", "I don't even know where to begin.  You praise the values of Europe as if it had common values, then say how you wouldn't be comfortable living there.  You've somehow forgotten about the relentless wars that the countries of Europe fought against each other, the rotating cast of governments and kingdoms, and the fact that we had to fight a bloody war of independence to get away from one European power while maintaining a thriving slave trade with others.  And I haven't even touched on what your comment implies about Americans whose origins rest in Africa or Asia.\n\nAmerica is not defined by its ancestry or its ethnicity, its religions or races.  America is defined by choices.  The living and the dead who chose to become American, the laws they chose to establish, the leaders we choose now.  ", "Icky gays are going to continue to get married and violate the *sanctity* of [biblical marriage](http://imgur.com/a/A8WgP) valiant police officers will no longer be able to shoot unarmed black people, and people who've lived here and tried to make a better life for themselves and family might actually have a chance to become citizens.\n\nNOOOOOOOOOOOO     /s", "How do you think swing states turn into not so swingy states? And how do you think not so swingy states turn into swing states? \n\nPlus voting in the majority/minority in solid color states helps gauge public interest. Going all the way back to the primary season: if Bernie voters in solid Bernie and solid Clinton states didn't even bother showing up, then his movement would have looked much smaller and less important than it actually was. It's tough to know where the electorate rests its head when 60 million vote Democratic, 60 million vote Republican, and 93 million don't even bother showing up. Every vote really counts in the end.\n\nTake it from me, I'm in fucking Washington and I voted. 0% chance Trump ever takes this place and here I am.", "This is whats called projection. You're the one pedaling stupid conspiracy theories...not me. First off the mother jones link is debunked IN the article with official government information that is sourced so already I can tell you lied about even looking at the article. Second of all guess this source must not be very reputable http://www.nytimes.com/2008/09/14/washington/14arms.html?_r=0\n\nyou know...just the NYT. Oh wait but another bad one. Just the Middle East Research project. Another \"non-reputable\" source.\n\nhttp://www.merip.org/mer/mer246/washingtons-new-arms-bazaar\n\nso now youre 0/3 and so is Sirota. Want to delete your post and try again?\n\nEDIT: 0/4 http://www.washingtonpost.com/wp-dyn/content/article/2010/01/30/AR2010013001477.html\n\nnow 0/5\n\nThe difference between these two ways of procuring arms from the US, and the associated pros/cons, are explained in these articles. One of the key differences is that unlike FMS, which is managed entirely by the US Government, DCS only requires an export license approval on a sale-by-sale basis and is not managed by the US Government. According to this GAO report:\nFor fiscal years 2008 through 2010, State reviewed 164,998 license applications worldwide and 28,550 for exports to the 13 transshipment countries (17 percent of all applications).[17] It approved 86 percent of license applications for these countries,[18] denied 1 percent, returned without action 13 percent, and suspended or revoked 1 percent of preexisting licenses.[19]\nLet's walk through some of the steps involved in obtaining a DCS license for a single export order:\nA business seeking to sell weapons via DCS has to first get a DCS designation from the Department of Defense (“DoD”)\nThe business then needs to get a license from the Department of State (\"State\") for each individual export\nEach and every export license application gets scrutinized not just by State, but also by DoD and the Commerce Department [recall that State processed ~165,000 license applications in 2008-2010, say ~55,000 per year on average]\nDoD puts each application through a process by getting inputs from experts in all their agencies, starting with DTSA that manages the license process, to Army, Air Force, Navy - Joint Staff, Acquisition, Technology &amp; Logistics and Policy, in order to ensure there are no national security or defense related concerns\nDoD then weighs in with a recommendation to State on whether or not the application should be approved or denied\nAdditionally, for sales exceeding a threshold in the range of tens of $M, Congress MUST be notified as well\nIt is only after all those reviews, would State be able to make a final decision on the license [*Note that President Bush also issued a directive in Jan 2008 ordering the State Department to speed up the license approval process]\n\nIn contrast, if you read the IB Times article, you might be left with the impression that a Secretary of State, sitting in her office, perhaps issued a blanket cross-agency approval for billions of dollars in arms sales via DCS on a country-by-country basis, somehow overriding the detailed license-by-license, sale-by-sale, multi-agency, bureaucratic process involved in every individual sale. Not only was it utterly preposterous for the IB Times to include DCS arms data and tie it to Sec. Clinton, it is astounding that they showed zero interest in understanding or explaining how these arms deals get done and how impossible it would have been for a Secretary of State to issue some kind of secret, country-level, blanket approval for DCS deals.*\n\n*Most certainly, Hillary Clinton would have had no other mechanism to achieve this byzantine plot other than directing her secret cabal of gnomes to infiltrate the organization processing, say, 55,000 license applications a year and have them selectively issue more approvals for all licenses for arms exports to Clinton Foundation donors.\n\nso you didnt read the article and just saw the name and panicked then used a debunked chart based on the official government chart to try and prove it wasnt. Thats...embarrassing. Now scram.\n\nEDIT: oooh ooh I missed some. Perhaps this is a \"shady website\" (the official government document) http://pmddtc.state.gov/DTAG/documents/plenary_minutes_10_08.pdf\n\nall of these are the weapons deals \"clinton sold\" to saudi arabia. the problem is that it was bush and had nothing to do with Clinton except that she was SoS that continued them and actually slowed DOWN the sales. ", "sounds venereal.", "Disagree. You'd have to be pretty dumb to consider Trump for the highest office. ", "You did not understand me did you.\n\nThere is a difference between policy and accomplishments, she has never been in the position where her decisions could cause the effects you blamed on her. All you are doing is spewing forth Trumpisms. \n\nYou got zero evidence and zero reliable sources. ", "Thanks for the insightful article from Breitbart user Hillary_eats_dicks. I look forward you disappearing forever come tomorrow. ", "To be fair he said \"28000 people here including the people outside\"", "Colorado's definitely blue. I think people have been underestimating the population growth we've had from liberal areas and industries. To hammer the point... tech workers (mostly software) are now the most common occupation in the state as of *2014*, and it's gotten even more so since then.", "So Trump is a Russian agent?\n\nDonald Trumpski !", "&gt; at this point\n\n\nohhhhh I think we were here a long time ago. \n\nhttps://www.washingtonpost.com/news/the-fix/wp/2016/03/21/the-amazing-story-of-donald-trumps-old-spokesman-john-barron-who-was-actually-donald-trump-himself/", "I had listened to that before but what jumped out at me this time around was the use of the word \"tremendous\".  It's like a giant flashing sign that says \"This is Donald Trump\", even if the voice wasn't so obviously him.", "I'm a Giants fan but I have the utmost respect for the Patriots organization. Brady and Belichick are legendary.", "Oh bill is running for pres?", "He does regularly claim that he \"went to Wharton school of economics\" as proof of how intelligent he is. I haven't heard a single grad saying \"I went to X Ivy League school\" unless they get a title. At best he's being semantically correct but misleading.", "Literally conspiratard central here. People think he just made it up? Just wrote the letter himself? My god people is there no end to what your biases will let you believe? ", "Varied opinions sure, blatant lies, no.", "\"Who's the more foolish the fool or the fool that follows him?\" -- Obi Wan Kenobi.", "Sean Hannity needs to get water boarded. ", "I wish you were right. He's the Principal Skinner of FBI directors. ", "Ah...the famous Pull Out Method of Trump control.\n\n", "We weren't at war during bill's presidency and enjoyed a booming economy. Facts are apparently,  your personal enemy. ", "I move for a bad trial thingy", "I guess it just goes to show: illegal voter suppression works. ", "\"Varied opinion\" doesn't mean you can't criticize dumb opinions. It's election day dude. Gtfo. No one cares about Bill fucking Clinton today.", "Looking forward to his 3am Twitter meltdown to kick start the election day", "But but but Trump gives speeches to large crowds!", "Oh no. I want to watch it crumble as their messianic Orangutan  crumbles. I want him to rant on twitter till be becomes sick of ranting. I want them to go through the same level of anguish his campaign has caused us. Let them suffer in their own hole. Just don't offer them the ladder when fire ants start coming in.", "Lmao you guys...\nThey asked if he is a early voter/voted allready the day before election.\nHe says no but plans to In the morning\nThen trump says in the night he got an endorsment and tom voted for him.\nAnd you guys claim that trump is lying because of this.\nThere is still a full day between these two events, you guys are swinging and missing on a whole new level", "He met Trump through golf. Brady is an avid golfer Trump owns golf courses.\n\nAlso Gisele is worth a lot more than Tom is. Pats fans always joke that the reason he takes tiny contracts compared to what he could command is because Giisele is the breadwinner and Tom's football money is just some spending cash.", "Hear hear!", "He forced his doctor to write a bullshit letter. Are you really going to act like he is not a liar?", "except that didnt happen no matter how many times you repeat it.", "Welcome to the Season Finale of America!\n\nWill we be renewed for another season? Let's hope so!", "God dammit Texas.I know you can flip. I want to believe. Do it for your country. ", "Good luck yanks. We love you guys. Democracy high fives. You got this.\n- love Australia 🇦🇺❤️❤️🇺🇸\n\nPs. Please bury that spray tanned freak show in a landslide like no other\n", "If Belichick were to say anything it would be along the lines of \"We'll review our mistakes and improve. We're on to election 2020.\"", "In case anyone reading this missed it: This isn't an exaggeration. [He actually called the fucking tabloids pretending to be his own spokesman and bragged about how many women he slept with.](https://www.washingtonpost.com/news/the-fix/wp/2016/05/16/donald-trumps-john-miller-interview-is-even-crazier-than-you-think/)", "Reminder: That movie kept going for at least half an hour after that.", "Brit here. Good luck everyone. We're as scared as you. ", "I read these articles but all I see is \"church wants to pay taxes so it can be politically involved.\"", "I don't think I've ever been this terrified of an outcome before.\n\nI'm reluctant to go with Clinton simply because 1. Her policies aren't terrible (compared to Trumps anyway) and 2. I refuse to take the chance voting third party while in Ohio.\n\nAt least with Romney or McCain I could see why people would want them and I knew the country wouldn't go to complete shit if they were voted in. Not so much with Trumpelthinskin.", "Unfortunately Trump will likely win Texas but that's not what it's about. What's important is that he wins Texas by a small margin. If that happens, then the DNC will actually start spending money here next election. 2010 proved that it doesn't take a lot of money to control a state. This could be a defining day for our state if the DNC recognizes the potential for investing in a voter base here.", "Thank God. US elections last far too fucking long.", "You can always count on Americans to do the right thing-after they've tried everything else. -- Winston Churchill\n\nUncle Drinky really understood us.", "I voted on the first day of early voting.  I know it's a long shot but I refuse to stand idly by if there's a chance to make sure Trump doesn't get near the white house. ", "No you're the puppet!", "&gt; Clinton has managed to instill enough hatred to make it so\n\nRight-wing media witch-hunts have done this not Clinton herself. Clinton didn't exactly make it difficult for them, but with benghazi, the emails, the foundation, and everything else Clinton has been attacked for has been deeply spun by right-wing media for so long, and so hard, that people start to believe she's evil. She's nowhere near half as evil as the people trying to discredit her.", "Surely it's a mock up and not a real fetus.\n\n&gt;...the Rev. Frank Pavone took an aborted fetus laid it upon an altar Sunday and posted a live video on Facebook. Pavone, a Catholic priest who heads New York-based Priests for Life, said the fetus was entrusted to him by a pathologist for burial.\n\nClearly, I'm wrong and there are even more crazy people in the world than I realized.", "&gt; **Who/What’s on the Ballot?**\n\n**OUR PROGRESS** is on the ballot\n\n**TOLERANCE** - is on the ballot\n\n**DEMOCRACY** - is on the ballot\n\n**JUSTICE** - is on the ballot\n\n**GOOD SCHOOLS** - are on the ballot\n\n**ENDING MASS INCARCERATION** - that's on the ballot right now.\n\n\nSource:  [Who else](https://www.youtube.com/watch?v=nKbY9wONBeI&amp;t=15m24s)", "Eastern European here. Hillary may not be perfect but at least her presidency won't result in Russia occupying my country. Please make the right choice people...", "i'm white i'm republican, i'm male. I voted for Clinton. \n\nLooks like his strategy failed.", "What better dragon for the first female president to slay on her rise to the top than Donald \"The living embodiment of misogyny\" Trump?", "It's very odd to me that r/the_donald has guaranteed that I won't be voting for Trump.", "Come join us at /r/the_meltdown! It allows for uncensored commentary of t_d. ", "Did my part already. Let's get this over with no 2000 repeat please.", "Well to be fair, trump's walked around his whole life with those ailments and look where he is now!", "By this time tomorrow it could be legal for millions of Californians to smoke marijuana if they choose to. Here's hoping prop 64 passes. Not into it myself, but nor do I think anyone needs to be arrested for it. Let prohibition end already.\n\nSaw sheriff Bill Gore arguing against 64 on the news. Saying it was unnecessary because they aren't arresting anyone for pot. Such an odd viewpoint. If you're not arresting people for it, it shouldn't be illegal. Free up some of your officers time, and our States resources while simultaneously gaining tax revenue.", "With no exaggeration this is a generational election with literally the fate of the world on the line. Stand with history.", "No worries he's got Rudy Giuliani and Chris Christie in his corner, best in the business.", "How I will feel around 11pm tonight https://media.giphy.com/media/zCME2Cd20Czvy/giphy.gif ", "Terrifying isn't it?\n\nYou have to think Clinton wins. But then we (or at least I did anyway) thought 'Remain' would win...", "This is actually the boat (basket) I think my father-in-law is in. He tells my wife and me that he thinks they're both unfit and won't be voting... Then proceeds to say every Republican talking point... America is weak globalization sucks, Benghazi, locker room talk, Giustra (he didn't actually know he existed, just the vague idea of kickbacks related to deforestation \"or something\"), etc etc. He even parroted a governor attack ad without knowing what it meant or that it was incorrect.\n\nIt's like how anti-vaxxers are embarrassed to say they're anti-vaxxers because..???", "I'm nervous. Trump has already effectively lost the election based on the early vote in Nevada but I am still nervous about the Senate, which the GOP could hold. I'll be devastated for Hillary if after all this she ends up constrained by a GOP Senate. ", "Can I just say handing off my ballot through the window of my car at the polling place was the coolest voting experience I've had yet. So easy and stress free.", "To my beloved sisters and brothers in the United States of America greetings from northern Europe.\n\nThe whole world is watching.\n\nThis has been definitely the most interesting albeit the dirtiest election I have followed so far in my life. I have followed both sides, the silent majorities and the loudest minorities, each passionately vouching for their candidate. I believe that all this is good for your country. I believe that true change can happen only through struggle and tough arguments.\n\nI want you to know this: you have my full support. Yes, exactly you. You as a single person with an opinion about Hillary Clinton and/or Donald Trump, you have my full support. I do not care who you vote for in the end. It is your opinion and that is legit. You are allowed to have exactly the opinion you have, and I support you for that.\n\nI believe that whatever happens in the next 24 hours is going down to history books as one of the key events that shape the future of all mankind. The only thing I am asking you, my friend, is that YOU VOTE TODAY. \n\nRegardless of the result, you will stay in my thoughts. Regardless of the result, you have my full support. Regardless of the result, I love you with all my heart.\n\nThe whole world is watching.", "Don't worry we'll start ramping up for 2020 in about a year. Plus midterm madness in the interval.", "The one thing we can be sure of regardless of who wins, we can expect level headed rational responses from both sides.", "We are all counting on you /r/FloridaMan/. ", "Man what's even the point of a Mississippi thread. It's not like there's gonna be a surprise, We're so red down here our bulls keep having seizures. ", "Trump and Hillary supporters are exactly the same am I right?", "&gt; You got this. - love Australia\n\nSorry to break it to you but they don't have sausage sizzles. You can't be expected to make an informed decision without cheap Woolies sausages.", "Probably less of Florida as a whole and more of the latinos in Florida. I bet those Puerto Ricans are pushing it high as well. They love them some democracy. ", "No.\n\nPlease stop.\n\nNo.", "Remember those voting in PA this ballot measure isn't as simple as it looks-\n\n&gt;“Shall the Pennsylvania Constitution be amended to require that justices of the Supreme Court, judges and magisterial district judges be retired on the last day of the calendar year in which they attain the age of 75 years?”\n\nThis isnt about ADDING a retirement age for judges, it's about CHANGING the current retirement age for judges from the current 70 years old to 75 years old\n\n&gt;A \"yes\" vote supports changing the mandatory retirement age from 70 to 75 for Supreme Court justices, judges, and justices of the peace.\n\n&gt;A \"no\" vote opposes this amendment to change the mandatory retirement age from 70 to 75 for Supreme Court justices, judges, and justices of the peace.\n\nhttps://ballotpedia.org/Pennsylvania_Judicial_Retirement_Age_Amendment_(2016)", "The only white people voting for trump are those who aren't smart enough to realize that their intelligence is being insulted.", "Everyone get out and vote. It can't be said enough.", "I've been thinking a lot about election day 2012. I spent the evening chugging a bottle of cab in the bath CNN's election coverage playing on my laptop, completely distraught that Mitt \"Binders Full of Women\" Romney would be my next president. \n\nIt seems so silly now. ", "&gt;  demand the ballot for the Negro **and not the woman.**\n\nI think this is the key bit\n\nShe was actually in favor of universal suffrage for everyone, woman and blacks\n\nShe was not in favor of limiting the expansion of suffrage just to black men", "Pantsuit engaged vote cast.\n\nI first saw Hillary when she visited my hometown stumping for Bill when I was 16. Honored I got to cast a vote for her 24 years later.\n\nNo fascism in our time!", "Cali will stay blue forever. Most of that forever is under water off course", "Not getting mine fucker.", "Trump creates his own reality as he goes along like Wile E Coyote running into the tunnel he just painted onto a cliff-face. \n\nTomorrow we'll see if Trump (along with r/the_donald, and everyone else who drank the koolaid) catches the Roadrunner, or comes out of the tunnel concertina'd on the cow-catcher of a locomotive.", "Don't fuck this up America I want to pick up my ban on /r/the_dipshits later tonight with a big smile on my face. \n\nedit: [Anthem for tonight](https://www.youtube.com/watch?v=GZc8tBtIDhI) ", "I'm from a certain Clinton state and I'm both jealous and relieved that I don't have as much responsibility as you do.", "&gt; Don't worry we'll start ramping up for 2020 ~~in about a year~~ tomorrow.\n\nFTFY.", "Landslide for CLINTON GO VOTE", "Good luck American, fae Scotland.  I will be getting progressively drunker throughout the day in your honour and because Democracy.", "Compared to other western democracies that's still pretty far to the right.", "Today will be like someone on death row waiting for a pardon and not being sure if it will come or not.", "So Bunnings &gt; American voting system confirmed?", "Yes on 62 no on 66!!\n\nIt is **very** important to note that if *both* measures pass, the one with the most YES votes becomes law. If you believe that we should abolish the death penalty in California, you have to not only vote yes on 62, but no on 66. \n\nIf you want some information on why the death penalty needs to go, I'd be happy to help. ", "You're  assuming trump even suspends his campaign. He might just roll through claiming he's the real president and Hillary stole it. We might have years of him pretending to be President in Exile ahead of us.", "Oh god that sounds so nice. Dumb fox reporters trying really hard to make a solid argument as the majority of us go \"huh that's stupid\" then keep going about our say? Oh god I might cry. ", "For the rest of my life i pretty much wont be scared of any election agian aslong as the GOP dosen't put up another mad man", "What the ACTUAL FUCK", "it's not satanic if it's done by a priest! (/s just in case)", "Same same, same.", "I voted early for Angie Craig. Really hope she beats that moron Jason Lewis.", "Agreed. Thanks Comey.", "I'm from WA and voted for Clinton two weeks ago. It's good to know that winning my state was never a concern for her but still...", "I'm pretty fucking terrified right now. It's not even about the election itself but the fact that almost HALF of all Americans who will vote today are going to vote for Donald Drumpf. Where did our country go so wrong to have so many people so uninformed or disinterested in learning FACTS about the candidates. How do so many people not possess the ability to see through people like him? This is embarrassing on a global level and it's really fucking depressing. This man is a fascist, he shares none of the ideals Americans care about and still he'll get tens of millions of votes.", "https://www.washingtonpost.com/politics/donald-trump-alter-ego-barron/2016/05/12/02ac99ec-16fe-11e6-aa55-670cabef46e0_story.html\n\nNot his first rodeo!  I think this is what happens when Trump can't vent on Twitter...", "/r/the_meltdown here we go!\n\n[This will be the official theme of this election after 11pm](https://www.youtube.com/watch?v=2KYYVrBX4v0)", "Most will do what they always do.  Re-imagine history and claim they fought against Trump tooth and nail.", "Even if you don't want to vote for president vote down the ballot. Vote referendums that actually matter. Look at a sample ballot. Register online. You pseudo anarchists who don't believe in voting, spare me, I will bury you. If you live in Indiana like me, were not a swing state so vote your precious idiot all you wish!", "Americans don't embarrass yourself internationally. The rest of the world finds it inconceivable how Trump got this far. Heck, Clinton is right-wing enough.", "...and I thought Taiwanese elections were bad.\n\nPlease make sure you Yanks shut down this wanker and his \"MAGA/walls/etc\" rubbish for good...", "I see Alex Jones' contribution to the Trump campaign is working well. ", "That's what competent government looks like.  ", "Living in FoCo I stopped off at the voting center, registered, voted, and left in 10 minutes last Thursday. Feelsgoodman.", "If Sanders was the nominee you just know the GOP would have gone into full-on McCarthy Red Scare mode and try to paint him as an evil commie.", "My stress levels are going to be off the charts today.", "Vote third party. CT Goes Democrat. Help the third party cause.", "2012 was the first election I really followed and I was fucking terrified (especially in the primaries, given I (early teens at the time) had come to the conclusion Santorum was going to put gay people in concentration camps).\n\nIn retrospect, man, Romney was such a great guy if you put him in the same room as Trump.", "Nate Silver on his podcast said there was a 20-25% chance that the result would be unknown even tomorrow given the possibility of a recount, tie, or otherwise contested outcome.. \n\nI think it's fair to say that Murphy's Law applies to this election, so get ready", "For my liberal friends Deborah Thomas is a pretty solid pick for Michigan Supreme Court. She came and spoke before a Sanders/Clinton rally last month. \n\nSimilarly, she vouched for Frank Szymanski for Michigan Supreme Court. Both are on the ballot and can be voted for. \n\nThomas was adamant that her and Szymanski are answers to Snyder's appointed SC judges. They're both listed in the nonpartisan section of your ballot, so you'll need to select them individually even if you vote straight ticket.\n\nEdit - Deborah Thomas is running against incumbent Joan Larsen who called Antonin Scalia  \"one of the greatest legal minds of our era\" so there's just a bit more info on why our incumbent Supreme Court justices have to go.", "Agreed. I loved getting my ballot weeks ago and being able to fill it out on my time then just dropping it off at my convenience. A much better plan than to try to schedule time to vote today.", "The tobacco tax measures are bullshit. Neither tax enough and both are proposed by the industry. Vote them down and replace them with better measures. This comes from a smoker.\n\nhttps://ballotpedia.org/Missouri_2016_ballot_measures", "They need to stop with more than just that.\n\nThey need to expel the racist the sexists, the homophobes, the bigots, the religious fanatics and the such as well.", "Vote yes on green casinos will become a hot box", "I still  can't believe Bush got away with 911 in episode 189. What a twist.", "In my district (8) Rick Nolan is being challenged by Stewart Mills the 3rd. Yes. He refers to himself as Stewart Mills the 3rd. \n\nHis father once owned Mills' Fleet Farm, and only sold the company so that Stewart could use the money to fund his election campaign. Based on the things that Mills has said, based on the things I have heard him say, I think he would be wholly incapable of properly representing the average Minnesotan. \n\nNolan on the other hand is not only a good representative, but he is genuinely a good guy. Anecdotal or not, he was incredibly happy to recieve my friend's church group when they visited him. He stayed with them over the scheduled time, because most of what he had to do could wait. He listened to everything they said, and even learned to dab at the time (this elated my friend to no end). I agree with nearly everything Nolan has done in office so far, and I suspect I will agree with him for the most part going forward. (Inside baseball, internal polling shows ~~us~~ er him, up over SM3 by a not insignificant margin). I think he'll be fine. \n\nI don't know how Keith Ellison's race is going, but if there's one representative in Minnesota that I hope one day runs for President, it's Ellison. ", "I disagree that they're purposefully working against america. Some of them are just really really fuckin stupid ", "What? Trump has been constantly compared to George Wallace this cycle.", "They'll be the people who claim they voted for Johnson-Weld even after they've left a trail of pro-Trump bs all over social media. ", "Sneaky bastards!  Most people would automatically vote YES thinking they were at least putting a limit in there.\n\nShould be 65 years.  You got no business deciding the future of the state when the remainder of your own future just involves pureed food and pants shitting.  They aren't invested.", "&gt;\"And Hillary can’t fill a room. Look look, this is called filling a stadium, and I have no guitar and no piano. Right? I mean she gets Jay Z and Beyonce the other night. The language. Right? The language was so bad. People were insulted. They started walking out. Hillary then walks on to the stage, hugs him, hugs him, hugs him. And then she says Donald Trump uses such foul language. Give me a break. And did you hear what he was saying?\n\n&gt;\"And tonight’s guest Bruce Springsteen. What they don’t say is, so they perform. Actually, in the case of Jay Z, they were leaving because so many of these people never saw language like that. They started to leave. So what happens, they come in, they listen to the musician, which I think is demeaning; it’s actually demeaning to the political process.\n\n&gt;\"They listen because she can’t fill a room. I’m telling you. She’d have a hundred people sitting in the first row. **We have 28,000 including the people outside.** More than Beyonce. More than Jay Z. More than anybody.”\n\nhttp://www.politicususa.com/2016/11/07/trump-breaks-hampshire-hillary-clinton-draws-bigger-crowd.html\n\nHe included the people outside. \n\nEdit: I can find no attendance estimate, but the venue holds about 12,000. I have a hard time believing there were 16,000 people outside, but then again I'm biased.", "Exactly: He's talking to people who have no idea how the electoral college works.", "As a republican who voted for clinton here in California. Yeah. ", "You're telling me a crazy conspiracy theory cooked up by the alt-right is WRONG? Gee I never saw it coming.", "I'm really sad that we already have a perfect ready-made word but no one is using it.\n\n[Trumpery](http://www.dictionary.com/browse/trumpery?s=t)", "Congrats on passing Prop 64.\n\n", "Honestly it's more like lack of intellectual curiosity. I've met smart trump supporters they just prefer not to use their brains when it contradicts their feelings. They would rather believe something is true than look it up and verify that it is. \n\nThey're also more likely to complain about their status but unwilling to attend more schooling or trainings or even keep up with advancements in their field that would help to keep them competitive in the job market. \n\nFor example, coal is a dying industry that does more harm than good. Rather than accept government trainings aimed at replacing coal work with clean energy jobs, thus allowing coal workers to transition to the new job market, they fight tooth and nail to keep a dangerous, economically unviable and environmentally unsustainable industry in place. Best case scenario, they elect Trump and save their jobs for maybe another 5 years, at the expense of everyone else.  They could learn a new trade, they could take advantage of proposed programs that would help them with the transition and ensure them decades of future work. But instead they do their best to prevent progress. It's short sighted and lazy. \n\nThey feel entitled to jobs they haven't earned that require qualifications they refuse to get.  They complain about government handouts while begging the government to give them jobs without requiring them to train for them or learn anything new. Then they complain about minorities being lazy. \n\nIf you can't adapt and grow with society, you will be left behind. Trumpets are the ones who decided to eat dust rather than train themselves to keep up. \n\nTrumpets are lucky liberals care about those unable to care for themselves or they would be homeless already. As is the red states receive far more in welfare than they contribute to society. It's no secret the blue states are supporting red welfare states. Yet the red states complain they're not getting enough compared to the blue states. \n\nLazy, unambitious, entitled children. That's who support trump. ", "Jumped the shark when they introduced that Trump character. Just not very believable. ", "Is Michigan seriously a freaking battleground state or is that just hte media wanting its horse race?", "That's also a blatant and egregious violation of Church doctrine regarding both the sanctity of the dead fetus and the altar he slapped it on so he's pretty shit at being a Catholic.  \nNot that the clergy will bother to do anything about it.\n", "The doxxing of the guy that went on care of this site was pretty disgusting.", "Denver guy living in Japan here- sent in my ballot a while back.\n\nDoes anyone remember how fucking electric LoDo felt on election night 2008?  That night was one of the last nights I remember when I felt that the USA had resolved to get back on the right track.  I never imagined how awful the opposition would get. \n\nPresident Obama you weren't perfect but you did your goddamn best with lowlifes constantly spitting in your face.  I'm proud to have voted for you twice, and I hope we make you proud tonight and in the years to come.  ", "They will just call it a mistake. Could happen to every journalist outfit. It's just an accident that Fox News gets caught red headed over and over again. ", "The same kind of conservatives who want to return to the god old days of the pater familias will blast everyone remotely islamic for how backwards their culture is in Saudi Arabia... where I'd expect the same kind of thing to happen.", "You can really see an evolution in Hillary's character over time. Watch interviews from the 90s around the time when Bill was first running and you'll see a woman that's self assured and defiant. There's fire in her eyes. Even by today's standards it's unnerving.\n\nShe has softened her image considerably. She's also much more guarded, which she can't seem to shake off. Most attempts at this result in her looking fake. But I think her convinction is still there. I suspect we'll see a very different Hillary in a couple years,  if she wins tonight. ", "Well the GOP lately has been the party of projection.", "I have less problems with NYS Republicans than I do with those RNC bigots but I'm still voting straight Democrat this election. Very excited for HRC and Zephyr Teachout ", "&gt; punks\n\nPunks are against Trump. He's everything we despise. ", "Dead people voting! Rigging!", "It's fucking laughable. Fabricating a letter from a major NFL coach in the desperate hope of swaying a handful of votes *somewhere*? Yikes. And this is after *yet another* lie claiming a famous football quarterback voted for him, trying to siphon off of Brady's celebrity status like a fucking leech.", "The 'non-problem' is that there wasn't any incident where a transgender person used a gendered space to devious means. The bill certainly was conceived from a perspective that cisgender people were the victims in this not the other way around. That's what I mean by it proposed a solution to a problem that didn't exist. Harassment is a separate issue from access. ", "Not only divide the locker room but this would bring the press screaming in to the Pats HQ carpark. If there's one thing we can all guarantee Bill Belichick would never ever do, it's go out of his way to attract extra media attention during a season, or ever. ", "Sam Wang's final projections: 323 electoral votes for Clinton 51 Democratic seats in the senate.\n\nFingers crossed...", "Trump should have never fucked with Latinos. They are about to blow his ass out.", "The Patriots are winners. People love winners. And winners love Trump.\n\nThis is Trump's logic. There's nothing more complicated to it.", "I think I can speak for everyone when I say I am deeply sorry for insulting people with autism by comparing them to Trump supporters.", "I don't like to *jump* the shark. I like to grab'em by the pussy. I don't even wait. They let you do it when you're a celebrity. ", "Fellow Eastern Europoor too. I don't think I've ever been as invested in a political event. \n\nIt might be an exaggeration but given Russia's recent actions, I think the continued survival of my country could depend on Americans today. \n\nYour country does so much good in the world, yanks. Things that benefit everyone. Things that no great power has or will ever undertake. Any American who's reading this *must* comprehend it. Don't believe you should remove yourself from world's affairs just because last decade's foreign policy blunders. ", "Someone who says \"we should take all their oil\" is hardly going to be peaceful.", "There's dozens of us believe me", "I read the same thing!  I think it's time we made this happen. ", "I would pay good money to watch trump attempt to grab a shark by the pussy. ", "Salt the earth Hillary. \n\nSalt it with their tears.", "Because for the party that claims to be against pc culture they're \"triggered\" and offended at the drop of a hat.", "He will look like a petulant child. So normal Tuesday for him really. ", "Hmmm could easily have been placed there by the guy taking the picture. It's outside the gates so he wouldn't even have to trespass. In fact it looks like it's just a cardboard sign from a rally or some shit. Not that I like how Comey acted but framing him like this doesn't help mend the wounds if HRC is elected.\n\nEdit: http://www.snopes.com/fbi-director-james-comeys-trump-sign/", "And because of that Bush became president and we ended up in the darkest timeline.", "&gt; Hey look at my profile. I'm not a Trump supporter.\n\nSo you're just a peddler of bullshit. You're here trying to make out Trump isn't corrupt and wouldn't start wars when he has LITERALLY made multiple direct statements confirming both those things. He was a supporter of the Iraq war before he was against it. He demanded intervention in Libya (before he decided it was a mistake), he has declared that he would destroy ISIS via the application of American troops (while simultaneously decrying whatever Obama and the rest of the world is doing as a mistake for reasons he can't actually articulate). He admits not paying taxes. He admits hiring contractors and small businesses to do jobs for him and then not paying them. He admits scamming students and residents of his properties. He has conclusively been shown to donate almost nothing at all to charity despite publicly stating he donates millions to basically everything - in particular, there is nothing at all to show that he gave anything to any 9-11 related charities despite claiming he did.\n\nMeanwhile, exactly what wars has Hillary Clinton started from her position as... someone who doesn't actually have the power to start wars? You've obviously read through her taxes, so where is the evidence of malfeasance there? Oh wait, you've got nothing. She's got that Clinton Foundation charity - where is your evidence of fraud there? Again, you have fuck all.\n\nIn fact, can you show where anywhere in any of your posts today you've shown anything remotely resembling the \"other side\" of anything?\n\nNo. You have strayed from being someone who is possibly simply sheltered and ignorant, to someone who is just a really piss poor liar. ", " &gt;History denial is so prevalent and such a goddamn pain.\n\nYou know what it is?  I've spent time with Southern Trump supporters and they actually think they were the good guys all along because they started voting Republican 50 years ago.  They blame the KKK and Jim Crow on the Democrats.  So they dont think they are racist, and don't think they need to change.   They ignore the history behind the parties and what happened in the 60s.  It's a way to avoid responsibility, and they get to call Democrats the true racists who 'enslave' black people with welfare.  \n\nThey get to live in a completely made up world.  And people don't call them out on it.  People keep referring to the Republicans as the party of Lincoln, when modern Republicans represent the south that went to war against him.   So, now southern Republican voters get to believe that they were the good guys all along.  ", "It's 5 am.  I'm headed out to knock on doors to get out the vote in Hillsborough County FL!\n\n1. Go Vote!\n2. If you already voted go knock on doors phonebank, volunteer to help drive people to the polls!\n\nLet's go America! Let's live up to our ideals\n\n", "Didn't the Pope denounce Trump? But hey who is the Pope to talk about what Christianity is about, right?", "Unfortunately most people are so stupid to realize that the gop is doing this and blsme the Democrats. ", "Allow me to suck any trace oxygen from republicans with the following thought on the future of their party:  I predict that the hardliners in your party are going to interpret this loss as not being \"nationalist\" enough just like they misread Romney's loss.  The alt right will continue to drive and produce nutty candidates for all eternity.", "My god...my god he's right.", "\"No way he'd fabricate this\"\n\nUmm... have you heard of Donald J Trump?\n\nThat is definitely a made up letter. Belichick doesn't speak like that. Only a hopeless narcissist would rail against the corrupt media while using the phrase \"come out beautifully\". This is a letter a \"winner\" like Belichick would right another \"winner\" like Trump in his dreams.", "In a strange way I feel like my vote matters for the first time.\n\nI always vote but I lived in NY and now WA, both guaranteed blue states. However I want the pile against Trump to be so staggeringly high nationally that it oddly makes my vote matter more than usual, since hopefully I can say \"I was a part of telling that piece of shit to go fuck himself\"", "Yeah brit here. Obama has been an amazing president overall. He enabled millions to enjoy affordable healthcare and not have to worry about denial of care. Obama reminds us of what a force for good the US can be. Dont let trump destroy your country", "Is Pennsylvania even generally considered a swing state anymore?", "Most the country thought remain would win. It's funny I had leave voters at work saying the exact same thing Trump supporters are (\"they'll rig the vote for remain\"). Interesting to see where this goes today.", "And depressingly\n\n5. Someone in your family ", "Why would a pathologist give a priest a fetus to begin with?  For burial? Common man you're telling me he thought the priest would be out there with a shovel digging a tiny grave like he was burying a cat?", "How far will you take that pride? She might be better than someone who flat out says he'll approve Keystone XL rip up the Paris accord on day 1 and explicitly support torture, but what will you do to hold her accountable when she - inevitably - starts breaking her promises, one by one?\n\nWhen she orders the no-fly zone in Syria and leans hard on regime change and Neo-McCarthyism, will you be out protesting? When she approves DAPL, will you be out protesting? When she goes ahead with privatizing social security and/or handing retirement funds to Wall St. banks, will you be out protesting? When she fully supports prisoners being executed, does nothing about Guantanamo Bay, continues to persecute whistle blowers, continues to militarize police and expand surveillance? \n\nIf you're proud for electing her, that's cool. But know what you're doing, and take responsibility when things start going badly. If you're that glad to vote a candidate in - any one of them, I expect you to hold them accountable to the fullest extent. Will you?", "Nope. Trump is not a dove in foreign policy. Didn't he say at some point: \"Lets bomb the shit out of them\". \n\nThe main problem with Trump is that he is so unstable. He can't focus and is erratic. I don't understand why people trust him with the nuclear codes...", "Ugh as a white male, nothing makes me cringe harder than the notion that Trump should appeal to me. What the fuck is wrong with my fellow white men? Why would they want to make this complete and utter moron president? I know it's mostly the uneducated white men, but still, it drives me nuts that this clown is supposed to be the face of white America.", "I think to call it a \"non-problem\" undermines the transgender experience which is typically one of unending violence. \n\nI've been harassed in restrooms on several occasions. it's definitely not a non-problem for me. it's a non-problem to people who neither care about the existence of trans people nor have to live our lives.\n\nthat's also what I hate about people calling this a \"distraction\" and such. the political purpose may have been to distract voters from \"serious\" problems but LGBT harassment is at record levels in many places. it's not a distraction for us. ", "If only the GOP had published some kind of post mortem following the previous election warning them of the risks of failing to appeal to Latinos.", "The truck thing is about Scott Brown right? He came to my high school under the guise of discussing the political process, and instead ranted for an hour about all the mean things kids had said about him on social media. I shit you not.", "&gt;good reasons to vote for Clinton\n\n\nSupreme Court and all the policy on her website.", "&gt;The husband expects his wife to vote for Trump. She doesn't. He doesn't know.\n\nMelania?\n\n:D", "Jesus why the circlejerk.\n\n\n**[Tom Brady on Trump](http://edition.cnn.com/2015/09/16/politics/tom-brady-donald-trump-endorsement/)**:\n\n&gt; When Brady was asked about a \"Make American Great Again\" hat that was previously spotted in his locker, he said the hat is a \"nice keepsake\" and **that it would be \"great\" if Trump won the election**.\n\n&gt; When asked if Trump has a shot at winning the general election, Brady said, \"I hope so. That would be great. There'd be a putting green on the White House lawn. I know that.\"\n\n=\n\nHe is probably afraid to admit it now (public backlash), but Trump likely isn't lying.\n\n=\n\n[Coming out of closet](http://www.insideedition.com/headlines/17636-caitlyn-jenner-throws-support-behind-trump-at-rnc-hours-after-ben-carson-assails-transgender-people) with Trump support isn't easy for some people:\n\n&gt; Caitlyn Jenner arrived at the Republican National Convention Wednesday to throw her support behind Donald Trump, telling the crowd that becoming a woman was easier than being a Republican.", "Brit here. Good luck America. Hope you make the best of a bad situation. We are worried about you guys. \n\nAlways remember we are here for you with a cup of tea and biscuit if you need to talk or just let off some steam. ", "Sure hippy website. I believe you.", "you'd be shocked at how dumb I am. :P ", "Here is hoping we give Governor Dayton a DFL legislature for his final two years", "This doesn't make any sense setting the dead fetus up there like it's being offered up as a *sacrifice*. It comes across as a sacrifice  for a Trump  win. This is some dark shit. ", "Do you know football? Do you know Belichick? He gives reporters absolutely nothing and divulges absolutely nothing about anything ever. He's not just about to start writing public support letters to the most controversial candidate in history. ", "Trump who? Oh I was for Kasich the *real* Republican choice. Trump didn't win because he was not a true conservative...", "Would be a nice upset to see Alaska blue for the first time in 52 years. ", "It's called projection", "Ellison will cruise to victory. I hope Nolan does the same. Mills is an entitiled brat and the district rejected him last time in a non presedential year so I hope they can do it again.", "Why do you dismiss Republican rhetoric but believe Democrat rhetoric?  If the leaks have shown us anything it's that the platform concessions are empty promises.  This is in their own words, mind you.", "That would be enormously entertaining if it weren't for the fact that too many people would take him seriously.", "Hahaha you think that they have to recognize reality?\n\n*Purses lips and leans in towards microphone*\n\nWRONG.\n\n*Leans back, smiles and bounces slightly to ensure maximum smugness*", "You don't even have to be close that age if you are from Switzerland: https://en.wikipedia.org/wiki/Women%27s_suffrage_in_Switzerland#Women.27s_Suffrage_at_the_Cantonal_Level_.E2.80.93_1960s the last canton was 1990 and it was forced upon them.\n\nBut at least the first female president was in 1999 although it's important to note that the president of Switzerland has barely anything to say. More of a figure head.", "Sky news is owned by Murdoch", "You get them after you vote! We've had quite a bit of trouble getting the us population to vote. It almost acts as an encouragement. But mostly it's a reminder for those who haven't yet.", "Gotta love that old false equivalency shtick.", "So his normal speech is pretty much Donald's shit show style of speaking? ", "Watch as Trump proclaims he'll sue Jeff Greene. Wait that might be out of character for him, Jeff Greene's too 'big' for Trump to bully.", "We all have a good laugh. In particular here on Reddit. The meltdown of /r/the_Donald will be sweet. ", "&gt; a name for the phenomena whereas Trump criticizing someone for X only reminds everyone that Trump is actually much guiltier of the behavior he is criticizing others for.\n\nThere already is a name for this: Republican strategy", "There's a certain irony about being at a fundraiser for an occupying force that has secured $38billion in military aid from the country in which the fundraiser is being held and then calling an attendee out for having dubious beliefs.\n\nYou're all pricks, De Niro. Every last one of you in attendance.", "BAH GAWD that's Jeb Bush's music! ", "HRC isnt really a bad result (Tho id prefer Bernie). She's bascially Obama term 3 with a slightly more liberal platform", "&gt; other western democracies are far older than the United States.\n\nI can understand why you would think that but it's factually about as wrong as can be. Most Western European countries were monarchies right up into the 18th or even 19th and 20th centuries. America's democracy predates France, German, Spain, Italy and more.\n\nThe OP is correct that America stands far to the right of most European countries. There are some peculiarly American causes for this - perhaps - but they're nothing to do with the age of the democracy.", "2020 began the day of the VP debates when those masochistic pundits started talking about the 'Mike Pence 2020 Ticket'. There is officially no end to the election cycle.\n\nYou see time is a flat circle that will destroy your will to live and make you envy the dead.", "Oh ok It just seems a bit like the \"You've been brave\" stickers you get after the dentists as a kid. \n\nWould be interested to see the figures for turnout and how much they are effected by the stickers. ", "This sounds very similar to how some conservatives talk about minorities.", "Plug for r/the_meltdown your one stop shop for all the fun ", "Remember everyone election boxes close at 8 PM PST. Even if there is a line at the drop box if you are in line by 8PM with your sealed and **signed** envelope will be accepted. Get out and vote. ", "Priest puts career vocation and entire future on altar: God vomits.", "What ridiculous ignorant reasoning.\n\nDo you really think Middle East conflicts will just magically resolve themselves without US involvement? \n\nThere will be more refugees regardless of who is President.\n\nMuch more important reasons to not vote for Trump.", "Mother Jones already had women on the record who were models with Trump who confirmed they worked without documentation.\n\nAP has confirmed that Melania Trump did 10 jobs for $20000 before she was permitted to work. You may not like these facts,but Trump supported illegal immigrants modeling. He also had illegal polish immigrants build Trump Tower, then tried to stiff them.\n\nYou are supporting him anyways, but own that you dont care.", "Move on him like a bitch.", "I never thought Romney would be the apocalypse I just didn't like his politics. Trump is something else completely. You can't even compare him to classic fascist leaders, cause I don't sense a sinisterness in him, he is just pure id, he's just stuck chasing that weird celebrity high and he'll do and say anything to maintain it. ", "I am voting yes because I think we need to pay state legislators better as many of them cannot hold down normal employment with all the duties of office meaning you have to be more wealthy to handle the financial strain of serving. Since its politically unpopular to give yourself a raise, we need some other instrument to ensure our chambers attract talent and passion without adding a financial burden.", "Sure here's one of the recent polls:\nhttp://maristpoll.marist.edu/wp-content/misc/usapolls/us161101_MCC/McClatchy_Marist%20Poll_National%20Tables%20of%20Adults%20and%20Registered%20Voters_November%204th%202016.pdf#page=1\n\nPage 5 (as its numbered) has the polling and you can see there that in this poll, 36% of women were voting for Trump. There's also still 33% of Latinos voting for Trump.\n\nNow, especially with women (less so with Latinos), being down by 15% is a big problem for any candidate because that's a hard thing to offset, so he's doing comparatively worse. For example, in 2004 exit polling, Bush lost women by 5%. Though in every election, women vote more for the Democrat. 2008 and 2012 the margin was 13% and 11%, respectively.\n\nIt's a popular narrative (and I think, to some extent, a bit of an echo chamber) to forget that there are a lot of conservative women in the U.S..\n\nFull site comparing a lot of these numbers for the gender polling: http://presidentialgenderwatch.org/polls/womens-vote-watch/presidential-polling-data/", "You'd rather the guy who'd send a nuke at you the second your leader pisses him off?", "Excellent fucking timing for this to hit after the Satanic Panic nonsense leveled at Hillary recently.\n\nHey GOP maybe those in glass houses shouldn't throw aborted fetuses.", "Hah no. You could tell by the introduction of Khan (as one of the speakers at the DNC with no ads prepared) that the Clinton campaign was completely surprised by Trump's tendency to completely self-destruct when someone attacks him.\n\nThe Alicia Machado thing *was* carefully planned out and went even better than they expected. It's not that Hillary is a mastermind it's just that Trump is so baitable and predictable."], "links": ["5bqv66", "5bre3q", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5brczx", "5bqsvt", "5bre3q", "5bq26a", "5bqv66", "5bre3q", "5bqv66", "5bpsnq", "5bqv66", "5bre3q", "5bqsvt", "5bptu4", "5bqv66", "5bqq0d", "5br7ls", "5bqv66", "5brbk8", "5br7ls", "5bre3q", "5bqv66", "5bqv66", "5bq26a", "5bre3q", "5brczx", "5bq6se", "5bpdao", "5bqv66", "5br7ls", "5bre3q", "5bqv66", "5bqc41", "5bq26a", "5brdy2", "5bqv66", "5bre3q", "5bqsuh", "5bqw65", "5bqv66", "5brczx", "5bqv66", "5bre3q", "5brgv1", "5bqdc0", "5br5pr", "5bqsvt", "5bre3q", "5bq26a", "5bre3q", "5bpfj3", "5bqw65", "5bqdc0", "5bqq0d", "5bre3q", "5bqmb2", "5bpsnq", "5bqsvt", "5bqsvt", "5bqsuh", "5brgv1", "5bpnu4", "5bpdao", "5bptu4", "5bq26a", "5bqv66", "5brexf", "5bqdc0", "5brczx", "5bptu4", "5bre3q", "5bqsvt", "5bpdao", "5bqpnk", "5br7ls", "5bpzkl", "5bqq0d", "5bre3q", "5bqq0d", "5bqw65", "5bqsvt", "5bptu4", "5bpfj3", "5bqbh1", "5bpzkl", "5bre3q", "5br5pr", "5bqw65", "5bqsvt", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bro3f", "5br2qc", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bro3f", "5br2qc", "5bptu4", "5bpsnq", "5bptu4", "5bqv66", "5bpsnq", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5brczx", "5bqv66", "5bpsnq", "5brczx", "5bro3f", "5bqv66", "5bqv66", "5bqv66", "5bpsnq", "5bq26a", "5bqv66", "5bq26a", "5bro3f", "5bqv66", "5bqv66", "5bpfj3", "5bqv66", "5bqv66", "5bqv66", "5bro3f", "5brm5q", "5bqv66", "5bqsvt", "5bre3q", "5bq26a", "5bpdao", "5bqq0d", "5bqv66", "5bro3f", "5bqv66", "5bro3f", "5brm5q", "5bpsnq", "5bqsuh", "5bptu4", "5brqg2", "5bqpnk", "5bqv66", "5bqpnk", "5bpsnq", "5bqpnk", "5brczx", "5bqsvt", "5bqv66", "5brm5q", "5bqsvt", "5brczx", "5bpzkl", "5bqsvt", "5bqv66", "5bpsnq", "5bqv66", "5bq26a", "5bqe7j", "5bpfj3", "5bre3q", "5bro3f", "5bro3f", "5bqv66", "5bpzkl", "5bqv66", "5bptu4", "5br7ls", "5bqw65", "5brkkx", "5bq26a", "5bqv66", "5brm5q", "5bqv66", "5brsd6", "5brsd6", "5bqv66", "5bqv66", "5bqsvt", "5bqq0d", "5bqv66", "5bq26a", "5bqw65", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5brujp", "5bqsvt", "5bqv66", "5bqv66", "5bq26a", "5bq26a", "5bry1l", "5bro3f", "5bqv66", "5bpsnq", "5bptu4", "5bpsnq", "5bpsnq", "5bpsnq", "5bs0dl", "5bry1l", "5bqsvt", "5bro3f", "5bry2r", "5bqsuh", "5bqq0d", "5brwvk", "5bqq0d", "5bqe7j", "5bqsuh", "5bqsvt", "5brujp", "5bqw65", "5bpsnq", "5bptu4", "5bqw65", "5bro3f", "5bq26a", "5brw34", "5bqsuh", "5bqsuh", "5brujp", "5bro3f", "5bon8w", "5bqsvt", "5bqw65", "5bry1l", "5bq26a", "5bqpnk", "5bry1l", "5brwvk", "5bq26a", "5brw34", "5bpsnq", "5bry1l", "5bry1l", "5bqw65", "5bqpnk", "5bqv66", "5bry2r", "5bqsvt", "5bq26a", "5br7ls", "5bqv66", "5bpdao", "5bq3xq", "5bq26a", "5bry2r", "5bro3f", "5bptu4", "5bqv66", "5bqsvt", "5bqsvt", "5bq26a", "5bqq0d", "5bqe7j", "5bro3f", "5bqsuh", "5bqsuh", "5bqw65", "5bptu4", "5br2qc", "5brwvk", "5bpsnq", "5brsd6", "5brt6b", "5broxm", "5bqq0d", "5bq26a", "5brsd6", "5brsd6", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqsvt", "5bqv66", "5bqv66", "5brujp", "5bqv66", "5bqq0d", "5bqsvt", "5bqv66", "5brsd6", "5bs3cv", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5bqv66", "5br7ls", "5bqv66", "5bqv66", "5bpsnq", "5bqsvt", "5bqsvt", "5bqsuh", "5bqv66", "5bqv66", "5bqsvt", "5bq26a", "5bq26a", "5bqv66", "5bqv66", "5bqw65", "5bqsvt", "5bqv66", "5bry1l", "5bq26a", "5bqv66", "5bqw65", "5bs3cv", "5bqw65", "5bqw65", "5bq26a", "5bqq0d", "5bq26a", "5br7ls", "5bqv66", "5bqv66", "5bqpnk", "5bqne0", "5br2qc", "5bpdao", "5bq26a", "5bqv66", "5bq26a", "5bqv66", "5bqq0d", "5bry1l", "5bqv66", "5bqpnk", "5bry1l", "5brsd6", "5bq26a", "5brczx", "5bry1l", "5bry1l", "5bs4rj", "5bqv66", "5bpdao", "5bs5ax", "5bqv66", "5bqv66", "5bqv66", "5bry1l", "5bqc41", "5bqv66", "5bry1l", "5bqv66", "5bry1l", "5bq6se", "5brujp", "5bry1l", "5bqv66", "5bs3cv", "5bry1l", "5bpdao", "5bqv66", "5bptu4", "5bqv66", "5bqv66", "5br2qc", "5bqv66", "5bq26a", "5bs7ms", "5brnur", "5bs7ms", "5bqv66", "5bqv66", "5bs7ms", "5bs7ms", "5bscsv", "5bs7ms", "5brnur", "5bs7ms", "5bs7ms", "5brnur", "5bqv66", "5bqv66", "5bscsv", "5bs7ms", "5bs7ms", "5bsbhp", "5bqsvt", "5bqv66", "5bs7ms", "5brjig", "5bqv66", "5bs7ms", "5bs7ms", "5bqv66", "5bs7ms", "5bs7ms", "5bqv66", "5bs7ms", "5brj2k", "5bs7ms", "5bs7ms", "5bs7ms", "5brjig", "5brln8", "5bscsv", "5bs7ms", "5bpdao", "5bs7ms", "5brnbn", "5bsbhp", "5bs7ms", "5bs7ms", "5bqsvt", "5bs7ms", "5briy5", "5bsbhp", "5bqv66", "5bs7ms", "5bs7ms", "5bs7ms", "5bs7ms", "5bs7ms", "5bs7ms", "5bs7ms", "5bs7ms", "5briy5", "5bs7ms", "5bqmb2", "5bs7ms", "5bscsv", "5bscsv", "5bsbhp", "5brlir", "5bs7ms", "5bs7ms", "5bs7ms", "5bqv66", "5bs7ms", "5bre3q", "5bs7ms", "5bs7ms", "5bs7ms", "5bs7ms", "5br7ls", "5brj2k", "5bqj1q", "5bs7ms", "5brkpa", "5bs7ms", "5bs7ms", "5brlfg", "5brj2k", "5brlqc", "5bqmb2", "5brm2j", "5bs7ms", "5brlir", "5bqq0d", "5bqsvt", "5bqw65", "5brnbn", "5bqv66", "5brsd6", "5bs7ms", "5bsj6h", "5brczx", "5briy5", "5bqq0d", "5bs7ms", "5brlfg", "5bscsv", "5bsj6h", "5brj2k", "5bsj6h", "5bqsvt", "5bqsvt", "5bqq0d", "5brmjz", "5bqq0d", "5bqsvt", "5bqv66", "5bqe7j", "5bqv66", "5bs7ms", "5bs7ms", "5bqv66", "5bqv66", "5bs7ms", "5bs7ms", "5bsf5x", "5brnn0", "5bscsv", "5bs7ms", "5bs7ms", "5bqq0d", "5bsev3", "5bsi42", "5brsd6", "5brczx", "5bqmb2", "5bs7ms", "5bscsv", "5br2qc", "5bqpnk", "5bs7ms", "5bqv66", "5bs7ms", "5bs7ms", "5brnbn", "5bs7ms", "5bqq0d", "5bscsv", "5bry1l", "5bsf5x", "5bsbhp", "5bqe7j", "5bs7ms", "5bqv66", "5bqj1q", "5bpdao", "5bqv66", "5bs7ms", "5bsi42", "5bsbhp", "5brlir", "5bscsv", "5bqv66", "5bre3q", "5brhkd", "5brczx", "5brlir", "5bqbh1", "5bs7ms", "5br5pr", "5bqsvt", "5bsdul", "5bqsvt", "5bqq0d", "5bqv66", "5brczx", "5bsev3", "5brczx", "5bsjhj", "5bs7ms", "5bs7ms", "5bs7ms", "5bs7ms", "5bqsvt", "5bqq0d", "5bsev3", "5brn5a", "5bscsv", "5bs7ms", "5bq3xq", "5bs7ms", "5bqv66", "5brlir", "5bqsvt", "5bs7ms", "5bscsv", "5bptu4"]}