{"comments": ["If only people with at least 4 grandparents born in America were voting Trump would not be eligible to vote.", "Ahh remember the Rob Lowe roast earlier this year, when everyone just tore into Ann?\n\nI mean, it was all gold - [but Jimmy Carr was just brutal](https://www.youtube.com/watch?v=zwoGrDa5g2c&amp;feature=youtu.be&amp;t=38s)", "None of his kids could vote either. His mom is from Scotland so they are all ineligible even Tiffany with American family on her mom's side.", "She's a twisted mess. She differentiates between *settlers* and *immigrants*. She considers herself a *settler* but is one *great* away from being an *immigrant*.  All eight of her paternal great-great-grandparents  are from Europe", "Bernie bro here voted for hillary, don't be dumb.", "Im a mexican doing a phd in Australia where I study sharks. My scholarship is in US dollars if Trump wins, the projected devaluation means I cant afford to finish my research. Dont elect him.  \nDo it for the sharks America!!", "Some of it was just brutal. The kentucky derby one did it for me :-)", "[deleted]  \n ^^^^^^^^^^^^^^^^0.6238 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/28182)", "No longer dog-whistles but fog horns", "Can he get arrested for this?", "There is no need to draw Nazi comparisons. We had this exact type of thing in the U.S. as part of Jim Crow. The appropriately named the \"grandfather clause\" was used to prohibit blacks from registering to vote. \n\nedit:\n\nNow I'm getting PMs from trolls telling me that the grandfather clause should be reinstated. Disgusting.", "First time voter. I woke up extra early to avoid the lines just to see what challenges I would face. Im not ganna lie when I say I was kind of scared of the unexpected. \n\nThey ask for your address and your name and just direct you to a poll and you select your candidate and press vote. Takes about 30 seconds. That was alot easier than I ever expected that when I casted my vote I really couldn't believe it was just that simple\n\nDemocracy is beautiful", "Australia signing in. Good luck y'all. The world is  counting on you not to vote the lunatic orange one in. xx", "Bernie is gonna flourish in a Dem senate under Hillary.", "This was the weirdest endorsement of the election for me but it worked I've changed my mind.", "I'm in a heavily African American area in Michigan. I am usually among the first few in line. There are 20 people ahead of me and many more behind. Good sign!", "Gracias mate", "Let's crush this fascist once and for all and show his supporters that the *real* \"real America\" will *never* be one of hatred and bigotry.", "&gt; \"If you are satisfied with the direction the country is going she's the clear choice. If you think the country needs to be changing direction and we need to reform some of our approaches to how we run our country, how we run our economy and how we support businesses, then it's not as easy of a choice,\" he told \"Closing Bell.\"\n\nThis rhetoric is a bit like saying \"if you want to feel something new, consider shooting yourself in the face\". Sure, you'll feel something new alright, doesn't mean it's a good idea.", "At least 4 grandparents?\n\nIsn't 4 the maximum?", "I'm 35 and this year was my first time voting. I'm slightly embarrassed to admit it but I never felt I legitimately knew enough to make an educated decision before this year. It was the simplest process where they had me fill out a quick form while in line asked for my ID and was on my merry way. It was a simple process and also one of the most satisfying.\n\nPlease get out and vote.", "Londoner here. If Brexit can happen so can Trump winning. Don't rely on others' votes if you think there's no chance it'll go Trump's way! Get out there. Good luck to you all and get drunk tonight.", "Peyton was great that night", "Good luck USA. Don't fuck this up. \n\nSincerely Australia. ", "I feel exhausted when I try to imagine how it must feel to be Trump or Clinton today. Say what you will about their character or fitness for office, they have both campaigned their hearts out in the best way they could, for themselves. \n\nIt is a brutal process, this multi-year campaign cycle and it takes a certain amount of masochism to willingly subject yourself to such punishment.\n\nOf course, I think this year has been particularly hard on the voter as well. So divisive and severe. \n\nIt doesn't end, today, but at least it shifts and for one of the candidates, they will get a real break. Congrats to both. ", "Exactly. Not using your vote for that just seems like a bad idea. That's what he wants so he can make actual change.\n\nAlso, we need the Democrats to win the white house for supreme court nominees. They will give in eventually. Pressure will build up.", "Long read but I hope you read it.\n\nHappily casting a ballot today for Clinton/Kaine. Funny thing about her; she has horrible approval ratings on a campaign trail, but her approval skyrockets when she holds an office. Why? She's socially awkward, but she gets shit done.\n\nTrump, on the other hand, is not only a vile (and I mean TRULY vile) human being, but his policies belong in a children's coloring book.\n\nRepublicans on my list, your party has to do better than this next time around. Hold them to task. Drop this \"culture wars\" bullshit- you've lost. Be a socially liberal, fiscally conservative party that actually functions instead of kicking and screaming like toddlers because you think America was better in the 50's.\n\nOr just continue thinking that their not-so-subtle racist/sexist attitudes are going to win on a national level at any time in the future. Guys like me- who take all sides into consideration- will never, EVER pull the \"R\" lever so long as they represent oppression, willful scientific ignorance, and faux outrage at the working class.\n\nThose of you who who are considering voting third party because you think \"both parties are the same\", I have three words for you: Paul Fucking LePage. Lets fix the process before we start pissing our votes away- like what we're doing in Maine with Question 5.\n\nI also get to vote on Marijuana Legalization today. I've been to jail for it- it's the most dehumanizing and stressful experience I've ever had in my life. Those of you who are considering voting no on Question 1 because you're concerned about who gets the most money? GO FUCK YOURSELF. Sit in a cell, and then tell me that you're still going to quibble over money! Money is not the issue here- basic human decency is.\n\nBut above all, no matter how disgusted you are with this election cycle, go vote. Vote for congressmen, senators, local politicians, ballot initiatives. So much more than the presidency is on your ballot, no matter where you live, and those things impact your life just as much.\n\nGo vote, shitheads!\n\n(c/p'ed from my Facebook post this morning)", "You know who the original source is right? r/the_donald and 4chan lmao. They had this conspiracy bullshit all over the front page of r/the_donald.\n\n", "Korea chiming in. Good luck. Make your votes count. ", "Sorry Trump but you're fired. ", "Belgium here. Please make the right disicion today America.", "We will have the 'I Voted' flair up and running here shortly! In the meantime you may sit and ooh and ahh with jealousy at mine.\n\n**Edit**: It is up and running now. Just comment \"I voted\"", "6am. Polls open. Headed to mine in NYC before going to work. ", "I'm up early to drive voters to the polls. Let's do this America.", "Desperate idiot begs for attention. ", "Meh she's said stuff just as bad or worse. The difference is, she tries to veil it under a guise of bullshit patriotism. Fuck Ann Coulter. ", "I'm a cashier working 6am-2pm at a gas station in Eastern Kentucky. Wish me luck today. ", "America don't fuck this up - Regards, a fragile 3rd world country", "UK here. See above^", "Whatever happens today. It has been an honor shit posting with you lot this campaign season. ", "Yeah for most people I'd absolutely feel sympathy. \n\nBut for someone like Coulter who's made a career peddling hate-speech? She deserves every word, and so much more\n\n", "German here it's been fun, but for the sake of the world... do the right thing.", "Trump is 70(?) And he visited 5 states to campaign in all of them yesterday I couldn't do that and I'm fucking 20.", "Sparking outrage is her payday. Don't feed her.", "Username checks out", "Also from the UK and came here to say this. Quite a few people I know didn't go out and vote because Remain was a sure thing. Don't don't assume your facebook timeline represents the nation as a whole. ", "German shepherd whistling.", "Or at least show that only 40% supports a fascist. (To compare: Hitler won 36.8 % in 1932.)", "Legalize it! \n\nFor so many decades that has seemed like such a futile slogan and finally it comes into focus as an actual possibility. For me this more than makes up for the sad state of affairs in the federal race. \n\nAlso glad to have a chance to participate in ending the barbaric death penalty putting a limit on big pharma and reducing the sadly enormous prison populations. The California ballot is exciting for me this time. . . the national race not so much. ", "Thank you ilu.", "American from the future?", "I'm still sporting a Bernie sticker on my bumper and I voted for Hillary two weeks ago.", "As a Pats fan I can completely believe that Bill would vote for Trump. But I also believe that there is not a chance he would've written this letter. It's like you said - no desire whatsoever for distractions of any sort.", "I love my state. I really hope we can flip blue it's about time we do! ", "White supremacy antisemitism within the GOP?  I'm shocked.  Shocked I tell you!", "Reported it to moderators saw nothing done, reported it to admins, saw nothing done.\n\nHopefully it's at least used as casus belli once the result is clear.", "Shes not socially awkward - she just tries too hard. Shes like that student who get straight As and argue with the teacher for remarks when she got an A-. She feel overwrought and too rehearsed. Her methods are greyish and you never going to see her heart on her sleeve.\n\nMaybe thats not the president who write rousing speeches, but you can bet shes going to get shit done", "Greetings from Hong Kong. Don't fuck it up guys.", "Americadont duck this up\n\n-yours Europe", "As an Australian I'm more nervous than I should be I don't know how the Americans do it...", "Yesterday when walking across my college campus I saw a business card on the ground. It read \"Take the red pill: what is the alt-right?\"\n\nI am so ready for this election to be over, but I fear the problem of the alt-right won't be.", "This should be stickied or put in the header.", "Greetings from Down Under\n\nPlease don't die.\n\nA concerned Aussie. &lt;3", "Brit here. For the love of all that's good America, *learn* from the mistake we made earlier this year. Don't be a UK. Go out and vote. You don't want to be known for one-upping us.", "Time to Dump the Trump. \n\nSee alt right online userbase? We can make puns and use wordplay too. That means we win in an argument as is written in the Yahoo! Answers guide.", "May the force of the nod &amp; smile be with you.", "Don't jinx it plz :) ", "Currently here because while I was watching late night coverage (west coast checking in) I thought I would do dishes.. I ended up dropping my ring in and have spent the past 2 hours pulling the garbage disposal and P-trap apart looking for it. Didn't find the ring and I think I busted the tightening mechanism on my P-trap.. It's been a terrible night. I really hope this election day goes well.", "Better late than never glad you got out and voted ", "Let it be known that u/harrymuesli was responsible for Trump being elected.", "Both candidates here yesterday so something is up.  538 has it at 11% chance of being the deciding state", "An interesting stat I forgot about mentioned on [The Upshot](http://www.nytimes.com/2016/11/09/upshot/election-guide-two-paths-for-how-the-night-might-proceed.html?rref=collection%2Fsectioncollection%2Fupshot)\n\n| *Clinton Will Lag In Popular Vote*\n\n| Hillary Clinton will trail in the popular vote for much of the night because the West Coast and the urban East will take longer to count votes.\n\nThis is going to create a ton of /r/the_meltdown fodder if they call it for Hillary while she lags in the popular vote count. In 2012 they called it for Obama @ 10pm but he didn't get into majority popular vote territory until after 1am.", "It's all good. Don't get me wrong I'm still not the biggest fan of her but people like bernie will do much better with her and it's not even close", "Spoiler alert: Hillary wins.", "They should. It's less dangerous and more fun than most \"drugs\"", "I voted at 6:00 and 30 degrees at my rural VA polling place. The line is out the door and parking is crazy. ", "First time I voted they tried to turn me away because they couldn't find my signature on my DL. I almost had a heart attack. But the look on her face when I pointed it out and said \"sorry you can't stop me\" was priceless. It's nerve wracking when you don't know what to expect! Good job on taking the time out to vote!", "Voted by mail from New Zealand in California even though I know it's Hillary. Gotta pump up that margin and legalize it! ", "I don't regret all I've said about Hillary(especially in the primaries) but she's so much better than Trump in all respects it's not even funny.", "[The shit posting is just getting started my friend.](http://i.imgur.com/LfLAxk9.gifv)", "Fuck Donald Trump ", "I'm overseas and going to bed soon.  Please let me wake up to a President Clinton.  ", "Hello Xanax my friend!", "Bernie... sis? here ditto!", "Just like he wouldn't lie about getting a letter from the NFL?\n\nhttps://www.theguardian.com/us-news/2016/jul/31/nfl-presidential-debates-schedule-donald-trump\n\n&gt;Outlining his argument on ABC’s This Week Trump said: “Well, I tell you what I don’t like. It’s against two NFL games. **I got a letter from the NFL** saying this is ridiculous … because the NFL doesn’t want to go against the debates because the debates are going to be pretty massive, from what I understand.”\n\n &gt;He added: “And I don’t think we should be against the NFL. I don’t know how the dates were picked. I don’t know why those particular dates.”\n\n&gt;On Saturday, in a statement emailed to the Guardian, the NFL spokesman Brian McCarthy said: “While we would obviously wish the debate commission could find another night, **we did not send a letter to Mr Trump**.” ", "At poll at 6am way more people voting than in the primary. One lady said, 'this is the largest turnout I've seen in 40 years!'", "45 minute wait to vote at 6am in Virginia already.  Turnout is strong.  ", "Since when has the truth mattered to Fox News?\n\nI'm sure it wont be long before someone somewhere starts suggesting The Guardian or the notary named in the article who verified the grandmother's identity are working for Hilary paid by the DNC or are engaged in demonic ghostbaking rituals. \n\nBut I like to keep an open mind - so if someone shows me this grandmother's death certificate, I'll reconsider.\n\n\nNote: Long Form death certificate obviously.  ", "Your studies sound amazing I will be thinking of the sharks.", "The hissy fit thrown over this guy who held a fucking sign at a Trump rally is hilarious. I believe the victimization here is at a full level 11.", "Nyc: At poll at 6am way more people voting than in the primary. One lady said, 'this is the largest turnout I've seen in 40 years!", "[Somehow](http://puu.sh/sazLE/e21d783d45.png) I don't trust your judgement on this issue.", "Remember this whenever racists talk about slavery being \"ancient history\" \n\nThe daughter of a slave voted **today**. ", "U.S. history is really young. Unbelievable that her parents were born slaves and she was born before she could vote and under Jim Crow\n\nedit: /u/MakeAmericaGravyGun is technically correct the best kind. she was born before her demographic could vote.  The 19th amendment was passed before she was old enough to vote (when she was 11) so she was never personally denied the vote.", "I don't understand Ann Coulter's place in American society anymore. She was saying Donald Trump shit before Donald Trump was. Her entire thing is bigotry and inflammatory rhetoric. There was a publicist who tweeted some racist shit about not getting AIDS in Africa because she was white and her life was destroyed in the time it took her plane to land but somehow Ann Coulter still has a place in our media. She literally helps to fuel the fire that smouldered and caught flame when Donald Trump was selected as the GOP nominee. When this election is over, she's going to keep writing books, keep wedging open the divide, and keep appearing on TV. It's disheartening and depressing. ", "Yep. I know a woman whose grandfather was born a slave. Imagine that. Imagine growing up seeing grandpa and knowing he was born into ownership (edit: though I think it'd be more accurate imo to call it a \"fucked up multigenerational hostage situation backed by the force of state and federal governments\").\n\nAnd what's worse is when they use \"slavery is ancient history!!!1!\" As a way to dismiss shit that happened as recently as 1968. Or worse yet, to dismiss racial disparities happening here and now.\n\nEdit: and I'd like to trow in this bit that I said elsewhere in this thread regarding my thought that the approach to teaching the racial history of America makes it seem ancient when it's really not: I saw the painting [\"The Problem We All Live With\"](https://en.m.wikipedia.org/wiki/The_Problem_We_All_Live_With) at some point in some textbook, and I, of course, learned about how the first black students to attend a desegregated school did so under police escort... What I didn't learn till much later was that Ruby Bridges, the little girl in that painting, is younger than *both* Clinton and Trump. She's 62.", "\"One of the most repugnant hateful hatchet faced bitches alive\"\nThat pretty much sums it up.", "I teach three university classes today. I've made it clear to all my students that if they are pressed for time I'd rather they vote than attend my class. If they send me a picture of them next to the \"Vote Here\" sign holding their \"I Voted\" sticker, then I waive any points they may miss. \n\nDoing my part for the Indiana senate race and for the mandate. Voted last week myself. ", "They didn't register to vote anyway.\n\nEdit: People are telling me that they couldn't vote in the Republican primary but can in the general.", "Third party vote-splitting, happened twice, question 5.\n\n(Just getting it all out there before it gets asked. Yes, I'm tired of doing this.)\n", "I'll give her props for showing up and taking the hits.\n\nLook at her face and compare it with Donald's when Obama cooked him.  Trump looked like a third grader manfully not crying.", "Sorry but I have zero sympathy for 'conservatives.'\n\nNone of them stood up when Ronald Reagan proclaimed that trees are worse for the planet than factories or when John Kerry was 'swiftboated' or when Trump started talking about Obama's birth certificate.\n\nYou want esteem?  Try doing esteemable acts.", "She thinks she's a native American too. \n\n\n\n**edit**: this is from a transcript from \"The View\"\nThe interview transcript that is listed below outlines the conversation between Navarro and Coulter:\n\n  **Ana Navarro**: “What’s your family’s immigration story, right, are you a Native American?”\n\n ** Ann Coulter**: “Why, yes I am. I am a settler. I am descended from settlers—not from immigrants.”\n\n  **Raven-Symoné**: “So that’s not a Native American, you are…”\n\n  **Padma Lakshmi**: “That’s not a Native American, that’s an immigrant…That’s just a holder…”\n\n  **Ann Coulter**: “No, if you mean Indian…If you mean INDIAN…”\n\n  **Ana Navarro**: “Were you already here when the pilgrims showed up? Were your people here?”\n\n  **Ann Coulter**: “Well no, but I am not living in Cherokee Nation. So, I am not an immigrant to Cherokee Nation. I am living in America—which was created by settlers, not immigrants.”\n\nRead more at http://indiancountrytodaymedianetwork.com/2015/11/08/ann-coulter-thinks-shes-native-because-she-descended-settlers", "It's not like this is the [first time](https://www.brennancenter.org/legal-work/dnc-v-rnc-consent-decree).\n\nThe Republican party keeps proving why the voting rights act was necessary in the first place and needs to be reinstated by the supreme court.", "Triple? \n\nGore won the popular vote 50999,897 to 50,456,002 and lost florida  2,912,253 to 2,912,790. \n\n\nBy my marks, votes in Florida mattered at least 1000 times more than anyone else's. ", "Or at least impeached. ", "And sadly enough even his presence on television over just the last few months will be enough to make an impression that will perpetuate those shitty traits further in our society. We truly are a product of our environment", "Good thing she's in *South* Carolina or she probably wouldn't get to cast it.", "Schools are already having to combat this.\n\nAccording to a friend who teaches nothing quite gets your blood going like a 4th grader shouting **Wrong!** at his teacher for correcting him", "Almost 40 years ago Ronald Reagan said he remembered a time 'when America didn't know we had a race problem' and that trees cause more pollution than factories.\n\nNo GOP called Reagan out then and now we have Trump.\n\nReagan killed the idea of a progressive party in the image of Ike and Teddy R. \n\n", "Does anyone know why Amendment 1 is worded so deceiving?  I actually had to research it to see what they *really* mean.", "It's so fucking weird hearing this garbage coming from *Maine*. ", "Paul Ryan saying that if you vote for Hillary Bernie could end up head of the budget committee was the greatest reason to vote for Hillary I could think of for the Bernie crowd", "I voted for the first time! No not young, just became a US citizen earlier this year. It was very efficient, and there was no waiting. Would vote again! :)", "My fellow Americans\n\nI love all of you. \n\nEven those whose ideas and convictions I find utterly repellent and loathsome, as human beings I care about you. \n\nI ask only one thing of you: do no harm to your countrymen and women. We are brethren, regardless of skin, or gender, or education, or belief. We *must not* harm one another to achieve political ends. If we do that thing, we are no longer a nation with any semblance of greatness.\n\nI, living in Florida, convicted decades ago of felony, cannot vote today. For anybody. So I come here now only say this:\n\n*Love your neighbor.*", "This is why we need to be here for midterms!", "mine too\n\nBut if Bernie is a steak Hillary is a solid cheeseburger, and Trump is a cyanide capsule", "Just voted for Hillary but my heart is still with Bernie.", "Let's all remember that the state government there has spent the past 4 years doing everything it can to make it harder for African Americans to vote.\n\nWhen they put out a press release bragging about the \"crumbling Obama coalition\" they were bragging about the success of their efforts to systemically disenfranchise black voters.", "Ann Coulter can go fuck herself.  She's the exact same person who would get excessive amounts of joy reporting on Jews to the Gestapo and spitting on them if they were paraded down the street.  She's a hate-mongering piece of shit.  ", "I guess she wants only Mormons to vote? /shrug", "Drain the Swamp", "Amazingly relavant username ", "Sweden here. Hillary had a 60 point lead when polling Swedish voters. We trust you to pick the sane option.", "**The Candidate**\n\n*Sung to the tune of The Piano Man*\n\n&amp;nbsp;\n\nIt's nine o'clock on Election Day\n\nAnd the first round of voters role in\n\nThere's an old man sitting next to me\n\nObsessing over polling and spin\n\nHe says \"Trump, can you bring me a victory\n\nThough I’m not really sure how it’d go\n\nAnd you don’t need to cheat, I know you’d compete\n\nIf we just got rid of that ho.\"\n\n&amp;nbsp;\n\nLa la la, di da da\n\nLa la, di da da da dum\n\n&amp;nbsp;\n\nSpin us a lie, you're the candidate\n\nSpin us a lie tonight\n\nWell, we're all in the mood for a victory\n\nAnd you've got us lookin’ for fights\n\n&amp;nbsp;\n\nNow James at the bureau’s a friend of mine\n\nHe gets me my leaks for free\n\nAnd he's quick with a joke or to blow me some smoke\n\nBut he’s run out of help to give me\n\nHe says, \"Trump, I believe this is killing me.\"\n\nAs the smile ran away from his face\n\n\"Well I sure love directing the FBI \n\nBut they’re running me out of this place\"\n\n&amp;nbsp;\n\nOh, la la la, di da da\n\nLa la, di da da da dum\n\n&amp;nbsp;\n\nNow Paul is a half-assed supporter\n\nWho’s balanced on the edge of a knife\n\nAnd he's talkin' with Romney, who's still piling on me\n\nAnd probably will be for life\n\n&amp;nbsp;\n\nAnd Kellyanne’s practicing politics\n\nAs Mike Pence slowly gets stoned\n\nYes, they're sharing a drink they call hopelessness \n\nBut it's better than losin’ alone\n\n&amp;nbsp;\n\nSpin us a lie, you're the candidate\n\nSpin us a lie tonight\n\nWell, no one here expects victory\n\nBut we’ve gotten ready to fight \n\n&amp;nbsp;\n\nIt's a pretty good crowd for Election Day\n\nAnd Melania timidly smiles\n\n'Cause she knows that it's me they've been comin' to see\n\nTo forget about blacks for a while\n\nAnd the speech, it sounds like a dog whistle\n\nAnd the microphone (finally) rings clear\n\nAnd they scream “Hillary behind bars!” and put bread in my jar\n\nAnd say, \"Obama was never born here!\"\n\n&amp;nbsp;\n\nOh, la la la, di da da\n\nLa la, di da da da dum\n\n&amp;nbsp;\n\nSpin us a lie, you're the candidate\n\nSpin us a lie tonight\n\nWell we're all armed for a revolution\n\nAnd the 2nd gives us that right\n\n", "Doctor here imploring you all to ignore the asshole doctors endorsing Trump in his ads. They are just after your money.", "Latino millennial, registered republican Florida voter here. Just cast my vote for the hilldawg! \nGood luck to all you bad hombres today! ", "I admittingly have never voted in midterms. I will not miss another one. ", "There's an entire sub called /r/the_meltdown dedicated to basking in the crushing cognitive dissonance that will be experienced by Trump supporters.", "To get the cool \"I Voted\" flair added to your username simply say the words \"I voted\" anywhere in a comment and it will be automatically added. You can reply to this comment if needed.", "Dear america\n\nPleas let Donald be presidint on Tuesday. \n\nThank you,\nDonald's mom.", "The country needs more professors like you! ", "&gt;Cathy Borden a retired Navy recruiter, said everyone she talks to is voting for Mr. Trump. “That’s why you can’t go by those polls.”\n\n&gt;Dave Kraft, in line with his wife, Ruth, wrestled with this dissonance. “How could he lose, if you look at Facebook?”\n\nThe world is bigger than your Facebook feed. \n\n&gt;“What have they done?” she asked. “We gave them a Republican Senate and we gave them a Republican Congress, and they have let Obama do everything that he wanted.”\n\nI'll just leave that here. ", "If that was the case Native Americans, Black People and New England would be large voting pools.  A large portion of White Irish would be ineligible.   And of course,  Mr. Trump, his family and 97% of people that have worked on his buildings would not be voting.", "Just voted against fascism!", "Someone remind me... is it Hillary Clinton or is it Donald Trump who's going on trial for fraud later this month?", "This. Is. Amazing.", "[Samantha Bee makes this point] (https://www.youtube.com/watch?v=b6zf5VkuiEQ) saying \"I'm not voting for Hillary Clinton either I'm voting for Hillary badass Queen B Rodham, I have a hunch, she's still in there\"", "I'm sorry your voting rights haven't been restored. I hope that one day I can cast a vote that will give them back.", "My father has voted Republican down ticket in every single election.  He is voting for Jill Stein today to send a message to Republicans that someone like Trump is unacceptable. It blows my mind because my dad is super conservative but as he told me yesterday \"I can't vote for that moron\". Of course he does have some choice words about Clinton...but for him to break against the party is pretty big.", "The battle for 2018 begins tomorrow.  We need to bring the Political Revolution to the state houses!", "Cast my first ever presidential vote for Clinton!", "1475 England predicted Donald!\n\n\n", "Where's my Virginians at", "&gt; \"I live two doors away from Donald Trump in Palm Beach. I know enough about Donald Trump to know that I would be scared to death to see him as our president.\"\n\nI never pictured Trump as *having* neighbors. I assumed he lived at the top of one of his own buildings. So where *does* he live? And does the whole Trump clan live with him in the compound or what?\n\nEdit: I guess \"neighbor\" is a relative term. Trump's house in Florida is [Mar-a-Lago](https://en.wikipedia.org/wiki/Mar-a-Lago) (or is that \"mar a logo\"? amirite?) with 126 rooms, 17 acres, and no actual neighbors to whom you could walk over to borrow a cup of sugar. Green lives a couple miles down the boulevard in another giant estate. And Trump's actual day-to-day home *is* on top of a tower in Manhattan with no neighbors (or friends). ", "I'm 29 and this is my first time voting for president.  Thanks to Bernie for inspiring me and to Trump for terrifying me.", "Probably the scariest outcome of all.  The damage is done.", "Bernie or bust!  Just voted for hilldawg!!", "Canada here. Please make the right decision because Canada can't afford to build a wall.", "On the point of coal Hillary has plans on plans on plans on how to revitalize coal country. It doesn't involve coal, but it'd get people working again and start undoing a lot of the damage coal companies and a shifting energy economy as done to them.\n\nThey just don't care. It's not coal so it has to be bad, even though those jobs are never coming back no matter what the gropenfuhrer says.", "It's a literal Nazi policy. Like. This isn't some Godwin shit. That was literally the way Nazis decided who could stay and who must go.", "I'm so happy that fascism is in vogue again /s", "Sweet hair though  http://i.imgur.com/LUS6NdK.jpg ", "I hate that. For all of us I hate that. The entire election has been a case study of how flawed we are, but it's not just about the mistakes we make, it's also about how much we're willing to overlook. It just seems like it's all setting a pretty lousy precedent", "yea but emails tho", "We're on to the mid terms!\n\nTrump traded to Cleveland ", "Indian here. Don't fuck this one up America", "Third party vote-splitting, happened twice, question 5.\n\n(Just getting it all out there before it gets asked.  Yes, I'm tired of doing this.)", "Absent a clear rejection of Trumpism I think the GOP is dangerously close to being a hate group -- defined by SPLC as a group that has \"beliefs or practices that attack or malign an entire class of people, typically for their immutable characteristics.\" There's not much else left. ", "Yeah Hillary is a right wing Socialist who wants destroy the American economy so Wall street can profit.  She's also a cold blooded murderess who can't work an email.\n\nTry reading the article. ", "Not to mention she only showed up to self promote.", "It's true that Clinton's numbers among Black voters seem to be significantly lower than they were for Obama. However it's also pretty well-documented that voter suppression in North Carolina has been specifically targeting Black voters and households. The majority of all people challenged by voting challenges in NC have been Black.", "Many Black voters in North Carolina have actually lost their status as registered voters in the days leading up to today due to voting challenges requiring them to show up at the county board to defend their right to vote. The combination of post being slow and people being busy with their everyday lives have resulted in a significant amount of voters being purged. This is something that really should not be ignored - no matter whose side you are on, it's unfathomably undemocratic.", "I voted for Hillary because fuck Trump and everything he stands for. ", "Doing my part in Maine!", "Good on his wife. I don't say that because she's supporting Clinton but because she's sticking to her own opinion despite someone who is as intimately acquainted with her as her *husband* trying to convince her otherwise.", "&gt;Who's under FBI \"investigation\" for pay to play and using their \"charity\" for their daughters wedding?\n\nI dont know who? Because the FBI hasnt ever said Hillary is.\n\n", "Then Trump wouldn't be able to vote Ann. ", "Yeah I think that's why he commented", "Good luck America. From Taiwan.", "Good. Caffeine is more dangerous than this. ", "Fuck consequences right ", "Selecting Donald Trump as your nominee will do that", "Actually in some states theyre up (FL) so this seems more likely to just be a NC voter repression thing. ", "What's up with them thinking all opposition has something to do with voter fraud this election? ", "We'll see. We've heard this before. I think they'll probably spend as much of the next year as they can pretending they've never heard of the guy. Then Marco Rubio will give a speech about A New Conservative Path and everyone will throw up a little in their mouths. ", "Wife and I Voted 7:05am Clinton. Good luck everyone.", "Trump's a different kind of liar: He's a bullshitter. He says things without caring whether they're true or not—only that his audience admires him more for saying them.", "A dead person really shouldn't be allowed to vote that many times. \n\n/s", "This false equivalency that is prevalent in discussions on the topic of the election are an example of very lazy thinking and poor reasoning. ", "Every pro-Trump commercial is the most dramatic I-just-learned-Adobe-two-hours-ago thing ever. *Grayscale big text, needs more cinematic overlay, zoom, MORE ZOOM*", "This kind of feels like Game 7.\n\nFor America.", "African Americans are also more likely to vote on Sundays.  Guess what NC shut down this year (and in 2012.)\n\nAfrican Americans are more likely to vote at their local community centers.  Guess what NC Republicans shut down this year.\n\nAfrican Americans are more likely to use early voting.  Guess what the NC Republicans shut down to 4 locations in the largest NC metropolitan area.\n\nAfrican American and Latino names are regularly struck off the voting records in huge numbers especially compared to white voters, in NC.\n\nWow, yeah, it's all their own fault.  Man, you really convinced me there.", "Damned if you do damned if you don't. If she shows emotion, she's clearly an unstable woman who can't handle the weight of office. If she doesn't show emotions, she's a cold-hearted witch. Sexism is \\#real. ", "Hardly. They're laying low going to completely ignore trump's campaign next round. They intend to rebuild their \"party\", changing nothing, doing nothing.", "That sounds like a bit of an overstatement.", "Nicest comment about the election I've seen in a while. Stay golden bro.", "r/politics and salon are trash ", "Nah let's be as pure as possible, and only let Native Americans vote.", "It would ban Trump his children, and all of his grandchildren (when they're old enough to vote).\n\nAnn Fail.", "Pleasant reminder: Actual voting laws should have prevented her from committing her first case of voter fraud\n\n&gt; She graduated from New Canaan High School in 1980. Coulter's age was disputed in 2002 while she was arguing that she was not yet 40 yet Washington Post columnist Lloyd Grove cited that she provided a birthdate of December 8, 1961, when registering to vote in New Canaan, Connecticut prior to the 1980 Presidential election. Meanwhile, a driver's license issued several years later allegedly listed her birthdate as December 8, 1963. Coulter will not confirm either date, citing privacy concerns.[12]\n\nThat's from her wiki page. Multiple sources have written about this.", "Clinton supporters have nothing to be proud of.  Corruption sleaze, greed, subversion of democracy, lying, incompetence, war mongering.\n\n", "Just gonna take this aborted fetus out of my pocket. Nothing to see here. ", "&gt;If only people with at least 4 grandparents born in America were voting Trump would win in a 50-state landslide.\n\nGood thing all 6 of my grandparents were born in America.", "Wait this is being reported by Fox? And it's a Repub Governor? Actual voter suppression, by a Red politician? The fuck? Fox, I thought you'd be burying this, why the change of character?", "Where the women are strong the men are good-looking, and the children are above average. ", "&gt;Minneapolis voters are expected to endorse the candidacy of the first Somali-American woman to hold elected public office in the United States. Ilhan Omar the Democratic nominee for a state House seat in an overwhelmingly Democratic district, was born in Somalia in 1982 and lived in a Kenyan refugee camp before settling in Minnesota in 1997. With a long history of political activism, this Paul Wellstone–style progressive says, “It matters that I am a woman. It matters that I am a Somali-American woman. It matters that I am a Muslim and immigrant woman. It matters that our campaign won the primary by creating a multicultural coalition.”  \n\n\n&gt;And it matters that Ilhan Omar will be elected to the Minnesota Legislature on the day that Minnesota rejects Donald Trump and the racism and xenophobia that is at the foul core of Trumpism", "And he's got at least 40% of the population supporting him.\n\nDo not forget that because nothing about them will be different after the election.\n\n", "Generally agree but Coulter is different. She CONSTANTLY does the most the meanest appearance based insults (often to the most vulnerable people). Turning this around on her is more a commentary on how repugnant her statements have been and less about her actual appearance.", "&gt; **the meanest thing Peyton Manning has said on public.**  \n  \nlol i take it everyone forgets [*this* quote!?](https://i.imgur.com/YRmhTWt.jpg)", "If he truly believed that was a human life why did he think it was appropriate to use the corpse as a prop?", "It's almost like Fox recently lost their propaganda coordinator.", "Remember the outrage over planned parenthood donations the fetal tissue for scientific research? Yeah...people got murdered over the outrage ", "Telling the flock who to vote for?  Then PAY YOUR FUCKING TAXES!", "She's a troll not even a purposeful one. Can't expect great things of most trolls.", "Super proud of my city and state today", "The pathologist should face charges it's desecration ", "Extra funny because it's the meanest thing Peyton Manning has said on public. ", "Her only job is to stand there and act not molested", "There a fish and chip shop in a town near me older than America as an independent country. ", "Yeah she really didn't think this one through", "But she's a women so they can ignore all of that and call you sexist for saying that.", "She never does.", "Personally I hate the appearence based insults. There are so many repugnant things about her, why do we need to care what she looks like?", "Donald Trump is proof that there is an unfortunately large audience for *patriotic* hate speech in America.  Ann has been targeting the extreme right wing nuts her entire career.", "And any time she's asked about it she deflects with a joke about her age. She is so obviously guilty.", "\"What are you impeaching her for?\"\n\n\"Oh don't you worry about that; we'll figure *something* out.\"", "It's similar to the \"deport Melania\" stuff when it was revealed she worked without a visa. We do NOT want her deported. We were making fun of the hypocrisy of Trump's immigration rhetoric.\n\nI don't care how Coulter looks. I do want her to feel some small part of the hate she's unleashed on some very undeserving targets.", "She's also a lifelong Cubs fan. What an exciting year for her!", "Let's play what subreddit are you in!\n\nr/politics\n\nr/enoughtrumpspam\n\nr/hillaryclinton \n\nr/the_donald", "Since he's endorsing a candidate does that mean his church loses his tax exempt status?  I think it does. \n\nEdit: remember you can report this to the IRS ", "&gt;&gt;If only people with at least 4 grandparents born in America were voting Trump would win in a 50-state landslide.\n\n&gt;Good thing all 6 of my grandparents were born in America.\n\nYeah, I was wondering about the biological logistics of that idiotic wording. Who has more than or fewer than four grandparents?", "If you give Jimmy Carr a target he doesn't know like a heckler, he'll go for the obvious digs. If you give him a target that he knows/can research, he will go for the very soul of that person where you aren't sure if the words are jokes or sincere \"advice\" he's offering to his target.", "Quick story: I was at the DNC convention as part of my state's delegation and we were next to the Mississippi delegation which predominantly consisted of old black women. During the roll call Hillary freed her delegates and Speaker Pelosi came to the stage announced Obama was the nominee and banged the gavel. These women broke down with a combination of joy and disbelief. One elderly women grabbed my hand so tight that I thought she was going to break it. Thinking about the life these women had - at most two generations from slavery, Jim Crow laws and the persistence of racism today to witness, in person, the rise of Obama. That was one of the, if not most powerful things to I've ever witnessed. That entire convention was magical.", "God damn it!", "*feigns shock*", "Does salon see itself as a real news source?  God I hope not. ", "Today is literally trash day for my street. ", "As an actual governing country though the US is older than Germany  France,  Russia and Italy.", "Anyone that can't see that the path the GOP is leading this country down politically is fascism is blind. ", "The direction the right has been going Ann Coulter can run for president next and win the nomination easily. ", "I'm not on board with giving her credit for staying culturally relevant so she can peddle her next tome of hatred. She's cut from the same needy narcissistic cloth that he is, so she's really only there for the exposure. ", "Also \"at lest 4 grandparents\"? Can one biologically have more than 4 grandparents???", "The actual Native Americans were savage pagans whom we pacified with Jesus beer, and smallpox. God bless America.\n\n", "Wait LePage didn't resign already? Mainers hate this dude.. ", "When I read Jimmy Carr was involved I immediately thought \"Ohh shiiiit\", but I still unprepared for how vicious he would end up being.", "You're right I let CNN do the hard work of telling me how great Clinton is!", "There is no way to \"look\" abused.", "\\&gt;SALON still trying to have itself up on some moral ethical high horse\n\n\n\\&gt;People still posting these trash-tier op-eds to /r/politics\n\n\n**SAD!**", "Poster child for ranked choice.", "I'm guessing they are never too young for priests.", "This is what I think public school history lessons should try to hammer home more. Going on and on about the triumphs of Lincoln's emancipation proclamation or MLK's brilliant and effective activism is great... But it overlooks just how recent that stuff is. For instance, I saw the painting [\"The Problem We All Live With\"](https://en.m.wikipedia.org/wiki/The_Problem_We_All_Live_With) at some point in some textbook, and I, of course, learned about how the first black students to attend a desegregated school did so under police escort... What I didn't learn till much later was that Ruby Bridges, the little girl in that painting, is younger than *both* Clinton and Trump. She's 62.", "He's like a middle schooler they can see what you are most insecure about and dive straight for it. ", "Because it was created by the utility companies as a means to remove competition. This wording is deceitful and disgraceful.", "And I'm sure they didn't allow Tiffany to vote. ", "plot twist: she votes trump", "There's a bit of a civil war going on in all vestiges of the Right including Fox. Roger Ailes being ousted was the first casualty in the Fox News organization and I think after today he probably won't be the last. My prediction is that Megyn Kelly, Shep Smith, and Chris Wallace are most likely going to inherit the airtime from Hannity, O'Reilly, etc. as the board of directors of Fox are going to want to back off from the cliff they almost drove the country over.", "Afaik she rejected the prepared jokes the writers had written for her and wanted to do solely her own material.\n\nWell, we saw how that went. ", "That man's got womanly hips! ", "This is the correct answer", "Wait what?\n\nWhat about, like, the actual Native Americans?", "Along with Gaslightin' Conway.  \nHmm... that's a nickname that should stick.", "Trump's disparaging of Somali-Americans is disgusting. ", "TBF it seems Tiffany was neglected and hates him she didn't look abused to me, its more like the daughter he never talked to in his life. Ivanka on the other hand, poor child.", "I knew what it was and I still clicked on it. What the fuck is wrong with me.", "I see how you could think most of that is significantly true if you lack the will or ability to think for yourself.   ", "Just getting warmed up they're going to spend the next four years screaming impeachment, demanding that Clinton make Trump a cabinet member and that the GOP makes the SC appointment.\n\nBasically business as usual.", "And honestly if anything immigrants are the most American. They are the embodiment of the \"American dream\", going to a new place and making a life for yourself and being free, fighting against the odds, etc", "[This is what the American Dream looks like](https://www.thenation.com/wp-content/uploads/2016/11/ilhan_omar_ap_img.jpg?scale=896&amp;compress=70)", "Hillary has one immigrant grandparent English, while Trump has all 4 grandparents being immigrants* (2 German, 2 Scottish) as well as his mom being Scottish. \n\nSources: [Hillary](http://www.perche-quebec.com/files/hillary-clinton/individus/hillary-clinton-en.htm), [Donald](http://genealogy.about.com/od/famous_family_trees/p/trump.htm)\n\n^^\\* ^^Technically ^^Trump ^^has ^^2 ^^immigrant ^^grandparents ^^and ^^2 ^^straight-up ^^foreign ^^grandparents, ^^since ^^his ^^Scottish ^^grandparents ^^never ^^immigrated ^^to ^^the ^^US.", "I don't wanna get all Godwin up in here but damned if it isn't appropriate. Literally Nazi.", "ITT: The last gasp of Trump's supporters... and attempts to try and suggest Hillary is not progressive enough. YOU chose Trump. YOU helped alienate your own most vocal supporters. YOU cleaved your own party in two. And frankly I couldn't be happier to watch it all go down tonight. ", "This sub should be shut down. Drain the Swamp. ", "Catholics have a history of using body parts as holy relics. I guess it's a new twist on that old tradition.\n", "&gt;Trump's disparaging of Americans is disgusting. ", "It isn't very nice but her looks are what got her the media profile in the first place. She's made a career out of looking like the all-american girl next door who is pretty and proper, but then spouts outrageously right wing lunatic public pronouncements and writings that give the conservative patriarchy a raging hard on. See also Sarah Palin, Michele Bachmann and every female Fox News presenter.\n\n", "&gt; People still posting these trash-tier op-eds to /r/politics\n\nSeriously remember folks; wikileaks links are not tolerated here, but your bullshit op-eds from Salon are more than welcome to sit at the top all day!\n\nI think a lot of people here will be out of a job by tomorrow ;) ", "That's the thing I'm sensitive about!", "yeah weird that presidential candidates are vetted and stuff in a way random celebs aren't weird, i don't get it", "Slavery happened 140 years ago that's 2x 70 year old ladies living back to back; not a long time", "Exactly- that's why we'll pass Question 5!", "Plus they have to actually pass a test to become an american.", "Being a teacher in the post-Trump world has been more than slightly discouraging. I have students who are birthers and 6000 year old earthers. It makes me sad when I'm trying to teach about logical thinking but the students have no desire to think critically about what they are saying.\n\nOne step at a time. Once the Donald washes away hopefully this filth will go with him.\n\nEdit: Hoo-boy! They're out in force today!", "She is the biggest troll ever. I think she is smarter than people give her credit for. I don't even think she believes half the shit she says she just does it all for the attention. She needs to be treated like a mass-shooter; just don't talk about her and she will go away.", "She's made her career on comments like these.  As long as it gets her attention she'll thrive.  Sad though it may be.\n\nAnd there are people out there who wholeheartedly support whatever she may say.  And since she's such a lightningrod, networks give her airtime since she can bring viewers.\n\nShe's like Freddy Kreuger.  We have to stop thinking about her if she's ever going to go away.", "Sounds like someone needs to pay a few years back taxes if they're advocating for a politician.", "&gt; the first black **man**\n\nShe's also a woman born before the 19th Amendment, so I'm sure today means a lot, too.", "that's a lovely generalisation", "&gt; Trumpery derives from the Middle English trompery and ultimately from the Middle French tromper meaning \"to deceive.\" (You can see the meaning of this root reflected in the French phrase trompe-l'oeil-literally, \"deceives the eye\"-which in English refers to a style of painting with photographically realistic detail.) Trumpery first appeared in English in the mid-15th century with the meanings \"deceit or fraud\" (a sense that is now obsolete) and \"worthless nonsense.\" Less than 100 years later, it was being applied to material objects of little or no value. The verb phrase trump up means \"to concoct with the intent to deceive,\" but there is most likely no etymological connection between this phrase and trumpery.\n", "Anyone else just...have an overwhelming sense of fear and dread? This is going to be a long day....", "That's an abbreviated list too. ", "\"Wrong.\" - D. Trump (R)", "I'm pretty sure Belichick has a legit libel case against Donald for publishing that obviously fake letter.  \n  \nEdit - I will believe that letter was from BB when I actually see a statement from him confirming it.", "Wew politics.\n\nGlad this doesn't violate your guy's civility rules.", "Second in line behind an older woman.  Tim Kaine's new life.", "Another solid piece of journalism from salon", "But somehow voters think Clinton is the dishonest one? Trump lies about absolutely everything. ", "No puppet.\n\nUpdate: @AdamSchefter: Tom Brady agent Don Yee on speculation of Brady vote: “Tom does vote but like many Americans, prefers to keep his preferences to himself.”\n\n", "What will /r/politics become after the election. Why are posts like this not on /r/HillaryClinton? People complain about /r/the_donald but that is a subreddit specifically in support of one candidate. /r/politics isn't supposed to be that. \n\nEdit: Thanks for the gold but I don't need it please give money to a charity in support of our veterans rather than to reddit.", "BREAKING: Clinton 66% Trump 33%, in Pennsylvania. \n\nSource: I asked 3 people in line who they were voting for. 2 said Clinton, 1 said Trump.", "This whole sub is trash. ", "Excuse me the media owes us an apology for Trump. Billions of free ad time because his crazy brought in viewers.", "This is nothing but propaganda lol. There is nothing actually being said here it's literally nothing but a smear piece.", "Trump can't even claim (legitimately anyway) that he didn't know the letter was fabricated.  Trump wrote the damn letter himself.\n\nOr atleast whoever wrote his personal physician's letter wrote Belichick's letter.  And it's funny both these people talk just like Trump.  They even have the same *tremendous* vocabulary.\n\nEdit:  For full disclosure, there is a local sports reporter saying that the letter is real.  A couple of places like Deadspin, are repeating this.  As of yet, there hasn't been any confirmation from the team or Belichick one way or the other.  The local reporter will not reveal his source.  So for now, there's still no reason to believe the letter isn't fake (IMO).  Tremendous x 2, Beautifully x 2, Unbelievable, Amazing, Remarkable.  These aren't Belichick words.  These are Trump words. \n\nEdit: 2:10pm Eastern - https://www.washingtonpost.com/news/early-lead/wp/2016/11/08/donald-trump-says-tom-brady-bill-belichick-are-on-his-team-gisele-bundchen-disagrees/?tid=sm_tw\n\nEdit: @AdamSchefter: Tom Brady agent Don Yee on speculation of Brady vote: “Tom does vote, but like many Americans, prefers to keep his preferences to himself.”\n\n", "r/politics is gonna implode if trump wins.", "Never change Donald.\n\nAlso, never come back.", "I voted for McCain on 08 and Romney in 12.\n\nSwitched my registration to Democrat when Ben Carson was applauded by the GOP for saying that Muslims shouldn't be allowed to serve as president in our country. Realized that this was no longer the party of Reagan and it certainly wasn't the party for me.\n\nVoted for Hillary this morning.", "You're the puppet!", "I just finished voting in Florida. \n\nA man at my polling location had trouble filling out his ballot the machine wouldn't read it. The volunteers voided his original ballot, showed him how to fill out the bubbles, and let him fill out a fresh ballot after despising of the failed ballot. He put his ballot in the machine before me and it counted, he had a huge smile, thanked everyone and went on his way.\n\nDemocracy at work! No lines, no vitriol, and no judgement, just democracy.\n\nHappy Election Day Everyone!\n\nETA: I voted", "&gt;The Virginia senator was beaten to the polls by 99-year old Minerva Turpin.\n\nSounds like a defense against the dark arts teacher.", "I remember hearing a reporter talk in a podcast that America seems to think Hilary is a liar and that trump is a bullshit artist. But that the opposite is actually true. Hilary spews a lot of bullshit lawyer speak cause she doesn't want to speak her mind. Trump flat out lies. Yet because of the disconnect people treat Hilary speaking bullshit nonsense as her lying, while they excuse Trump lying pathologically and think he's just bullshiting. \n\nI thought that was as good a summation of these two candidates as I've heard his election.", "\"The Republican Party is better than this.\" \n\nBased on what evidence? This is who they are.", "How desperate do you have to be to make up fake endorsements?", "Trump has a strange history of making up fake letters from the NFL and it's associated personnel.", "That's a very biased and incitive title you got there.", "I know this is vox and this guy cries wolf a lot and stuff but I really am for the first time. \n\nI'm a white upper middle class male Jew, never had to worry about any bullying or discrimination of any kind. I live in Tampa, it's not exactly a hub for crime and we have a huge Jewish population. \n\nWell a month ago a desecrated American flag with the words \"Jews and immigrants go home\" was left on the steps of my synagogue. 22 years of peaceful coexistence and all of a sudden Trump runs and I felt for the first time what it was like to be attacked because of who I was. I used to say that it was only a matter of time before Trump found a way to make us all feel discriminated against and unsafe and it's so sad that I was right. It felt like another box was checked off. \n\nNo I'm not afraid to leave my home or anything ridiculous, but I've never had to worry about knowing how someone feels politically could put me at risk. And this isn't far fetched - it's already happened. That day my entire congregation was reminded about what it **was** like to be Jewish. My mom had forgotten what it was like to have pennies thrown at her. Jewish paper after paper has documented this rise of white supremacy and the magnitude of the anti-semitism that is undeniably a part of Trumpism and anyone who he has skewered is completely justified in feeling this way. ", "Another groundbreaking and insightful piece from Salon", "Wait is this the same Donald Trump that was on The Apprentice?", "Gracias amigos y amigas gracias.", "*sniff*", "This sub is constantly shit talking trump. Never anything that goes against Hillary. Weird.", "538 rates this poll as A+", "I just got out of the polling place in Maryland. So did my friend. He is a huge Donald Trump supporter. He just texted me saying that Donald Trump is going to win the popular vote by a landslide. I asked him what would give him that idea since there is literally no statistics that will back up Trump leading Hillary by the popular vote. His response?\n\n \"You're just a typical delusional Democrat.\"\n\nOk. ", "This is what's funny about Donald Trump. He can spew senseless lies all the time and his supporters worship him. But if Hillary misspeaks she is a witch. ", "There was a BBC editorial which summarized the election as \"the lawyer vs the salesman\". I think that really nailed it.", "Guys stay safe out there. Don't get into confrontation. This has been a dirty election and people's emotions are riled up. Just turn the other cheek and vote.", "35 years old.\n\nTook my daughter to the polls this morning about 60 people in line in front of us.\n\nVoted straight ticket Democrat for the first time in my life.\n\nEDIT:\n\n[she got a sticker](http://i.imgur.com/kprbvfu.jpg)", "IMO they lost all credibility after doubling down on the secret Russian server thing ", "If you wanna rip on Trump then be my guest but /r/politics started posting shit from Buzzfeed and Huffpo like come on guys. .. ", "Hillary spent a lot of money to have it this way.", "Fox is staring into the abyss of the monster it created turning on them.", "I hope the cubs win", "Salon.com being an accepted source is proof of this.\n\nEdit: I feel like I'm in Lord of the Rings. I don't read Breitbart either. \"You have no power here.\"", "Jesus /r/politics isn't even trying to hide that they've been corrupted by Hillary anymore.", "In the interest of retaining some semblance of hope for humanity I'd like to point out that not all Trump voters are Trump supporters. They're voting Republican because of the \"Democrats will nominate liberal judges who will legislate from the bench\" narrative, not because they think this cretin is the best man for the job.\n\nThis election seems more about voting against the other party's candidate than voting for your own party's candidate.\n\nThere's of course still a worrying number of people who think Trump is a great candidate.", "Coulter is proof that four grandparents can be two people...", "Please stop mentioning her.\n\nThe only purpose she serves is to orbit the fringes of politics and say *intentionally* stupid things so people pay attention to her. She's the grown-up version of a sad lonely sorority girl who wanders around the party shouting at people about how drunk she is after having one light beer.\n\nWhy, if her ideas offend you so much, do you so passionately go out of your way to help her? The cure to a leech attack is not to cut your wrists and fill a wading pool for them to writhe in.", "You should spend tonight with him.  Put that shit on youtube.  \n\nEdit:\n\nHAAHAHAOIVJHSAPFOHAPOIFHGPODSHGSOI", "Somethings wrong with the mic.", "I felt twinges fear when Palin ran with McCain.  Romney's run gave me a bit of hope that the republican party could recover.  Trump's run scares the living shit out of me.", "\"Im holding out\" - Gisele\n\n5 seeconds later \n\n\"Lol fuck you Trump\" - Brady", "White republican Christian guy here just voted for Hillary in Ohio! (...and Rob Portman...)", "Trump is getting mowed down by a convoy of taco trucks.", "The press owes an apology to America too. \n\nIt was their 24/7 nonstop coverage that helped build the monster that became Trump. Their almost complete disregard for pertinent issues during the election season was incredibly irresponsible.", "Nono you are confused this is the Donald Trump who was in Home Alone:Lost in New York", "He's still butthurt about the USFL isn't he?", "End Trump. Vote.", "probably the expense of having to pay mandatory workers overtime (ie: police firemen, doctors, nurses, etc)\n\nalso the fact that one of the political party's entire electoral strategy is having turnout be as low as possible.", "You can have fewer than 4 grandparents but it would have certain implications that you probably want to avoid", "Thank you for putting country above party.", "Seriously why is election day not a national holiday? ", "If the letter was some thing like\n\nDonald Trump? Yep.\n\nI'd be more apt to believe Belichick wrote it. ", "It's funny how some people are super into state's rights except when the states want to give people rights they don't think they should have.", "Obama and Hillary went to Kenya and broke my microphone ", "There is no Clinton email in the world that could make me vote to give that orange skinned psychopath the power to destroy the world several times over.  I voted accordingly 3 weeks ago.", "Trumpers will claim Kaine was campaigning in a prohibited place in 3...2...1..\n\n", "PA checking in. Got there before polls opened and was standing outside for over 2 hours. I was the 170th voter. \n\nNot everyone has the luxury of waiting in line for that long on a weekday there's nothing that deters participation more than long lines in the cold. We need to have an election day holiday. ", "No way it was written by John Miller.", "Ivanka poured her milk (skim almond) into her morning coffee (Colombian, dark).  The milk swirled up and seeped through the coffee like a man's unwanted hands on a beautiful woman's hips.  Why was there no way to go back, Ivanka wondered.  Why could she suddenly no longer return to a time when the milk and coffee were separate?  Why must the behavior of one thing forever scar another?  The goddess of entropy was cruel.  Ivanka was her favorite plaything.\n\nIvanka took a sip.  It was scalding hot.  She liked it that way.  She liked the pain on her tongue better than the pain in her soul. \n\n(click my name for more Ivanka vignettes)", "She voted for herself. RIGGED. \\s", "These Racists NEED a reminder that \"minorities\" is pretty much a false statement these days  ", "Pretty much. They're a bunch of racists misogynists, bigots. Some, I assume are good people.", "Welcome to the 45th Hunger Games. ", "“Here in Minnesota you’ve seen firsthand the problems caused with faulty refugee vetting, with large numbers of Somali refugees coming into your state without your knowledge, without your support or approval, and with some of them then joining ISIS and spreading their extremist views all over our country and all over the world,” said Donald Trump at a rally in Minneapolis on Sunday.\n\nTrump is lying. Minnesota doesn't have a refugee problem. The company I work for in Minneapolis has over several hundred Somalis employed. Funny thing, they are just like everyone else. Trump is just a bigoted, racist asshole. Fuck you, Donald Trump!", "Hillary is a corrupt wall-street shill and a hawk, but with a massive advantage in the headspace and required background knowledge of being president.\n\nDonald Trump is a bigoted authoritarian who lacks competence in any single area except marketing.\n\nThird parties aren't going to win. Stein is also a bit incompetent and her rhetoric betrays a lack of deep understanding on some issues.\n\nJohnson is a libertarian, which has no fundamental mechanism for dealing with Climate Change or other problems and is not a serious political philosophy. Johnson himself is unprepared for the basic rigors of electioneering and presidenting as well, as evidenced by his serious gaffes.\n\nClinton is the best choice. I don't like her and I intend to protest her tonight at the TYT rallies and moving forward I hope she's primaried in 2020. But as far as the realistic direction the country is going to move in, Clinton will hold things together the best of our choices.", "/r/propaganda in full swing\n\nVote for who YOU want to. Don't let these idiots do your thinking for you.", "As long as it's anti-Trump it's A-ok.", "Thank you. While I disagree with McCain and Romney on a political level they were decent people with the candor and respect and temperament needed to be our president. ", "Well in my area the Hispanic turnout has been incredible. Watch out Trump", "Republicans are being left behind by demographics. The white population of America is shrinking and the GOP is showing no signs of reaching out.", "She voted for Rufus Scrimgeour ", "It honestly is absurd how many of them claim their great great so and so was a chief. \n\nNo one is ever the child of the mushroom picker. Its always the chief. \n\nAnd for so many of them its barely even \"one drop\" its more like 1/5 drop.\n\nMy grandfather was 1/4th blackfoot indian and he was allowed to hunt on the reservations would attend the events, etc. I am aware that the percentage within me is so negligable that it might as well be non existant. I never mention it and make no claim to native american culture. Whats the big whoop anyways? So many White americans look at native americans like they are mythical creatures. They are just people. Im (mostly) white and its not a big deal. (Actually mexican and white but according to my friends mexican is diet white so apparently im 100% white).", "Imagine Florida goes blue that pretty much ends the entire election.", "but... r/politics told me 2 weeks ago that Trump had no chance according to polls?\n\nlul", "Pregnant lady here and I voted. Puked before leaving and puked again upon returning home.\n\nThat's also how I feel about this election in general...", "Plus with the up and coming Trump TV Fox News will have to get more moderate viewers now that the 'crazies' will have more options.", "Thank you Bad Hombres. You are the heroes we clearly don't deserve.", "Similarly r/the_donald will be on suicide watch if Hillary wins ", "Today I woke up to a text from my immigrant mother. She was so proud to have voted and urged my brother and I to get out there today too. My favorite text from her:\n\n\"They keep talking on CNN how surprised they are that the latinos vote went up since last election. They need to realize that a new generation of latinos (well educated) are now of age to vote and they are educated!. Hello?? - love the stereotype, this is why I don't want Trump to win.\"", "Can you imagine him changing? He is immune to information.", "Can't just wait and join the class action like the rest of us?", "\"The only person you'll ever make happy is the Mexican immigrant digging your grave.\"\n\nThat was the most savage burn I've ever heard in my life.", "I have good news", "For... what?  Representing their base?", "I for one, welcome our new Taco Truck overlords.\n\n^mmmmmm ^tacos", "First time voting democrat. This election made me feel dirty all over. Let's do a better job next time. ", "And that's the news from Lake Wobegon", "One way or another Reddit will implode.", "Let's all remember the reason for this law.  Its so that you can keep your ballot private.  There were fears that people would force you to share your ballot with them so they could know that you voted the way you said you would.  Either for money or intimidation.\n\nThis doesn't violate the spirit of the law only the letter.  And while everyone is going to be up in arms about any potential laws being violated today, I really think people need to calm down on this one.", "His tweet on the matter\n\n&gt;I wanted to be first at my polling place but 99-year-old Minerva Turpin beat me to it. Looks like I need to get used to being number two!", "Lol I literally thought the same thing... This subreddit has turned to shit", "She does not deserve that credit she's a minor player who will not be remembered by history.", "Professional logician here. I'll note that she said \"No!\" to the proposition that she *and* Tom supported Trump. That does not mean that Tom doesn't support Trump; it just means they don't both support him. (Disclaimer: I'm not a professional logician.)", "Another solid top post on r/politics.\n\nIt's a caricature of its former self.", "Vote people and don't leave your line", "\"She's such a nasty woman.\"", "Ha seems like a pretty chill dude. ", "Right? Trump was under the impression that Brady was voting for him and certainly jumped the gun saying that he did but Brady never said he wasn't going to vote for him in the interview just that he hadn't voted yet.  Gizelle is saying no to them both supporting Trump but that doesn't mean he doesn't individually.\n\nI'm waiting for definitive proof of who Tom voted for before I cast my vote. ", "&gt; Mrs. Krabappel and Principal Skinner were in the closet making babies and I saw one of the babies, and then the baby looked at me.\n\n - Donald Trump", "&gt; And while everyone is going to be up in arms about any potential laws being violated today\n\nHonestly outside of some pithy headlines, no one gives a shit about this sort of thing.", "Voter suppression at work.\n\nThis is why people need to pay f***ing attention to midterm elections. When you let the state government be run by goons they pull shit like this.", "I'll take \"No Shit\" for $1000 Alex.", "Note: this article was written by Bill Press. It doesn't say the \"press\" in general thinks the GOP owes the country an apology even though I'm sure many journalists share the sentiment.", "how many times did he repeat that he'd been endorsed by ICE? i can't believe the moderators didn't call him out on that shit. ICE is a fucking government body.", "Where's all the inspirational posts encouraging people to go VOTE on /r/politics today?  Doesn't matter the candidate shouldn't the message on this sub on the day of the Presidential Election be GO VOTE and not a bunch of shit-slinging?  ", "Website Salon.com .... LOL", "Michelle's speech moved him. This is how the fever breaks. ", "Which one?\n\nThe quiet one or the one who looks like Donald fucked himself and birthed his own inbred clone?", "To Whom My Concern:\n\nI have been a redditor since 1980 and I can state unequivocally that those letters were the most legitimate letters in history. \n\nPeople always tell me- people who I meet. I've never even met them before. The come up to me and they say \"Don... uh Juan\" - \"Don Juan, those letters are *so* valid. *So* valid.  Extraordinarily valid.\" *sniff*  And I've seen it. Believe me. So- and by the way, you've never seen a more valid, extraordinarily-written, tremendous, beautiful letter. I mean, the paper. Right? Whose seen the paper? Beautiful paper. And the words? The words, by the way, the words are the best words. Believe me. And they know. You know? People know.", "But how can that be!? I just saw Trumps speech last night he said they were ahead in \"EVERY SINGLE POLL\" Rigged!!! Rigged!!!", "Reddit and r/politics in particular became a battleground in a very bad way this election and the damage cannot be undone. Expect financed social engineering/propaganda to dominate every major issue going forward. Oh don't like TPP 2.0 or the latest war on [insert unsavory nation here]? Well, the commercial upvotes and manufactured discourse has decided that your opinion is shit so move along to downvote land. ", "&gt; Bill Belichick one of the most publicly despised figures in America\n\nAs much as we all joke about him being Emperor Palpatine, he's extremely well respected and considered by most to be the greatest coach in the history of the sport.", "Until I see Belichick in front of a camera stating explicitly \"I wrote that letter\" I will not believe he did. It sounds NOTHING like him, on top of the fact its so out of character it boggles the mind anyone would even try and pass it off as legit. Plus hes always been said to be a Democrat. Everything just doesn't add up.", "The one who looks like a sexual predator. Wait that doesn't help. Um. The one that looks like one of Draco Malfoys goons. Wait..that also doesn't help. The one who retweets white supremacists...no wait that's both of them...\n\nI guess I can't help you", "/r/politics is basically /r/hillaryclinton. The simple way to get karma is post as much as you can that is anti-Trump. Don't agree that Hillary is a goddess perfect person? Get hammered with downvotes. Articles like what was posted just simply reinforce this.\n\nWhat ever happened to being neutral and respecting opinions? Why can't the trash posts like this be kept to /r/the_donald and /r/hillaryclinton?", "The priest &lt; should &gt; be defrocked and kicked out of the priesthood.\n\nAnd that Church if not all Catholic churches, should lose it's tax exempt status. Other Catholic Churches have been telling parishoners for years that it was a mortal sin to vote Democratic and they ALL should lose tax exemption but so should most Baptist churches and many others as well because preaching from the pulpit has become commonplace because the ministers all know the IRS  will NOT take any action against them for violating the law.", "I love the irony of people giving gold to support reddit, when the comment is knocking reddit for corruption.", "I'd also like to point out that Belichick would never write a letter that uses the word \"beautifully\" in it.", "Salon is not propaganda. Salon is truth. Vox is truth. CNN is truth. MSNBC is truth. r/politics is the Minister of Truth. ", "He was endorsed by the union that represents ICE officers.\n\nhttp://www.politico.com/story/2016/09/immigration-customs-enforcement-union-endorses-trump-228664\n\nIt's a weird way to phrase it that could be considered misleading but anyone who cares enough to look it up would see what he meant. I mean, when he said it, I had the same thought as you -- he couldn't possible mean ICE itself. I figured he probably meant the union that represents their employees, and sure enough that was it.", "Oh my goodness he is the most likeable politician. He's like the epitome of supportive dad who makes terrible dad jokes but you love him anyway because it makes him so happy", "Black dude voting in San Antonio! Go Trump!\n\nHaha Jk. Fuck that dude. ", "This isnt just the left \"thinking\" hes dishonest he blatantly lies on camera daily. And then denies saying the things we have him on camera saying. Its pretty unprecedented", "Exactly. Republicans have been peddling ignorance and bigotry for decades but they were very good at softening their language with buzzwords like \"state's rights\" and \"handouts\". Trump's just explicitly racist/sexist/anti-Semitic. If the GOP is a dogwhistle, than Trump is a bullhorn. ", "https://twitter.com/jdubs88/status/795839830978625536?ref_src=twsrc%5Etfw\n\n&gt; @AnnCoulter Ann your side usually waits until 3 a.m. to tweet sh*t this stupid.\n\nHAHAHA", "As suspicious as I was that the letter was fake- it looks like it was real. Still can't believe the wording. Very strange for Belichick.\n\nhttp://deadspin.com/report-bill-belichick-did-write-that-letter-to-donald-1788696859", "I feel the same way. White middle class male Jew in his 20's living in the Clearwater area. My grandmother and great aunt are Holocaust survivors and they're absolutely mortified with what's going on.", "The mic just got 10db higher", "Voted early for Clinton and Roy Cooper. #fuckpatmccrory", "That letter was literally the most bizarre part of this entire election. Who the fuck does that? It's so crazy... he's unwell. ", "I haven't been checking /r/politics lately but wtf is this. I thought /r/politics was meant to be impartial?", "Registered Republican and voted Hillary and Murphy. Just can't deal with this GOP shit anymore", "Member when Red State would publish her shit? Pimp her books? She's always been this awful just noticing now huh?", "I think the biggest argument against that letter is still the weird idea that Belichick would stir that controversial pot at this point during the season. The vast majority of coaches for any teamsport would be loathe to toss that elephant into the locker room let alone Bill Belichick. ", "Scantron weaning out those who can't color inside the lines since 1972.", "Reminder all the polls Trump was tauting yesterday which showed him leading were from the same pollster, [Trafalgar Group](http://www.realclearpolitics.com/epolls/latest_polls/state/). Their polls have never been in line with the averages, and they always skew heavily Republican.\n\nIt's almost as if the Trump campaign specifically commissioned Trafalgar to give him some good news. But that's not possible, since it would mean the polls were rigged...", "If you encourage people to vote they might vote for your opponent. ", "Agreed it was a great speech too.\n\nI hope those not part of the Alt-Right go easy on him for now. He seems to have realized what an idiot he was.\n\nMaybe it's for money, who knows. His new outlook is fine with me.", "Comments like this make me think people like you only recently discovered reddit. Surprised your account is 2 years old but then again that also means this is your first election season on reddit.", "A win-win situation if you ask me", "**Most** of this is targeted suppression http://www.slate.com/blogs/the_slatest/2016/11/07/those_insanely_long_early_voting_lines_were_a_result_of_republican_voter.html ", "A tremendous microphone...", "It took me about 45 minutes to vote in Philly this morning. For reference when I voted in 2008, 2012, and the Democratic primary there was no wait.", "Even Trump's friends know he's a shitty leader. Haha!", "And make Mexico pay for it.", "Absolutely he thought killing the USFL for the NFL would ensure him a chance to own a team and the league snubbed him. Of course he still has a vendetta against them. ", "We'll build a new microphone...", "You should watch the Rob Lowe roast which was basically the Anne Coulter roast.  Pure schadenfreude.  She is mortified.  I guess it's impossible to take a joke when you are one.", "we're in full opposite day mode\n\nif Trump loses he's covered!", "They really should have embraced the 2012 Autopsy the ran after Romney's loss.  Instead they've further limited their brand and driven away potential supporters that could have carried them to victory in the WH this year.\n\nJust image if they had nominated a real Republican candidate against Clinton.", "It's more just the irony of them bitching about potential voter fraud and patrolling polling sites and then not knowing the voter laws in their own state. I don't think anyone actually cares that he took a photo of the ballot but ask yourself if the shoe was on the other foot how much Trump would be crying about Chelsea taking a photo of her ballot illegally. ", "He'd never emote in any way.", "Yet...here you are.", "I don't understand why all states don't have early voting. What is the argument against it? I voted two weeks ago here in NC. No line.", "People complain about t_d because they've been aggressively gaming the front page for the last year.", "Also Michelle Bachmann.  \n\nSo don't give us too much credit.", "Salon and mother Jones are just as bad", "McCain/Palin is the ticket that made me give up on the Republicans.", "Considering the reaming he took from that his butt SHOULD be still sore.", "This sub was *very* anti Hillary for a long time at least since before Sanders dropped out.", "There's a big difference between reddit as a company and the moderators/posters/commenters that make up the \"discussion\".", "&gt;I'm Donald Jr. The Brains!\n\n&gt;I'm Ivanka, The Beauty!\n\n&gt;[And I'm Eric!](https://youtu.be/oC4VXwFibWY?t=362)", "\"Nasty old woman takes my place in line. Disgusting! After I win this type of thing needs to be investigated we will PUT AMERICA FIRST. \\#MAGA \\#MENSRIGHTS\"\n\n\nEdit: I wish, I wish, I wish that Trump's ~~staff~~ ~~handlers~~ babysitters hadn't confiscated his phone and his Twitter account. Can you imagine the shit he'd be coming up with today? ", "Sooo happy to see everyone here saying they voted NO on amendment one!!!! Couldn't be more proud of ya'll.", "It's because you can tell he's genuinely a good person. ", "Who fucking cares? ", "Not to brag or anything but if Clinton carries Illinois by one vote you're welcome.", "No it's always been left leaning. ", "Boston sports radio was confirming it was real this morning they were shocked that it was", "Donald has an unending obsession over popularity approval and affirmation -- not among the general public, but more so among people he considers his \"peers\" (rich, talented, and/or powerful people, e.g.: celebrities, public figures, government officials, high-ranking military, etc.).\n\nWhen so many of his \"peers\" endorse Clinton over him, his ego just can't really take it. He wants his own entourage, except of course he can't get it. So he just fakes it. He lies about \"hundreds of admirals\" that endorsed him. He lies about Tom Brady. He lies about Bill Belichick. His supporters eat it up regardless, because the fact-checking media is just being biased, and the journalists deserve to be hung.", "I grew up in North Dakota.  I did my undergrad in Minnesota.  I went to school with these immigrants.  They were my classmates and friends.\n\nHe went out of his way during the final days of a highly contentious election to go to a state he has nearly no chance of winning for the sole purpose of disparaging a whole group of people based on their ethnicity.\n\nFuck Trump and his utterly vile rhetoric.\n\nHis vision of American is contrary to everything that makes this country great.", "The Clintons must be the greatest criminal masterminds in the history of crime to have committed so many crimes and gotten away without ever leaving a shred of evidence and never having been convicted of anything but lying about a blow job.\n\n**If they are that smart ---- I WANT THEM RUNNING THE COUNTRY**.", "Indeed and maybe we also owe Donald Trump thanks for being so all around awful.  It seems like the thing that truly sunk his candidacy was his A) misogyny, B) his taped confession of sexual assault, and C) his inability to restrain his infantile nastiness.  All the other stuff didn't seem to be enough.  If he had been some racist, nativist, xenophope candidate who was otherwise silver-tongued, charming, and respectful, he might have actually had a chance at beating a Democratic candidate as weak as Clinton.  How scary would that have been?", "Chris Thile is the new host. He's one of the best mandolin players in the world and the winner of a MacArthur Genius grant. And don't you dare talk smack about powdermilk biscuits. ", "who knew I could ever agree with redstate, these are truly strange days.", "Salon is shit just like this subreddit.", "He seems like a good guy. Probably the most refreshing part of this election has been his boring nice attitude. I don't mean that as an insult I really want politics to be boring again.", "I'm so mad I haven't been able to do the 'no puppet' on anyone in real life.", "Bill Maher on Friday night, basically apologized for painting Mitt Romney as a demon in 2012. \"Let's be honest, my life wouldn't have changed that much. But this is different.\"\n\nI hate to make the Hitler comparison. but it's completely apropos. Trump is rattling off the lies that everything is crumbling down around us and it's all the fault of Hillary and Obama. He's \"the only one who can fix everything\". He's going to jail his opponent as soon as he gets into office, despite the fact that Hillary is not under investigation for anything. Trump spouts xenophobic rhetoric, and his crowds go wild over it.\n\nTrump's followers simply don't care what the facts are; they are united over their hatred of Hillary and Obama, and are willing to burn down the entire political system to see \"change\".\n\nThis election cycle is truly terrifying.", "Even then Cruz and Rubio are pretty far right of mainstream politics (or were at least driven there by the base).  I really think the RNC needs to do a deep dive on what stances they want to take, and try to reflect the changing demographics of the nation.  They need more women and non-white candidates, and younger ones too.\n\nIt seems to me at least they need to loosen their grasp on conservative social policies (abortion, LGBT rights, etc) and turn more towards fiscal responsibility (smaller/smarter government, cutting tax loopholes, states' rights, etc).", "It's still incredibly unlikely that he wins. ", "&gt; Some I assume are good people.\n\nwow, it's crazy to think back at how much has been said this that phrase, it almost seems tame now.", "&gt; It's scary to think that a blueprint has been laid out now.\n\n# The blueprint has been laid out for decades.\n\nIt started back in 1968 with Nixon's Southern Strategy. Every Republican president since then has used it. All Trump is doing is saying things out loud instead of using dogwhistles. Just listen to every Trump supporter when they ask why they like him and they'll answer \"He says what everyone is thinking.\" The only thing Trump has done is go from covert to overt racism.", "\"Very ungrabbable pussy. No class.\"", "&gt; redstate.com\n\ndamn", "&gt; I'm waiting for definitive proof of who Tom voted for before I cast my vote.\n\nFinally someone here is being responsible.", "It's easy to see this and claim Ann Coulter committed voter fraud but the situation is much more complex than that.\n\nAnn Coulter is a demon that was summoned from the dark dimension some five thousand years ago. For whatever strange reason, this demon felt it necessary to acquire a legitimate US issued photo ID. Being unfamiliar with the concept of \"birth dates\" and \"the passage of time\", the demon made a small clerical error.\n\nUpon seeing how easy a person/inter-dimensional being could commit voter fraud, this creature dedicated itself to ensuring nobody but the most dedicated of demonic servants (republicans, obviously) could vote.\n\nOnce the voter ID laws of the USA meet this demons strict criteria, it will leave our plane forever. Kind of a win-win.", "Well said.  I'm a fairly solid conservative and am quite nervous about how her policies will impact the country but voting for her was one of the easiest decisions I have made.\n\nBoth parties have mindless zealots prone to group think and hate, but only the Republicans allowed that hate to become their platform and subsequently endorsed it in express terms.  Republicans who endorsed Trump shall never see my vote.  Capitulating to him as the lesser if two evils demonstrates the lack of principle and individual cowardess of each who endorsed him.\n\nI am no more liberal today as I was a year from now.  But I will sacrifice ideology, economic prosperity, security to retain the decency and democratic ideals that characterized much of American history and progress.\n\nMy hope is that, however flawed, Hillary sees an opportunity to unite much of us, who want a better, more civil way of governance, and while I do not care for her, I deeply wish for her success.", "It's gone from a Bernie supporting community to a full on pro-Hillary campaign trail.  That's the funny part to me is because not too long ago people in this subreddit were against Hillary.", "If you had told me two years ago that I'd be upvoting a link to redstate.com as the rational voice of the Republican Party...\n\nI would have laughed at you.", "Yeah she doesnt give a shit what anyone thinks about her as long as she can peddle her ridiculous books to dumb idiots. She says shit like this to stay in the news cycle…", "Thank you my guamish people.", "You used to talk negative about Hillary on here and get a ton of up votes. Now you can get banned if you mention the name of her super PAC funneling money into propaganda ", "As a resident of VA. That pretty much sums him up. Kaine is a chill guy. I've attended one of his rallies a few years ago and even saw him more recently unexpectedly at a play put at the theatre in richmond. It'll be interesting to see him as VP.", "[This is what she wants.](http://erin-gee.ca/wp-content/uploads/2015/11/B8S86rCCEAIqP1e.png)", "Some choice Ann Coulter quotes:\n\n&gt;It would be a much better country if women did not vote. That is simply a fact. In fact in every presidential election since 1950 - except Goldwater in '64 - the Republican would have won, if only the men had voted.\n\n  ----\n\n&gt; Whether they are defending the Soviet Union or bleating for Saddam Hussein, liberals are always against America. They are either traitors or idiots, and on the matter of America's self-preservation, the difference is irrelevant. \n\n  ----\n\n&gt; I think there should be a literacy test and a poll tax for people to vote.\n\n  ----\n\n&gt; My libertarian friends are probably getting a little upset now but I think that's because they never appreciate the benefits of local fascism.\n", "Here's the letter:\n\n&gt;Congratulations on a tremendous campaign. You have dealt with an unbelievable slanted and negative media and have come out beautifully – beautifully. You’ve proved to be the ultimate competitor and fighter. Your leadership is amazing. I have always had tremendous respect for you, but the toughness and perseverance you have displayed over the past year is remarkable. Hopefully tomorrow’s election results will give the opportunity to make America great again. Best wishes for great results tomorrow.\n\n&gt;Bill Belichick\n\nThere is no doubt in my mind that those are Trump's words.  First off, that would be completely out of character for Belichick to even write a letter like that.  Second.. he used \"tremendous\" twice and said \"beautifully – beautifully.\"  That's how Trump writes, there's no way in hell anyone but Donald Trump wrote that letter.", "If you are in line by the time the polling station closes they have to allow you to vote.", "If he's anything like I think he is he'll be a less cool Joe Biden. Nobody can replace that man.", "He still has two months left to steal all my guns!!", "Diamond Joe was a national institution", "It's Gaumi Bears. ", "Redstate is a staunch conservative but definitely anti-Trump media outlet.  ", "&gt;I played a lot of harmonica on the trail. I would say that and being able to speak Spanish, are the two fun things I've been able to do during my 105-day adventure. Being with Jon Bon Jovi on stage, hard to beat that.\"\n\nGuy is having the time of his life.", "&gt;  benefits of local fascism.\n\nHoly shit monkey balls that woman is crazy", "\"I don't delete tweets\" Eric Trump\n\n&gt;Update: Shortly after this post was published Eric Trump deleted the tweet.", "He didn't even take all the guns. ", "He's a goober Joe Biden. Both are dads just different types of dads. Biden buys a motorcycle and winks at the ladies at the bake sale. Kaine buys a reticulated bicycle and has zinc on his nose 7 months out of the year.", "\"White land owning men over 22 making over $100,000 ($250,00 for a family of 4) who have 4 natural born american grandparents\"", "Absolutely because you should always vote exactly like your favorite sportsball star.", "Once again The Donald doesn't pretend to be non partisan. It wouldn't be nearly so bad if they didnt get banned from here for having a differing political opinion and forced into an echo chamber to discuss their candidate.", "The headline is confusing. It's the opinion of the author Bill Press -- not the entire \"press.\"", "&gt;Televangelist\n\nAnd that's where I stopped reading.", "Mexican with dual citizenship here. Im going to go vote today for Hilary not because Donald is a racist because he is a moron.\n\nbtw: I'm more of a republican.\n", "Actually it was the Muslim Brotherhood's plan, which Obama is the Grand Vizier of, but Obama misunderstood 'Sharia law' (having never really attended Harvard law school) and tried to enact Shia Labeouf law, which is what one would do if a partner of The Transformers.  fortunately for the US that means rule of law and freedom...", "Do remember poll herding is a thing. This isn't over until the results are actually tallied, go out and vote!", "He got in on the USFL because the NFL wouldn't have him. Saying he 'killed' the USFL is the same as saying he's killed every other business venture he's ever been in: he's just bad at business. There was no reason the USFL was going to be any different.", "and enact marshall law and make himself supreme ruler.  people who can actually vote really seriously thought he would do this!\n\nwe need a sanity test for voting....", "Headline should have been: GUAM WITH HER!", "[Relevant *This American Life*.](https://m.thisamericanlife.org/radio-archives/episode/600/will-i-know-anyone-at-this-party). It's amazing to hear how hard it is for people to admit there are explicit racists supporting their party and how they rationalize it.", "he didn't even try!", "Is*", "it's not even that it can be considered misleading. it absolutely is 100% misleading but more to the point, it's a straight up lie. a union =! a government body. implying you have the official endorsement of what is supposed to be a nonpartisan government body is a bald-faced lie. \n\nalso, all three of us (you, me, and trump) know a majority of people can't be bothered to look that shit up after a debate.", "Ohio here in a very liberal area. Huge lines the biggest lines, this year has the best lines. Seriously though I've never had a wait before and now the line was about 1/4 mile long ", "de nada guey", "We got cheated out of the ability to vote for Marijuana legalization. ", "I think it's dumb that it's illegal to smoke weed but I'm not going to be smoking a joint in front of a cop any time soon. Not in this state anyway.", "&gt; Donald Trump’s candidacy took off because a bunch of old white Democrats decided Black Lives Matters was just too uppity and the major Democrats weren’t doing enough to support cops who kill blacks. So they switched to Trump and held up “silent majority” signs.\n\nStill the Democrats' fault though huh? Nothing will move forward without accountability. Take the hit, you can't spin eveerything against the other side.", "Hate skeleton and aspiring Baba Yaga are the best descriptions I have yet to read about Ms Coulter..\n\nshe seems like a peach", "I heard another one recently where they interviewed a lady Trump supporter and she openly called for a violent Christian dictatorship as her reason for voting for Trump. Dead pan just \"I think everyone should be forced by law to follow my Christian values the supreme court is the only thing on my mind when voting, and it's to force my Christianity on everyone in society\". People are bonkers.", "I've just always thought that reddit is mostly liberal and anti-trump. ", "Not from the US so sorry for the dumb question. \n\nDo they close the line, when polling stations close? So that only people who got into the line before it closed can vote?", "Meanwhile Trump proposed [gun confiscation](http://www.vanityfair.com/news/2016/09/donald-trump-gun-rights-stop-frisk)", "Regardless of who wins Reddit, CNN, Twitter, etc have done permanent damage to their reputations.  Doesn't matter if you are republican or democrat, anyone can see that places like /r/politics and CNN are just propaganda machines.", "They do pretend to be a \"bastion of free speech\" though", "I voted no on it. Porn actors are adults they can make their own choices regarding their sexual health. It smacked too much of having underlying motives for me to feel comfortable with it.", "So you missed the part about him being a convicted felon (twice I think) and how he runs a scam where he sell ding dongs \"survival food\" by the ton? ", "Yeah I wasn't against McCain but when he chose Palin that whole ticket really jumped the shark.  ", "Nobody cares what Trump thinks. He doesn't get to invalidate tens of millions of votes because he thinks he should have won. We don't fucking want him. \n\nHoping for a particular landslide in the popular vote that will put his nonsense to rest. ", "It's funny because the GOP even acknowledged that they need more minority outreach after their loss in 2012.\n\n2012: We need to outreach more to women and minorities.\n\n2016: Grab them by the pussy! All Mexicans are thugs and rapists!\n\nIt's so tragic if it wasn't so hilarious. The Mexicans are saving us from this thug.", "It's relevant because Trump for some unknown insane reason claimed that Tom Brady called him and told him he voted for him", "The lines to vote are [astronomical right now in Washington.](https://wei.sos.wa.gov/franklin/PublishingImages/Connell%20Ballot%20Box%20photo.JPG) ", "Manhattan hates Trump. But he's known this his whole life.", "He's been saying things like this all election though. Trump's ascendancy really scared him.", "the circle of life", "That was my thought followed by \"why do we keep giving her any attention?\"  ", "Others said it better here but they will always fall back on cost as an excuse. Which is bullshit. That is a primary function of the state existing. It must do everything it can to allow representation of its citizens. The very nature of it means it has to be one of if not the primary things they account for in the budget.", "As a recent Black Mirror episode showed we really enjoy hating people. That's why this post is going straight to the top. \"Worst person in the world over here, come bully this person free from consequences because everyone else in the thread will agree with you!\"\n\nNot that I'm sticking up for Coulter, but I'm trying to answer your question. I think this is why we keep giving horrible people attention. We want them to continue being horrible so we can continue lashing out at them without feeling guilty. It's cathartic. ", "I voted blue in Williamson county.  My girlfriend registered over 300 people from our nearby apartment complexes just in time for the registration cutoff so I'm proud of her regardless of how those people vote.", "Sure she does.  She just knows none of the people who buy her books will think this through or read any media criticizing her", "This is not a story worthy of being in a politics subreddit. ", "I read this in his voice and it didn't seem out of character.", "\nhttps://www.youtube.com/watch?v=zwoGrDa5g2c", "I'm pretty sure that's why they were at the polling place...", "\"We're victims we're victims!!!\"\n\nDo they ever get tired of it?", "Same with r/The_Donald I commented on how there was a misquote and got banned. Tried messaging the admins... they blocked me ", "We hate him because he's successful for another team. If at the end of the season, he announced that he has decided to coach the Lions, I'd be head over heels for him - and that's how I know I don't actually hate him.", "Make sure to join in your home state's discussion thread!\n\n* **State Links:** [Alabama](https://www.reddit.com/r/politics/comments/5bri47/2016_election_day_state_megathread_alabama/) [Alaska](https://redd.it/5brhkd), [Arizona](https://www.reddit.com/r/politics/comments/5brigl/2016_election_day_state_megathread_arizona/), [Arkansas](https://www.reddit.com/r/politics/comments/5brims/2016_election_day_state_megathread_arkansas/), [California](https://www.reddit.com/r/politics/comments/5briy5/2016_election_day_state_megathread_california/), [Colorado](https://www.reddit.com/r/politics/comments/5brj2k/2016_election_day_state_megathread_colorado/), [Connecticut](https://www.reddit.com/r/politics/comments/5brkpa/2016_election_day_state_megathread_connecticut/), [Delaware](https://www.reddit.com/r/politics/comments/5brj7j/2016_election_day_state_megathread_delaware/), [Florida](https://www.reddit.com/r/politics/comments/5brjig/2016_election_day_state_megathread_florida/), [Georgia](https://www.reddit.com/r/politics/comments/5brjmn/2016_election_day_state_megathread_georgia/), [Hawaii](https://www.reddit.com/r/politics/comments/5brjw9/2016_election_day_state_megathread_hawaii/), [Idaho](https://www.reddit.com/r/politics/comments/5brjzv/2016_election_day_state_megathread_idaho/), [Illinois](https://www.reddit.com/r/politics/comments/5brk9s/2016_election_day_state_megathread_illinois/), [Indiana](https://www.reddit.com/r/politics/comments/5brkdy/2016_election_day_state_megathread_indiana/), [Iowa](https://www.reddit.com/r/politics/comments/5brkin/2016_election_day_state_megathread_iowa/), [Kansas](https://www.reddit.com/r/politics/comments/5brku2/2016_election_day_state_megathread_kansas/), [Kentucky](https://www.reddit.com/r/politics/comments/5brkxo/2016_election_day_state_megathread_kentucky/), [Louisiana](https://www.reddit.com/r/politics/comments/5brl1m/2016_election_day_state_megathread_louisiana/), [Maine](https://www.reddit.com/r/politics/comments/5brl4x/2016_election_day_state_megathread_maine/), [Maryland](https://www.reddit.com/r/politics/comments/5brl8q/2016_election_day_state_megathread_maryland/), [Massachusetts](https://www.reddit.com/r/politics/comments/5brlck/2016_election_day_state_megathread_massachusetts/), [Michigan](https://www.reddit.com/r/politics/comments/5brlfg/2016_election_day_state_megathread_michigan/), [Minnesota](https://www.reddit.com/r/politics/comments/5brlir/2016_election_day_state_megathread_minnesota/), [Mississippi](https://www.reddit.com/r/politics/comments/5brln8/2016_election_day_state_megathread_mississippi/), [Missouri](https://www.reddit.com/r/politics/comments/5brlqc/2016_election_day_state_megathread_missouri/), [Montana](https://www.reddit.com/r/politics/comments/5brlv8/2016_election_day_state_megathread_montana/), [Nebraska](https://www.reddit.com/r/politics/comments/5brlz4/2016_election_day_state_megathread_nebraska/), [Nevada](https://www.reddit.com/r/politics/comments/5brm2j/2016_election_day_state_megathread_nevada/), [New Hampshire](https://www.reddit.com/r/politics/comments/5brm69/2016_election_day_state_megathread_new_hampshire/), [New Jersey](https://www.reddit.com/r/politics/comments/5brmbt/2016_election_day_state_megathread_new_jersey/), [New Mexico](https://www.reddit.com/r/politics/comments/5brmg3/2016_election_day_state_megathread_new_mexico/), [New York](https://www.reddit.com/r/politics/comments/5brmjz/2016_election_day_state_megathread_new_york/), [North Carolina](https://www.reddit.com/r/politics/comments/5brmn1/2016_election_day_state_megathread_north_carolina/), [North Dakota](https://www.reddit.com/r/politics/comments/5brmry/2016_election_day_state_megathread_north_dakota/), [Ohio](https://www.reddit.com/r/politics/comments/5brmxi/2016_election_day_state_megathread_ohio/), [Oklahoma](https://www.reddit.com/r/politics/comments/5brn0s/2016_election_day_state_megathread_oklahoma/), [Oregon](https://www.reddit.com/r/politics/comments/5brn5a/2016_election_day_state_megathread_oregon/), [Pennsylvania](https://www.reddit.com/r/politics/comments/5brnbn/2016_election_day_state_megathread_pennsylvania/), [Rhode Island](https://www.reddit.com/r/politics/comments/5brngz/2016_election_day_state_megathread_rhode_island/), [South Carolina](https://www.reddit.com/r/politics/comments/5brnjd/2016_election_day_state_megathread_south_carolina/), [South Dakota](https://www.reddit.com/r/politics/comments/5brnn0/2016_election_day_state_megathread_south_dakota/), [Tennessee](https://www.reddit.com/r/politics/comments/5brnr8/2016_election_day_state_megathread_tennessee/), [Texas](https://www.reddit.com/r/politics/comments/5brnur/2016_election_day_state_megathread_texas/), [Utah](https://www.reddit.com/r/politics/comments/5brnyn/2016_election_day_state_megathread_utah/), [Vermont](https://www.reddit.com/r/politics/comments/5bro2i/2016_election_day_state_megathread_vermont/), [Virginia](https://www.reddit.com/r/politics/comments/5bro76/2016_election_day_state_megathread_virginia/), [Washington (state)](https://www.reddit.com/r/politics/comments/5broap/2016_election_day_state_megathread_state_of/), [Washington D.C.](https://www.reddit.com/r/politics/comments/5brogx/2016_election_day_state_megathread_washington_dc/), [West Virginia](https://www.reddit.com/r/politics/comments/5brojt/2016_election_day_state_megathread_west_virginia/), [Wisconsin](https://www.reddit.com/r/politics/comments/5broni/2016_election_day_state_megathread_wisconsin/), [Wyoming](https://www.reddit.com/r/politics/comments/5bros6/2016_election_day_state_megathread_wyoming/) and [U.S. Territories](https://www.reddit.com/r/politics/comments/5browb/2016_election_day_state_megathread_us_territories/).", "Close enough to say he told you so and close enough to say \"hey there was a chance\" \n\nNice Nate. ", "From his own [website](https://www.donaldjtrump.com/press-releases/donald-j.-trump-statement-on-preventing-muslim-immigration) : \"Donald J. Trump is calling for a total and complete shutdown of Muslims entering the United States\"", "Hey guys. I found Donald Trump!", "God damn people here are just the most bitter and cynical individuals in the world sometimes.", "Still seems a little hazy. One outlet confirmed but no one else believes it. For fuck's sake it's written exactly like Trump speaks.\n\nEDIT: [It does seem like the letter is legit.](http://sports.yahoo.com/news/bill-belichick-confirms-trump-letter-but-gisele-denies-tom-brady-support-160427161.html) The reason why it sounds like it's written by Trump is because the media doesn't have a copy of the actual letter, just a transcript of Trump reading it at a rally.", "&gt; I'm waiting for definitive proof of who Tom voted for before I cast my vote.\n\nPolls will be open again tomorrow morning for the people waiting to see how Brady voted.", "No they're saying \"Boo-nald\" ", "Vote 3 times in 6 years and you'll have the platform you want voted in BY YOU. Not just the old guard, the people you pick, with your vote!", "OK buddy. Whatever helps you feel better about your next Vice-President.", "\"We're on to 2020.\"", "Nah they are a staunch conservative but definitely anti-Trump media outlet, ... believing the Donald is the Milli Vanilli of conservatism.   Iirc, they think Trump would (1) reverse course quicker than a Cruz if faced with serious reelection trouble, (2) alienate non-whites, and (3) reverse free trade, .. which has been Republican gospel since the defeat of the Hoover admin at FDRs hands.", "Nonetheless the \"press\" owes the country an apology just as much for letting this clown for months spew shit, as they gave him a completely free ride to the nomination.", "TRUMP: Are you voting for me?\n\nMELANIA: I'm your wife.\n\nTRUMP: I need to check!\n\nhttp://i.imgur.com/MvmGvPT.jpg", "If he's catholic  he absolutely should be defrocked or disappeared to a monastery. \n\nThat's what happens to some in my diocese. The Bishop ain't taking no shit", "I think it's dumb that it is illegal to take a picture of your ballot. ", "Trump since its public record Brady hasnt voted.", "Is redstate going full progressive liberal today? ", "Your employer is required to give you 2 hrs to vote by law.", "Yeah I mean look at how censored /u/legalxz32 is.  Can't even write his opinions here on r/politics without it being blacked out or deleted by Big Brother.\n\nOh wait.\n\nJust because there are people that don't agree with your opinion doesn't mean that your opinion is being censored.  \n\nTrump isn't as popular as people think he is.\n\nHe is popular among a large percentage of Americans.  He might even win today. \n\nBut Reddit isn't just America.  \n\nA Canadian poll that came out today showed that if Canadians had to pick the US president, it would be 70% Clinton, 7% Trump.  A lot of the world is legitimately afraid of the idea of President Trump.  It breeds A LOT of uncertainty.  \n\nThere's a lot of people who are newly passionate about politics, which is great.  But don't buy into the Trump press saying that if he loses, it's rigged. \n\nThat's democracy, sir.  \n\nSometimes you're stuck with a politician you hate for 8 years.  Sometimes you vote for someone who you think will be great, and he kinda sucks.  \n\nAnd if you think picking a leader and a party will make all your problems go away, you've got some growing up to do.  ", "On behalf of the young men who I called friends who died of AIDS in the 80s fuck you.\n\nReagan refused to acknowledge that AIDS was a health crisis.  He did not deploy resources that could have prevent its spread and he refused to make statements that would have provided crucial understanding to how the disease spread.\n\nLook at how much people were shitting their pants when there was Ebola and SARS and Bird Flu and Swine Flu and all those other much less dangerous communicable diseases.  Now imagine Obama saying \"well, it only effects old people\" so we're not going to have Congress or the Department of Health address the issue.  Reagan failed his moral duty as a human being", "Another no vote here. One of the worst parts of this proposition is that it gives ANY citizen the right to sue a porn star and potentially leads to the publishing of private information about them.  \n\n[Here's a good argument from the chronicle](http://www.sfchronicle.com/opinion/editorials/article/A-condom-requirement-for-porn-actors-doesn-t-9198804.php)", "She's the new Westbro Church these days.", "yeah I don't think Trump has that kind of money"], "links": ["5bsmqm", "5bsmqm", "5bsmqm", "5bsmqm", "5bsl1l", "5bsl1l", "5bsmqm", "5bsmqm", "5bsmqm", "5bsrlh", "5bsmqm", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5brczx", "5bsmqm", "5bsl1l", "5bsl1l", "5bsmqm", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsj6h", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsmqm", "5bsmqm", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsmqm", "5bsl1l", "5bsl1l", "5bsmqm", "5bsl1l", "5bsl1l", "5bsmqm", "5bsl1l", "5briy5", "5bsl1l", "5bsl1l", "5bsl1l", "5bqv66", "5brnur", "5bsmqm", "5bsj6h", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5brlfg", "5bsl1l", "5bsl1l", "5bsl1l", "5bsrpv", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bqv66", "5brmjz", "5bsl1l", "5bsj6h", "5bsl1l", "5bsj6h", "5bsl1l", "5bsf5x", "5bsvss", "5bsvss", "5bsmqm", "5bsvss", "5bsmqm", "5bsl1l", "5bsmqm", "5bsvt0", "5bsmqm", "5bsp6u", "5bsmqm", "5bsrlh", "5brsd6", "5bsrlh", "5bspwu", "5bsvss", "5bspwu", "5bsqrw", "5brjig", "5bsrlh", "5bsl1l", "5bsl1l", "5bsl1l", "5bsxm8", "5bsl1l", "5bsl1l", "5bssoc", "5bsmqm", "5bsmqm", "5bspwu", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsl1l", "5bsxm8", "5bqv66", "5bsl1l", "5bqv66", "5bsl1l", "5bstnj", "5bsmqm", "5bsl1l", "5bsxno", "5brczx", "5bqsvt", "5bsl1l", "5bsp6u", "5bsxm8", "5bsl1l", "5brczx", "5bro76", "5brczx", "5bqw65", "5bspwu", "5bsl1l", "5bsl1l", "5bqq0d", "5bsmqm", "5bsrlh", "5bspwu", "5bspwu", "5bsl1l", "5bqv66", "5bsl1l", "5bsrlh", "5bsqrw", "5bsf5x", "5bsmqm", "5bssoc", "5bssoc", "5bsl1l", "5bsrpv", "5bqsvt", "5bsxno", "5bsmqm", "5bsl1l", "5bsl1l", "5bsrpv", "5bstnj", "5bsvs4", "5bssoc", "5bsj6h", "5bsqrw", "5bsl1l", "5bqv66", "5bqsvt", "5bspwu", "5bsl1l", "5bsl1l", "5bssoc", "5bsl1l", "5bsqrw", "5bsqrw", "5bsl1l", "5bspwu", "5bt2yj", "5bt2yj", "5bt2yj", "5bspwu", "5bt6wu", "5bt2yj", "5bsvt0", "5bt76r", "5bt76r", "5bspwu", "5bsmqm", "5bsmqm", "5bt6wu", "5bsvt0", "5bt6wu", "5bt6wu", "5bsmqm", "5bt76r", "5bt6wu", "5bsmqm", "5bsmqm", "5bsvss", "5bt2yj", "5bspwu", "5bt2yj", "5bsmqm", "5bsmqm", "5bt2yj", "5bt6pa", "5bsmqm", "5bsvss", "5bspwu", "5bt6wu", "5bt2yj", "5bsmqm", "5bsvss", "5bsmqm", "5bsvt0", "5bspwu", "5bspwu", "5bsvss", "5bt6pa", "5bt2yj", "5bsmqm", "5bsmqm", "5bsmqm", "5bsvt0", "5bsmqm", "5bspwu", "5bsmqm", "5bspwu", "5bsvt0", "5bt6wu", "5bsvss", "5bsmqm", "5brjig", "5bsmqm", "5bsvss", "5bsvt0", "5bsmqm", "5bsmqm", "5bsmqm", "5bsmqm", "5bsmqm", "5bt76r", "5bsmqm", "5bsmqm", "5bspwu", "5bt6pa", "5bsmqm", "5bt76r", "5bsmqm", "5bt2yj", "5bsf5x", "5bspwu", "5bt6wu", "5bt76r", "5bsmqm", "5bspwu", "5bsmqm", "5bspwu", "5bsvss", "5bsvt0", "5bsmqm", "5bspwu", "5bsmqm", "5bsmqm", "5bt6wu", "5bsvss", "5bspwu", "5brczx", "5brnbn", "5bspwu", "5btc89", "5btc89", "5bspwu", "5btbuo", "5bspwu", "5btc89", "5btc89", "5bspwu", "5btbto", "5bspwu", "5btl8o", "5bspwu", "5btc89", "5bspwu", "5btc89", "5btbto", "5btc89", "5btbto", "5btbuo", "5btc89", "5btl8o", "5btc89", "5btc89", "5bspwu", "5bt59a", "5bspwu", "5btbto", "5btdfr", "5btc89", "5bspwu", "5btbto", "5btbto", "5btc89", "5btc89", "5bspwu", "5btbto", "5bspwu", "5bspwu", "5bspwu", "5bsvt0", "5btbto", "5bspwu", "5bspwu", "5bspwu", "5bt2yj", "5bt2yj", "5btbto", "5btc89", "5bt59a", "5btc89", "5btbto", "5btdfr", "5btl8o", "5btbto", "5btc89", "5btbto", "5btbto", "5bt2yj", "5btbto", "5btbto", "5btc89", "5bsrpv", "5btc89", "5btbto", "5btbuo", "5btbto", "5btc89", "5btbto", "5bthz1", "5btdfr", "5btl8o", "5btbto", "5bt76r", "5btbto", "5bspwu", "5bspwu", "5btbto", "5btbto", "5btdfr", "5btbuo", "5bt2yj", "5btbto", "5bspwu", "5btbto", "5bsvt0", "5btbto", "5bspwu", "5btbto", "5btc89", "5btltd", "5bsmqm", "5btbto", "5btc89", "5btdfr", "5btbto", "5bt76r", "5bspwu", "5btoxu", "5btbuo", "5bspwu", "5btwg8", "5btc89", "5bspwu", "5btm54", "5btc89", "5btbuo", "5btc89", "5btc89", "5btoxu", "5btsqb", "5btwg8", "5btl8o", "5btc89", "5bspwu", "5bspwu", "5btpuw", "5btoxu", "5btc89", "5btm54", "5bspwu", "5btc89", "5btc89", "5btoxu", "5bspwu", "5bt6wu", "5bspwu", "5btc89", "5bspwu", "5btc89", "5btbuo", "5brnur", "5btc89", "5btl8o", "5bt2yj", "5btc89", "5bt59a", "5btc89", "5brmn1", "5btc89", "5bspwu", "5brjig", "5btwg8", "5btc89", "5btoxu", "5btm54", "5bspwu", "5btpuw", "5bspwu", "5bspwu", "5btsqb", "5btc89", "5btsqb", "5btsj0", "5btc89", "5btc89", "5btc89", "5btwg8", "5btpuw", "5btdfr", "5btoxu", "5btc89", "5bspwu", "5btsqb", "5bspwu", "5bt76r", "5bspwu", "5bt59a", "5btc89", "5bspwu", "5bspwu", "5btoxu", "5btbuo", "5brjig", "5btbuo", "5btc89", "5brk9s", "5bspwu", "5btc89", "5btc89", "5bt76r", "5bt59a", "5btl8o", "5bt76r", "5btwg8", "5bspwu", "5btbuo", "5btc89", "5bt59a", "5btdfr", "5bspwu", "5btl8o", "5bt59a", "5btc89", "5bu1u6", "5btc89", "5bt2yj", "5bu1u6", "5bspwu", "5bu1u6", "5btwg8", "5bucyh", "5bspwu", "5btbuo", "5bubgt", "5btwg8", "5btc89", "5btm54", "5btbuo", "5bu11i", "5btbuo", "5bucyh", "5bu1u6", "5btbuo", "5btwg8", "5btoxu", "5bu11i", "5btbuo", "5bubgt", "5btc89", "5bspwu", "5btl8o", "5bucko", "5btdfr", "5bu11i", "5btm54", "5btc89", "5bu11i", "5bucyh", "5bu1u6", "5bu11i", "5btbuo", "5btc89", "5btsqb", "5btdfr", "5brlfg", "5bu7wg", "5bu1u6", "5bt2yj", "5bu1u6", "5bspwu", "5btm54", "5bu11i", "5bspwu", "5bspwu", "5briy5", "5bucko", "5bt59a", "5bu001", "5btdfr", "5btc89", "5broap", "5bu5w5", "5btpuw", "5btbto", "5btwg8", "5btsqb", "5btwg8", "5brnur", "5bt2yj", "5btc89", "5btc89", "5btwg8", "5bu5w5", "5bucko", "5bspwu", "5btc89", "5budzo", "5bu3j6", "5bt76r", "5btoxu", "5bu3j6", "5btc89", "5btc89", "5bu5w5", "5btsqb", "5btbuo", "5btc89", "5bu1u6", "5btl8o", "5btbto", "5bt6wu", "5bu7wg", "5btsj0", "5bu1u6", "5btsqb", "5bspwu", "5bsp6u", "5briy5", "5btwg8", "5btltd"]}