{"comments": ["Don't boo vote!\n\nBut I guess if you're already at the ballot box, you can do both. \n\nEdit: Seems like booing at a ballot box is voter intimidation.  Obviously, don't break any laws and vote responsibly. Also, enjoy a bit of humor when browsing reddit comments. ", "There was a lady on a megaphone outside Trump Tower the other day shouting \"On November 8th, elect Donald Trump and make America great again!\"\n\nLoud outbursts of laughter, every time. New Yorkers were the first people to think he was a joke.", "I heard one guy said to Obama \"I voted can I boo now?\"", "As someone who lived in NYC for awhile Trump was always a complete joke to NYers. Total complete fucking joke. The fact that anyone takes him even remotely serious on any level blows the mind of most people who know him.", "\"Funny\" thing is a huge number of black people have all of their ancestors (going back generations) born here. These are the same people that have their voting rights being suppressed in places like NC.", "The circle of Hell reserved for millionaire narcissists is poverty and obscurity. Starting tomorrow ignore Trump and boycott his properties. \n\n**Edit**: Someone should write an app that, given the name/address of a hotel, golf course, etc, warns about any Trump ownership/licensing. If we're going to blacklist Trump, now's the time to automate it.", "If you have voted continue booing", "Fuck Donald Trump", "This is not \"New York Liberal\" hate he got. He has fucked over so many contractors and bilked the city out of so much money (while being pretend \"bankrupt\") that many people in NYC have either been directly ripped off by The Donald or know someone who has.", "Funny how the people who know him best NYers, hate him the most. Good job, GOP.", "As a fellow New Yorker I concur. This is like the town drunk running for president. ", "They were saying Boo-onald.  You know how New Yorkers have weird accents.", "&gt; After a federal court order on the first day of early voting the state Board of Elections issued new paperwork to allow voters who tried to register through the DMV to use provisional ballots. Riggs said that should help protect the ballots — but not if voters are turned away or not offered the new forms.\n\nIf this happens to you, get a provisional ballot!", "Voted this morning in a swing state. Changed my vote from Jill Stein to Hillary Clinton at the last minute because I cannot stand Trump.\n\nIf I didn't live in a swing state I still would've voted Green. I has a sad but I know I made the right choice.\n\nI gotta make sure Our Revolution continues on Fight On. \n\nEdit - What? Gold? I'm usually a lurker and that made my day better. Thank you random stranger!", "I voted today against our shitstain of a county sheriff.  ", "Trump spin: WHY FOREIGNERS ALLOWED TO VOTE?!?!?", "I'm an educated left leaning voter, and it makes me sad to see disparaging remarks about other groups during this election.  There is nothing wrong with being working class or not having an education.  \n\nEdit:. Yes, I realize OP was not disparaging the working class, he was saying Trump dislikes them.  Not need to point it out again.  I was adding to the discussion.", "Does anyone really think to themselves \"I'm not sure who to vote for what deep insights does Tom Brady offer regarding this election?\"", "Unfortunately those predictions are only good until they fail.", "[When you trust your wife to vote for you but not really.](https://twitter.com/Gabbienain/status/796031055715246080)", "Getting booed at your polling place probably doesn't feel very good for Trump. \n\nI urge people to not be ugly on here today especially if Clinton wins. There are still millions of people in the US that constantly feel burned by the economy and politics in 2016. If Hillary wins, that frustration and those problems do not disappear. ", "I lived in NYC for years and was born there. We all thought he was an asshat well before his lol ", "Anyone else can't focus on anything but the election today? It's seriously stressing me out", "The irony of all this is that from now on, Trump will only be welcome among the people he hates -- the uneducated lower classes.  ", "And the voting public will remember the Republicans who did go all in for Trump.", "GOP rigging away I see", "Don't fuck up Marijuana for us California.", "She's advocated for a poll tax she thinks women shouldn't be allowed to vote, and she is clearly a racist. Why does anyone listen to this person?", "I became a citizen in July and I voted today for the first time.", "Arpaio?", "Yup.  He desperately needs to retain office so the county can keep footing the tab for is millions in legal bills.", "Good for you.  I don't live in AZ but I very much want to see this racist piece of shit lose.  It will send a hell of a message if the two most visible anti-Latino racists in the country lose their elections.  ", "no one will see this im gay", "Yes there are plenty of black Americans whose entire family has been born in America since the 1700s. So, we can include them, the Native Americans, some people of Spanish and French descent and sons of British subjects during the revolution. \n\nEveryone else should be denied the vote. ", "*Until you act with superiority and violence to push a racist candidate into office seeking to undo decades of progress based on the idea that educated people all have it wrong and are just out to get you.", "THIS.  I lived in NYC for some time and this is absolutely correct.  The real village idiot of Manhattan.", "I took a mental health day.\n\nIm home eating pizza and drinking beer right now.", "I voted for Trump\n\nOn a Buzzfeed poll for Best Human Potato Cosplay", "New phone who dis?", "Not only do I agree with this I'd add a call-to-action: Stop following news sources that cover her.  Anybody can go on a bigoted, ignorant rant.  It's not fucking news.  We need to deprive these people of their money if the message is ever going to get across.", "&gt; everyone will see this I'm a karma whore\n\nFTFY", "This is the best headline of the election.\n\nEdit: so yes I was wrong about the outcome. The fact that presidential candidate got booed at the polls hasn't changed. ", "Because they want those things too? ", "Hello from Australia! Surprise steal from Jill Stein! From around 1% of the vote to a whopping 76%!\n\nTruly amazing performance.", "Sounds like the Republicans are up to their same old dirty tricks in North Carolina. ", "There are so many points to consider.  \n\n1.  Historically Bill has been pretty liberal and has supported liberal causes.  \n\n2.  Bill would never risk doing something controversial politically mid-season especially if it might cause trouble in his locker room(I'm guessing most NFL players aren't pro trump).  \n\n3.  Bill has never been this loquacious unless he's talking football theory.  He literally resigned from the Jets HC position on a napkin writing \"I resign as HC of the Jets.\"\n\n4.  And of course the farcical use of vocabulary.", "Thank you for being a responsible adult. A Trump win is an outright disaster and would set us back decades.", "Prediction: In 2 years at least 20% of the people who voted for Trump will deny it.", "Hillary is a corrupt wall-street shill and a hawk, but with a massive advantage in the headspace and required background knowledge of being president.\n\nDonald Trump is a bigoted authoritarian who lacks competence in any single area except marketing.\n\nThird parties aren't going to win. Stein is also a bit incompetent and her rhetoric betrays a lack of deep understanding on some issues.\n\nJohnson is a libertarian, which has no fundamental mechanism for dealing with Climate Change or other problems and is not a serious political philosophy. Johnson himself is unprepared for the basic rigors of electioneering and presidenting as well, as evidenced by his serious gaffes.\n\nClinton is the best choice. I don't like her and I intend to protest her tonight at the TYT rallies and moving forward I hope she's primaried in 2020. But as far as the realistic direction the country is going to move in, Clinton will hold things together the best of our choices.\n", "Turns out Trump was right about something. The election is rigged in his favor and he's still going to lose.", "You can't even say he's one of NYC's famous eccentrics because other people like Crazy Eddie and Dr. Zizmor are endearing to some. At best Trump stands among the inconviences of NYC along with rats, bedbugs, and the MTA.", "I would sleep in a cardboard box before I would stay at one of his properties ", "he probably pronounces Guam like \"Joo-aam\"", "I 100% agree. Just saying Trump has historically had disdain for the lower classes (which you can tell by his platform).  He's using them as political cannon fodder but would never want to actually live among them.", "I'm just impressed he remembered he had to vote for himself", "[Relevant xkcd](https://xkcd.com/1122/)", "As a Green in a heavily blue state: totally understandable.\n\nBernie: \"First defeat Trump then we continue our work.\"", "yes Donald.  you have wasted the time of every American.", "Good point", "Of course it is going to be ugly on here.  You can't have a candidate spout off violent rhetoric for a year have a whole sub dedicated to spamming r/all with childish nonsense, be inundated with crazy lies and conspiracy theories, and expect this place to be respectable when the votes come in.\n\nI just hope people don't get violent.", "Shout out to the New York Board of Elections for creating a needlessly complicated ballot. Three of the four candidates were listed multiple times on the ballot. Clinton under Democrat Women's Rights and Working Families. Trump under Republican and Conservative. And Johnson under Independent and Libertarian. So there were multiple bubbles for the same candidate, but you are only allowed to fill in one single bubble. \n\nIn the 15 minutes I was there, at least a dozen people filled in multiple bubbles for the same candidate and had their ballots rejected. They were able to start the process again, but why the hell would they make it so unnecessarily complicated??", "I'd love someone (maybe the [spurious correlations] (http://tylervigen.com/spurious-correlations) website) to list all the random things that happen to correlate with election wins.", "Can someone who lives in Australia tell us who won the election?", "He isn't going to be able to eat at a restaurant drink at a bar, or go to a show in this city ever again. Get out Donald, you aren't welcome any more.", "But she's copying Michelle Obama's ballot.", "[Trump campaign has just released their projected electoral map to win](http://i.imgur.com/cPVp4nZ.jpg)", "I'm hoping that after a very gracious victory speech Hillary gives Trump a personal call and says: “Your words will disappear. Your house will disappear. Your name will disappear. All memory of you will disappear.”", "But you have to understand what it feels like on an individual level.  If the economy isn't going well for *you* or *your town* then you are going to be pretty upset about it.", "There's actually a nonpartisan organization this year sending pizza people can report where long lines are: \n\nhttp://www.avclub.com/article/lets-keep-democracy-alive-sending-pizza-voters-stu-245528\nhttps://polls.pizza/\n", "those people are delusional. the economy has been so good in the past few years. Wages are finally increasing and unemployment is decreasing. These people that are complaining about the economy don't even know what an economy is. i don't feel sorry for them. ", "If it's a legitimate peek the polls have a way of shutting that kind of thing down.", "When you can't win fair you have to start stealing the elections. This is  what the GOP's America looks like. Call everyone else corrupt to hide the fact that you're the most corrupt.", "The people that have known him the longest (apart from his family) seem to despise him. Why that wasn't a red flag to more people is beyond me.", "I voted for Clinton in MI. God i hope it stays blue...", "\"But wait everywhere I go everyone loves me!  These must be the riggers!\"", "And Nevada too!", "And my axe!", "And Massachusetts!", "As a Nasty Woman™ I thank you on behalf of all of us! ", "I keep reading reports of massive turnout in Philly and Pittsburgh especially among black folk. Good news for Hillary, hopefully. :)", "Yea but sometimes its tough to know who they pick.  I decided to play it safe and just write in the Belichick and Brady ticket.  4 more years!", "And Arizona! ", "I don't think it was a waste of time.  It totally exposed what happens when you neglect your public educational system for 30 years.", "Is peeking at someone elses ballot not illegal?", "He's Trump and he can you know just get away with things like that. ", "oh no a fat feckless religious extremist that runs for president just to hock books to his mindless fellow religious extremists while pretending to be godly might be mad?!?!  I'm sure the non-religious class of republicans are shaking in their boots at the thought of Fuckabee being upset with them!", "I was gonna vote for Clinton but this  Facebook post that had a meme with frogs got me questioning my life.", "I think its more of an expression. Also im in law school right kow so i dont really have vacation days. I just skipped tax and evidence class.", "My theory is that she doesn't give 2 fucks about politics but loves that money she gets from the far right. She knows how to say something outrageous every once and a while so they will keep buying her books", "I love how this post is basically calling anyone who votes for Trump a racist ...and it has a sticky right at the top asking for polite civil behavior. It even says \"don't be a jerk\" in the sticky. What happened to you, r/politics?", "Just voted in Vermont.  Pretty hard to not vote pretty close to a straight-D ticket this year.", "/r/politics isn't pro-Hillary it is anti-Trump. The two just happen to be largely fungible at this point in the election.", "I will never understand how he got through this whole campaign without being asked whether he voted for her for Senator in 2000 or 2006.", "Man she kicked his ass, too.\n\nCLINTON, Hillary/KAINE, Tim Democrat 22,972  \nTRUMP, Donald/PENCE, Mike Republican 7,747  \nSOLTYSK, Emidio/WALKER, Angela Socialist USA 1,352", "The GOP's biggest enemy... people being able to vote.", "What a dumb move by Trump. \n\n&gt; Under election law anyone who is in the queue to vote must be able to cast their ballot, even if that happens after the scheduled close.\n\n\nEdit: [Nevada judge denies Trump request.](http://edition.cnn.com/2016/11/08/politics/nevada-voting-lawsuit-donald-trump/)", "Lol I got a slight chuckle at the idea that even Melania is probably voting Hillary.", "Don't forget \"People being able to vote\"'s sidekick: \"Congressional districts drawn in a fair and reasonable manner.\"", "Regarding minorities voting one Redditor on here made a great comment a few months ago (this was regarding the North Carolina racist voter suppression debacle):  \n\n&gt;Probably every single instance of racism and discrimination going back to slavery was \"it's not really racism, it's just that black people tend to &lt;insert prejudiced assumption&gt;.\" That literally is how racism works. This is a textbook Jim Crow law.\n", "Why doesn't he want people to vote?\n", "Yes. Yes you may.", "looks like both Donald trump and his son  broke NY election law today. ", "r/the_meltdown begins...", "Remember when Cruz or Mittens or whoever it was slammed Democrats for their \"New York values\"? And their base ate it up and then nominated the shittiest New Yorker of the last 100 years? That was funny. Not funny \"ha-ha\", but funny, like, \"we're all dying\" kind of funny.", "&gt;Jack Donaghy: The television audience doesn’t want your elitist East Coast, alternative, intellectual, left-wing...\n\n&gt;Liz Lemon: Jack, just say Jewish, this is taking forever.", "\"I'll have that bitch deported if she votes for Hillary..\"", "In the same vein there's a panhandler in Times Square who's been camped out in the same spot for a few months with a sign that says \"Give me a dollar or I'm voting for Trump.\" It gets a few chuckles from passersby, myself included.", "While I wish trump wasn't a thing I really don't think it was cool to boo him during the vote. It reeks of voter intimidation.\n\nOutside of the polling station, when he is on stage/going to stage, all that jazz for sure. While he is voting and all that, he should be left alone just like everyone else. After that, boo him and let him know how much of a horrible person he is.\n\nAdmittedly, he did encourage this sort of BS to all of his voters. Amazing how that sort of shit comes full circle, but it's shit all the same and we shouldn't be doing it.", "And the third member of the rogue's gallery democracy.", "Here we go with the lawyers. \n\nHope this election doesn't require a 9-member Supreme Court.", "I also voted for recreational Marijuana and a $15.00 minimum wage.\n\nI got to vote for Hillary and against John McCain.  How much fun can one guy have in a polling booth?", "woman haters tend to love the orange man on Reddit and everywhere else. Period.", "But if we're being honest \"New York values\" was probably code for \"Jewish\". ", "She's with Hillary.", "You are insulting the drunk in my neighborhood that sweeps the sidewalk every day.\n\nHe is sweeping in the morning drunk out of his mind when I pass him on the way home.", "If any party or candidate has a problem with more people having the opportunity to vote then they're not in favor of an honest and fair election result end of story", "&gt;As a reminder this subreddit is for civil discussion.\n\n\"If you vote for Trump, you're a racist. Yes, you're a racist.\"", "I mean it's a secret ballot. We don't know who he voted for.", "I absolutely love how obvious it was that /u/Plisskens_snake was taking about Arpaio. Nothing says you're doing a great job like random people recognizing you by the word \"shitstain.\"", "I dunno until Ja Rule tells me who to vote for I'm undecided. ", "He cheated off his wife: http://imgur.com/a/1DQsc ", "Look I don't support trump. I didn't vote for him, and I don't think anyone else should either.\n\nBut this is horse shit logic. We don't have infinite candidates to choose from. In my state, we have three, and only two of them have a shot at winning.\n\nAll three of them have done and said things I disagree with quite vehemently. I would never do or say those things.\n\nDoes that mean I can't vote for any of them, without assuming all of their various sins? Am I forced to choose between not voting and betraying the values I hold dear?\n\nOf course not. I vote in the way that will most likely reach my goals. If I were a conservative, who wasn't a racist, that might still mean voting for trump.", "I discovered that sub yesterday.  Its fucking awesome.  There are some good posts on there today from 4chan of people who either didn't know they had to register in order to vote or giving up because the lines were too long.  ", "Its the year 2016; we can detect gravitational waves but registering to vote is as much of a clusterfuck as ever.\n\n\nOk maybe not *as ever* but still.", "No no, no...people love him. He pays people a lot of money to love him...biggly.", "Nah he's just making sure she's voting the way he told her to.", "The only reason I voted for Obama is because of the anti-intellectualism Sarah Palin represented.\n\nI don't get to vote on issues I get to vote on the insanity index.", "Least surprising results ever.", "I've both worked as a poll worker and managed polls and this is incorrect. At precisely 12 hours after the polls were opened, a poll worker gets in line at the back and is the cut off. He/she advises people trying to get into line that they will not be allowed to vote because the polls are closed, and the people in front of them were in line at the time of closing.\n\nUnless they have proof that this poll worker at the back of line let people in the line in front of them after the poll closed, any lawsuit is dead in the water I would think.\n\nedit - It was pointed out to me that this was an 'early voting day' where the 12 hour window probably doesn't apply. On election day -proper, it matters because you don't want, say, one precinct enjoying special status by getting extra time to vote... but... this is *early*, is already extra time, so I don't really see how it even matters if the poll did stay open longer, unless it was in contradiction to state/federal law on early voting procedures.\n\nIt was also pointed out to me that state/federal law on the matter might not exist, or might be vague, or might even allow for extended hours or whatever. I haven't looked at it so I don't know.", "He gets tremendous boos. The best boos", "Mexicans too. I have a friend whose family has been in San Antonio since the 1700s and they're still called \"illegal immigrants\" by some people.\n\nImmigrants have been part of the fabric of this nation for a long, long time. Much longer than people like Ann Coulter seem to realize. I used to live in San Francisco and there are many Chinese families there who have been in the area since the 1850s to early 1900s.", "I don't want to think what would happen to her if she did vote for Clinton and he did see it. ", "It says something that he would look over. He is not even confident that his wife will vote for him.", "You'd have to hate women to vote for a guy who bragged about sexually assaulting them. ", "*brown people.\n\nThe Republican chair in Nevada all but admitted it. \"The polls were allowed to stay open late so a certain group could vote.\"\n\nHe then went on to imply that allowing \"certain groups\" to vote is a hindrance to freedom. I can't even parse out the logic here. The polls stay open later to let more people vote and somehow we're less free? Somehow the election is more unfair?", ":)\n\nProbably the first time he is out of one of his safe places since his campaign began.", "[From 538](http://fivethirtyeight.com/live-blog/2016-election-results-coverage/?ex_cid=538twitter):\n\n&gt;Here’s a story that’s just breaking: It appears that the Trump campaign is filing a lawsuit against the Clark County Registrar’s Office for keeping polls open yesterday for two additional hours beyond their close time (this is being reported by CNN’s Jim Sciutto). It’s slightly confounding that they are doing so since voters are allowed to cast ballots past the official poll closing time, as long as they were in line before the end official voting hours. As a Clark County spokesman said a couple of days ago, ““If there’s a line when closing time comes, we just keep processing voters until there’s no more line.”\n\nJesus Christ.", "&gt; Anybody can go on a bigoted ignorant rant.\n\nHell, some of them can even become a nominee for a major political party.", "He's a city slicker who just grifted a bunch of simple yokels. \n  \nThe majority who've never been to NYC and don't realize what a serious hustle is going on. It's palpable. It's everywhere and NYC folks are simply on another level. And those red states are easily manipulated by someone like him. ", "Still won't show his tax returns.", "yeah on every brietbart comment section", "You won the voting quadfecta.", "The Donald the. ", "his name is riggs? hahah\n\n", "A New Yorker who falls for a schtick as weak as Trump's would be broke or dead or held in a basement to be exploited for a daily dose of smack.", "[His son did the same.](https://pbs.twimg.com/media/CwwrqFZXAAA5FZg.jpg)", "We can help her by ignoring everything she says. If she doesn't get the attention she will go away.", "This election has been the most head-spinning thing i've ever experienced. I'm only 24 but jesus fucking christ", "He voted for Johnson.", "Pretty sad that he's insecure about whether his own wife would vote for him.", "Perhaps he was just cheating off of her answers.", "Especially when hiding behind the technological cloak of anonymity.", "That's not even illegal lol. What a baffoon", "All varieties of bigots (misogynists racists, homophobes, transphobes, xenophobes, etc.) worship the Orange Buffoon.", "I wish that they would give Trump his twitter back... I want to [watch him meltdown in real time](https://media.giphy.com/media/L4caiF7GTkgJa/200.gif).", "They covered their bases.  This is the last paragraph.\n\n&gt; Donald Trump’s candidacy took off because a bunch of old white Democrats decided Black Lives Matters was just too uppity and the major Democrats weren’t doing enough to support cops who kill blacks. So they switched to Trump and held up “silent majority” signs.\n\n[insert eyeroll here]", "The article isn't saying that *you're* racist if you vote for Trump. It's saying that you're *supporting* racism if you do. \n\nVoting for a political candidate is always a compromise you might agree with them on most of the issues but the stuff you disagree on is minor enough to let it slide.\n\nBy voting for Trump you're saying 'racism and intolerance isn't a deal breaker for me because the other stuff is more important'. ", "It was Cruz.  And after he said that and after Trump dissed his wife, and after Trump dissed his father, Cruz got on his knees and serviced him.", "It's rogue rouge is a type of make up. ", "Gotta stop those riggers!", "That sounds like the final year of my marriage. ", "Should be \"Trump begins life of daily booing.\"", "He's bullying her. ", "[So this popped up on Twitter](http://i.imgur.com/xANWLOm.jpg)", "\"Now that she said that she's a 6 at best, which is just barely assaultable.\"", "I don't have a problem with ignorance. But willful ignorance can fuck right off. ", "We might lose Arpaio.  McCain is a lock.  Some of the offices only had republican candidates.  Fucking Arizona.  One or two had a Republican and a green party candidate.  So I voted green on those.", "That's not a joke I'd wager. I won't be the least bit surprised if they're divorced next year.", "He never gave a shit about undocumented workers until he figured out there was political mileage to be made from it.  It's not even his job.", "Thank you voice of reason. This logic is awful. Using it anyone in here who voted Obama 08 is against gay marriage.", "Well I grew up in the Midwest, and now I live in the South. I have experience with people all over. I honestly think most of his supporters don't believe him, but they are pissed off people who want other people to feel their pain. Voting for Trump is like a suicide pact. \"We're gonna show them by voting in a doomsday machine for president\" It's cheap, sad, and really pathetic. It is also incredibly immature. I think it is cultural problem as oppose to an intellectual one. Trump voters feel like they are victims and they want someone to pay for their pain. Voting for Trump is like their version of going on a shooting spree. They are too much of a pussy to actually hurt someone else, so they vote for Trump who will do it for them.", "\"how can we blame all of this on the democrats?\"", "Glenn Beck expressed sympathy for Black Lives Matter and said Obama made him a better man.", "Too late Jill. Way too late. You could have said this when it was asked of you a million times including in the AMA and you ignored it or used double-speak. Now you want to refute it? Too late.", "Openly racist. Runs chain gangs like it was the 1800s. Humiliates prisoners. Keeps people busted for pot in a max security prison where people routinely die. Has an open air section of the prison where people live in tents which is totally unsecured so he has a squad/swat team that he has run assaults/raids on his prisoners. Kept people outside in cages in Arizona sun til they died. \n\nActually, if you took the laws of a Scandinavian nation and applied them to Arpaio I can't think of anything he's done that isn't illegal. He'd likely be up to a few thousand year prison sentence by now.\n\nBut in the US, Sheriffs are picked by popular vote. Because that makes fucking sense.\n\nEven so, he's been charged with a few dozen things and the state has to pay the fees because he's a state official. Hopefully he gets voted out and face prison time in his own prison and gets shivved in the first week.", "He really needs to invest in better lawyers. This is fucking stupid even by trump standards. ", "Joo-aam... \nJew-aam... \nConfirmed Jews rigging election. ", "It says a lot if they want less people to vote.\n\nLike...how can you pretend to be the voice of the people (looking at you donald) and then not want them to be heard? \n\nContradictory bullshit.", "You New Yorkers are a pleasant bunch.", "I got to vote for Bernie in the primary and against Donald Trump in the general. That feels pretty good tbh.", "we're going to shoot for nominating that Naked Cowboy dude in 2020 that cool with you guys?", "Let's also remember that while McCain has really bad policies and is in general probably not a positive at this point in time. He's definitely not the worst we could do.", "If Trump loses and tries to take it to the Supreme Court I doubt he'd even have Justice Thomas' vote, let alone the rest of the conservative wing.\n\nThere's no chance in hell Kennedy and Roberts would permanently destroy the legacy of the Supreme Court to install a sore loser as President when he has no case.  Especially since I highly doubt either of them would even have any interest in having Trump as President.  Alito is definitely smart enough to ignore Trump as well.  Thomas is the only one who'd even consider it for a second, and even then, he's not THAT crazy.\n\n------\n\nThe situation where you'd have to actually worry about the Supreme Court is if Trump actually WON through shady means (i.e. if all his supporters actually went through with all the voter intimidation plans and shut down tons of polling places in Democratic areas) and Clinton then takes it to the Court.  In that case, I'd actually be worried about SCOTUS. \n\nBut if Clinton wins, I have absolutely no doubt he'd get laughed out of the Court.\n\n", "I can't imagine why someone who was running for office would call a whole ethnicity rapists and drug dealers and then not want them to participate in their legally protected right to choose a president. \n\nHmm. We might never crack this mystery. ", "You cannot sue anyone for rightfully allowing legal citizens to vote. Donald Trump will lose this lawsuit like he will lose the election. ", "Aren't there election reps that stand at the official \"end of the line\" to not allow anyone else to join said line after the closing time?", "The lawsuit is actually regarding people who may have got in line after the scheduled closing time not people who were already in line.", "People. At the end of today Californians could be getting:\n\n* the first female president\n* another respected female senator\n* increased legislative transparency\n* legal recreational marijuana\n* a cheaper, fairer criminal justice system with no death penalty", "[Toby Ziegler knows it]\n(https://www.youtube.com/watch?v=KbgoAchOhEk)", "Yeah but because there would be no way to tell who was in line, the argument would be to throw out all of the votes from early voting in that location.", "She copied Michelle Obama's ballot", "Thanks Obama.", "There are some funny tweets...\n\n&gt;when you're afraid Melania is accidentally gonna copy Michelle's vote too", "[Eric Trump](http://i.imgur.com/VEityA5.jpg) was ballot peeking too. What is with these assholes? Not really hiding it at all. \n\nIt's especially interesting because they're probably going to lose the state of New York by 15% of the votes under the best case scenario for them. The end result will have nothing to do with the votes that they are so obsessively watching. ", "A very similar way to point this out was a different quote I read.\n\n\"Imagine if Obama had 5 kids with 3 different women and went around talking about grabbing women by the p---y.\"\n\n\nIt would be totally reflective of his race and negative mark on Black American lifestyles. But with Trump race is   totally removed.\n\nThis is how institutional racism works.", "I wonder if this is his way to hold the election hostage.  Saying that they can't legally declare Hillary the winner because one state is in a legal battle over their results.", "Pssst Melania.  What's the answer to the first question?", "Imagine if BLM protesters took control of a government facility were armed to the teeth, and fired at officers. Like rightwing extremists recently did in Oregon.", "Finally the proper way to use that phrase", "Highjacking your comment to link to the live feed from the courtroom Trump's lawyers seem desperate and the Judge is in disbelief of their claims.\n\nhttp://www.lasvegasnow.com/breaking-live-news\n\n**UPDATE**: It's over for Team Trump and Judge denied to open case against Hispanic voters. Below are tweets from people who followed it live.\n\nFrom a twitter user who followed this from the start:\n____\n\n[Trump campaign already filing knowingly bogus lawsuits to set up its grievance-based next life.](https://twitter.com/DukeStJournal/status/796048448860684288)\n\n\n[Trump campaign, it seems, is using NV lawsuit to set a precedent under which it could seek to invalidate any results it does not like.](https://twitter.com/DukeStJournal/status/796067425926127616)\n\n___\n\n[For months, Trump has said any vote that doesn't go his way is rigged. Are we shocked that his lawyers have now put that on paper?](https://twitter.com/DukeStJournal/status/796067649096740864)\n___\n\n[Based no doubt on affidavits of the conspiracy-fueled Trump volunteers acting as \"poll watchers.\" Good luck with that.](https://twitter.com/DukeStJournal/status/796069650622808068)\n\n___\n\n[Trump camp quickly backing itself into the corner of admitting they don't want Hispanic voters casting ballots](https://twitter.com/DukeStJournal/status/796071489745387520)\n___\n\n[Judge is stuttering in disbelief at Trump lawyer. \"What. Are. You. Asking. For.\" Not going great for the plaintiffs.](https://twitter.com/DukeStJournal/status/796071995268071424)\n___\n\n[Oh my God. Trump lawyer can't even say what happened. Says lawsuit is so they can find out whether or not line was left open.](https://twitter.com/DukeStJournal/status/796072728969232384)\n___\n\n\n[Judge: \"Aren't we missing like seven steps here?\" \nOn the plus side for Trump's lawyer, his suit is very shiny.](https://twitter.com/DukeStJournal/status/796073757605564416)\n\n___\n\n[Judge: \"It'd disturbing to think that people might be harassed.\"\nTrump lawyer: \"No one will be harassed.\"\nJudge: \"Do ya watch Twitter?!\"](https://twitter.com/DukeStJournal/status/796075902870372353)\n\n____\n\n[Now, Trump people are trying to get all the information about poll workers in nevada to harass them. \"It's disturbing to me,'' says Judge.](https://twitter.com/kurteichenwald/status/796075564763332612)\n\n___\n\n[\"Why should I give u information about ppl doing their civic duty so you can harass them?'' \\(close quote.\\) Judge in Nevada to Trump lawyers.\n](https://twitter.com/kurteichenwald/status/796075827855245313)\n\n___\n\n[\"I am not going to expose people doing their civic duty to help people vote..to public attention, ridicule and harassment.\" Judge in Nevada.](https://twitter.com/kurteichenwald/status/796076304617664512)\n\n\n___\n\n[This is so transparent.\"You've got no cause of action\": Judge in Trump \"stop state from counting hispanics' votes\" case.](https://twitter.com/kurteichenwald/status/796076782038503424)\n\n___\n\n\n[The Trump lawyer in the Nevada case is starting to sound  panicked.](https://twitter.com/kurteichenwald/status/796077120917241856)\n\n____\n\n\n[\"I'm not doing it.\" Angry judge in Nevada's \"Trump wants hispanic votes thrown out\" case.](https://twitter.com/kurteichenwald/status/796077691921432585)\n\n___\n\n[Judge said 3 times she is not going to give Trump what he wans, and Trump lawyers won't stop arguing in \"don't count hispanic votes\" case.](https://twitter.com/kurteichenwald/status/796078176384466944)\n\n____\n\n[Judge denies Trump motion in case of \"Trump v. Hispanic People Who Voted.\"](https://twitter.com/kurteichenwald/status/796078477401321474)\n\n___\n\n[DENIED: So basically Trump lawyers didn't talk to SOS, didn't do their due diligence, don't, basically, have a clue.](https://twitter.com/RalstonReports/status/796077977108770816)\n\n___\n\n[Judge summed it up: \"Right now, you've got no cause of action.\"\nTo paraphrase George Bluth: \"Trump has the worst fucking attorneys.\"](https://twitter.com/DukeStJournal/status/796078558154199041)\n\n____\n\n[They brought out best lawyers in the world for \"Bush v. Gore.\" In \"Trump v. Hispanics Who Voted,\" they...ummm...went a different direction.](https://twitter.com/kurteichenwald/status/796079979536715780)\n\n____\n[What I just saw unfold in Nevada with \"Trump v. Hispanics Who Voted\" was some of the most remarkable minutes in a court I've ever witnessed.](https://twitter.com/kurteichenwald/status/796081425208512512)\n_____\n\n\n[CASE CLOSED!](http://i.giphy.com/hTJeAKYMEj504.gif) \n\n\n\n", "\"I'M A TRUMP therefore I'M IN CHARGE!\"\n\nThis is the mindset they were raised with, and it brings an uncontrollable urge to try to control other people. It's what happens when you grow up surrounded by people who are paid to say 'yes' to everything you say and do.", "Some more hard hitting political news from r/politics. ", "Probably more like \"what the hell is this other stuff after picking president\". ", "He'd rip the hair out of her head and rape her while screaming obscenities at her? \n\nOh wait that was a different wife...\n\nI wonder how long she'll last before filing for divorce if he loses?", "We're going to need some aloe over here!", "It would only matter when that states electoral votes are the determining factor in the election.", "The fact that he had just enough doubt to check tells me a couple things. The first is they've been in fights lately. I suspect she knows the truth that he's a womanizer and a bully. Two she probably told him she's voting for Hillary in one of their fights. Trump has severe undiagnosed [Narcissistic Personality Disorder](https://en.wikipedia.org/wiki/Narcissistic_personality_disorder), which affects the ones closest to him worse. Everything about Melania gives me the sense she has been bullied by him, or worse.\n\nHe's such a fiend, it's disgusting.\n\nEDIT: There's some serious butthurt below about my armchair diagnosis.\n\n[Source 1](http://www.theatlantic.com/magazine/archive/2016/06/the-mind-of-donald-trump/480771/)\n\n[Source 2](http://www.huffingtonpost.com/daniel-wagner/trump-and-narcissistic-pe_b_11289332.html)\n\n[Source 3](https://www.washingtonpost.com/news/the-fix/wp/2016/07/22/is-donald-trump-a-textbook-narcissist/)\n\n[Source 4](http://www.independent.co.uk/news/world/americas/us-elections/petition-trump-narcissist-medical-mental-state-psychology-a7177681.html)\n\n[Source 5: NYT and particularly salient, calling Trump a \"threat to democracy\"](http://www.nytimes.com/2016/08/16/health/analyzing-donald-trump-psychology.html)\n\n**Trump's a fucking raging narcissist, period.**\n\nI'm going to go one step further. Look up the definition of the word [demagogue](https://en.wikipedia.org/wiki/Demagogue) and combine that with his raging narcissism.", "I mean who knew that Donald Trump was right all along. The system is rigged", "Maybe.  But I like to imagine it played out something like this.\n\n*Trump fills in circle for Trump/Pence on ballot*\n\n*Trump looks at Melania's ballot like a kid in elementary school cheating on an exam*\n\n*Trump sees Melania has filled in the bubble for Clinton / Kaine*\n\n*Trump scratches out vote for Trump fills in bubble for Clinton / Kaine*\n\n*Trump leaves polling place feeling smug, thinking he got the right answer by cheating off the smart kid*", "&gt; During arguments over whether elections officials should turn over personal information regarding poll workers who worked at the contesting polling places Judge Sturman said that “it’s disturbing to me” that poling workers could be harassed because of this lawsuit, if their information is revealed to trolls on Twitter.\n\nI'm confused.  What possible reason could Trump's attorney want polling worker's personal information for?!", "he spent $66 million which is 66% true, which is probably the most truthful he's been about anything.", "For everyone complaining that he only just now released all this:\n\nThese are recap tweets of things he has been reporting on for months.", "Laws are for little people.", "\"People often forget that the first victims of the Nazis were the Germans themselves.\"\n\nI guarantee you life with The Donald is every bit as bad as we imagine it to be. ", "&gt; I didn't even ask my wife who she voted for.\n\nI don't think I've ever had to *ask* my wife's opinion on anything.", "It is legal to purposefully peak over the divider like that?  Seems like it would be flirting with voter intimidation even if it is your wife.  Or rather, especially if it is your wife.  ", "*\"Wait... Are we actually voting for the old man or what?\"*", "I enjoyed that vera much. ", "LMAO\n\nBad Hombres 1 - Trump 0", "My boyfriend's pro-trump parents were so confused when I told them Manhattan hates Trump \"but but he created so many jobs?!!!!\" Haha", "Ding ding ding.  I think this picture is hilarious but he has no earthy idea about the amendments.  My wife and I actually took crib sheets so we could remember everything, and she left her judge paper at home and I had to hand it to her.  \n\nSo, yeah, it's funny, but it may actually be worse than checking to see if she voted for him.  He was checking because he doesn't know the first thing about how our government works.", "To be fair Trump has also gifted those of us in the Atlantic City area with many opportunities to develop a strong distaste for the man.", "It's very satisfying to see people like that not get their way ", "[Here](https://storify.com/clair3/kurt-eichenwald-s-tweets-listing-his-findings-from) are all 126 tweets as this site only lists the first 50 or so. ", "I never lived in New York but I have had a TV for 30 years and have always recognized him as an asshat.", "He was booed on his way in to the polling station getting out of the car etc. There's a cellphone video of it floating around out there. No film inside the actual polling place as I'm pretty sure that's highly illegal. It was kinda petty, sure, but I think it was fair game\n\nedit: here you go:\n\nhttps://www.youtube.com/watch?v=Z7cG0E-Du_c\n", "As long as republicans control the downticket and off year elections this is going to continue. Democrats have to vote straight ticket every election until this crop of republicans is gone and republican culture is crushed.  ", "Honestly in any other developed nation with a semblance of liberal democracy this would be considered the most disgustingly offensive move possible. Democratic values seem to be positioned very low on the totem pole of political values in the US.... certainly well below partisanship. I get that this type of posturing is being executed by strategists, but there has to be a certain climate of opinion that tolerates anti-democratic attitudes. I mean, in any other jurisdiction a strategic move of this nature would never be considered because of the obvious fallout.... unless of course the fallout isn't a concern because Trump's strategists have already acknowledge defeat and are positioning themselves to challenge it post-election....fingers crossed.", "If your biggest argument for losing is because too many people voted you're hurting your own case for winning.", "God damn did 30 Rock and Parks and Rec miss a good election season to land a few good jokes.", "\"DENIED: So basically Trump lawyers didn't talk to SOS didn't do their due diligence, don't, basically, have a clue.\"\n\nhttps://twitter.com/RalstonReports/status/796077977108770816", "&gt; The polls are supposed to cose at seven. This was kept open until 10. Yeah you feel free right now?\n\nActually yes.  \n\nI feel a lot more free when everyone who is eligible to vote can vote. ", "I think they were confused. They knew to fill in the bubble saying \"Trump\" but then there were other questions and bubbles with long words, it became overwhelming and they needed help.", "\"I'm not racist I just dislike black culture!\"\n\nThose people are awful.", "Apparently he doesn't trust his own wife enough to believe that she wasn't.", "It's probably because [he's illiterate](https://www.youtube.com/watch?v=7LFkN7QGp2c) and isn't sure which boxes to put the X in.\n\n", "&gt; So now the tactic is to deny them the right to vote if the lines are too long - the lines being too long because of the Republicans.\n\nTalking of lines; a little reminder why this is a ridiculous suit:\n\n&gt;  But as Clark County spokesman Dan Kulin told the AP allowing everyone in line when the polls close to vote is the law.\n\n&gt; \"If there's a line when closing time comes, we just keep processing voters until there's no more line,\" he said. \"We're flexible because we want people to vote.\"\n\n&gt; Many (if not all — I couldn't find any that didn't follow this rule) states have laws on the books requiring every person in line when the polls close to be able to vote. If this happens to you, stay in line.\n\n&gt; \"It's one of the most basic principles of electoral democracy,\" Ned Foley, director of Ohio State University's Election Law @ Moritz, wrote for Medium. \"If you go to the polls when they are open, and you are a registered and qualified voter, then as long as you wait in line, you are entitled to cast your ballot even if the line is so long that you must wait until after the scheduled time for the polls to close.\"\n\n&gt; If you are in line to vote when your polling place closes, and anyone tries to keep you from voting, contact the Department of Justice Civil Rights Department by phone (1-800-253-3931), email (voting.section@usdoj.gov), or submit a complaint on their website. \n\n&gt;--\n\n&gt;(source - [This is what happens if you're still in line to vote when the polls close](http://uk.businessinsider.com/what-happens-still-in-line-to-vote-when-polls-close-2016-11?r=US&amp;IR=T))\n\n--\n", "http://i.imgur.com/FCbFbga.jpg \n\nTaken today in NYC :)", "Hold up. \n\nIt's palpable in tourist traps in Times Square, waiting on line for talk shows, or bustling street corners where people are trying to sell you shit.\n\nMost of NYC is people trying to survive just like everywhere else. The real neighborhoods, where the people who actually run the city live, are filled with kindness, community, and values. \n\nKnow why a New Yorker may give you shit? Because you stop in the middle of the goddamn sidewalk during lunch hour, or complain on Yelp about bodega cats, or move into the city for a year and think you're suddenly a New Yorker. No. You're not. \n\nSpeaking as a native, this city is many things. Yes, it can be ugly. But mostly, it's a beautiful place filled with people who want to get by, have a good time, and who will drop what they're doing on a dime to give you directions, or get you medical attention. Truthfully, it's the transplants who are beyond rude: spoiled brats whose mommies and daddies are paying for their NYC adventure, who cut in line, take up multiple seats on the subway, make snide comments under their breath as they pass you by, and are just shitty people.\n\nDon't lump us all in with them. NYC loves you. Have a nice day. Now get the fuck outta my face.", "That rat doesn't use a fork and knife to eat pizza because it's more of a New Yorker than Donald Trump", "Brilliant. He'll just sue every state that doesn't vote for him.", "Insecure men support vindictive fragile man child. Who coulda seen it coming?!", "Well to be fair, some people are saying that Trump doesn't actually know how to read.", "6 months. ", "Or yet another case of projection.", "You married someone you can't share your politics with?", "I swear absolutely all of his claims are projection. At this point I'm starting to wonder if *his* dad was involved in the Kennedy assassination. ", "I forget which political pundit said \"Donald Trump is what poor people think a rich person looks like.\"", "Checks out this guy is married.", "Very smart people have said that. I'm not sure if it's true but they're saying it.", "They love him because he's their ideal model of how they wish they could be around women: an ass who treats women like shit. Most of the red-pill folks are obese virgins so I'm told. ", "I can just imagine Trump's rage at not being able to respond to each tweet. ", "Next month he'll say he never ran for President...\n\n...after he's done saying the election was rigged and stolen from him.", "&gt;Judge denies Trump motion in case of \"Trump v. Hispanic People Who Voted.\"\n[Kurt Eichenwald](https://twitter.com/kurteichenwald/status/796078477401321474)\n\nClearly the heritage of these citizens represents an absolute conflict and their votes should not be counted", "Justice Ruth Bader Ginsburg had an appropriate comment:  \"It's like abandoning your umbrella in a rainstorm because you're not getting wet.\"", "Is that factoring in all the money he's funneled back to himself and his family through the campaign? ", "I've posted this before but it's my favorite story of Biden. \n\nSeveral years ago I was a contractor running a dining facility warehouse in Iraq. Biden stopped by victory base camp where I worked. He eventually made a stop at my dfac and they came through the back entrance. Secret service told us to not make any sudden movements toward him. Let him come to you. So I'm standing there drinking a coffee and Biden walks by. I say \"what's up Joe?\" And he says \"how's it going, bud?\" And walks over to me and extends his hand. I very slowly extend my hand and he goes \"uhh\" and I told him that they said no sudden movements and he let's out one of those laughs where you throw your head back. Shakes my hand, pats me on the shoulder and while still laughing says \"nice to meet you. Have a good one, son\" and walks off. ", "I really don't understand these people.\n\nI guess maybe it explains the divorce rate.", "Remember when Clinton got booed by Latinos? Oh /r/politics probably never covered that gem lol", "We don't have a functioning Supreme Court to get involved ATM", "He is such an insecure wiener.", "Which just makes it all the more appalling.  There's not even the faintest evidence that any law or procedure was violated but Trump is still suing because \"certain communities\" got their votes counted.  ", "They're not really allowed to vote. They have no electorates. It's just a courtesy pat on the head \"good for you\"", "It's even more satisfying to see them get nowhere. If they are so coddled and obnoxious then they really should not have made it this far in life. It's a goddamn shame that the way can be paved for people who speak and act as they do.", "For something this basic and clear-cut I would be surprised if the Supreme Court split 4-4.", "The lawyer is being absurd.", "Now lets be fair the idiotic sexually assaulting fascist piece of shit racist PROBABLY knows how to read.\n\nHe just despises any intellectual exercise and has no ability to focus, so he hates doing it.", "Yes!  That's the best way to describe it! I've lived my whole like in NYC (and I'm on the older side) and Trump has always been such a joke here.  It's so crazy that a billionaire, unscrupulous real estate baron, who was born with a silver spoon in his mouth, can suddenly be seen by the rest of America as a champion for the working class.  This guy would sell his own daughter to make a buck (and I wouldn't be surprised if he hasn't tried).  I was lucky enough to go to some bougie private schools as a kid, and even amongst the wealthy class he is seen as a tacky, narcissistic joke, who almost lost all of his dad's money.  How do you become bankrupt owning property in NYC through the 90s?", "I am a black small business owner yet here I am being called racist for having a different opinion. ", "We are pleasant people but we're also highly skeptical of a con.\n\nIt's why the fat Midwestern tourists are the ones who are getting scammed into paying for a photo with Elmo in Times Square.\n\nBecause no New Yorker would put up with that bullshit.\n\nWe also wouldn't take a photo with Elmo in the first place, but that's beside the point.", "Well she *is* an illegal immigrant, after all. \n\nAdditionally, did anyone else see her face when they pulled up and Trump got booed. Gritting her teeth and (I think, it's hard to tell with the botox) scowling. I reckon he had some choice words for her on the trip there.", "Many Americans are praying for a devastating Tweetstorm at 3 am when his phone is finally returned to his tiny hands. ", "I think it's also illegal.\n\nI'm glad no one was watching me the three times I voted today.\n\n**EDIT** Could I get my flair updated to have 3 checkboxes?", "I want to believe in both cases it's just a \"You done can we go?\" gesture, but otherwise the visual says so much: a) I don't trust my wife, b) I don't have the control over my wife to do the things I (as the man) should have control over, c) my wife may not trust me (or my Dad) enough to vote our way.", "Is the education thing for real? I know Melania made up a degree but didn't expect Trump to make up 2 from a school he loves to talk about.", "Roger Stone was part of Trump's campaign! ", "Strange; Republicans from Nevada to Pennsylvania are trying to suppress the vote as hard as possible. It's almost as if they know the country disagrees with them and the only way they can win a general anymore is to try to make it so people can't vote...weeeeeeird!", "It WAS talked about at length. A lot.\n\nTrump does 500 scandalous things a month. His vote percentage should be 3%.", "Jake Tapper asked this to Kellyane Conwoman she replied:\n\nThis goes back to their democrat nominee living above the law and getting special treatment. Blah... bla...", "Make sure to join in your home state's discussion thread!\n\n* **State Links:** [Alabama](https://www.reddit.com/r/politics/comments/5bri47/2016_election_day_state_megathread_alabama/) [Alaska](https://redd.it/5brhkd), [Arizona](https://www.reddit.com/r/politics/comments/5brigl/2016_election_day_state_megathread_arizona/), [Arkansas](https://www.reddit.com/r/politics/comments/5brims/2016_election_day_state_megathread_arkansas/), [California](https://www.reddit.com/r/politics/comments/5briy5/2016_election_day_state_megathread_california/), [Colorado](https://www.reddit.com/r/politics/comments/5brj2k/2016_election_day_state_megathread_colorado/), [Connecticut](https://www.reddit.com/r/politics/comments/5brkpa/2016_election_day_state_megathread_connecticut/), [Delaware](https://www.reddit.com/r/politics/comments/5brj7j/2016_election_day_state_megathread_delaware/), [Florida](https://www.reddit.com/r/politics/comments/5brjig/2016_election_day_state_megathread_florida/), [Georgia](https://www.reddit.com/r/politics/comments/5brjmn/2016_election_day_state_megathread_georgia/), [Hawaii](https://www.reddit.com/r/politics/comments/5brjw9/2016_election_day_state_megathread_hawaii/), [Idaho](https://www.reddit.com/r/politics/comments/5brjzv/2016_election_day_state_megathread_idaho/), [Illinois](https://www.reddit.com/r/politics/comments/5brk9s/2016_election_day_state_megathread_illinois/), [Indiana](https://www.reddit.com/r/politics/comments/5brkdy/2016_election_day_state_megathread_indiana/), [Iowa](https://www.reddit.com/r/politics/comments/5brkin/2016_election_day_state_megathread_iowa/), [Kansas](https://www.reddit.com/r/politics/comments/5brku2/2016_election_day_state_megathread_kansas/), [Kentucky](https://www.reddit.com/r/politics/comments/5brkxo/2016_election_day_state_megathread_kentucky/), [Louisiana](https://www.reddit.com/r/politics/comments/5brl1m/2016_election_day_state_megathread_louisiana/), [Maine](https://www.reddit.com/r/politics/comments/5brl4x/2016_election_day_state_megathread_maine/), [Maryland](https://www.reddit.com/r/politics/comments/5brl8q/2016_election_day_state_megathread_maryland/), [Massachusetts](https://www.reddit.com/r/politics/comments/5brlck/2016_election_day_state_megathread_massachusetts/), [Michigan](https://www.reddit.com/r/politics/comments/5brlfg/2016_election_day_state_megathread_michigan/), [Minnesota](https://www.reddit.com/r/politics/comments/5brlir/2016_election_day_state_megathread_minnesota/), [Mississippi](https://www.reddit.com/r/politics/comments/5brln8/2016_election_day_state_megathread_mississippi/), [Missouri](https://www.reddit.com/r/politics/comments/5brlqc/2016_election_day_state_megathread_missouri/), [Montana](https://www.reddit.com/r/politics/comments/5brlv8/2016_election_day_state_megathread_montana/), [Nebraska](https://www.reddit.com/r/politics/comments/5brlz4/2016_election_day_state_megathread_nebraska/), [Nevada](https://www.reddit.com/r/politics/comments/5brm2j/2016_election_day_state_megathread_nevada/), [New Hampshire](https://www.reddit.com/r/politics/comments/5brm69/2016_election_day_state_megathread_new_hampshire/), [New Jersey](https://www.reddit.com/r/politics/comments/5brmbt/2016_election_day_state_megathread_new_jersey/), [New Mexico](https://www.reddit.com/r/politics/comments/5brmg3/2016_election_day_state_megathread_new_mexico/), [New York](https://www.reddit.com/r/politics/comments/5brmjz/2016_election_day_state_megathread_new_york/), [North Carolina](https://www.reddit.com/r/politics/comments/5brmn1/2016_election_day_state_megathread_north_carolina/), [North Dakota](https://www.reddit.com/r/politics/comments/5brmry/2016_election_day_state_megathread_north_dakota/), [Ohio](https://www.reddit.com/r/politics/comments/5brmxi/2016_election_day_state_megathread_ohio/), [Oklahoma](https://www.reddit.com/r/politics/comments/5brn0s/2016_election_day_state_megathread_oklahoma/), [Oregon](https://www.reddit.com/r/politics/comments/5brn5a/2016_election_day_state_megathread_oregon/), [Pennsylvania](https://www.reddit.com/r/politics/comments/5brnbn/2016_election_day_state_megathread_pennsylvania/), [Rhode Island](https://www.reddit.com/r/politics/comments/5brngz/2016_election_day_state_megathread_rhode_island/), [South Carolina](https://www.reddit.com/r/politics/comments/5brnjd/2016_election_day_state_megathread_south_carolina/), [South Dakota](https://www.reddit.com/r/politics/comments/5brnn0/2016_election_day_state_megathread_south_dakota/), [Tennessee](https://www.reddit.com/r/politics/comments/5brnr8/2016_election_day_state_megathread_tennessee/), [Texas](https://www.reddit.com/r/politics/comments/5brnur/2016_election_day_state_megathread_texas/), [Utah](https://www.reddit.com/r/politics/comments/5brnyn/2016_election_day_state_megathread_utah/), [Vermont](https://www.reddit.com/r/politics/comments/5bro2i/2016_election_day_state_megathread_vermont/), [Virginia](https://www.reddit.com/r/politics/comments/5bro76/2016_election_day_state_megathread_virginia/), [Washington (state)](https://www.reddit.com/r/politics/comments/5broap/2016_election_day_state_megathread_state_of/), [Washington D.C.](https://www.reddit.com/r/politics/comments/5brogx/2016_election_day_state_megathread_washington_dc/), [West Virginia](https://www.reddit.com/r/politics/comments/5brojt/2016_election_day_state_megathread_west_virginia/), [Wisconsin](https://www.reddit.com/r/politics/comments/5broni/2016_election_day_state_megathread_wisconsin/), [Wyoming](https://www.reddit.com/r/politics/comments/5bros6/2016_election_day_state_megathread_wyoming/) and [U.S. Territories](https://www.reddit.com/r/politics/comments/5browb/2016_election_day_state_megathread_us_territories/).", "But remember according to John Roberts, systemic racism is dead and states with long histories of placing impediments in the way of minority voters shouldn't be held to any strict standards.", "BREAKING:  People who hate women don't want a woman President", "He hid when booed. Does that mean we wait till the 28th to vote?", "No boo. No boo. You're the boo.", "I voted. As a Republican it blows my mind why any sane person would vote for Trump. Donald Trump is not a Republican. I know what I'll get with HRC, Bill, W, Obama, HRC, they're all political animals. I understand we want a saviour, someone to break up the insanity in DC, but Trump is not that person. So I voted 4 more years of the status quo, maybe next time...", "Yes you can!", "MA voter here; if I'm stuck with Donald Trump and no legal pot I'm gonna have a bad time", "Only took us 8 years. ", "Holy shit: both George W. and Laura Bush voted for Clinton:\n\nhttps://twitter.com/DavidKristoph/status/796083002707214337", "[Video of the NV judge smacking Trump's lawyer judicially in the face](https://twitter.com/Deadspin/status/796076676480434176)", "As much fun as it is to speculate the video seems to show that look was in passing after they had finished and were leaving.", "we did it reddit\n", "So what time do you think Pence will give Trump's concession speech?", "I voted like you all told me too. Instead of Good Boy Points I'll take karma and gold. \n\nEDIT: YOU NORMIES PROMISED ME 20 GOLD IF I VOTED HILLARY REEEEEEEEEEEE", "That's exactly why that vote is supposed to be secret. She has the right to vote for Hillary if she wants to without worrying that her husband is going to harass her for it.", "I watched the livestream. The judge felt Trump's lawyers wanted to make the names of the poll workers who allowed voters to stand on line after 9PM a matter of public record. \n\nShe felt this would leave the poll workers open to abuse. \n\n**Edit: I found a clip\nhttps://twitter.com/Deadspin/status/796076676480434176/video/1", "White voter here. I voted in about 3 total minutes. Its bullshit that people have to wait huge amounts of time. Make more fucking voting locations.", "For people who can't get to the polls until later today make sure that you pass along to those around you that they don't have to go home after official closing time if they haven't voted yet. If you're in line by then you get to vote! Also ignore all polling data today until after you have voted! Some people might even try to tell you a certain candidate has already won to try to get you to go home. Ignore them and cast your vote! ", "Proudly voted for Clinton Kamala Harris, Michael Eggman, legal weed, getting rid of the death penalty, and no on requiring condoms for porn, among many other things today", "To copy an earlier comment of mine:\n\n&gt; When the Black Panthers took weapons to the California State Capitol the response of then-governor Reagan was to say that there was \"no reason why on the street today a citizen should be carrying loaded weapons\" and that guns were a \"ridiculous way to solve problems that have to be solved among people of good will.\" He then signed legislation against carrying weapons in public.", "TX voter here; if I'm stuck with Donald Trump and revitalized rednecks I'm gonna have a bad time. ", "...And it's been [thrown out](http://www.rawstory.com/2016/11/incredulous-nevada-judge-slaps-down-trumps-voter-fraud-suit-what-are-you-asking-for/).", "Ladies and gentlemen the system works.", "&gt;you still somehow think you’re entitled to an order in your favor. Why? - Judge Gloria Sturman\n\nWell this case is going very well ", "In other news Hillary Clinton was also booed at her polling station.", "Another reason I'm hopeful that Trump will fare worse than expected in red states tonight.\n\nRed State Wives are sick of their husband's political shit. When alone in the voting booth they can do whatever they want. I'm trusting they will. ", "Well let's be real here.  Laura Bush probably voted for every Democratic presidential candidate other than, maybe, her husband.  \n\nI'm glad that George W. did the right thing.  It's frustrating when I see some leftists thinking that it reflects poorly on Clinton that non-crazy Republicans prefer her to Trump,  when it's just a sign that they're not crazy.", "For all the bad hombres and nasty women out there I voted", "If Hillary takes Nevada it's almost guaranteed that she wins the election. The same goes for Florida but it's more likely that she'll take Nevada.", "Nothing shouts \"insecure man\" more than these red pill alt-right douches.", "That was fast!", "After a journalist said that Trump supporters sent him picture of his child in a gas chamber; I appreciate the judge's viewpoint.", "Voting will continue until booing improves", "Fuck Donald Trump Again", "Looking forward to the Trump campaign's response that a woman cannot objectively make a decision about this case since he's running against a woman.", "A bunch of people came to my college campus (PA) to register voters. Dozens if not hundreds, of people signed up with them, and have been turned away for not being in the system. If you want to talk about voter suppression, this is exhibit A", "KENTUCKY GOES RED FOR THE FIRST TIME IN 4 YEARS. LANDSLIDE INCOMING!!!! #MAGA!!!!!!!!!!!!!!", "That was fucking cringeworthy to watch.\n\nI'm glad the judge was obviously not buying what Trump's lawyer was selling. She's like the only person in this entire year-long election who seemed to stand up to the constant bullying and incessant whining of the Trump campaign. The Trump campaign should not be taken as seriously as they are. ", "&gt;Judge summed it up: \"Right now you've got no cause of action.\" To paraphrase George Bluth: \"Trump has the worst fucking attorneys.\"\n\nThat happens when you don't pay your lawyers and have to work with whatever idiot is left that actually trust you will pay them. ", "I cant believe its this close. Trump has ruined presidential politics. Republicans running next term will not have anywhere close to the accountability for their actions in the past.", "LOL seriously 3 people booing on a cell phone video from 30 feet away. Front page.", "I'm dreading when Indiana and Kentucky close at 6:00pm and /r/The_Deplorable pretends red states getting called for Trump immediately is a sign of things to come", "'member when [Bush got booed at his inaugural parade](https://www.youtube.com/watch?v=dnSWfaQmboI)? His limo got egged and IIRC he had to drive whereas other presidents traditionally walk.\n\nWhatever happens today we're going to get some historic imagery in January.", "Lmao why is this upvoted? This has nothing to do with political discussion.", "Yup. Half-mexican here I wouldn't be able to vote under these rules because my **german** grandparents came here after WWII.\n\nMy mexican family, on the other hand... they didn't cross the border, the border crossed them.", "You can tell she's had enough of his shit.", "Vote you fucking cuties", "Specifically to harass them when Trump inevitably loses.  ", "Yes but Ohio is the only swing state that Trump has a decent lead in. ", "Careful. You'll get banned...", "This is so important and something that people tend to overlook.\n\nObama is a representative of African Americans, but Trump doesn't get branded as the representative of white men.", "Trump is a republican that lives in a heavy democrat area. \n\nHillary would get booed of she lived in Alabama.", "Double checking to see that Melania isn't voting for Hillary Donnie? \n\nAlso, [like father, like son?](http://imgur.com/a/k4SVf).", "Nevada Judge just ruled against Trump's lawyers who said that polling stations were open past their closing time.\n\nEDIT: Judge also denied releasing the poll workers name.\n\nEDIT 2: [Source.](https://www.revealnews.org/blog/nevada-judge-tosses-trump-campaign-early-voter-lawsuit/)", "I threw up in the car on the way home from voting this morning (not because of who I voted for I'm adjusting to a new medication). My cousin thinks this is hilarious and has been sending me the \"I Vo(mi)ted\" memes all morning. ", "Because it's just going to drive the industry out of CA there is a demand for condomless films and the actors are extremely highly tested all the time, and the bill (if passed) would allow the suing of everyone involved in the making of adult films (even the actors!).", "Anything that puts Trump in a bad light will get upvoted here. The comments that follow will support said things often without reading the article and/or with complete hypocrisy. That's how things go on /r/politics", "As a lawyer watching this was just so cringey. That guy was so out of his depths. It is hard to know whether he was making those frivolous legal arguments because 1) he is an idiot; 2) it is his job and he has specific instructions.\n\nDon't be too hard on him personally, it is probably 2.", "When you think about it that's a pretty good investment for a dollar...", "&gt; \"I submit to you that if you're in the club and by the club I mean the establishment, if you are among the few elites in Washington and New York that actually, for lack of a better term, run the country, you're going to hang together with other club members,\" he said.\n\nAnother equally plausible interpretation is that Bush knows, more or less, what is required to be president, and does not believe Trump possesses those qualities. ", "From [Kurt Eichenwald (Newsweek)'s Twitter](https://twitter.com/kurteichenwald) :\n\n&gt;  Source: \"If you asked Don he'd call me his best friend.\"  \n&gt;\n&gt;  Me: \"What would you call him?\"  \n&gt;\n&gt; Source: \"A clinical sociopath.\"  \n&gt;\n&gt; Source to me: \"What you don't understand about Don is that he's mentally ill.\"  \n&gt;\n&gt; Source: \"Don believes everything he says. He can't tell what's true or false.\"  \n&gt;\n&gt; Source: \"This 'close family' thing is a pose. He was the worst father. He was particularly abusive to Don Jr., physically and mentally\"  \n&gt;\n&gt; Source: \"Don almost ruined my life. We met late and he told me he did it because I didn't give him enough public credit for my success.\"  \n&gt;\n&gt; Source: \"I've known him and his family for a long time. Trump is really a bad, bad guy.\"  \n&gt;\n&gt; Source: \"This whole campaign is a con. There's a reason he flipped on abortion. He'll say whatever he needs to say to win.\"  \n&gt;\n&gt; Source: \"I played in a charity golf event. Trump's team lost, but after he took the scorecard, he changed it so they won. Everybody knew\"  \n&gt;\n&gt; Diffrent source: \"Its ridiculous how much Donald cheats at golf. It's like he's incapable of admitting he lost. I dont play him anymore.\"  \n&gt;\n&gt; Source: \"A lot of members of the family believe Don tricked his (then demented) dad into rewriting the will to cut his brother out.\"  \n&gt;\n&gt; Me: \"Trump says at rallies he never settles cases, but he has a lot.\"\n&gt;\n&gt; Source: \"Well, in his mind, he means it in a broader sense.\"  \n&gt;\n&gt; Source (close to Trump.): \"Don makes himself out to be this business genius. If not for the family money, he'd be living on the street.\"  \n&gt;\n&gt; Source: \"He told an elderly couple he was 'trying out' some of antiques they sold. Then he refused to return them or pay for them. He told them it was more valuable 4 the antiques to be seen a Mar-a-Lago then 4 him 2 pay for them.\"  \n&gt;\n&gt; Source: \"The casinos ran well til Trump took over management. (after death of executives.) It was utter chaos. He's a horrible person.\"  \n&gt;\n&gt; Source: \"I have never had someone lie to me right to my face more than Donald Trump. He is incapable of telling the truth.\"  \n&gt;\n&gt; Bottom line: In 6 months, I have never found a real Trump friend or anyone who isn't paid by him who has anything nice to say about him.\n\nYou know his kids are afraid to say anything because his father would cut them out of his Will without a second thought.", "I've said it Many times before.\n\nThe election is a shit show because Trump and his campaign are a shit show.  \n\nThe election is a circus because HE is a goddamn circus.\n\nThe election is nasty because HE is disgusting.  ", "No fuck no fuck. You're the fuck.", "Here we are \"in suspense.\" ", "dude of course he doesn't. women are fuck dolls to him. She's an accessory. In a few years, when she finally divorces him, he'll just get another hot girl. \n\nI only hope that when she, and trump's two daughters, manage to get away from his grasp when he dies of a heart attack eventually they write a tell-all book or something and rip his shit wide open. I may not be some kind of clinical body language interpreter, but I can *tell* that her, Ivanka, and Tiffany are under his thumb and have little to no choice with this and I hope one day they're free enough to speak about it. People shit on Melania a lot, but she's not Eva Braun, she's a fucking hostage. ", "This is such bullshit are there going to be any consequences for wasting the court's time and trying to curtail democracy?", "Don't minorities tend to live in urban areas? And don't urban areas tend to have the most crowded polling stations?\n\nI live in NYC. I voted in Queens and it took about 15 minutes to vote (I went at 6:15 am). My coworker voted in East Village in Manhattan and it took him 1.5 hours to vote this morning (he went at 6:05 am).\n\nUrban areas -&gt; long lines at polling stations. Minorities mostly live in urban areas -&gt; minorities mostly have longer wait times to vote", "Do y'all think this election cycle would have been as nasty had Trump never ran to begin with? I see a lot of people saying it has brought out the worst in people. But I think it was *he* that brought out the worst in us. I can't see Jeb! vs Hillary being bad at all. ", "All it takes is a vague familiarity with the speech patterns of used car salesmen to know he's a lying turd.", "California checking in. Voted for the Shillary legal weed, getting rid of the Def Penalty, and banging yer mom.", "I always respected and admired Laura Bush as First Lady. She is known to be pro choice and was pro gay marriage long while back. I can't imagine how awful it had to be for her stomaching the anti-gay marriage rhetoric in Electiom '04. \n\nLaura Bush is definitely a Democratic voting independent and I think she broke ranks mainly for her hubby's elections. ", "I live in North Carolina. My friend who lives in a predominately African American neighborhood had her polling place moved 5 miles. 4 years ago she waited 15 minutes. This year it was 2 hours. I'm worried Republican shenanigans with the polling places may win the election for them. ", "Such a nasty woman", "Nah I bet she's in it till the end. He's already 70 and the prenup probably doesn't give her much if they get divorced. I assume she gets more when he dies. ", "Despite the fact the majority of their young men serve in the US military. Yes you can serve, no you can't vote. ", "Trump *loves* using lawyers to bully people. It's pretty much the main thing he does when someone disagrees with him.", "Right? This comment was a very long way down but when I read the title, this is what I thought. Obviously both candidates have people who dislike them, so it's not surprising if either get booed. Pretty slow news day so far, is it reddit?", "Nervous Canadian here hoping that you all show Trump the true meaning of humiliation today!\n\nBut just in case I have my finger on the button ready to manufacture 10 million \"Civil War II\" coffee mugs. Only $11.99!!", "\"Hello. At approximately 8:15 EST at the time the AP called the election, Donald J. Trump jumped in his helicopter and said he was 'Going to find Sean! We have to find Sean!'\"", "At first I was disappointed that Jon Stewart wouldn't be covering it on the daily show but what is there to say? How can you even satirize what's happening? Trump's a caricature of the candidates that Republicans have been running for the last 60 years. I feel like every episode would consist of a clip of Trump speaking followed by Stewart facepalming.", "If you're the product of incest you can have less than four grandparents. Just throwing that out there. ", "Holy shit who could possibly think that's okay?\n\nSidenote - I don't remember doing it, but I have you tagged as \"best damn dude on reddit\" fwiw", "Trump suing NV for letting people vote is enough proof that even they know Clinton is winning tonight", "It was always in the media's best interest to let the shit show continue for ratings and profits. The court system isn't playing that shit. They have a full docket of legitimate/non-frivolous lawsuits to attend to.", "Yeah and that's why mail-in voting makes me uncomfortable despite it being so much easier. It *also* makes it much easier to coerce someone's vote.", "This day needs to be over.  I am completely useless at work. ", "Did he think she was going to plagiarize Michelle's ballot?", "\"I am a Christian a conservative, and a Republican, in that order\"\n\n-- Mike Pence", "\"At least 4 grandparents born...\"\n\nSomeone can only have 4 grandparents. Why not say \"all grandparents?\" And even then you'll have someone who decends from some founding father ancestoral line, but their dad (from that side) married a US citizen born and raised in the US, who happens to have one parent who wasn't born in the US.\n\nHow fucked is that? It's just a call to restrict voting rights to the people that she views as \"true americans.\"\n\nShe also considers herself a native american because she has ancestors who were settlers. They are native Americans because there was no America before the USA became a thing, so if they were here when the USA came into existence, native americans!!! But they had to be white. Black slaves don't count.", "It feels good to be on the side of the candidate that isn't actively trying to suppress voters' rights.", "As an European this subreddit looks like a joke.", "But did anybody give him a dollar?", "Wow so Trump got no ex-Presidents. \n\nThe Republican Civil War will be fascinating", "Reaganites view job creation as greater than God's creation.", "Booed by the 20 people who were waiting there to boo him... breaking news! Good job /r/politics. ", "This needs to be higher up DO NOT LEAVE YOUR PLACE IN LINE, you are legally entitled to your vote once you step in line prior to polls closing.", "At my school (CA) a guy came and was getting people to register to vote for \"either party\". However, if you read the fine print, it was clearly registering them as Republicans and they signed agreements saying they were not tricked or coerced into registering as a republican. I don't know how many people he got before a few of us started telling everyone who came up to him that it was a sham. No idea how legal this was", "Judge Badass", "I voted for Hillary Clinton. She's not my ideal candidate; many candidates could have taken my vote from her. But given our two real choices and four party choices, Hillary Clinton is the only one who displayed the competence to hold office. Her competition is disqualified by inexperience, ignorance, or in Donald Trumps case, that and a whole lot more.\n\nLet's finish this and send Trump and his ilk packing.", "By voting for Hillary you're saying 'national security and a pay to play government isn't a deal breaker for me because the other stuff is more important'", "I don't doubt that some of this can be contributed to voter suppression however, could it also be caused by the fact that a large chunk of minority voters live in the major cities where voting lines tend to be large due to the volume of people? Combine that with a presumed increase in voter turnout this cycle it is a sure thing for long wait times. ", "I voted in NYC this morning and it was only for people - there are no amendments on the ballot here. So unless it's something small for his specific district within Manhattan (I don't really know how that works) it was about as simple as a ballot gets. ", "I can't believe Trump's attorney didn't have a brand new O'Keefe video ready to go", "As an American I can assure you this sub *is* a joke.", "Daaaamn what's *her* name? &lt;3", "I'm rolling in shadenfreude here ...  \n\n&gt; Trump’s companies destroyed or hid 1000s of emails and documents demanded in official proceedings in defiance of court orders.  \n\n&gt; In lawsuit critical question was what did Trump know before Jan 2001. All emails be4 that date destroyed be4 plaintiffs culd get them  \n\n&gt; Trump execs filed sworn statement that no email server existed before 2001. It was a lie, which they admitted after emails destroyed.  \n\n&gt; Not only did Trump company destroy emails sought in litigation under court order, they erased the backup tapes.  \n\n&gt; Confounded by Trump refusal 2 produce records, the court appointed an independent expert 2 find them. He was obstructed from his work.  \n\n&gt; Although Trump folk stopped indepdent expert from doing his job, he was able to discover many relevant documents had been destroyed.", "Wow. He wasn't kidding about watching immigrants (legal or otherwise) at the polls. ", "&gt; A man in East Lansing tried to block two women in hijabs from casting ballots local officials say.\n\nTypical Depl0rable.", "As awful as trump is and for the record, i did not vote for him, I sympathize and empathize with his voters. \n\nThis isn't a fraction of America. It's a significant group. And I think it's hypocritical for people to make fun of people at his rallies who cheer at generic horeshit rhetoric when you can find those same versions of people at any other rally. \n\nI think it's incredibly rude and insulting to just take anyone who votes for Trump (for whatever their reasons) and assume off the bat they are a dumb piece of shit. I get it, I really do. Trump is a huge piece of shit. I get it. But people are actually voting for him in large numbers because there is something he is saying or doing that speaks to them. Regardless of what it is, even if it was fucking Hitler running, you need to take his supporters seriously. \n\nDon't stomp hate with hate. It doesn't work. Memes, making fun of people, harassing, belittling them won't work. Why would it? Those things are done selfishly to make themselves feel good. \n\nYou don't need to sing kumbaya with these people but treat them as though they are people at least--you'll learn something through your disagreement. ", "Well I shouldn't leak the secret but you seem kinda nice... All this election craziness is a ruse. Americans are united, and whoever wins the election gets to lead the midnight invasion of Canada as we plunder your resources. ", "She's not an illegal immigrant. She's a US citizen. Jesus fucking Chist.", "So I voted. For the first time in 30 years I voted for a Democrat for President. I was intending to vote GOP on the rest of the ticket but you know what? Screw you.\n\nI'm tired of having to settle for less. I'm tired of abortion being part of the platform. I tired of politicians telling what I should do on Sunday. I'm tired of having to eat gay marriage either my small government. I'm tired of being embarrassed by Ted Cruz and Michelle Bachmann.\n\nSo screw you, GOP. You haven't earned my vote.", "Florida Man vs. Florida Woman The Sprayening", "My future MIL in Georgia is one of those red state wives completely sick of her husband's political bs. She loved voting for Clinton today. ", "Wife and I stood in line this morning for about 30 mins to vote in NC but right at the end my pregnant wife suddenly felt weak and just about collapsed. She couldn't walk herself to the door 6 feet away. I was going to walk her out but she told me to vote first (we likely wouldn't get a chance to come back later). I took our two year old in and voted, then found her outside with a doctor, the spouse of a poll watcher, getting her into one of their fold up chairs. When I pulled up with the car, the poll workers had brought her a ballot to fill out where she was, since she couldn't make it inside. So, it took a lot more than we expected, but we both voted! No excuses! Go vote!\n\n(She's fine, btw)", "So THAT'S why conservatives love Reagan so much!  ", "Sounds they both came into the situation prepared for a confrontation. Not surprised that incidents like these would happen during this election", "Oregonian voter here. I voted in about 30 total minutes. The only reason it took me so long is because I was researching every ballot measure on my computer as I was filling out the ballot at my desk.\n\nHaving only lived in absentee-only states the idea of having to take time out of a work day, travel to a polling location, and/or stand in line--potentially for hours--to cast a vote seems preposterous to me. I can't think of any good reason why voting by mail shouldn't at least be an option in every state. ", "As a huge Matrix fan fuck those people for making everyone identify \"redpill\" with their douchery now.", "Reminds me of just earlier this year\n\nhttp://vetsforbernie.org/2016/03/kansas-chooses-bernie-for-president/\n\nKansas has correctly predicted the democratic nominee for the last 50 years.\nThey picked Bernie this year. It wasn't Bernie after all. \n\nStatistics like these are useless. ", "It's a clusterfuck *by design*.", "She was an illegal immigrant and she worked illegally during that period prior to citizenship, so while being wrong that she is currently illegal - the person you replied to wasn't totally wrong...", "I think it's moreso the case that that's what happens when your attorneys tell you there's no case to be had and you force them to try anyway.", "Come join the discussion over in our [megathread](https://www.reddit.com/r/politics/comments/5bxyd3/2016_election_day_returns_megathread_1010pm_est/)!", "That seems like a key demographic for them too.", "Lindsey Graham is such a weird guy. He comes off as so normal when he's not advocating all out war. ", "And why they vote for Trump the man who's going to empower cops to stop citizens on the street and take their guns. Conservatives love gun control when it takes certain people's guns.", "With some pretty glorious smackdown by the judge.", "The party left you -- that's not your fault. Thanks for choosing country over party. With people like you our future is full of potential.", "It's been pretty tame all things considered. Florida is just being Florida it doesn't count. ", "I voted for Hillary today for myself and for my late wife who was a quiet woman working for issues concerning women and families for decades.  Considering her modest origins as a dark skinned minority  she went further than any of her friends or family would have ever thought and I was happy to support her in her efforts.  I always figured if I didn't have dreams for myself I could better myself by supporting the dreams of someone else.  so I put money and effort into making sure she had everything she needed.  Yes somewhere along the way we made the pilgrimage to Susan B. Anthony's grave and toured her home.  Let's not forget Elizabeth Cady Stanton either - her partner in crime.", "But they were technically wrong the worst kind of wrong.  ", "Native Syrian who just voted in her first presidential election.  Regardless of party or vote I feel so fortunate to have a voice here in this country.  ", "Oh my God fuck red pill. What a cess pool that place is. I am ashamed to be a white male because of those fuckers.", "\"I survived the Trump Campaign: An Insider's Tale\"\n\n~ Melania Trump\n\nNew York Times best seller for a month.", "It is illegal.", "It's even more bizarre now that both Wachowskis are trans.\n\nEdit: Spelling. At least it's still easier than M. Night Shamalamadingdong.", "Hey when you've got nothing else going for you, you've got to pretend your sex and race make you inherently superior!", "I'm a voter in a red state one of the reddest states, in fact (Mississippi.) I voted against Trump. Hope my vote helps even though I know Trump is probably going to take my state. ", "You are voting for a man who thinks that climate change - the biggest single threat to the future of this planet - is a hoax invented by the Chinese. \n\nEverything else aside (the sexual assault the racism, the racketeering and tax fraud), THIS is enough for any thinking person to ignore Trump. If we neglect climate change for another 4 to 8 years, the entire world will pay the price. You think refugee issues are bad now? Wait until the devastating affects of rising sea levels and crop failure. \n\nMany of you may be black, Hispanic, military members, or whatever demographic, but you are selfish and short-sited to support a candidate who dismisses the most pressing issue of our time. Sorry, but I have no respect for such people. ", "I've stopped feeling sorry for that women as she was \"just doing her job\" \"is tired of defending trump\". She is on the wrong site of history and people are going to not forget this. ", "And when you lie so often that your attorneys only speak to you in pairs so that they can back each other up when calling out your lies later.", "A woman judge! You know Trump will argue that she couldn't be fair to him having heard his pussy-grabbing comments. He'll want a male judge of English or Scottish descent. lol", "So wait a minute.  They get into a little verbal back and forth.  He goes and votes and it sparks up once again.   He gets close  but doesn't touch her physically.   She pepper sprays him  and then he fights back and somehow he's the only one being charged?\n\nShe's the one who escalated it into a physical altercation.    Now  I am 100% against laying a hand on a woman so he shouldn't have  done so.  But both of them most certainly should be charged.", "Once their in the booth you can't \"check their answers\"... unless your Donald Trump.  How is that not illegal?", "I'm sorry but this has been the best story of the day. I may be of the other gender but her fight has always been an inspiration for me. She had no right to expect a good outcome and my god she should be better remembered than she is. ", "This is Florida land of some of the nation's most open self-defense laws.  Making someone feel threatened by getting up in their face (then proceeding to actually attack the person even after getting pepper sprayed) is a good reason to get pepper sprayed here.", "medicinal plant goo", "Yes exactly.   This is a feature, not a bug.  It's exactly what was envisioned when these states were drafting their election laws. ", "She missed the boat on that one.  Three months ago would have been the peak time for that sale.", "\"You ever heard of the Emancipation Proclamation?\"\n\n\"I don't listen to hip-hop!\"", "I've been calling him a redneck with money for years tho", "Especially as there are about 270 million potential voters and the total campaign financing for all parties is at least $1.3 billion.  $1 to commit one vote is a better return they are currently experiencing.", "&gt; Amendment I\n&gt;\n&gt; Congress shall make no law respecting an establishment of religion or prohibiting the free exercise thereof;\n\nWhat part of this is so difficult to understand?", "Remember a few weeks ago when a racist right-wing white guy murdered two cops in cold blood and how everyone called him a terrorist, and that moderate white men needed to disavow that kind of violence on behalf of their race?", "IMO voting should take place over a period of two weeks. You can go at your lesure take your time not stand in long lines and make a decision you are comfortable with.  Voting by mail is another option but I personally would feel more comfortable just doing it in person. Why do we only have a single voting day? In many states early voting went on for quite a while and it looks like there aren't significant lines in any of those states.", "&gt; It also makes it much easier to coerce someone's vote.\n\nEasier than bullying them in the car on the way to and in the parking lot of the polling place?", "Polls close in 5 hours so 8 hours from now we should have a winner", "The guy even italicized \"is\".", "According to the lawyer for the state no. She said closing times are state mandated *minimums*. You can stay open as late as you want (according to her). She also said this has been standard practice in years past; this is nothing new. ", "You missed a step.\n\nHe got angry about his hair transplant so he started ripping her hair out... *which got him hard*, so he raped her.", "Yeah and in this scenario we are debating what is more important: basic human rights (Trump is against many of these) or national security/integrity of democracy (of which there is still no concrete that *we* know of that Hillary did anything wrong). I actually think Hillary did probably at least do something wrong but in this particular argument I think it doesn't matter much.\n\nAgain, when you are discussing whether basic human rights are more important or whether national security/integrity of democracy is important, basic human rights should win. Every time. It fucking sucks that we're even in this situation, but this is the reality. This is the America we live in.\n\nIf I have to sacrifice national security/integrity of my government to ensure that the country won't be sent back into the times before the civl rights act, so be it. \n\nWhen the 'other stuff' you refer to are basic human rights, yeah, they are more important.", "I don't think they were booing him for voting just booing him for being him.", "I voted early in Dallas and contributed to the blue dot in the sea of red.", "&gt;It's probably because there are hardly any Hillary voters at the polls today most did early voting.\n\n&gt;Looking like a Trump presidency at the moment.\n\n&gt;Speaking of which; has anyone else noticed that a lot of accounts that have been commenting here all day, every day, for months aren't here anymore?\n\n*Looks at Username*\n\nWait a minute....", "Yet another reason to scrap the electoral collge. So all US citizens' votes count. ", "From what I understand there aren't many people who *don't* hate Doniel Trump.", "There could be a very good reason why Melania is sensitive about bullies.", "&gt;Witnesses told the Palm Beach Post that Garrecht looked like “he was picking a fight.”\n\n&gt;Afterward Garrecht admitted that he should have gone to his car, saying he isn’t one to “just let things go.”", "Nazis also said they were just doing their job. \n\nShe chose this she believes this and she sold her soul for money. ", "This is a potential president\n\nLiterally fucking suing his own country for practicing a free democracy\n\nHe cannot be president", "Mine was non-provisional. I don't know what the difference is. I had to jump through a bunch of hoops just to even vote because they lost my registration again. I re-registered and voted in the primaries, then return to the exact same polling station without moving or changing anything, and they couldn't find me.\n\nSo yeah, that may have something to do with determining if I got provisional or non-provisional... especially considering there was like a 5 second ordeal about which one I was getting.", "Well the thing is, Trump and his attorneys didn't want to harass them *personally.*  They wanted precisely what the judge was afraid of - for Trump's loyal legion to do the harassing.", "Join the club.  I left the GOP in 04.  Had enough of Bush.  I am not sure I will ever go back because the candidates keep getting worse and worse.", "Breitbart = Bullshit.", "Gotta admit I teared up a bit when I showed my 82yr old mom the live feed... she said it was one of the most beautiful things she's ever seen.", "There are times when I'm almost tempted to call him reasonable. But it's usually just when he's surrounded by real mental illness.", "I don't believe that for a single solitary second.", "It's just a picture let's pin all sorts of insults and conspiracies to it.", "Same here! They were around when Texas was it's own nation so I joke that I'm part Texan. ", "If you are ignorant enough to think that climate change is a hoax and you are selfish enough to leave our descendants with the consequences, then you deserve to have your intelligence insulted. Period.", "As a Trump supporter thank you for this. Through all the mud slinging and rhetoric people don't seem to realize he has received more votes than any other republican candidate in history. He also has the highest amount of democrates voting for him. We are not all racist white rednecks. Many of us are current or former military black, Hispanic, old,young business owners construction workers lawyers etc. \n\nIt's not right to paint all black people as thugs and welfare recipients, it's not right to paint all Trump supporters as stupid white racist.", "But its all Trumps so who cares?", "&gt; I sympathize and empathize with his voters\n\nI used to until I realized these are the same people who always freaked out about \"welfare queens\" reliably voting \"small gov't\" GOP until a huckster paid attention to them. Then they ditched the small gov't stuff in favor of naked racism, xenophobia, and misogyny.\n\nThey do have legitimate gripes with the system, but it's mostly the fault of the Tea Party a-holes they elected, not Democrats, \"elites,\" or people of color.", "Other Links:\n\n[ABC News](\nhttp://abcnews.go.com/Live/video/special-live-2-14519615)\n\n[Al Jazeera English](http://www.aljazeera.com/live/) \n\n[BBC News](http://www.bbc.com/news/live/election-us-2016-37899679)\n\n[Bloomberg News](http://www.bloomberg.com/live)\n\n[CBS](http://www.cbsnews.com/amp/live/)\n\n[Fox News](\nhttp://video.foxnews.com/v/1241186546001/?#sp=watch-live)\n\n[MSNBC](http://www.msnbc.com/msnbc-live)\n\n[NBC](http://www.nbcnews.com/storyline/2016-election-day)\n\n[Newsmax](http://www.newsmaxtv.com)\n\n[Sky News](http://news.sky.com/watch-live)\n\n[Telemundo](https://youtu.be/T33j-7Qr_hk)\n\n[The Young Turks](https://tytnetwork.com/live/)\n\n[PBS NewsHour](http://www.ustream.tv/pbsnewshour)\n\n[YouTube](https://www.youtube.com/live) (Several Options)", "This breaks the pledge he made at the first Republican debate.", "She can't believe the guy hit her after she pepper sprayed him? It's pepper spray not magical \"Shut the Fuck Up\" spray.", "I'm looking forward to him being a big player this cycle in the Senate.", "I voted in Georgia. Regardless of who wins today I look forward to voting them out of office in four years. ", "My wife and I passed up our usual green votes to ensure the safety of the... world. Fuck you Trump.", "I live in Florida and this made be laugh because it's true.", "Your incredible bias is showing. I voted for Clinton but from reading this article it's obvious HE was in the wrong.\n\nShe asked him many times to get out of her face as she felt physically threatened. When he wouldn't, she discharged her pepper-spray and he TACKLED her and began punching her. What did she do wrong exactly?", "I will never forget the dream that was Bernie Sanders. Hopefully he will continue to play a large role in our political system.", "This is *exactly* why we have the inheritance tax.  ", "&gt; But people are actually voting for him in large numbers because there is something he is saying or doing that speaks to them\n\nTrump has given a legitimate voice to racism sexism, bullying....all things which the average American despises. It is these things which have motivated his base, it is these things that \"speak\" to them. It is not the moderate voters intent to dismiss or in anyway bully or harass the people who have gravitated towards this rhetoric, but racism isn't something that needs to be contemplated...sexism doesn't need to be understood. These ideas should be snuffed out at every turn and I think people sometimes get confused when someone attacks an idea rather than the person who is giving voice to the idea. ", "Your account is 21 days old..", "Well those stickers indicate that you did indeed vote. And then you went out of your way after voting to honor her. I think it's nice and they can take them off easily.", "American democracy terrifies me. It's so sleazy. It's remarkable you guys function at all...honestly.", "Ditto his accomplice Mike Pence. Indiana hates him for being so right-wing. Mull that sentence over for a bit: *Indiana* thought his Republican partisanship was a little much. \n\nCompare with Joe Biden who is still beloved in Delaware, and Tim Kaine, who seems impossible not to like. Even the RWNJs are gonna be all \"President Hillary is a *monster!* Tim's cool, though. No complaints.\"", "Being a senior in college this year has caused me to reflect on my life up to this point and think about all of the factors that have contributed to my success. While many people feel that this election is the end of a long and harrowing (and to some depressing) experience, in reality this election symbolizes the true greatness of our country. Millions of people across the country will cast votes in an election that will shape the next four years of policy in our country and foreign policy all across the world, and will do it relatively peacefully.\n\nI strongly supported Bernie in the primaries, to the extent that I found myself as apart of the crowd hoping Hillary would be indicted, which would allow Bernie to face off in the general election. I was actively voter suppressed in the Connecticut primary and unable to vote for Bernie, which only furthered my anger. I never, ever considered voting for Trump, but I did consider not voting at all. I recognized that would be a tremendous mistake. Not voicing my opinion in such a contentious election would be irresponsible, and go against my core beliefs of civility. But this election season stressed me in ways I did not think were possible before. Trump, to me, is the antithesis of my morals and experiences. I understand the anger that can lead people to vote for him (or not vote at all), and therefore I won't bash those who will vote for him based off that anger.\n\nI will, however, voice my absolute disdain for those who believe the terrible things he says. Trump is a national disgrace, a man so vile that I would fear for the safety of my family, my friends, and my own future. The length and severity of his lies, alone, is enough. He has tweeted over one hundred times since 2008 that climate change is a Chinese hoax. His complete disregard of even basic diplomacy, shown by his comments on our involvement in NATO (the alliance responsible for the stability of the world as we know it), is disqualifying of a presidential candidate. The list is long enough to write a dissertation about. He is a demagogue, a man who wants to capture your emotions through hate filled speeches and then promise you of a better future with irrational policy and racist, sexist remarks. A man in Germany did this, and he killed over 10 million people by his own hand before he was forcefully removed from power.\n\nI study history, and I know enough about democracy that it is only as strong as its weakest candidate. Donald Trump and Hillary Clinton, both, have weakened our democracy. Clinton and her campaign actively engaged in suppressing voters, like me, from being able to vote. Trump, by making statements like he may not accept the results of the election, threatens the very core of our most sacred American tradition - the peaceful transition of power from one president to another. It is our countries most vulnerable time.\n\nToday, I voted for Hillary Clinton. I did it because she is qualified for the presidency, and represents a great majority of the policies I want to see pushed forward in my lifetime. I voted for her acknowledging her weaknesses, and the corrupt and undemocratic processes her campaign engaged in. She is, undoubtedly, an imperfect candidate, but she maintains the level headed nature that is an essential trait of presidents. If she wins, I will be critical of her and her presidency, and hope that she follows through on some of the promises she has made. If she is unable to follow through should she be elected, I would back a potential primary challenger in 2020.\n\nVoting is your civic duty. But please, vote based off of policy and fact. Policy is what will change your future. And make you vote down ballot as well! Your senators, representatives, and local officials are just as essential to our democracy as the presidency, so get out there and do your duty!", "Yikes. That's midnight here. Oh well looks like I'll get little sleep tonight ", "He actually demanded that the registrar pay trumps legal fees for filing this case...", "Penalties for frivolous litigation are pretty common. I don't know if this would fall into that category but it's not at all unusual to punish people for bringing a lawsuit they should have known was pointless.", "This is extremely important and something not enough people know.", "That makes two of us Bernie.", "The whole election system in the USA is fucking bonkers. ", "And still quite a few people (like 20 to 21%) out of that 71% will vote for him.", "Fuck this guy. If the only way you can win is through disenfranchisement you don't deserve to win.", "Absolutely.  The video that accompanies the pic shows it wasn't anything more than this. There's perfectly legitimate reasons to hate the guy but making shit up with out-of-context pictures is embarrassing.", "I am a journalist for MSU and a young woman from East Lansing precinct 2 told me directly that they tried to turn her away because the address on her ID was from her home town. She told me she had to yell at the poll worker until she finally conceded that Michigan voters don't need photo ID to vote.\n\nI know our city clerk so we'll be having a chat.\n\nEdit - I should add that the person who I interviewed was a white woman but she insisted that her appearance (punk rock clothing and dyed hair) and age was why she was targeted. I don't endorse her opinion, I'm just relaying information here.", "So you're saying I don't have to go home but I CAN stay there? ", "If you stay Trump might sue you! :)", "Bigly. Defeat him *bigly* Bernie!", "and oh its definitly rigged ", "I Feel Your Bern. ", "save us master chief! why cant we vote for him?", "because hes not real :''''(", "I've been seeing some news today that Michigan might be closer than expected so this worries me greatly. Not only the fact Hillary could lose Michigan this election cycle, but seeing Americans deprived of their right to vote is extremely disturbing to say the least, regardless of who they vote for. ", "&gt; feel disenfranchised\n\nTrump: feels &gt; reals the campaign", "\"Wtf I thought we were just playing along to keep our inheritances.\"", "And my axe!", "Bernie's a really good guy and if there were no one else looking out for young people and progressives, would single-handedly provide a system of checks and balances on Hillary.", "Given that Dearborn and the surrounding areas have the largest Muslim populations in the US I expected some sad news out of this region. ", "But what part of the constitution bars them for voting? ", "&gt; Conservatives love gun control when it takes certain people's guns.\n\nYou know *those* people.  ", "“If a man has a stubborn and rebellious son who will not obey the voice of his father or the voice of his mother and, though they discipline him, will not listen to them, then his father and his mother shall take hold of him and bring him out to the elders of his city at the gate of the place where he lives, and they shall say to the elders of his city, ‘This our son is stubborn and rebellious; he will not obey our voice; he is a glutton and a drunkard.’ Then all the men of the city shall stone him to death with stones. So you shall purge the evil from your midst, and all Israel shall hear, and fear.\" \n\nIf you don't think that unruly children should be stoned to death, then you don't have the right to call yourself a Christian. ", "&gt; Red State Wives are sick of their husband's political shit. When alone in the voting booth they can do whatever they want. I'm trusting they will.\n\nGod this is a fantastic sentiment. ", "Been feeling the Bern up here in Canada too! Please my brothers and sisters south of the border, suck it up and vote for Hillary. Its either her or a fascist, bigoted, racist, sexist, demagogue. Please. We're all so incredibly nervous. PLEASE VOTE!", "Again feels &gt; reals.", "I notice \"American\" isn't on that list... which means it ranks 4th at least.", "The 88th amendment\n\nedit: truly shitposting is the way to gold", "Regardless of what happens in all the races we can all agree that voting by mail is way better than having to wait in some of those lines. I love being able to actually open up my laptop and research topics I don't know much about before picking the bubble to fill in. ", "Sixth after carnivore heterosexual, and good with numbers.", "Looks like you brought the bigots out of the woodwork.", "I feel you bern. I hope you run again someday ", "I totally agree. But I guess it doesn't matter anymore. Tonights the night.", "Me too. Same state. If nothing else we narrowed his margin by two. ", "If you watch the video he's just asking to see if she's done. Why is this on r/politics", "FBI recommends no charges. ", "Then they should also have more polling places in densely populated areas; it really shouldn't matter if you live in a rural or urban environment the population-to-polling booth ratio should be roughly equal but it clearly isn't.", "Honestly East Lansing is pretty far away from Dearborn - we're also a pretty liberal electorate, so I am saddened to hear about this behavior. ", "Must've been Dantonio's offensive coordinator. That explains the disorganization and propensity to do the wrong thing. ", "Well that guarantees Chris Christie will be in attendance.", "&gt;4chan where Trump is a referred to as a “God Emperor,” also had its boards littered with posts by anonymous users complaining that they were turned away from polling places for not having registered, followed by pleas from fellow users who were hopeful they were trolling the board.", "oooh this is gonna trigger some Trump supporters.  The emails are all they have left.", "Voted what was on his mind. ", "woohoo our entertainment is back. Time to pull out the whiskey and popcorn.", "University of Michigan recommended using your student ID because it doesn't have an address on it so they can't even try to pull that shit.", "Imagine them having to say President Clinton  after today. ", "Damn I agree with that guy a lot.", "No he fucking lied again. Because he's a fucking liar. Liberal bias my ass.", "Yup. Lana (formerly Larry) transitioned in 2010 and Lilly (formerly Andy) transitioned earlier this year.\n\nIt's pretty ironic that the writers that coined the red/blue pill concepts that redpillers raped and bastardized are now everything that TRP loathes and fears.", "Agreed.  Michigan was the one that everyone got wrong in the primaries.  I think Trump takes it.  And I think Hillary takes Nevada and Florida to make up for it and then some. ", "That's selling used car salesmen way short.  They at least express moderately sophisticated thinking.  Trump is like a four year old or rudimentary computer program.  His speech patter is basically: \"Me good.  The greatest.  Believe me.  Other thing bad.  Just horrible.  Worst ever folks.  Let me tell you.\"", "Damn if Hillary just running makes you \"feel disenfranchised with politics,\" you're gonna have a rough life. I need to buy some Kimberly-Clarke stock...", "How is this related to anything regarding politics?", "Not me. They chose along party lines in 2000 and would almost certainly do so again now.", "Must be funny then, how the bloodiest of wars were not waged by Islamists, but by in fact, those of Judaeo-Christian descent. ", "I'm starting to wonder if he's a nasty woman.", "Strap in all. Trump's got his Twitter back tonight.", "Trump is the kind of guy who would write in his own name every year because he doesn't think anyone else deserves his vote.", "These folks could really use a safe space to express themselves.", "I'm glad to see that the worst case of voter intimidation so far is one dude who failed.", "When I was canvassing for the Liberals in Canada most couples I spoke to, the 'husbands' hated Trudeau and said no one in their household would be voting for him. Most of the wives found a way to indicate otherwise.", "Easy to say very hard to prove when they haven't had a year of negative ads and oppo research targeted against any of those people.", "&gt;  a year of negative ads\n\nTry 20 years.", "This is what I am expecting.", "Samantha Bee was right\n\nHE CAN'T FUCKING READ\n\nhttps://www.youtube.com/watch?v=7LFkN7QGp2c", "Let them eat cake! ", "To clarify: Exit polls show that more people seem to have been contacted by Clinton's campaign than Trump's. I've yet to find any exit poll data on election results themselves. The article doesn't differentiate between trump supporters or clinton supporters being the one contacted, what the results of that contact were, etc. \n\ntldr Clinton campaign appears to have called more people. ", "It'll be a YUUUUGE win!", "http://i.imgur.com/v9tQi1v.gif", "You didn't get the memo?\n\nThey're the Wachowski sisters now.", "That's why Hillary is untouchable ", "No this is Patrick!", "No turd. No turd. You're the turd. ", "Paragraph 14 to be precise.", "That's how it is in CO. Around October 15 my household (Me + two roommates) received a large booklet with descriptions (including sample arguments from proponents and opponents) of the (many) proposed state-level amendments and ballot measures. It was accompanied by a smaller booklet for county level proposals.\n\nI got my ballot in the mail on October 22-23ish and, had I chosen to affix postage, could have dropped it in the mail. I dithered a little bit, and ended up dropping it off at the county courthouse at 7:30 PM last night. I would say that in the ~30 seconds I was in view of the ballot box, 8 people did the same. I could have dropped it off in secured locations at the university student center, or at my grocery store, but I felt like biking downtown.\n\nIf I had waited for today and/or lost my mailed ballot, my understanding is that the polling lines usually take 5-15 minutes to get through. This is how I voted in 2014, and it was utterly painless.\n\nI'm not sure why more states don't have this combination mail/drop-box/in-person system.", "Yep. My step-dad thinks BLM is a hate group that discriminates against whites and even went so far as to say that police brutality against black people is the fault of black people! Then other things, like they should all be forced to stand for the anthem, or \"they\" are taking all of \"our\" jobs.\n\nIf I suggest his ideas are remotely racist, he flips out on me. Mind you, I try to express this in a diplomatic way - not with outright insults. I wish people understood that they can be racist even if they aren't registered members of the KKK. For some reason, people who spout blatantly racist ideologies think they're exempt from being labeled as such.", "How the fuck are we supposed to expect these people to assimilate when this kind of heinous shit is pulled on them?", "That thing is CREEPY. ", "How much of this do you think is trolls trolling trolls?", "Trump is a man of his word. He did say he'd keep an eye on immigrants at the voting booths.", "How about data pertaining to Republican controlled states vs Democratic controlled states?", "Funny how you expect us to buy that but you will never accept it as truth the other way.", "If you squint there is a teeny tiny asterisks after religion, that in fine print reads \"Except Christianity, because God says.\"\n\n/s", "&gt;One user of Reddit’s r/The_Donald who has had a Reddit account for over two years, had a familiar plea: “So I got up early today to MAGA!! Turns out, after waiting in line to vote, I needed to register months ago?? How is this possible? Can I still vote?”\n", "DAMN!!! It's to late for me to jump on that....I already voted.", "[Macedonian propaganda](https://whois.icann.org/en/lookup?name=americanlookout.com)\n\n[Buzzfeed has an article on pro-Trump economic propaganda outlets designed for revenue generation](https://www.buzzfeed.com/craigsilverman/how-macedonia-became-a-global-hub-for-pro-trump-misinfo?utm_term=.raQr00NxzK#.gna1AAdNyo) which tend to follow fairly close patterns:\n\n* Less than 1 year old oftentimes less than 6 months, in some cases only 2-3\n\n* All focusing exclusively on praising Trump and attacking Clinton\n\n* All appear in the_donald either on the first submission or within a handful of the first few submissions\n\n* Many first submitted by users that're either obviously from the sites being posted or who have account registration dates that tie in pretty closely with the registrations of the sites they're posting\n\n* Many of them share the same cookie-cutter page layouts\n\n* When registrant data is available, many of them share the same geographical locations or owners, and sites that profess a particular forus in US affairs are often halfway around the world in the likes of Macedonia\n\n365lifetimenews.co.uk: [WHOIS report](http://whois.domaintools.com/365lifetimenews.co.uk) [Submission history](https://www.reddit.com/domain/365lifetimenews.co.uk/)\n\nallforusa.com: [WHOIS report](http://whois.domaintools.com/allforusa.com) [Submission history](https://www.reddit.com/domain/allforusa.com/)\n\namericafans.com: [WHOIS report](https://whois.icann.org/en/lookup?name=americafans.com) [Submission history](https://www.reddit.com/domain/americafans.com/)\n\nangryamericanpatriots.com: [WHOIS report](https://whois.domaintools.com/angryamericanpatriots.com) [Submission history](https://www.reddit.com/domain/angryamericanpatriots.com/)\n\nberniemyhero.com: [WHOIS report](http://whois.domaintools.com/berniemyhero.com) [Submission history](https://www.reddit.com/domain/berniemyhero.com/)\n\nbigbluedimension.com: [WHOIS report](https://whois.domaintools.com/bigbluedimension.com) [Submission history](https://www.reddit.com/domain/bigbluedimension.com/)\n\nbigbluevision.com: [WHOIS report](https://whois.domaintools.com/bigbluevision.com) [Submission history](https://www.reddit.com/domain/bigbluevision.com/)\n\nbigbluevision.org: [WHOIS report](https://whois.domaintools.com/bigbluevision.com) [Submission history](https://www.reddit.com/domain/bigbluevision.org/)\n\nbluevisionnews.com: [WHOIS report](https://whois.domaintools.com/bluevisionnews.com) [Submission history](https://www.reddit.com/domain/bluevisionnews.com/)\n\nbvanews.com: [WHOIS report](https://whois.icann.org/en/lookup?name=bvanews.com) [Submission history](https://www.reddit.com/domain/branews.com/)\n\nchristiantimesnewspaper.com: [WHOIS report](http://whois.domaintools.com/christiantimesnewspaper.com) [Submission history](https://www.reddit.com/domain/christiantimesnewspaper.com/)\n\nconservativestate.com: [WHOIS report](https://whois.icann.org/en/lookup?name=conservativestate.com) [Submission history](https://www.reddit.com/domain/conservativestate.com/)\n\ndaily-politics.com: [WHOIS report](https://whois.domaintools.com/daily-politics.com) [Submission history](https://www.reddit.com/domain/daily-politics.com/)\n\nhardnfasttruth.com: [WHOIS report](http://whois.domaintools.com/hardnfasttruth.com) [Submission history](https://www.reddit.com/domain/hardnfasttruth.com/)\n\nglobalnews4u.com: [WHOIS report](https://whois.icann.org/en/lookup?name=globalnews4u.com) [Submission history](https://www.reddit.com/domain/globalnews4u.com/)\n\nhelping-mothers.com: [ICANN WHOIS](https://whois.icann.org/en/lookup?name=helping-mothers.com) [Submission history](https://www.reddit.com/domain/helping-mothers.com/)\n\nlibertywritersnews.com: [WHOIS](https://whois.icann.org/en/lookup?name=libertywritersnews.com) [Submission history](https://www.reddit.com/domain/libertywritersnews.com/)\n\nmagseriesusa.com: [ICANN WHOIS](https://whois.icann.org/en/lookup?name=magseriesusa.net) [Submission history](https://www.reddit.com/domain/magseriesusa.net/)\n\nnewscenterusa.com: [WHOIS report](https://whois.domaintools.com/newscenterusa.com) [StatWebAZ WHOIS](http://www.statwebaz.com/newscenterusa.com) [Submission history](https://www.reddit.com/domain/newscenterusa.com/)\n\nnoscomunicamos.com: [WHOIS report](http://whois.domaintools.com/noscomunicamos.com) [Submission history](https://www.reddit.com/domain/noscomunicamos.com/)\n\nopenmedianews.com: [WHOIS report](https://whois.icann.org/en/lookup?name=openmedianews.com) [Submission history](https://www.reddit.com/domain/openmedianews.com/)\n\npress24.us: [WHOIS report](https://whois.domaintools.com/press24.us) [Submission history](https://www.reddit.com/domain/press24.us/)\n\npoliticsbreaking.com: [WHOIS report](http://whois.domaintools.com/politicsbreaking.com) [Submission history](https://www.reddit.com/domain/politicsbreaking.com/)\n\npoliticsintheusa.com: [WHOIS report](http://whois.domaintools.com/politicsintheusa.com) [Submission history](https://www.reddit.com/domain/politicsintheusa.com/)\n\npoliticsinusa.com: [WHOIS report](http://whois.domaintools.com/politicsinusa.com) [Submission history](https://www.reddit.com/domain/politicsinusa.com/)\n\nspinzon.com: [WHOIS report](https://whois.icann.org/en/lookup?name=spinzon.com) [Submission history](https://www.reddit.com/domain/spinzon.com/)\n\ntheamericanrevenant.com: [WHOIS report](https://whois.icann.org/en/lookup?name=theamericanrevenant.com) [Submission history](https://www.reddit.com/domain/theamericanrevenant.com/)\n\nthelastlineofdefense.org: [WHOIS report](https://whois.icann.org/en/lookup?name=thelastlineofdefense.org) [Submission history](https://www.reddit.com/domain/thelastlineofdefense.org/)\n\nthunderviral.com: [WHOIS report](https://whois.icann.org/en/lookup?name=thunderviral.com) [Submission history](https://www.reddit.com/domain/thunderviral.com/)\n\ntruepundit.com: [WHOIS report](https://whois.icann.org/en/lookup?name=truepundit.com) [Submission history](https://www.reddit.com/domain/truepundit.com/new/)\n\nusconservativetoday.com: [WHOIS report](https://whois.icann.org/en/lookup?name=usconservativetoday.com) [Submission history](https://www.reddit.com/domain/usconservativetoday.com/)\n\nusadailyinfo.com: [WHOIS report](https://whois.domaintools.com/usadailyinfo.com) [Submission history](https://www.reddit.com/domain/usadailyinfo.com/)\n\nusafreshnews.us: [WHOIS report](https://whois.domaintools.com/usafreshnews.us) [Submission history](https://www.reddit.com/domain/usafreshnews.us/)\n\nusalibertynews.com: [WHOIS report](http://whois.domaintools.com/usalibertynews.com) [Submission history](https://www.reddit.com/domain/usalibertynews.com/)\n\nusanewsflash.com: [WHOIS report](http://whois.domaintools.com/usanewsflash.com) [Submission history](https://www.reddit.com/domain/usanewsflash.com/)\n\nusanewslive365.com: [WHOIS report](https://whois.icann.org/en/lookup?name=usanewslive365.com) [Submission history](https://www.reddit.com/domain/usanewslive365.com/)\n\nusapoliticsnow.com: [WHOIS report](https://whois.domaintools.com/usapoliticsnow.com) [Submission history](https://www.reddit.com/domain/usapoliticsnow.com/)\n\nusapoliticstoday.com: [WHOIS report](http://whois.domaintools.com/usapoliticstoday.com) [WebsitePart WHOIS](http://websitepart.com/www/usapoliticsnow.com) [Submission history](https://www.reddit.com/domain/usapoliticstoday.com/)\n\nusapowernews.com: [WHOIS report](https://whois.icann.org/en/lookup?name=usapowernews.com) [Submission history](https://www.reddit.com/domain/usapowernews.com/)\n\nusatodaypolitics.com: [WHOIS report](https://whois.domaintools.com/usatodaypolitics.com) [Submission history](https://www.reddit.com/domain/usatodaypolitics.com/)\n\nworldpoliticus.com: [WHOIS report](https://whois.domaintools.com/worldpoliticus.com) [Submission history](https://www.reddit.com/domain/worldpoliticus.com/)", "And Benghazi!!! Whenever people get all up in arms about it I just ask them to name one of the cities where an embassy was attacked under Bush. When they don't know a single one, their bias is there for everyone to see. ", "Removing it just changes what states are relevant it doesn't make all states relevant.\n\nCurrently the EC forces you to appeal to different demographics in like 10 states; each state has its own \"hot button\" issues whether they be the economy, immigration, justice reforms, or energy policy.\n\nWithout the EC you can just target a specific, majority, demographic and win.\n\nPart of the separation of powers was to force the President to appeal to a variety of states and not just focus on the largest few at the expense of the others.", "All aboard the S.S. Dumpsterfire now leaving!", "That's how white supremacists see it at least.", "And who cares even if it is genuine? That looney fuck did a shitload of damage to our country. Fuck him. ", "When I was 22 I voted for the first black man to dare run for president. At 30 I just voted for the first female president. There are things our children will take for granted. And thank fuck for that. \n", "&gt; Donald Trump seems to have regained control of his Twitter feed after campaign staffers seized it in the final days of his campaign.\n\nBoy, this gonna be good!", "Republicans created the crisis of inefficient government that's more bureaucracy than actually helping people. Then they get to rail against the problem they crated to dupe those who they screwed over into voting for them. "], "links": ["5bufsq", "5bufsq", "5bufsq", "5bufsq", "5bubgt", "5bufsq", "5bufsq", "5budzo", "5bujsp", "5bufsq", "5bufsq", "5bufsq", "5buqdh", "5budzo", "5bufsq", "5bucyh", "5bufsq", "5btc89", "5bucyh", "5budzo", "5budzo", "5bujsp", "5budzo", "5bufsq", "5bukkt", "5buqdh", "5budzo", "5bubgt", "5budzo", "5bufsq", "5bufsq", "5bufsq", "5budzo", "5bubgt", "5bufsq", "5bufsq", "5budzo", "5budzo", "5budzo", "5btwg8", "5budzo", "5bujsp", "5bubgt", "5budzo", "5buqdh", "5btc89", "5budzo", "5budzo", "5budzo", "5buqdh", "5bufsq", "5bufsq", "5bucyh", "5bufsq", "5bufsq", "5bucyh", "5budzo", "5bugkd", "5budzo", "5budzo", "5budzo", "5bucyh", "5budzo", "5buf7z", "5budzo", "5budzo", "5budzo", "5budzo", "5btm54", "5budzo", "5budzo", "5buqdh", "5bufsq", "5budzo", "5bufsq", "5budzo", "5budzo", "5budzo", "5budzo", "5budzo", "5btc89", "5budzo", "5bugkd", "5budzo", "5budzo", "5bukkt", "5budzo", "5budzo", "5bubgt", "5bu1u6", "5budzo", "5bspwu", "5bujsp", "5bucyh", "5buupp", "5buupp", "5bv2wl", "5buupp", "5bv13z", "5buupp", "5bufsq", "5bv2wl", "5buupp", "5bufsq", "5bufsq", "5bv2wl", "5bufsq", "5bufsq", "5buupp", "5buupp", "5bufsq", "5bv48l", "5bufsq", "5bv2wl", "5bufsq", "5buupp", "5bu1u6", "5bujsp", "5bufsq", "5btc89", "5bufsq", "5bu1u6", "5buupp", "5buqdh", "5buupp", "5bufsq", "5bu1u6", "5bv48l", "5buupp", "5bujsp", "5bubgt", "5bv2wl", "5busl5", "5bv48l", "5buupp", "5bujsp", "5budzo", "5btwg8", "5bufsq", "5bv4ki", "5bv1ly", "5bufsq", "5bufsq", "5buqdh", "5bufsq", "5bufsq", "5buspg", "5bu1u6", "5bujsp", "5bv2wl", "5busl5", "5bv48l", "5buupp", "5bv48l", "5buupp", "5bu1u6", "5bu1u6", "5bufsq", "5buupp", "5buupp", "5bufsq", "5bujsp", "5bv2wl", "5budzo", "5btc89", "5bufsq", "5bufsq", "5bufsq", "5bufsq", "5bu1u6", "5bufsq", "5bu1u6", "5bu1u6", "5buuvh", "5bufsq", "5buupp", "5bucyh", "5budzo", "5bufsq", "5bufsq", "5bufsq", "5bufsq", "5buupp", "5buupp", "5buupp", "5buupp", "5buupp", "5briy5", "5bufsq", "5buupp", "5bv2wl", "5bufsq", "5bv2wl", "5bv2wl", "5bv13z", "5buupp", "5bv2wl", "5bv13z", "5bufsq", "5buupp", "5bv2wl", "5bufsq", "5bv2wl", "5bv2wl", "5bv2wl", "5buupp", "5bv2wl", "5bv13z", "5bv2wl", "5bvibt", "5bv4ki", "5bvbtp", "5bv2wl", "5bv2wl", "5bv2wl", "5bv2wl", "5bv2wl", "5bv2wl", "5bvibt", "5bufsq", "5bv2wl", "5bufsq", "5bv2wl", "5bvbtp", "5bujsp", "5bufsq", "5bv13z", "5buupp", "5buupp", "5bufsq", "5buupp", "5buupp", "5bufsq", "5bv13z", "5bv2wl", "5bv2wl", "5buupp", "5bv2wl", "5bufsq", "5bufsq", "5buupp", "5bv48l", "5bv2wl", "5bv2wl", "5bv13z", "5bv2wl", "5bv13z", "5bufsq", "5bv2wl", "5bv2wl", "5bv48l", "5bvbtp", "5bv4ki", "5bvibt", "5bv4jz", "5bv4ki", "5btbuo", "5bv2wl", "5bufsq", "5buupp", "5bv2wl", "5buupp", "5bucyh", "5bv2wl", "5buupp", "5buupp", "5bv2wl", "5bufsq", "5bu1u6", "5bufsq", "5bv2wl", "5bvbtp", "5busl5", "5bv2wl", "5bvbtp", "5bv6l0", "5bvb5w", "5bvbtp", "5buupp", "5bvj86", "5bv13z", "5bv48l", "5bujsp", "5bujsp", "5budzo", "5bufsq", "5bvj86", "5bufsq", "5bvj86", "5bvj86", "5bv2wl", "5bufsq", "5bvj86", "5bvj86", "5bv2wl", "5bvkqy", "5bv13z", "5bvj86", "5bvj86", "5bv13z", "5bvj86", "5buupp", "5bufsq", "5bvibt", "5bufsq", "5bv2wl", "5bvj86", "5bvj86", "5buupp", "5bv2wl", "5bvkqy", "5bvibt", "5bufsq", "5bvj86", "5bvkqy", "5bvj86", "5bvj86", "5bvibt", "5buupp", "5bvj86", "5bufsq", "5bvj86", "5bufsq", "5bufsq", "5bubgt", "5bvkqy", "5bvj86", "5bvibt", "5buupp", "5bufsq", "5bv13z", "5bufsq", "5bvrjt", "5bvj86", "5bvj86", "5bvj86", "5bufsq", "5bvisk", "5bufsq", "5bvl9p", "5bvj86", "5bvj86", "5bvj86", "5bvj86", "5bv2wl", "5bvkqy", "5bv13z", "5bvj86", "5bujsp", "5bvj86", "5bvj86", "5bvj86", "5bvj86", "5bv2wl", "5bucyh", "5bvibt", "5bufsq", "5bvj86", "5bvj86", "5bufsq", "5bubgt", "5bvibt", "5bvj86", "5bvibt", "5bv2wl", "5bvj86", "5bvrjt", "5buupp", "5bubgt", "5bvkqy", "5bufsq", "5bufsq", "5bvl9p", "5bufsq", "5bufsq", "5bvj86", "5bvj86", "5bvj86", "5bvj86", "5bu1u6", "5bv13z", "5bv2wl", "5bvibt", "5bufsq", "5bvj86", "5bvbtp", "5bv2wl", "5bw7ih", "5bufsq", "5buupp", "5bv2wl", "5bvj86", "5bw2ff", "5bv2wl", "5bvj86", "5bv13z", "5bw2ff", "5bv13z", "5bv2wl", "5bucyh", "5buqdh", "5bv2wl", "5buupp", "5bvxtz", "5bubgt", "5bw3rs", "5bv13z", "5buupp", "5bvj86", "5bw2ff", "5bvz5b", "5bv2wl", "5bvj86", "5bv2wl", "5bv2wl", "5bv2wl", "5bv2wl", "5bv2wl", "5bv2wl", "5bufsq", "5buupp", "5buupp", "5buupp", "5bw2ff", "5bv2wl", "5bvz5b", "5bw2ff", "5bv2wl", "5buqdh", "5bv2wl", "5bv13z", "5bv13z", "5bufsq", "5bw7ih", "5bv13z", "5bv13z", "5bv2wl", "5buupp", "5bv2wl", "5buupp", "5bvrjt", "5bu1u6", "5bufsq", "5bvj86", "5bw2ff", "5bucyh", "5bv2wl", "5bv2wl", "5bw2ff", "5buupp", "5buupp", "5buqdh", "5bvibt", "5bvj86", "5bw50i", "5bvz5b", "5bw3rs", "5bujsp", "5bv2wl", "5bubgt", "5bufsq", "5bufsq", "5bv2wl", "5bufsq", "5bvxrs", "5bw3rs", "5bw5jq", "5bvypd", "5bvj86", "5brk9s", "5bw2ff", "5bw2ff", "5broap", "5bv2wl", "5bufsq", "5bw2ff", "5buhvi", "5bvj86", "5bufsq", "5bvj86", "5buupp", "5bvy5n", "5bvkqy", "5bwcax", "5bwdrp", "5bwcax", "5bwkrv", "5bw7ih", "5bv2wl", "5bw7ih", "5bwcax", "5bwcax", "5bwdrp", "5bufsq", "5bwdrp", "5bufsq", "5bufsq", "5bw7ih", "5bw7ih", "5bv2wl", "5bwdrp", "5bwdrp", "5bw7ih", "5bw7ih", "5bv13z", "5bw7ih", "5bv2wl", "5bwdrp", "5bw7ih", "5buupp", "5bw7ih", "5brn5a", "5buupp", "5bw7ih", "5bwdrp", "5bv2wl", "5bv2wl", "5bv2wl", "5bv2wl", "5bv13z", "5bw7ih", "5bw7ih", "5bwcu2", "5bwjqg", "5bw9mk", "5bwlom", "5bwh9q", "5bw7ih", "5bv2wl", "5bwdrp", "5bwk2h", "5bv2wl", "5bw7ih", "5bujsp", "5bw7ih", "5bv2wl", "5buupp", "5bw7ih", "5bv13z", "5bwawc", "5bujsp", "5bw7ih", "5bw7ih", "5bv2wl", "5bw7ih", "5bw7ih", "5buupp", "5bwawc", "5bwcu2", "5bwb6b", "5bwdrp", "5bucyh", "5bv2wl", "5bv2wl", "5bwdrp", "5bujsp", "5bw7ih", "5bv13z", "5bv13z", "5bw7ih", "5bwcu2", "5bwjqg", "5bv2wl", "5bv13z", "5bw2ff", "5bw7ih", "5bwjqg", "5bwcax", "5bwkx9", "5bw9mk", "5bucyh", "5bwh9q", "5bv13z", "5bwj2k", "5bvj86", "5bwamd", "5bwhip"]}