{"comments": ["We really missed out on a Bernie presidency. ", "PSA:For people who are just getting to the polls or going later on the west coast make sure that you pass along to those around you that they don't have to go home after official closing time if they haven't voted yet. If you're in line by then you get to vote! Also ignore all polling data today until after you have voted! Some people might even try to tell you a certain candidate has already won to try to get you to go home. Ignore them and cast your vote! \n\n", "'Enough of *votes*' they sadly spoke,  \n'Enough of damned debate.  \nElections fought with shady folk,  \nIn vitriol and hate.\n\n'Enough of countless lies ahead,  \nWith every empty vow.  \nAt least it's *done*,' they sadly said -  \n'At least it's *over* now.'\n\nBut all the hate,  \nand all the doubt,  \nAnd all the spite and fear -  \nAnd all the awful words were out  \nFor everyone to hear...\n", "hold me im scared", "4 years ago I was waiting in line with my girlfriend when they had announced Obama the winner. Lol", "A message from a Canadian: We're actually not real you can't move here. ", "bleach", "Since I know this is what y'all want: [The Guardian's animated results tracker](https://www.theguardian.com/us-news/ng-interactive/2016/nov/08/us-election-2016-results-live-clinton-trump?view=map&amp;type=presidential)\n\nEdit: Corrected spelling. No officer I have not been drinking this evening", "One from the live thread:\n\"Preliminary exit polling from Florida suggests 39% of the electorate will be people of color. This compares to 2012 when the electorate was 33% PoC.\"\n\nIf that's close to true, this is over. ", "Why can't vote-by-mail become more of a thing? I voted from my bed. No lines. No hassle.", "No bonkers. No bonkers. You're the bonkers.", "One day Donald Trump is going to look a reporter straight in the eye on national TV and say \"I never ran for President.\"", "It's weird that if Hillary wins I won't even be able to consider the historic implications of the first female president.  All I will be able to think of is how much of a bullet the country dodged by not electing Trump.", "First polls are closing = time for my first drink of the evening!", "I tried to explain what's going on to my three year old and after careful consideration of the facts she decided she wants Hillary Clinton to be the princess of America.", "The whole rest of the world watching us right now like we're the drunk guy at the party who keeps threatening to do a backflip off the roof. ", "[IT IS TIME!](http://i2.kym-cdn.com/photos/images/original/001/180/493/520.png)", "So CNN is saying Kenucky is going to Trump\n\nSky is blue but good to know", "I'm going to bed. Wake up and find out if nukes r airborne or not...... ", "I love that if Clinton wins Florida I can stop worrying because the election is over.", "Dear Real Republicans\nAs a Democrat, I truly miss you. First you were co-opted by the Tea Party, and that ultimately led to where you are today, with a madman as your nominee. \n\nHere's to hoping you moderates fight back and boot these nutjobs out of your party. ", "shh bby is ok", "The biggest issue in my newsfeed right now is that a lot of people's polling places didn't have stickers. People are not pleased ", "A little girl on a bus just saw my sticker and said \"Who did you vote for?\" I paused a bit cause it's kind of a rude question on a packed bus, but I told her \"Hillary Clinton.\" She smiled so huge and say \"YAY!\" What a messed up election, but that little thing at the end made me feel pretty good.", "Please don't do anything silly America.\n\n~Signed Brits who have already done something pretty silly this year \n\nEdit: God fucking damn it!", "These Americans are crazy\n\nI hope they don't screw up\n\nHoly fuck do I like maple syrup\n\n-- my shitty haiku", "So you're saying you don't want people to come across your southern border? I would think a particular demographic would support your stance on that.", "Wow. 28% are ok with Trumps treatment of women.", "Alabama exit poll:\n\nTrump      18%\nClinton     3%\nSaban      79%", "Bleach", "*'there were two polling officials that were asking him to leave'*...LEAVE??? He should have been arrested as that's a Federal crime.", "did you stay and vote ?", "Please Florida.", "Florida man this is your time to shine. Dont screw this up.", "What's everyone drinking? ", "C'mon Florida don't fuck it up this time!", "There's a religious republican bloc who literally believes that Hillary is Satan. ", "Virtual hold ", "&gt; “I could’ve voted but when they pulled that crap, I didn’t want to vote,” Alvin said. “We could’ve gone to Sheboygan, but it’s just the idea of it – to pull that crap, when she has a picture ID, what more do you want?” **He blamed “the damn Republicans,” who he said, “don’t want Latinos and old people to vote.”**\n\nThis is a different person in the article but it still involves this voter suppression crap. \n\n&gt;Margie and Alvin Mueller, who are 85 and 86-years-old, went to vote early in Plymouth, Wisconsin. They’ve been married for 64 years, have lived in the same house since then and always vote at the same place. But Margie’s ID was not accepted because her driver’s license is expired and she no longer drives. Election officials said she had to get a new ID in Sheboygan, which is 25 minutes away. Margie is a cancer survivor who’s in between radiation and wasn’t up for the trip. “When you’re 85, I guess you don’t count anymore,” she said. Her husband was so angry, he decided not to vote, either.\n\nThis is the backstory of the husband of the first quote. Love seeing the failure of voter suppression.", "As a woman this is terrifying. Scratch that, as a human being, that is terrifying.", "This needs to be a sticky / on top. ", "If Florida screws the pooch again can we swap their statehood out for Puerto Rico? ", "Im not going to stop worrying until the electoral college votes. I will probably allow myself to stop holding my breath though", "#NeverTrump\n\nCome on America let's go!!", "They like people who don't get caught. ", "Early Exit Poll Roundup from the networks\n\n- 54% of voters approve of President Obama (45% disapprove)\n\n- 18% Under Age 30 (54% Clinton 34% Trump)\n\n- 17% Over Age 65 (45% Clinton, 52% Trump)\n\n- 31% Republican\n\n- 38% Democrats\n\n- 37% Favorable opinion of Trump\n\n- 44% Favorable opinion of Clinton\n\n- 61% Unfavorable opinion of Trump\n\n- 54% unfavorable opinion of Clinton\n\n- 32% say Trump is honest and trustworthy\n\n- 38% say Clinton is honest and trustworthy\n\n- 40% support border wall\n\n- 54% oppose border wall\n\n- 52% College graduates (50% of voters) for Clinton \n\n- 40% College graduates (50% of voters) for Trump\n\n- 87% voters decided before last week\n\n- 75% of voters decide before last month\n\n- 52% economy most important issue\n\n- 22% supreme court most important tissue\n\n- 49% criminal justice system is unfair to African Americans\n\n- 69% of voters angry/dissatisified with federal governemtn\n\n- 27% liberal voters\n\n- 70% white\n\n- 12% black\n\n- 11% latino\n\n- 4% Asian\n\n- 3% Other Race \n\n- Black voters 87% clinton, 8% Trump\n\n- Hispanics voters 65% Clinton 27% Trump\n\n\n", "Can we all agree that garlic bread is one of the best foods ever?", "Then why aren't they voting Hillary", "Can you not just open more polling stations? Having a long queue to vote doesn't seem right.", "As a Kentuckian I proudly flew my hot dog down the proverbial hallway that is voting democratic.\n\n....aaaand bourbon time.", "Cartoon Network", "&gt; College graduates (50% of voters)\n\nThat's got to be some kind of high watermark.\n\n&gt; Black voters 87% clinton 8% Trump\n\nHoly shit, Trump got 8%?!", "And it begins! Get the popcorn ladies and gents! Don't worry about the salt, we're about to have quite a bit of it!", "Well.... the system is rigged.. Did y'all already forget about Bernie? How he never stood a chance because the system was against him? Saying the system isn't rigged is just plain ignorance.", "Ok for real though when do we start getting election results cause I'm gonna throw up.", "\"My skin seems to have sloughed off while I slept...\"", "I'm so fucking scared.I'm not even American.I'm just terrified what's going to happen to our world. ", "I'm calling both Kentucky and Indiana for Trump. Shocking I know.", "Make sure to join in your home state's discussion thread!\n\n* **State Links:** [Alabama](https://www.reddit.com/r/politics/comments/5bri47/2016_election_day_state_megathread_alabama/) [Alaska](https://redd.it/5brhkd), [Arizona](https://www.reddit.com/r/politics/comments/5brigl/2016_election_day_state_megathread_arizona/), [Arkansas](https://www.reddit.com/r/politics/comments/5brims/2016_election_day_state_megathread_arkansas/), [California](https://www.reddit.com/r/politics/comments/5briy5/2016_election_day_state_megathread_california/), [Colorado](https://www.reddit.com/r/politics/comments/5brj2k/2016_election_day_state_megathread_colorado/), [Connecticut](https://www.reddit.com/r/politics/comments/5brkpa/2016_election_day_state_megathread_connecticut/), [Delaware](https://www.reddit.com/r/politics/comments/5brj7j/2016_election_day_state_megathread_delaware/), [Florida](https://www.reddit.com/r/politics/comments/5brjig/2016_election_day_state_megathread_florida/), [Georgia](https://www.reddit.com/r/politics/comments/5brjmn/2016_election_day_state_megathread_georgia/), [Hawaii](https://www.reddit.com/r/politics/comments/5brjw9/2016_election_day_state_megathread_hawaii/), [Idaho](https://www.reddit.com/r/politics/comments/5brjzv/2016_election_day_state_megathread_idaho/), [Illinois](https://www.reddit.com/r/politics/comments/5brk9s/2016_election_day_state_megathread_illinois/), [Indiana](https://www.reddit.com/r/politics/comments/5brkdy/2016_election_day_state_megathread_indiana/), [Iowa](https://www.reddit.com/r/politics/comments/5brkin/2016_election_day_state_megathread_iowa/), [Kansas](https://www.reddit.com/r/politics/comments/5brku2/2016_election_day_state_megathread_kansas/), [Kentucky](https://www.reddit.com/r/politics/comments/5brkxo/2016_election_day_state_megathread_kentucky/), [Louisiana](https://www.reddit.com/r/politics/comments/5brl1m/2016_election_day_state_megathread_louisiana/), [Maine](https://www.reddit.com/r/politics/comments/5brl4x/2016_election_day_state_megathread_maine/), [Maryland](https://www.reddit.com/r/politics/comments/5brl8q/2016_election_day_state_megathread_maryland/), [Massachusetts](https://www.reddit.com/r/politics/comments/5brlck/2016_election_day_state_megathread_massachusetts/), [Michigan](https://www.reddit.com/r/politics/comments/5brlfg/2016_election_day_state_megathread_michigan/), [Minnesota](https://www.reddit.com/r/politics/comments/5brlir/2016_election_day_state_megathread_minnesota/), [Mississippi](https://www.reddit.com/r/politics/comments/5brln8/2016_election_day_state_megathread_mississippi/), [Missouri](https://www.reddit.com/r/politics/comments/5brlqc/2016_election_day_state_megathread_missouri/), [Montana](https://www.reddit.com/r/politics/comments/5brlv8/2016_election_day_state_megathread_montana/), [Nebraska](https://www.reddit.com/r/politics/comments/5brlz4/2016_election_day_state_megathread_nebraska/), [Nevada](https://www.reddit.com/r/politics/comments/5brm2j/2016_election_day_state_megathread_nevada/), [New Hampshire](https://www.reddit.com/r/politics/comments/5brm69/2016_election_day_state_megathread_new_hampshire/), [New Jersey](https://www.reddit.com/r/politics/comments/5brmbt/2016_election_day_state_megathread_new_jersey/), [New Mexico](https://www.reddit.com/r/politics/comments/5brmg3/2016_election_day_state_megathread_new_mexico/), [New York](https://www.reddit.com/r/politics/comments/5brmjz/2016_election_day_state_megathread_new_york/), [North Carolina](https://www.reddit.com/r/politics/comments/5brmn1/2016_election_day_state_megathread_north_carolina/), [North Dakota](https://www.reddit.com/r/politics/comments/5brmry/2016_election_day_state_megathread_north_dakota/), [Ohio](https://www.reddit.com/r/politics/comments/5brmxi/2016_election_day_state_megathread_ohio/), [Oklahoma](https://www.reddit.com/r/politics/comments/5brn0s/2016_election_day_state_megathread_oklahoma/), [Oregon](https://www.reddit.com/r/politics/comments/5brn5a/2016_election_day_state_megathread_oregon/), [Pennsylvania](https://www.reddit.com/r/politics/comments/5brnbn/2016_election_day_state_megathread_pennsylvania/), [Rhode Island](https://www.reddit.com/r/politics/comments/5brngz/2016_election_day_state_megathread_rhode_island/), [South Carolina](https://www.reddit.com/r/politics/comments/5brnjd/2016_election_day_state_megathread_south_carolina/), [South Dakota](https://www.reddit.com/r/politics/comments/5brnn0/2016_election_day_state_megathread_south_dakota/), [Tennessee](https://www.reddit.com/r/politics/comments/5brnr8/2016_election_day_state_megathread_tennessee/), [Texas](https://www.reddit.com/r/politics/comments/5brnur/2016_election_day_state_megathread_texas/), [Utah](https://www.reddit.com/r/politics/comments/5brnyn/2016_election_day_state_megathread_utah/), [Vermont](https://www.reddit.com/r/politics/comments/5bro2i/2016_election_day_state_megathread_vermont/), [Virginia](https://www.reddit.com/r/politics/comments/5bro76/2016_election_day_state_megathread_virginia/), [Washington (state)](https://www.reddit.com/r/politics/comments/5broap/2016_election_day_state_megathread_state_of/), [Washington D.C.](https://www.reddit.com/r/politics/comments/5brogx/2016_election_day_state_megathread_washington_dc/), [West Virginia](https://www.reddit.com/r/politics/comments/5brojt/2016_election_day_state_megathread_west_virginia/), [Wisconsin](https://www.reddit.com/r/politics/comments/5broni/2016_election_day_state_megathread_wisconsin/), [Wyoming](https://www.reddit.com/r/politics/comments/5bros6/2016_election_day_state_megathread_wyoming/) and [U.S. Territories](https://www.reddit.com/r/politics/comments/5browb/2016_election_day_state_megathread_us_territories/).", "When you're famous they just let you do it.", "Seriously PLEASE FLORIDA.", "Federal Government steps in to smack that down soon. ", "what flavor?", "From your friends in the UK... Don't fuck this up America.  Please.", "[Aannnd away we go!] (http://i.imgur.com/2bnDCQh.gif)", " Get your streams!\n\n[NBC](https://www.youtube.com/watch?v=deh3phE97ok)\n\n[CBS](http://www.cbsnews.com/live/)\n\n[ABC](https://www.youtube.com/watch?v=-TTiDlK4vS8)\n\n[CNN](http://www.cnn.com/)\n\n[FOX: Clinton-Focused](https://www.youtube.com/watch?v=bSS0tsCTCJg)\n\n[FOX: Trump-Focused](https://www.youtube.com/watch?v=r1_p6A56ZVI)\n\n[PBS](https://www.youtube.com/watch?v=lL-gicgoCAY)\n\n[Sky News](https://www.youtube.com/watch?v=y60wDzZt8yg)\n\n[CBC News](https://www.youtube.com/watch?v=Mkb3oFIFAXc)\n\n[Telemundo](https://www.youtube.com/watch?v=T33j-7Qr_hk)", "I voted. My first election!", "and if clinton hadn't cheated they would have been right", "Ana Navarro just spat wildfire", "America is truly a great country! We've endured the Great Depression WW2, the Vietnam War, both Iraq Wars, the Great Recession, and Trumps 2016 campaign.", "The irony of course is that O'Keefe has probably done more to mobilize Black voters than anyone else the law of unintended consequences makes him a huge liability for the right wing.", "NyQuil on the rocks. ", "i want to apologize for crying wolf about mccain romney, even george w bush &amp; dole.... trump really is going to lead to the end of the world. this is the most important election, all those others were just make believe.. i'd vote for mccain or romney in a heartbeat compared to donald.. sorry for crying wolf. ", "He did have an id which worked in previous years.\n\nThe constitution also guarantees you a vote and it does not mention any ids.\n\nYou do realize that voter id laws are put in place to solve a problem that does not exist.   In person voter fraud happens at a rate of less than 100 votes per billion votes cast.\n\nBut im sure facts and reality mean jack shit to you\n\n\n", "Ooh! a Sprog poem early! \n\nCan you do one from Canadians perspective?!", "I hope their Kentucky lead gives T_D the delusional idea that they're winning bigly. Makes the meltdown all the sweeter.", "Probably republicans trying to suppress voters again. They know college kids are very liberal and can be easy targets.", "I sure as hell wanted a fucking sticker. Disappointed.", "If this holds until polls close at 8 pm Eastern yes, Clinton is 45.", "Wow! I saw a sprog poem in real time!\n\nWe are truly blessed on this day.\n\nExcept for all the other stuff.", "Reminder: There was a 99.6% chance Trump would win Kentucky\n\nReminder: There was a 97.5% chance Trump would win Indiana", "Voter id laws doing what they were intended to.\n\nStopping left leaning voters from casting their ballot.\n\nThe GOP is the cancer of this country", "Bernie's my only living political idol. He's yet to say anything I full on disagree with.\n\nGive Trump hell America.", "Yeah this.\n\nObama really is kind of a miracle. He's so self-controlled (like, compared to an average human)... dude is ice cold, and he has to be. If he ever showed the tiniest flare of anger (at least during his initial electio), it would have scared the fuck out of so many people.", "Because they don't want people to vote. By guaranteeing polls are only open during working hours only people who can afford to take a day off can vote and poor people can't.\n\nedit: I voted", "He and Elizabeth Warren have significant power as 2 of the top Democrat fundraisers.", "yeah its almost like 'first female president' is forgotten among the relief of Trump losing this election", "[\"Mr. Trump the results are in...she won...\"](http://i.imgur.com/b5OskSK.jpg)", "Tonight I'm drinking some nice tequila.\n\nIf Hillary wins, it's a toast to the historic Hispanic coalition that swatted down Trump's disgusting vision of America.\n\nIf Hillary loses, well, then I just want to get fucked up.", "I'm a white college educated male and didn't need to think twice about voting against Donald Trump. ", "This is the last night John King gets to play with the magic wall for 2 years.  Some nights he will try to sneak in to visit it but Wolf is always there to scare him off with a spray bottle full of salt water.", "The fact that these are our available choices is evidence that we  have already done something silly. ", "I voted straight ticket Democrat. First time in my voting career (first vote was '04 Bush re-election) that I voted Democrat. I don't plan on looking back.", "If you read the abstract of the study done about wait times its based on voters per poll worker and voters per machine. So theoretically, urban areas that are mostly dominated by minorities are going to have more voters per machine and per poll worker creating longer lines and wait times. Never mind that their data's wait times in 2006 and 2014 were about 5 minutes apart for all white and all black polling locations. However, in the 2008 and 2012 Obama elections, there was about a 30 minute wait time difference between all black and all white polling location, you also have to take into consideration that those elections saw significantly more minority voters and slightly fewer white voters. But you know, gotta fit the narrative of /r/politics until tomorrow!", "White men have killed 4 cops this week alone. \n\nOf course the only people actually talking about it are black activist. ", "Again let's make it clear: if you are in line before the polls close they are legally required to let you vote.", "And for what? A corrupt woman and a horrible man. Smh...", "I have serious doubts as to how many of these people actually didn't know this compared to how many are just trolls.", "I can't even watch.  This shit is the worst anxiety attack ever.  ", "So you're saying you voted for Trump?", "At least we saw the future of the liberal movement.", "Major population centres haven't been measured in Florida. It's too early everyone calm the fuck down. \n\nSource: Australian with no dog in this fight.", "\"Droves\"\n\n4 people and on 4chan which are probably trolls.", "Stop giving me anxiety Florida \n\nEdit: this shit is a tug of war. ", "It's like most of you have never watched election results. Calm down", "I don't understand...The headline recognizes them as trolls yet the author of this article still fell for their trolling", "Can't believe actual humans would vote for Trump. ", "Election isn't for another 20 days . Wtf esquire!!? ", "Elizabeth Warren 2024 perhaps and hopefully a lot of young people getting elected the next 8 years to build a liberal bench again.", "Dear first time watchers freaking out:\n\nSmaller counties are counted faster and are mainly republican. Major cities = more people = longer time to count.\n\nFlorida ping pong back and forth such was the case in 2000, 04, 08, and 12.\n\nP.S.\n\nIf you're watching as an expat overseas like me, watch your coffee intake cause palpitations sucks.", "Ever since Game 7 of the World Series (as a Cubs fan) I've not experienced anxiety.", "They haven't - that's the thing.", "If Florida goes red\nhttp://m.imgur.com/g2r2oHU", "Shouldn't be looked at like a bad thing. Glad other younger people are going out and voting.", "Read: all the time. Big urban areas more often than not vote blue. ", "/pol/ is about 50/50 idiots and trolls so...", "I'm as nervous as a long-tailed cat in a room full of rocking chairs.", "But if you do that minorities and poor people might get to vote, which would be *terrible*!", "Please Florida. Please. I need more alcohol for this.", "Major population centers haven't been measured and it's already a very close tally in Florida. Clintons gonna win it big.", "Bernie could have been a sore lose and given a reluctant endorsement like he gave Bill in 96 but instead he has been Hillary's biggest supporter and worked his ass off traveling the country to bring up turnout. There is literally no one else like you Bernie. It's no wonder you have such high favorables and are America's most liked politician. ", "Don't forget everyone the second most important thing you can do today is order pizza, drink beer, and watch election coverage as you descend into a greasy, drunken embarrassment. It's what the founding fathers would have wanted.", "This thread is a great example of why people really don't need access to the kind of data we have right now. Some of you are overworking your anxiety for no reason.", "Not gonna stop us from circlejerking about how much smarter we are than them", "And Obama was in their eyes, the antichrist. 😂", "Fun game ITT: Spot the people who are going through their first election. ", "What's the thing exactly?  This is my 6th election.  Am I supposed to act like I'm too cool for this shit?  When I get to my 7th is that when I have to start acting the inverse of my age and actually make fun of people for being younger than me?  Just wondering how this works.", "To the top!!!!", "Hey it's me ur cousin ", "I tweeted my early vote already.", "Dear friends in America I may not agree with your choice of candidates for political office, but I wish your country all the best and I want it to do well in this world. Good luck tonight from Stockholm, Sweden.", "exit polls for my fridge so far: 1 six pack gone 1 spilled beer. 100% chance for getting drunk", "Jesus I've watched the last two elections online here at home and every time this has happened. People just need to chill, we won't know for hours and hours and next to fuck all of the votes have been counted.\n\nFrom you friend in the future here in Australia, you all need to calm down. Order pizza, crack a cold one and relax. ", "Starting to regret that stein vote.", "It's been suggested that part of the reason there are long queues in some locations and not in others is because of intentional manipulation.  If the person making the decision about the number of polls and the hours they operate knows that people who vote at polls in that district generally vote contrary to their own personal political leanings....then a corrupt and democracy-hating individual would intentionally limit those voting stations to try decrease the number of votes for the opposition.\n\nLots of polling stations open and minimal delay for districts which vote your way.....fewer polling stations and huge lines for those voting for the opposition.  The democratic process obstructed.", "Yea. I think people are really missing out on this one...\n\nBernie Sanders is now the most popular politician in America and his newfound fame is already being put to use as a fundraising monster.\n\nHe's here to say, ironically, because the Democrats cannot afford to lose out on his donations.", "Maybe you used up the nations yearly supply of luck.", "It's depressing to know that educated journalists don't know \"fucking around on the internet\" when they see it. And that they still think Pepe was a racist meme. ", "Lmao", "This is a first election for a lot of people.\n\nBetween people celebrating or panicking it's too early.", "Prediction: the next hour and a half will be everyone panicking before the urban votes come in.", "Well Trump could have been defeated badly, but the crooked Dems nominated Crooked Hillary instead.", "I hate that you have to say \"it's either her\". It's the year 2016 with the amount of knowledge and education we have developed we still can't find a reasonable candidate for the most powerful military nation in the world who isn't corrupt. I was a Bernie fan and had to vote Hillary because of that dumb logic.", "KEY RACE ALERT: Oxygen has been inhaled in Florida.\n\nEdit: Thanks for the gold!", "Too bad he couldn't bring himself not to wage two fucking decade plus long wars based on a fucking lie.", "Like 3 guys on 4chan", "I have but I panic every time ", "Voting in Colorado is so awesome.  I would vote against anyone who tried to change it.  It's just the best. ", "Guess which party suppresses that idea whenever it comes up?", "Fuck Donald Trump", "Comments on reddit are rigged", "It's all up to Broward County ", "You should ", "Fucking misleading title. They say changing your state of residency can screw up your financial aid. Which makes sense. If you are a resident of a state different from where you go to college you should get an absentee ballot. This isn't some republican conspiracy this is a school looking out for it's students. Fuck off OP", "Yet the headline is \"Trump supporter pepper sprays Clinton voter.\" Kinda misleading. ", "4 million so far. It can't be because of his wholesome personality. They are voting against those evil democrats  ", "That's certainly possible. A candidate might lose your state but win the election so even if your state goes 100% for their opponent, it won't matter.", "Trump misspoke at a rally and told people the election was on November 28.", "it's actually kind of sad the number of people who think it would be a good idea to vote for Trump", "Washington. Which is as far as I can tell, Colorado with beaches.", "Wolf Blitzer: \"This just in during the break I took a *significant* bowel movement\" ", "Until you vote that is.", "So gather up your jackets and move it to the exits", "CNN has to hit their daily quota of 100 Key Race Alerts or their funding will be cut ", "I'm in Oregon and it is great.", "Yeah this is pretty typical and transparent 4chan trolling", "This just in: Anxiety medicine sales booming!", "Colorado?  I love Colorado voting. ", "Broward is historically a heavy handed democrat stronghold. I wouldn't worry too much.", "I didn't realize how much I appreciate the establishment until someone threatened to burn it down and blame me among other minorities.", "It didn't start out racist but it was coopted by racists.", "After they've already been scared out of voting natch.", "Georgia being too close to call is a disaster for Trump. ", "Is anyone else baffled at how trump has a single supporter ", "I yelled at my mom to go and do it for me she better have", "*believes anything that's posted to 4chan*", "&gt; and old people to vote.”\n\nThey.... they *don't?* That's absolutely news to me", "It's cool most people fuck things up the very first time they try. \n\n¯\\_(ツ)_/¯", "I'm 21 drinking a Budweiser. There's an \"I voted\" sticker on my shirt. I'm watching the results filter in. I've never felt more American.\n\n\nIt's fucking terrifying.", "Don't worry too much about Florida. The actual numbers show Trump is performing poorly there even though he does currently lead;\n\nhttps://twitter.com/benchmarkpol", "CNN: We have a key race alert... there is no new information in these three very important states.", "Orange?", "*Anxiety sponsored by Florida.*", "Make sure to join in your home state's discussion thread!\n\n* **State Links:** [Alabama](https://www.reddit.com/r/politics/comments/5bri47/2016_election_day_state_megathread_alabama/) [Alaska](https://redd.it/5brhkd), [Arizona](https://www.reddit.com/r/politics/comments/5brigl/2016_election_day_state_megathread_arizona/), [Arkansas](https://www.reddit.com/r/politics/comments/5brims/2016_election_day_state_megathread_arkansas/), [California](https://www.reddit.com/r/politics/comments/5briy5/2016_election_day_state_megathread_california/), [Colorado](https://www.reddit.com/r/politics/comments/5brj2k/2016_election_day_state_megathread_colorado/), [Connecticut](https://www.reddit.com/r/politics/comments/5brkpa/2016_election_day_state_megathread_connecticut/), [Delaware](https://www.reddit.com/r/politics/comments/5brj7j/2016_election_day_state_megathread_delaware/), [Florida](https://www.reddit.com/r/politics/comments/5brjig/2016_election_day_state_megathread_florida/), [Georgia](https://www.reddit.com/r/politics/comments/5brjmn/2016_election_day_state_megathread_georgia/), [Hawaii](https://www.reddit.com/r/politics/comments/5brjw9/2016_election_day_state_megathread_hawaii/), [Idaho](https://www.reddit.com/r/politics/comments/5brjzv/2016_election_day_state_megathread_idaho/), [Illinois](https://www.reddit.com/r/politics/comments/5brk9s/2016_election_day_state_megathread_illinois/), [Indiana](https://www.reddit.com/r/politics/comments/5brkdy/2016_election_day_state_megathread_indiana/), [Iowa](https://www.reddit.com/r/politics/comments/5brkin/2016_election_day_state_megathread_iowa/), [Kansas](https://www.reddit.com/r/politics/comments/5brku2/2016_election_day_state_megathread_kansas/), [Kentucky](https://www.reddit.com/r/politics/comments/5brkxo/2016_election_day_state_megathread_kentucky/), [Louisiana](https://www.reddit.com/r/politics/comments/5brl1m/2016_election_day_state_megathread_louisiana/), [Maine](https://www.reddit.com/r/politics/comments/5brl4x/2016_election_day_state_megathread_maine/), [Maryland](https://www.reddit.com/r/politics/comments/5brl8q/2016_election_day_state_megathread_maryland/), [Massachusetts](https://www.reddit.com/r/politics/comments/5brlck/2016_election_day_state_megathread_massachusetts/), [Michigan](https://www.reddit.com/r/politics/comments/5brlfg/2016_election_day_state_megathread_michigan/), [Minnesota](https://www.reddit.com/r/politics/comments/5brlir/2016_election_day_state_megathread_minnesota/), [Mississippi](https://www.reddit.com/r/politics/comments/5brln8/2016_election_day_state_megathread_mississippi/), [Missouri](https://www.reddit.com/r/politics/comments/5brlqc/2016_election_day_state_megathread_missouri/), [Montana](https://www.reddit.com/r/politics/comments/5brlv8/2016_election_day_state_megathread_montana/), [Nebraska](https://www.reddit.com/r/politics/comments/5brlz4/2016_election_day_state_megathread_nebraska/), [Nevada](https://www.reddit.com/r/politics/comments/5brm2j/2016_election_day_state_megathread_nevada/), [New Hampshire](https://www.reddit.com/r/politics/comments/5brm69/2016_election_day_state_megathread_new_hampshire/), [New Jersey](https://www.reddit.com/r/politics/comments/5brmbt/2016_election_day_state_megathread_new_jersey/), [New Mexico](https://www.reddit.com/r/politics/comments/5brmg3/2016_election_day_state_megathread_new_mexico/), [New York](https://www.reddit.com/r/politics/comments/5brmjz/2016_election_day_state_megathread_new_york/), [North Carolina](https://www.reddit.com/r/politics/comments/5brmn1/2016_election_day_state_megathread_north_carolina/), [North Dakota](https://www.reddit.com/r/politics/comments/5brmry/2016_election_day_state_megathread_north_dakota/), [Ohio](https://www.reddit.com/r/politics/comments/5brmxi/2016_election_day_state_megathread_ohio/), [Oklahoma](https://www.reddit.com/r/politics/comments/5brn0s/2016_election_day_state_megathread_oklahoma/), [Oregon](https://www.reddit.com/r/politics/comments/5brn5a/2016_election_day_state_megathread_oregon/), [Pennsylvania](https://www.reddit.com/r/politics/comments/5brnbn/2016_election_day_state_megathread_pennsylvania/), [Rhode Island](https://www.reddit.com/r/politics/comments/5brngz/2016_election_day_state_megathread_rhode_island/), [South Carolina](https://www.reddit.com/r/politics/comments/5brnjd/2016_election_day_state_megathread_south_carolina/), [South Dakota](https://www.reddit.com/r/politics/comments/5brnn0/2016_election_day_state_megathread_south_dakota/), [Tennessee](https://www.reddit.com/r/politics/comments/5brnr8/2016_election_day_state_megathread_tennessee/), [Texas](https://www.reddit.com/r/politics/comments/5brnur/2016_election_day_state_megathread_texas/), [Utah](https://www.reddit.com/r/politics/comments/5brnyn/2016_election_day_state_megathread_utah/), [Vermont](https://www.reddit.com/r/politics/comments/5bro2i/2016_election_day_state_megathread_vermont/), [Virginia](https://www.reddit.com/r/politics/comments/5bro76/2016_election_day_state_megathread_virginia/), [Washington (state)](https://www.reddit.com/r/politics/comments/5broap/2016_election_day_state_megathread_state_of/), [Washington D.C.](https://www.reddit.com/r/politics/comments/5brogx/2016_election_day_state_megathread_washington_dc/), [West Virginia](https://www.reddit.com/r/politics/comments/5brojt/2016_election_day_state_megathread_west_virginia/), [Wisconsin](https://www.reddit.com/r/politics/comments/5broni/2016_election_day_state_megathread_wisconsin/), [Wyoming](https://www.reddit.com/r/politics/comments/5bros6/2016_election_day_state_megathread_wyoming/) and [U.S. Territories](https://www.reddit.com/r/politics/comments/5browb/2016_election_day_state_megathread_us_territories/).", "Personal story.  My wife is a professor at a large university.  She is not a citizen.   She's Scottish.  This is literally the most personal election ever.   Trump wants to change the h1b visa so she loses her job.  I'm for the first time ever (and I'm 40) im stressing an election.  ", "What a good guy to test the voting system and then the judicial system, and then the prison system.  I am sure he will find them all working well.", "I'm more nervous than a freshly hatched marine iguana sprinting away from Galapagos racer snakes. \n\nEdit: obligatory thank you for the gold and replies guys you made my night regardless of results. ", "That's six months to five years. Enjoy prison dipshit.", "I've voted everywhere from the center of Toronto to out in the middle of nowhere here in Canada and it's never taken more than a few minutes of my time. This sort of shit doesn't happen unless somebody's making it difficult on purpose. ", "Even if Trump doesn't win tonight the fact that the race was this close still seems pretty terrifying.", "\"This election is like if your friends pick dinner and 3 vote pizza and 2 vote \"kill and eat you\". Even if pizza wins there's a big problem.\" @Shvartacus on Twitter", "Test passed the system works", "Remember folks.... even if the Presidential race is decided... you should still vote for your local level reps and your Congressmen. \n\nCongress is arguably the more important election. If you don't like how things have been going look into changing who represents you in Congress. ", "[Florida right now](http://i.imgur.com/O2DZIPI.jpg)", "If a democrat did this /r/the_donald would lose it's mind.", "People 50 years from now will shake their heads and have a hard time comprehending just how many Americans voted for Trump.", "This is way more competitive than it should be. I'm disgusted.", "In his defense we had two DNC chairs removed for going to outrageous lengths to get Hillary an advantage. \n\nTrump had the GOP against him too but at least he had ridiculous opponents so he could easily shine above them. Hillary is a strong candidate and that diluted Bernie's chances too much.", "No matter who wins I think we can all agree Florida can suck a dick", "Do you think they'll let him wear his MAGA hat in his mugshot?", "Ooh topical. ", "Have to say that the Guardians voting map is fucking brilliant.", "&gt; Why can't vote-by-mail become more of a thing?\n\nBecause then more people would vote.", "Over 40% of the country voting for a fascist asshole is not quite the country's proudest moment.\n\nIf he actually wins the US would go far beyond laughing stock.\n\nBush winning twice was embarrassing, but Trump winning would be admitting that the entire country is just a big joke and shouldn't be taken seriously.", "Um... bit late for that.", "As an Australian following closely this is incredible to watch...mostly because it's not happening to us. ", "And tropical", "The gop only wins when voter turn out is low. So they gerrymandering and making voting hard for everyone but certain groups of white men.", "where were you when obamuh wins pressdent\n\ni was sat at home drinking antifreeze when karl rove ring\n\n'romney is kill'\n\n'no'", "Fuck Trump. ", "Kinda hard when no one runs against the incumbent for 12 years straight.", "Warren is going to be 75 in 2024. As much as I'd like it to it's probably not going to happen.", "I can't believe this many people are willing to give Trump a chance.", "When the Trump campaign sends its people they're not sending their best...", "This country is split beyond repair this is gonna be a rough 4 years no matter who wins if people can't come together afterwards.", "How far can one meme go. Tonight we find out.", "ITT: People who haven't watched all the shitty red state electoral votes get called early before...", "It took all of 5 minutes to get my ballot here in Alabama took about 15 to actually cast it because we vote on all amendments to our state ", "Reminder that she can lose Florida and still win soundly. ", "If Ohio defeats Trump we'll forgive them for Harambe ", "I couldn't believe the excuse they make over why we shouldn't make Election Day a holiday. Columbus Day is a holiday I mean come on.", "Dont let the fact that the FBI destroyed Clintons 11 point lead blind you from realizing that Trump looks like Gamabunta from Naruto:\n\nhttps://i.imgur.com/VfDReYL.jpg\n\nhttps://i.imgur.com/yQbwgGP.jpg\n\n", "I'm nervous.", "What bothers me is that while ~71% think he doesn't respect women ~47% still vote for him. For some voters, sexually assaulting women isn't a deal breaker. ", "&gt;They will understand when they see who the Democratic candidate was.\n\nNo...no they wont. They will ask why a woman with 30+ years of political experience is having to prove themself to someone who is at best a mediocre businessman with no experience and at worst a corrupt misogynist.", "https://www.theguardian.com/us-news/ng-interactive/2016/nov/08/us-election-2016-results-live-clinton-trump?view=map&amp;type=presidential\n\nEdit - I think they got it guys. ", "You guys might actually vote a fucking businessman/celebrity TV host in as your president. ", "People need to relax. The rural counties that have lower populations will more frequently go for Trump and will turn in their results more quickly because there's fewer ballots to tally.\n\nThe biggest urban areas in most of the swingy states under scrutiny right now are at around 10-30% reporting- in some cases there's literally over half a million votes left to report, and these counties are in many cases going *heavily* Clinton- by 65-70+%.\n\nSo relax, take a breath, drink a beer and chill out. Nothing's called yet.\n", "Broward county save us from the swamp people in the panhandle.", "A lot of people think troll=anonymous online bully. Not someone trying to be an asshole on purpose for laughs. ", "Embarrasing. When he finally gets a chance to make some actual change with his vote he does nothing. Shame ", "Predicting the guy who just fell on NBC will be a meme", "But on the surface you look calm and ready", "I'm from the deep south. I know some really fucking stupid individuals. ", "Well…. maybe they are.", "They should have. There are still remaining seats to fill and props to pass/turn down.", "She stole him from us.", "People are smart. Groups of people are idiots", "Party before country it seems.\n\nSad.", "She's winning in Ohio atm which would save her ass if she loses Florida. I can't believe its this close. ", "No thanks.  I'll take Tulsi Gabbard.", "Fucking Florida don't you ever get tired of being America's asshole?", "Holy shit I've never been so scared in my life. Florida if you fuck us I swear to god.", "FUCK YES TAMMY DUCKWORTH WON ILLINOIS. FINALLY ILLINOIS IS ALL BLUE IN THE SENATE. THAT'S AT LEAST 1/5 SEATS WE NEED TO RETAIN MAJORITY. Good job, Illinois. That was a no brainer after watching the senate debates.", "One of the most qualified people to ever run? History will blur out all the bullshit micro-controversies and look on her up to this point much more favorably", "They can't lose what they never had.", "Was your polling place dead? I had to fill out a form with my name line up for an old lady to write in on a piece of paper slowly in fancy cursive like some ancient ritual, then go to another place to sign my name and verify my name and address, then I had to wait in line for one of the 5 voting booths to be open, it only took about 15 minutes, but I also went early in the morning when it wasn't too busy.", "Can't wait to hear it!", "Yeah I wish it was her this time. She is brilliant. The 2010 disaster really clobbered the D bench and most of our prominent Gov and Sen are old.", "Southern states are reporting first and they generally break red. The first couple of hours of every national election is pretty much like seeing a shark come right at you before it turns at the last second to eat the guy on your right.", "He's white and male so it's okay.", "so that is 3 separate trump supporters arrested this week for voter fraud and 0 for Clinton\n\nwell at least Trump is winning this contest ", "Even if Clinton wins Trump getting this many votes is fucking sad.", "Lock...him...up!", "The funniest part is he's getting prison time for a vote that doesn't even matter. Absolutely hilarious. What a time to be alive!", "Broward and Palm Beach County still at very low precincts reporting going almost 70% Clinton. There's still a lot of row to hoe here.", "Yeah those locked in states need some political upwelling in their youth.", "When he's literally telling his supporters at rallies to do exactly this (something that's technically illegal and you don't have the RIGHT TO DO in the first place) ... yeah it's his fault. He egged the behavior on.\n\nBottom line, this man had no authority to be pulling people out of line and demanding documentation. His official affiliation with the polling place was exactly zilch.", "Fuck Kevin Durant", "Watching from Canada I keep thinking:\n'America you're fucking it up'\n\nYikes.", "Calm the fuck down.\n\nBroward county cast over 500k votes for Obama in 2012 (67.2%). Still waiting on the majority of the votes to come in. Media loves itself a horse race though.\n\nTo put in perspective most of those counties up in the panhandle have something like 0.3% of the population. Broward county has 10%\n\nProof:\nhttp://www.politico.com/2012-election/results/president/florida/\nCrtl + F Broward\n\nhttps://www.theguardian.com/us-news/ng-interactive/2016/nov/08/us-election-2016-results-live-clinton-trump?view=map&amp;type=presidential\n\n13% precincts currently reported.", "Shoutout to all the Canadian's here", "Haha there are a lot of first timers here, that much is really obvious.", "If someone does attempt to force you to leave you are encouraged to call a voter protection hotline (such as 1-866-OUR-VOTE) or submit a complaint to the Department of Justice (1-800-253-3931).", "Yeah Trump has been nothing but a friend to the Muslim community, and does absolutely nothing to promote violence or people watching the polls for those damn riggers.\n", "AMA request: the dude who just fell on his face right next to the reporter on NBC", "AGAIN. if they fuck us AGAIN", "Likely. But to be fair.... when you live on a tiny island voting on our local council and charter ammendments is probably more important than who gets into the White House.", "Absolutely. Claims in protest that black people are disenfranchised. Decides to not vote and disenfranchises himself.", "Well the rest of the ballot matters a lot.", "God I hate Florida. ", "Texas is blue! Temporarily but it's blue! ", "Is this seriously fucking happening? Can someone explain whether or not Trump is actually far out-performing our expectations?", "Why didn't they make Trump's color on election maps orange??", "Amendment 1 (Solar Energy restrictions) \n\n#FAILED to pass\n\nAmendment 2 (Legalizing medicinal dank) \n\n#Passed\n\nAmendment 3 (Tax exemptions for first responders) \n\n#Passed \n\nAmendment 5 (Tax exemptions for low-income senior, and long-term residents) \n\n#Passed\n\nWe did good tonight folks. \n", "To this day I can't believe the dude that fought McMahon at WWE is this close to be President.", "&gt;unless somebody's making it difficult on purpose.\n\nDing ding ding\n\n\nTook me 3 minutes at a polling precinct in the  outer County. \n\nTook my friends 55 at the precinct in the middle of our campus.", "Tbh the fact that there are even at least one million people who think Trump would be able to run the country is scary af.", "It's not a concession speach it's a \"how they cheated\" speech.", "The thing is that Warren is too smart to want to be POTUS. Unless Clinton somehow oversees a seachange in DC politics what little there is that can be accomplished will come from the Senate rather than the executive branch.", "Right now doesn't look like that's going to happen. Dems only have themselves to blame by running a piss-poor candidate and screwing Bernie out of the nomination. ", "The fucking former chair of the DNC works for Clinton. That's not a strong candidate diluting someone's chances that's corruption. ", "ITS NOT TOO LATE I JUST PHONE BANKED FOR 10 HOURS FOR BERNIE, MATCH ME", "Fuck.", "The fact that its so close is a disgrace.", "As a non american WHAT THE FUCK ARE YOU GUYS DOING??!", "This season finale is definitely delivering.", "This is too close.  ", "Should've been you Bernie, Should've been you.", "As a canadian I kind of feel like Im watching my older brother destroy his life with drugs. I know u hated dad and ran away 240 years ago but cmon man dont do this to yourself. ", "this isn't fun anymore ", "Blue States what are you doing Blue States STOP GOING RED", "How fucking stupid are people? I know its not over but how is this even a competition? What the fuck.", "As an America we are wondering the same fucking thing. This is disgraceful. ", "I'm a Bernie supporter but I lmao at this. ", "But *I don't want to wear an armband...*", "America has been taken over by ignorant hateful white trash. FML", "why are we blaming Trump we should be blaming the Democratic party along with everyone that voted Clinton over Bernie.  putting a non viable candidate that no one trusts or believes in", "I'm sweating right now. This is a very close race so far especially in Florida.", "Is literally every non-American horrified by how close this is? I do not understand any part of what makes Trump something you'd vote for. If you want a reprehensible moron to be your president knock yourselves out I suppose you've earned it.", "Colorado just voted in favor of assisted suicide! Regardless of who wins tonight I feel that we can all agree that this is a timely event!", "1 up vote and I will drink myself asleep tonight. ", "So after all three disastrous debates by Trump after all the negative things that were revealed about him, after all the extensive campaigning Clinton has done, and yet, Trump STILL has a chance to win? THAT IS MINDBLOWING. What is wrong with us. ", "Guys Trump might be the president.\nTHE HOST OF CELEBRITY APPRENTICE IS GOING TO HAVE HIS HAND ON THE NUCLEAR LAUNCH BUTTON.", "How can so many people support trump? I just dont get it", "We now live in a post-fact America. Where reality doesnt matter. You can make up anything get Alex Jones to say it, and half the country fucking believes and shits it all over facebook.\n\nFML.", "Dear everyone who said Bernie can't win so we have to vote Hillary\n\nFuck you.", "Trump is right. He could win by running as a republican b/c they're stupid. Jesus. This is pathetic. ", "Trump represents anti establishment. People are sick of politicians. It was a terrible year to run Hillary", "Goddamnit don't fuck this up America ", "As an outsider did Brexit not teach you NEVER UNDERESTIMATE the silent group that the media doesn't show or shun. ", "Cos EMAILZZZZZ\n\nLiterally worse than hitler those emails are", "And then you see the same shitty people getting voted in to Congress. We always see glimpses of what the liberal movement could be but it always falls short.", "Scared.", "Posted in the last thread but it was at the end of the posting limit and locked - so going to repost it here.\n\nAs much as everyone is interested in the Presidency, the House and Senate are going to control a LARGE part of what happens the next several years. Right now I am seeing \"Re-elected\" over and over again. Re-election to the same congresspeople that have done very little for this country over the past several years.\nAnd we are still on this same merry-go-round it appears. I voted for change today, because I feel the same congresspeople have not done their job. But it isn't going to matter, because people keep voting in these same worthless excuses for politicians.\nI'm ashamed of you America.", "This shouldn't be happening. ", "Well that's unlucky for him because when Trump started the day he was projected with a 28% chance of victory. Now, it's a 54% chance. The Trump centipedes are outperforming and Clinton supporters just didn't show up. Looks like weak voter turnout screws over the Democrats again.", "I want off Mr. Bone's Wild Ride", "Obama is spineless on the drug war.", "One step closer to federal legalization. ", "You mean ended his campaign by winning.", "Absolutely terrifying", "Are we the baddies?", "Donald Trump might end up being the next President of The United States. What the fuck America?", "Ohhhhh not yet you're not, you propagandizing fucks. The breaking point will be when your shit establishment-collaborating mouthpiece of a newspaper goes bankrupt.\n\nWhere will we be without the New York Times to tell us all about Iraq's WMDs? Probably a lot better off. Pull back from the madness? I'D RATHER DIVE INTO IT FACE-FIRST.", "love from germany.", "Wow america youre a joke \n\n-The rest of the world", "I don't understand how this could be legitimate. It proves that this truly is a bipartisan system and it doesn't fucking matter who the candidates are- people will still vote with their party. ", "Every reasonable American is too.", "Dude they showed Trump supporters and Trump non stop for 15 months. He's dominated the media for over a year. ", "you can't really say that yet... they do mostly red states first", "Oh no doubt. What a great team of writers. ", "Yeah red states are red and blue states are blue, but things being close is still sad.\n\n", "If you told me a year ago I'd be in front of my TV with tears in my eyes begging for Hillary to win I'd laugh in your face. \n\nIf you told me it was because President Trump was a very, very real possibility, I'd probably piss myself laughing.\n\nIs this real life? What the fuck is happening? I'm sick to my stomach. ", "Dear friends in America I may not agree with your choice of candidates for political office, but I wish your country all the best and I want it to do well in this world. Good luck tonight from Stockholm, Sweden.", "We're fucked\n", "Sick of your shit rural voters", "I hate this country", "I'm sure the UK is happy they won't look as stupid now.", "Republicans won't let it happen. Not going to give the dems a new Congressman and two new Senators.", "The fact that Trump is doing as well as he is tells you how deeply messed up this country is.", "And a perfect year to run Bernie. Whoops.", "I don't fear a Trump Presidency.\n\nI fear the GOP controlling every branch of government.\n\nI feel like I will watch decades of social progress be washed away before my eyes. I don't care about military foreign policy, taxes, or whatever... but America stands for something in my eyes, and it isn't what the GOP represents. ", "As a Bernie supporter I really don't want to have to say\"I told you so\"...", "wait...what the hell?", "I hope everyone enjoyed that recession we had because if Trump wins we are right back in it starting with the stock market crashing tomorrow. ", "I'm really embarrassed for my country right now", "It was terrible to run Hilary in general", "Feels like America just gave birth and we didn't even know it was pregnant.", "Christ for what, grim reaper? I like the guy too but he's not going to be president at 80.", "For the folks struggling with anxiety:\n\nBreathe in counting four hold for four, out for four, rinse and repeat for ~2 minutes. Reduces production of one of the hormones responsible for anxiety.\n\nSource : Suffer with anx chronically, deal with this shit daily.\n\nAlso recommend turning off the internet and tv for 15 and rocking out for a bit. Recommend \"Whole Lotta Rosie\" cover by steel panther, Aces High (iron maiden, live version of your choice), and Rasputin or Holmgard and Beyond by Turisas.\n", "Go to sleep man we are just going to let you down", "Bernie would have won. ", "Check the exit polls they don't.  They just hate Clinton more.  A ham sandwich would be competitive agianst her. ", "She just better win. This isn't the night I want to say \"I told you so.\"\n\nShe was supposed to be more \"electable.\" Her early wins in primaries in the southern states was supposed to be a huge advantage (though I don't see her doing well there tonight). And she was supposed to help the down-ballot candidates and give us a Democratic senate (which doesn't look like is going to happen).\n\nIf she loses this thing after what she did to Bernie...please for the love of god, don't let me say \"I told you so.\"", "The white trash vote is going to elect Trump.", "A president of a 1st world country that doesn't believe in climate change. That's a lovely image.", "Why is it that every time I hear about colorado it's them doing something fucking awesome?", "Its not going to be a big defeat if she even wins at all. This is how shitty of a candidate she is...she can barely beat Donald fucking Trump let that one sink in. This country bangs the doldrums year after year and then come election time shits their pants. a bunch of uneducated people trying to masquerade as smart and knowledgeable.   ", "r/Politics on suicide watch lmao", "DWS was a suicidal pawn all along.", "European 3:30am. If I sleep in uni, you are to blame Murica.", "As an American WHAT THE FUCK ARE WE DOING!?!?\n\nI'm seriously freaking the fuck out right now.", "I'm trying to figure out what self-respecting woman is OK with Trump as President.", "Is it too late for Obama to issue an executive order to decriminalize weed federally?", "Trump is scaring me. American people are scaring me.", "This is terrifying. People are voting for a man who literally emanates nearly everything a president doesn't stand for. A sexual predator. Proven racist. Lost a billion dollars so definitely not a businessman. He doesn't have any idea what he is doing and has proven it on multiple occasions. How is this even fucking a question anymore?!", "Okay America it was funny at the start you can stop kidding now. Please.", "Considering Hillary is a world celebrity with decades of political relationships around the country it's amazing Sanders did as well as he did. No one else with Hillary's record and positions on the issues would have beaten Sanders.", "I'm freakin out. ", "This is fucking scary now.", "if i'm not mistaken they vote that all the time but only congress can authorize it and they never do.", "I'm so disappointed in America that this is even close. He's an unqualified racist conman.", "Because America never changed still racist women hating pieces of shit and Trump stands for that. Oh well I guess I can still live in fear woo hoo.", "You're fired", "The way this is going Were going to have a republican controlled house, senate and a Republican in the whitehouse. Are you scared yet?", "As a Muslim American I am terrified", "Thank god colorado passed assisted suicide today", "Canada citizenship and immigration site is down.\nhttp://www.cic.gc.ca/ ", "This is the darkest timeline\n\n^^^^^Edit: ^^^^^I'm ^^^^^not ^^^^^changing ^^^^^it ^^^^^to ^^^^^dankest ^^^^^people", "I honestly can't believe Americans are this stupid", "My thought process of the last year:\n\n\"Trumps running for President? Lol\"\n\n\"Wow Trumps the nominee, what evs, he wont win.\"\n\n\"Its Nov 8th tommorow! Time for Trump to get Stumped!\"\n\n\"Fuck.\"\n\n\"Fuck.\"\n\n\"Fuckity fuck fuck.\"\n\n\"Maybe I can move to Canada for the next 4 years...\"\n\n", "This is atrocious. I have never been more ashamed of my country.", "No Hillary and the DNC cheated us out of a Bernie presidency", "Well I'm British and this is all looking heartbreakingly familiar right now. There is something in our societies that's rotten to the core and we have got to start facing it head on. What a mess.", "WELCOME TO BREXIT 2.0", "So a candidate that believes that climate change is a fucking hoax is about to win...\n\nThats juuuuuust great for the world....", "Clinton doesn't seem to be getting support from the working class or agriculture. This is entirely understandable with her support of free trade agreements which screwed over blue collar workers in the rust belt we're witnessing the effects of that. \n\n\nBernie should have been the nominee. His candidacy is not the reason for Trump winning, it's the lack of it which hasn't given these types of voters a viable alternative. \n\nThe Democrats and Clinton supporters were arrogant and didn't make the slightest of efforts to get Bernie supporters on board. Rather, it was a case of \"well she's the nominee so now you have to get behind her\". \n\nNice one, look how it's worked out for you, and for us all. \n\n\n\n", "we cant believe this either", "Are we really about to make a cartoon character our president? Is this real?", "She has California guys.  There's always money in the banana stand.", "Well at least I'm a white male", "If the markets are crashing because your candidates are winning you're doing it wrong.", "Trump is going to win.  Fuck the polls.  Look at the markets. \n\n- The Dollar is down 3%\n- The US stock market is down 600 points\n- The UK stock market is down 300 points\n\nAll in the last 90 minutes.  \n\n**The New York Times has him at 61% chance of taking the Presidency.**", "Michigan and Florida *could you fucking not?*", "so GOP gonna have all three branches of the government.\n\nfuck me.", "Yeah they really shat the bed on this one.   The fucking dnc and media have no one to blame but themselves.   We are also super fucked because the house and senate are staying R.", "I want off Mr. Trump's Wild Ride.", "Guys I'm freaking out. Like, what does Trump have to do for you to not vote for him? Grab her pussy, ban Muslim immigration, 3 am tweets ranting about a FUCKING BEAUTY PAGEANT CONTESTANT, excitement using nuclear weapons, the Mexican Wall, cutting taxes for the top 10 percent.\n\nWHAT THE ACTUAL FUCK, AMERICA?!", "\"Just fuck my country up fam\"\n\n-America, apparently", "I never thought that I would miss George W. Bush.", "I really can't believe that Trump might win. This is disgraceful. ", "Are we really this stupid? REALLY?", "Bernie had the independents on lock. If Bernie had the nomination this would have been a landslide victory. But no, everyone wanted to suicide on Hillary. Fuck the stupid Democrats", "A Trump presidency will ruin everything Obama has done for the past eight years and plunge the world into a recession almost overnight. \n\nFuck. ", "I am shocked at the amount of support for a bigot.", "Will the_meltdown actually be about us? Fuck.", "I'm going to just punch anybody who says they voted for Gary Johnson now.\n\nedit: itt white people talking down on abstract moral principles to a hispanic who's citizen status just got fucking coin tossed.", "I appreciate that polling has margins of error but two errors of this magnitude in one year should prompt some serious reconsideration of both the methodology behind the polls AND the weight we give them.", "1776-2016", "I am embarrassed to be a american ", "Clinton's odds on 538 just tanked from 70% to 55%. Fuck us all.", "I'm already missing Obama", "Yeah I really wish I had prepped for the coming recession.", "Bernie would have destroyed trump in Florida.  \n\nFuck you DWS fuck you right in the face you dirty corrupt pile of garbage.", "Congrats.\n\nYou all get to find out exactly what \"Great Again\" really means.\n\nI remember this feeling. It was the feeling I had when we were about to invade Iraq. I knew it was a mistake but the popular consensus was that it was going to be *so awesome guys*.\n\nEight years later, it was political poison.\n\nAfter four years of Trump, Iraq will seem like a blessing of the highest magnitude.", "All the DNC had to do was put up Bernie as the nominee. Never forget that. ", "He's who America deserves. This is what happens when you have shit education and every politician is corrupt and untrustworthy.", "Even if Clinton wins at this point we as a country should be ashamed that it got this far.\n\nEDIT: Looks like it will probably be the case. A man who denies climate change and will set the progressive movement back 10 years. Mr. Trump, I sincerely hope with all my heart that I'm wrong about you.", "The US isn't a country it's a mishmash of people being pulled down by uneducated fuckheads.", "Holy shit this election is crazy", "Is this  a bad time to say Prometheus wasn't a bad movie", "Lol if dems lose it's 100% because of the antics of DWS the way she \"stepped down\" but still received praise and alocades by Obama and Hillary, and all the other fuckery that took place during the primaries. I voted D down the line in Florida, outside of that presidential bubble. So many smug liberals telling me that Bernie Sanders and all of his supporters didnt need to vote and Hillary would win anyway. Then over the last few days it was just loads and loads of guilt-shaming people to vote for Hillary, because Trump is Lucifer. I still dont know who that clown is running as Vice President. Another idiotic choice when all dems needed to do is select someone actually progressive. Didnt even have to be Sanders. But nope, they had it in the bag, right?!\n\nSo let everyone squirm. It sure looks closer than every media outlet has been reporting over the past 6 months. Maybe if Trump is president, it will at least cause some reform and soul searching within the dem party. And honestly, vice versa with the conservative party. No one is happy with the way our political system is running any more. Im actually glad it's a tight race. And I hope more people vote third party every election until the candidates get better.", "We see your Brexit. And we raise.", "Donald Trump googling “What does the U.S. President do?”\n\n", "holy shit between this and brexit maybe the Australian $ will be worth something by the end of the day. ", "Naw bro dont worry about it just hold your nose from the terrible stench and vote for the establishment favorite.", "Oh my god Please let this be a fucking nightmare. Trump said he wouldn't take using nuclear weapons of the table. Please. I don't want to die in a nuclear war.", "time to move to colorado", "Welp it's time we all stop talking shit and admit that America is not the greatest country in the world.", "I sincerely thought Hillary had it in the bag. I am on the edge of my seat for this it's much closer than most expected. ", "trump just shitposted his way into office... jesus christ. ", "Among other things it's official: we are never allowed to make fun of that comic where Lex Luthor got elected president ever again.", "National Suicide Precention Hotline\n\n1-800-273-8255", "And that's what happens when you put a 'hold your nose and vote' candidate up against a candidate that brings out passion in people. ", "Good god. Global warming. Supreme Court. Healthcare. I have children. This is bad.", "Middle East checking in. How the fuck do you think we feel?", "Responsibility for this entire debacle from the primaries to tonight rests squarely with the DNC and all the rank and file Democrats who wanted their \"annointed one\". \n\nWe could have had progress. We could have had a President who had popular appeal and who garnered support of liberals progressives, independents and moderate Republicans. Instead, it looks like we'll get a mysoginistic egomaniac and a VP who passed a bill in Indiana requiring women to have funerals for zygotes. \n\nI don't even blame Trump or his supporters. They are what they are, unashamed, and at least they are true to their beliefs even if I totally disagree with them. \n\nThe DNC?  They're failures. Losers. They chose party politics over what was best for the country and chose the one candidate who could actually lose to Trump. \n\nNo. This won't be on Johnson, Stein or Bernie supporters. This failure rests with the DNC and all their hack, corporatist members. ", "Lmfao thats hilarious ", "As an American I'll never look at my country the same way again.  ", "This is unsettling ", "I blame the Cubs.", "Help. I'm dying from stress", "So I guess this is how racists felt when Obama was winning. ", "I laughed them off because I thought America was more reasonable than a Trump vote. ", "Don't forget the Supreme Court judge", "What a crazy election where the FBI the KGB, and the KKK all want the same candidate to win", "I'm scared", "\"He tells it like it is\"\n\nI'm tired of hearing people say this. You can't even understand the word salad he spews.", "Missing Grandpa Bernie tonight:(", "[deleted]  \n ^^^^^^^^^^^^^^^^0.9934 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/91306)", "RIP Abortions\n\nRIP me being black in public\n\nRIP non white nationalists\n\nRIP the markets\n\nRIP human decency\n\nRIP foreign relations\n", "Surprising? - Isn't this what the Trumpers were telling us about. That the polls were \"Fixed\". And we laughed them off as delusional. ", "Shaka when the walls fell.", "The berenstain universe is a bad one indeed.", "Donald Trump is like the villain of a movie where the hero is a dog.\n\nEdit: my first gold. thanks!", "Bottom line: people didn't want to admit they were voting for Trump.", "Republican president. Republican Congress. Republican SCOTUS. \n\nFUCK. ", "I'm more afraid of Pence than Trump.", "I see this a lot and honestly I hate Hillary but everyone is so willing to completely ignore how AWFUL Trump is just because they don't like Hillary. I hat to say it but not liking one candidate doesn't mean voting for the man that lied almost every time he spoke during the debates. You literally can't believe a single word that comes out of his mouth without fact checking him. That scares me more than anything well that and people eat his bullshit constantly. I can understand liking certain aspects of Trump but god dam at least fucking admit he's shit too.\n\nEdit: So people seem to think changing my paragraph to talk about Hillary makes since. Well I hate to say it really doesn't. Most people are aware of how shitty she is and I was not saying you shouldn't vote for Trump. I was simply addressing the fact that all the pro-Trump stuff I see berates Hillary and ignores how fucking terrible he is as well. As far as the lying is concerned Hillary lied too but Trump lied almost every time he spoke in the debates. I am also not defending or saying HAIL Hillary I am simply asking Trump supporters to take the blinders off.", "Please don't put some guy who calls Climate Change a hoax into the white house. Thanks the rest of the world.", "Remember this is after all the disasters from the Trump campaign, he did and said every offensive/wrong thing you could imagine, insulted everyone and it didn't matter.", "That's what happens when you nominate so irresponsibly", "i'd love to say this is going to be a wake up call for the dnc but they'll just get shitty at johnson voters and blame them.", "It's happening oh god", "I legitimately wonder just how many people in this country are still regularly exposed to lead...", "Hates immigrants muslims, women, vets, Latino. Bullies and threatens people publicly. And the reward is presidential lead. Fuck this. ", "Fuck 2016", "Good job America.  There goes our health care, there goes our semi-decent relationships with the rest of the world, there goes the somewhat-respectable social progress we somehow made over the past 8 years...", "Is America really a racist country?  Because Trump winning is proving it.", "At least they won't be able to hide behind the bullshit excuse of \"You've never given us a real chance to try it our way\" after this. Which is the only reason morons vote for them because they get nothing but grand promises and whining about how they've been stopped from delivering those promises by liberals.", "but...but.. /r/politics told me that he was gonna lose by a landslide!", "I cannot believe Trump just memed himself into the white house. ", "Don't let Donald Trump winning the presidency distract you from the fact that Hillary Clinton blew a 3-1 lead", "Welp at least I am a straight white guy.\n\nEdit: See!? Gilded because I'm a white dude, its already working!", "Way to go /r/politics your anti-Trump posts really paid off in spades.", "Because she was a shit candidate. ", "Can't be /r/politics told me the exact opposite ", "He didn't let his memes just be dreams. ", "The Democrats should have nominated Bernie Sanders.  Sad!", "Yup. Blame her and the dnc not the american populace. ", "The fate of the world lies with Detroit MI", "Regardless of who you voted for it's a combination of interesting, funny, and sad, that Hillary has made sure every action she's made since 1992 has been carefully calculated with the ultimate goal of eventually becoming president.  At some point in 2014, Trump said \"Fuck it, I'm not doing anything else, I might as well run for President, why not?\" And now he's the one of the verge of winning.", "The story will definitely be voter turnout. I cannot understand how Clinton ends up losing WI MI, and VE.\n\nEdit : VT, sorry. Christ its like I trampled the flag ", "6 million down the drain", "You thought the insanity would end with the election. You thought wrong. That was only the appetizer.", "To all those who arent white hetereosexual, financially stable males:\n\n*May the odds be ever in your favor.*\n\nAnd to all white heterosexual financially stable males:\n\nYall probably fucked too.", "but.. but.. the polls!", "Lmao I can't believe he's about to meme himself into a presidency ", "Don't let Donald Trump winning the presidency distract you from the fact that Hillary Clinton blew a 3-1 lead", "#National Suicide Prevention Lifeline Phone Number\n\n    1-800-273-8255", "The people had a choice between shit and crap...and they chose shit just to throw mud in crap's face.\n\nEdit: TRuMp tower gold! Thank you kind stranger!", "This is the darkest episode of Black Mirror I've ever seen.", "https://twitter.com/bradheath/status/796201122386087936\n\n&gt;Clinton is getting crushed in the counties where unemployment has *improved* most since 2010.\n\nThis is similar to Brexit where people who received the most benefit from EU grants and laws voted to leave.", "Born too late to explore the Earth \n\nBorn too early to explore the universe\n\nBorn just in time for Trump to meme himself dangerously close to winning the fucking POTUS", "I just don't get it man. I don't understand how this many people could go for Trump", "Debbie Wasserman Shultz is going to go down in history as one of the worst party chairs ever. This women has led her party to what is probably going to be a decade of having the smallest amount of power and influence Democrats have had in government in decades. Just 8 years after the 2008 waves.\n", "Don't worry when President Trump does nothing about climate change, Flordia will be the first to go.", "Wonder who the special prosecutor will be...", "Regardless of whether you think he'll be a good president this is shows just how fucked our politics are. Trump had an all but non existent campaign and won based on rallies alone. Literally all you have to do to win a campaign is just tell people the other guys suck.", "*Condemnned us to a Trump presidency.", "At over $125m IIRC now", "/r/politics is such a sweet place to relish this victory :)", "So Trump plans to end gay marriage overturn Roe vs. Wade, end Obamacare, end all our free trade agreements, end NATO, throw out 11 million people and start a trade war with China.\n\nThis is who people voted for.", "So that seriously just happened. Remember how many of us laughed when he announced that he was running for president? And then he won the primaries and we still thought he couldn't possibly win. The only way we could possibly lose is if we picked someone just as unpopular, and we managed to do that. Shoutout to all the Bernie supporters out there, we tried our hardest. We will be the future of this party. ", "Shouldn't of forced Hillary on us DNC. You brought this on yourselves. ", "If anything the HRC followers were confused sheeple blindsided by this.\nWe KNEW this was coming, we knew the media lied and Bernie's nomination was stolen but a lot of people chose not to listen ", "As a female I'm fucking freaked out by this turn. I'm also angry at the DNC for pushing out Sanders. This is ridiculous. ", "The future VP of the United States believes gay people can be \"cured\" via conversion therapy.", "This is JUST like Brexit.\n\nI remember when it happened I was glued to my screen for 6 hours straight till 3am. Reading the forums. Looking at the futures. No one expected Brexit to pass.\n\nThis is JUST like that night.", "People born in the early 1800s is this what it was like when Andrew Jackson became president?", "Dear America\n\nReally?\n\nYours Australia", "I'm glad my Mom is dead. I'm not even joking. She died in 2014. She was a lifelong Democrat who HATED Trump for his birtherism.", "\"O Canada! Our home and native land!\" - America", "Goodbye Roe v Wade and environmental regulations ", "All memes and jokes aside we have voted an oppressive, Muslim hating, ignorant, bigot to the highest office of the land. We deserve whatever happens to us. ", "Anyone who thinks a Trump victory will lead to a progressive revolution is out of their mind.  The court will be conservative for 20+ years.", "This is crazy. No other democratic candidate could have lost to Trump. On another note no \"serious\" republican candidate could have lost to Clinton. We need to do away with the two party system.", "It's more that this many people couldn't go for Hilliary. ", "I want to go back to the Berenstein universe", "What a great series finale of America. I never saw all these twists coming.", "Bleach is my new favorite drink", "We lived in the dankest timeline apparently.", "Consider yourself an idiot if you voted for Clinton over Bernie in the primary.", "Born just in time to witness the rebirth of Fascism", "but but how?? browsing /r/politics in the last mounts told us otherwise in fact there was not a single anti Clinton article on here.\n\nare you sure she was a shit candidate?", "These threads are going through the 5 stages of grief.", "Well she did lose to a \"black muslim socialist\" the last time out and had to cheat to get an advantage over a unknown Jewish socialist so yeah that should have shown how crap of a candidate she was. Trump was literally the only person she could have beaten on the Republican ticket and still lost despite outspending him 7-1 in the last few weeks.", "Nah I think he just ended his presidential campaign by BECOMING OUR NEXT PRESIDENT.", "This is a fucking disgrace.  For the first time in my life I'm embarrassed to say I'm an American citizen. ", "I wonder if the mods will censor the elections outcome because they don't like them.", "\"lol he is le meme! its le funny! xD PEPE!\"\n\nas well as\n\n\"He might be a sexual predator offender, and assaulter, as well as a pedophile going to court for 3 cases of child rape and/or molestation, but that's not as bad as emails!\"", "Legal Weed in Mass.", "They're gonna need it after tonight.", "I can. I'm a liberal and probably would have voted for Clinton - if she *hadn't done the things that Wikileaks revealed.* Those things included rigging the primaries against Sanders, collusion with our supposedly free press to give her a debate advantage, and accepting money from known state sponsors of terrorism.\n\nShe was just too dirty for any liberal with an intact moral system to support.", "Here's hoping Obama declares martial law and seizes a third term like grandma always said he would", "This is like when DC isn't selling enough comics so the make Lex Luthor president. Except Lex was at least a competent businessman.", "Maybe the DNC shouldn't have rigged their primary to put such a shitty candidate on the ballot then?", "God help us", "How did we vote for weed and trump?", "All in favor of snapping the DNC's fucking neck and purging the corporate imbeciles who let this happen?", "I remember when /r/politics said Hillary would win ", "First Black President to First President endorsed by the KKK.\n\nlulwut?", "The memes were too powerful", "As a Canadian could you please not.", "Who had the Cubs and Trump 10 months ago?\n\n\nFuck. 2016. Fuck.", "Remember when Bernie Sanders said over and over again that he was the best chance at beating Trump and the DNC fucked him over anyway?  Yeah fuck you DNC.  ", "The DNC was gift wrapped this election with Bernie Sanders against Trump and they absolutely blew it. They deserve this. I've always been blue but fuck em.", "Donald Trump ends his campaign by becoming the President.", "Entitlement. Poor understanding of who/what helped them.", "Dear America\n\nNo really. WTF?\n\nSincerely,\nCanada", "California better fucking legalize recreational marijuana", "If Trump wins then Hillary is the worst presidential candidate ever. The whole establishment is behind her, shes a former first lady, former secretary of state and she still loses to a racist, bigot, bipolar man child. This whole election cycle is fucking insane.", "That is exactly what he did.  Just say everything confuse the populous and they will follow you.  Shepple eh?", "I'm waiting for his report to come out of his review...", "how about the racist white voters who voted overwhelmingly for DJT?", "She's in a better place. Even if there's no afterlife. ", "What message does this send to people - bigotry hatred, intolerance, ignorance, arrogance. This is what won today.\n\nSpare me all the bs about working class taking back America. Take away the email scandal and its a different result. ", "I always wanted to visit the USA. But seeing how around 50% of all the people there think Donald Trump is a suitable candidate for US Presidency I guess I will scratch that forever.", "now that she lost...the mods arent gonna get paid anymore.", "Why is this a thing? He's a corrupt business man what makes you think he won't be a corrupt president?", "I fear for the planet as a whole. if America pulls out of major world Climate agreements there's almost no reason other major countries would stay. Global Warming will get worse, and that will lead to disaster.", "I'm legitimately scared for my rights as a woman tonight. ", "We are about to succeed the first black president of the United States with a president endorsed by the KKK.", "Because Clinton has performed very poorly with working class white Americans.", "The minorities don't deserve what's about to happen to _them._", "/r/politics is disgusting. I don't even live in America but just this sub Reddit alone makes me want to vote trump with the disgusting bias that goes on in here.", "threads are moving so fast no one will see that im gay", "She never stepped foot in WI after primaries combined with Trump promise to overturn NAFTA and TPP."], "links": ["5bwdrp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwcax", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwcax", "5bwcax", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bw7ih", "5bwcax", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwkrv", "5bwmxp", "5bwpja", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwkrv", "5bwkrv", "5bwmxp", "5bwkrv", "5bwcax", "5bwmxp", "5bwmxp", "5bwkrv", "5bwmxp", "5bv13z", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bv2wl", "5bwmxp", "5bwwwj", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bucyh", "5bwmxp", "5bwmxp", "5bwmvi", "5bwmxp", "5bwmxp", "5bwpja", "5bwmxp", "5bwmxp", "5bwwwj", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwpja", "5bwdrp", "5bv13z", "5bwmxp", "5bwdrp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bwmxp", "5bv13z", "5bv13z", "5bx7em", "5bwdrp", "5bx034", "5bx7em", "5bx7em", "5bwdrp", "5bx7em", "5bx034", "5bx7em", "5bx7em", "5bx034", "5bx7em", "5bx034", "5bwdrp", "5bx7em", "5bx7em", "5bx7em", "5bx7em", "5bx7em", "5bx7em", "5bx034", "5bx7em", "5bwcax", "5bx7em", "5bx7em", "5bwdrp", "5bx7em", "5bx7em", "5bx034", "5bwkrv", "5bx7em", "5bx7em", "5bx7em", "5bx7em", "5bx034", "5bx7em", "5bx7em", "5bx7em", "5bx7em", "5bwcax", "5bwdrp", "5bx7em", "5bx034", "5bx7em", "5bx7em", "5bwmxp", "5bwdrp", "5bwdrp", "5bx7em", "5bx6qg", "5bx034", "5bx7em", "5bwcax", "5bx034", "5bx7em", "5bwcax", "5bx7em", "5bx7em", "5bwwwj", "5bw2ff", "5bx7em", "5bwcax", "5bx034", "5bx7em", "5bwcax", "5bx7em", "5bwcax", "5bwcax", "5bx7em", "5bwcax", "5bx034", "5bx7em", "5bwcax", "5bx7em", "5bwdrp", "5bx034", "5bwwwj", "5bx24m", "5bwmxp", "5bx034", "5bx034", "5bwpja", "5bx0ie", "5brjig", "5bx7em", "5bwmxp", "5bwkrv", "5bwmxp", "5bx7em", "5bx7em", "5bxdqp", "5bxjb8", "5bxdqp", "5bwcax", "5bxjb8", "5bxjb8", "5bxdqp", "5bwcax", "5bxjb8", "5bxdqp", "5bxjb8", "5bxjb8", "5bwdrp", "5bxjb8", "5bxdqp", "5bxjb8", "5bxjb8", "5bwcax", "5bxjb8", "5bxdqp", "5bxjb8", "5bxjb8", "5bwcax", "5bwcax", "5bxjb8", "5bwcax", "5bwdrp", "5bxjb8", "5bxdqp", "5bxjb8", "5bxjb8", "5bxjb8", "5bwcax", "5bxjb8", "5bx7em", "5bwcax", "5bxjb8", "5bxjb8", "5bwkrv", "5bxjb8", "5bxjb8", "5bxjb8", "5bxjb8", "5bxjb8", "5bx034", "5bxh2d", "5bxjb8", "5bxjb8", "5bxjb8", "5bxdqp", "5bwcax", "5bwdrp", "5bxjb8", "5bxjb8", "5bxjb8", "5bwdrp", "5bxjb8", "5bxjb8", "5bx7em", "5bxjb8", "5bxdqp", "5bwcax", "5bxat8", "5bwdrp", "5bxjb8", "5bw7ih", "5bxdqp", "5bx7em", "5bxdqp", "5bxdqp", "5bxjb8", "5bwcax", "5bw7ih", "5bxjb8", "5bxjb8", "5bxjb8", "5bxjb8", "5bxjb8", "5bwcax", "5bw7ih", "5bxjb8", "5bxjb8", "5bwcax", "5bxh2d", "5bwcax", "5bxjb8", "5bx7em", "5bxjb8", "5bx7em", "5brjig", "5bx7em", "5bwcax", "5bx7em", "5bxat8", "5bwdrp", "5bwdrp", "5bwdrp", "5bwdrp", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bwdrp", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bwdrp", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxjb8", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bwdrp", "5bxrwr", "5bxrwr", "5bxrwr", "5bwdrp", "5bxrwr", "5bxjpf", "5bxjpf", "5bujsp", "5bxrwr", "5bxrwr", "5bxrwr", "5bxuvb", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bxjb8", "5bxrwr", "5bxrwr", "5bxqrp", "5bxjb8", "5bxrwr", "5bxjb8", "5bxrwr", "5bxqrp", "5bxrwr", "5bxrwr", "5bxrwr", "5bxqrp", "5bwdrp", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5bwdrp", "5bxrwr", "5bxjb8", "5bxrwr", "5bwdrp", "5bxrwr", "5bwdrp", "5bxrwr", "5bxrwr", "5bxjb8", "5bxjpf", "5bxlp1", "5bxrwr", "5bxrwr", "5bwdrp", "5bxuvb", "5bxrwr", "5bxqrp", "5bxjb8", "5bxrwr", "5bxrwr", "5bxrwr", "5bxrwr", "5by3kh", "5by3kh", "5bxyd3", "5by0li", "5by3kh", "5by3kh", "5bwdrp", "5by0li", "5by3kh", "5bxyd3", "5bwdrp", "5by0li", "5bxyd3", "5by3kh", "5bxyd3", "5bxyd3", "5bwdrp", "5bxyd3", "5by3kh", "5bwdrp", "5by3kh", "5bxyd3", "5by3kh", "5bxyd3", "5by3kh", "5by3kh", "5bwdrp", "5by3kh", "5bxyd3", "5bxyd3", "5by3kh", "5by3kh", "5by3kh", "5by0li", "5bxyd3", "5by3kh", "5by0li", "5bwdrp", "5by3kh", "5by3kh", "5bxyd3", "5bxyd3", "5by3kh", "5by3kh", "5bxyd3", "5bwdrp", "5by3kh", "5by3kh", "5bwdrp", "5bwdrp", "5bxyd3", "5by3kh", "5bxyd3", "5by3kh", "5bxyd3", "5by3kh", "5by3kh", "5bwdrp", "5by3kh", "5by3kh", "5bwdrp", "5by3kh", "5by3kh", "5by0li", "5by3kh", "5bxyd3", "5by3kh", "5by0li", "5bwdrp", "5bxyd3", "5bxyd3", "5by3kh", "5by3kh", "5by3kh", "5by3kh", "5by0li", "5by3kh", "5bxyd3", "5bxyd3", "5by3kh", "5by3kh", "5bxyd3", "5bwdrp", "5by3kh", "5by3kh", "5by3kh", "5bwdrp", "5by3kh", "5bxyd3", "5bxyd3", "5bxyd3", "5by3kh", "5by3kh", "5by3kh", "5by0li", "5bygln", "5bygln", "5bygln", "5bwdrp", "5bygln", "5bygln", "5bygln", "5bygln", "5bygln", "5by9gx", "5byhk8", "5bygln", "5bwdrp", "5bygln", "5byhk8", "5bygln", "5by9gx", "5byhk8", "5byhk8", "5bygln", "5by9gx", "5byhk8", "5byhk8", "5byhk8", "5by9gx", "5by9gx", "5bygln", "5by0li", "5bwdrp", "5bwdrp", "5bygln", "5by9gx", "5byhk8", "5by9gx", "5bygln", "5byhk8", "5byhk8", "5byhk8", "5by9gx", "5by9gx", "5by9gx", "5byhk8", "5byhk8", "5byhk8", "5byhk8", "5bwdrp", "5byhk8", "5byhk8", "5by9gx", "5byhk8", "5by9gx", "5by9gx", "5byhk8", "5bygln", "5by9gx", "5byhk8", "5bujsp", "5byhk8", "5bygln", "5byhk8", "5byhk8", "5bycvt", "5bygln", "5byhk8", "5by9gx", "5bwdrp", "5by9gx", "5bxjpf", "5by9gx", "5byakl", "5by9gx", "5byhk8", "5byhk8", "5by9gx", "5by9gx", "5byhk8", "5bujsp", "5byhk8", "5by9gx", "5by9gx", "5by9gx", "5bygln", "5bxdqp", "5by9gx", "5by9gx", "5by9gx", "5by9gx", "5bwdrp", "5byhk8", "5by9gx", "5byhk8", "5byhk8", "5bygln", "5byhk8", "5byakl", "5byhk8", "5bygln"]}