{"comments": ["As usual the Democratic Party manages to snatch defeat from the jaws of victory.\n\nFucking hell. Why the fuck can't they learn their fucking lesson?", "The point of the primaries is to nominate the strongest candidate. Clinton was the DNC's pick for this election 8 years ago. \n\nThey should have just backed off and let the people decide without all the favoritism and scale-tilting.\n\nThis isn't even just about Bernie. There were plenty of moderate democrats who could have run but didn't because everyone got out of Clinton's way since it was \"her turn.\" In the end they nominated the only candidate in the country who could lose to trump 1 on 1.", "Guess we're going to need it. ", "To be fair that kid was not crying he just had his head down. Possibly because he's only 9 yrs old and its midnight.", "I would be too. The SCOTUS is fucked for the next 20+ years.", "The DNC should sit in a corner and think about what it did", "#National Suicide Prevention Lifeline Phone Number\n\n    1-800-273-8255", "Two supreme court judges and god knows how many other appointments with a full congress. America will be right wing for decades to come.\n\nEDIT: Forgot to add how great this was time to make America great again.", "This election is a scathing indictment of our educational system.\n\nEdit: Listen guys. We voted in someone who denies climate change and thinks vaccines cause autism. Who plans on building a border wall when all experts agree that it'll waste money and accomplish nothing. Someones who's tax plans have been evaluated by numerous experts who have concluded that we are heading for a recession if he enacts them. How about instead of calling me arrogant or cocky, you get back to me in 1 or 2 years from now and we'll see how things are going for you, if you are \"winning so much.\"", "But /r/politics told me it wouldn't even be close and Hillary would stomp trump \n\njust like they told me Bernie would win :\\^)\n\nEdit:Whoever gilded me is a dumbass don't give money to reddit ", "r/the_meltdown ", "I'm a Bernie voter\n\nI just came here to say Congrats to Trump supporters who put in so much hard work making dank memes\n\nAnd congrats to Hillary supporters for voting in one of the most unliked and unelectable candidates in the history of this country rather than the man who actually gave a fuck (Bernie).\n\nEither way. Bernie voters get the satisfaction tonight\n\nCarry on with trashing CTR\n\nEdit: For the people asking, no, I'm not happy Trump won, he was a blow to progressive policy and SCOTUS. However! I don't think the world will end with Trump like many on here. Everyone needs to calm down", "Mannnn if only they had a democratic candidate that was well liked, particularly by millennials. You would think a candidate like that would win.\n\nEdit: A few people appear to be taking umbrage with millennials. They overwhelmingly voted in favor of Bernie over Hillary in the primaries. Young voters vote ONLY when they're excited about a candidate. They weren't excited about Hillary. Furthermore, millennials are now the largest voting bloc of voters surpassing baby boomers. Just facts.", "Most ironic subreddit ever? ", "Well obviously since she got the questions in advance. ", "Got to be. I didn't vote for Trump but smugness like that is why he's in this position. ", "Straight white male who don't need no woman here. I'm laughing at the absurdity of Trump leading but crying on the inside. Here's to 4 years of comedic shenanigans and dank memes. ", "The ministry of magic has fallen. The minister of magic is dead. They are coming.", "Especially an anti-establishment candidate who could draw in those votes. Shame there was none.", "Oh I am going to *love* reading this sub for the next week", "Whenever they announce the winner of a new state it reminds me of the Hunger Games when they announce the dead tributes at the end of the day. I swear it's the same exact music.", "Who would have thought a liberal circle-jerk where everyone regurgitates the same feelings isn't an accurate portrayal of the electorate at large.", "This is what happens when you rig primaries. Enjoy the destruction DNC. You brought this upon yourselves.", "Sources say that in stark contrast Trump headquarters crowd has already begun work on a wall. ", "I bet a lot of people have really clever and original jokes about the timing.", "I was born in America to American parents.  How do I get deported?", "Here's hoping he can't affect any actual change and doesn't fuck things up too bad for the next 4 years. ", "CTR has been laid off", "I saw somebody on here earlier today saying to a trump supporter \"i hope you feel dumb after you realize you voted for a meme\". I wonder how he feels now?\n\nEdit: i know how he feels \" damn a meme won the presidency\"", "Fuck the DNC.", "As a Canadian I must say this since [our immigration site has crashed.](http://www.ctvnews.ca/canada/canada-s-immigration-website-crashes-on-election-night-1.3152231)\n\nAs much as we love our American neighbours, one of the reasons we love you guys is because you're *in America*. ^^just ^^kidding, ^^maybe ^^not ^^really, ^^sorry\n\nThis is the curse and blessing of democracy. If you aren't happy with the way it's going, then hopefully your party will learn from this. If you're happy with how this is going, then congratulations! But please remember, one of the few core foundations of democracy is the acceptance of the results and showing empathy for those who aren't the happiest right now. The answer isn't giving up on your country or pointing &amp; laughing at each other.", "He's on his way to having both the house and the senate so he has everything in place to do so.\n\n**EDIT**: Well, house and senate are now republican majorities, Trump got Pennsylvania, and is up 3% in Wisconsin with 98% reporting. Sitting at 265 without Wisconsin called.", "Now Trump has republican house and senate will undo all the wrongs Obama \"achieved\", nominate conservatives to supreme court, build the wall and deport them all just in time for reelection in 2020.", "1. Expected African Americans to show up like they did for Obama\n2. Dismissing all your opponents as stupid uneducated racists\n3. Nominating Hillary Clinton ", "Pro trump article posted in r/ politics???? Wtf is this ", "Trump supporters will obviously cheer and celebrate now and let's let them but the future of this country is looking grim. This election has shown us one thing and that's that we aren't as \"united\" as we'd like to think. This is a divided and conflicted nation.", "&gt;You cannot laugh and be afraid at the same time and the devil cannot stand mockery.\n\nThank you Stephen Colbert for doing your damnedest to keep my spirits up", "/r/the_meltdown. It was intended for lamenting in the tears of Trump supporters but ironically is turning into Hillary supporters melting down. As a Hillary supporter the absurdity and irony is glorious. ", "I love how the CNN anchors are bickering with each other while John King is just silently studying the board in the background ", "American Horror Story: American Horror Story", "And now they are eating their own shit sandwich. I love it.", "Fuck Hillary Clinton.  \nFuck Debbie Wasserman Schultz.  \nFuck the DNC.  \nAnd fuck the media that helped them screw over Bernie. ", "Does anybody know how soon you can sign up?", "Because /r/politics is shit.", "The American people voted Television as president.", "The new national anthem is now the emergency broadcast tone", "Fuck you CNN. ", "Trump is like the Boaty McBoatface of presidential candidates. ", "Lmfao.  Truth be told.", "i was watching the Daily show and i forgot the female guests name but god damn it was sad seeing her like that she looked like she found out her mother died on the phone. fuck man i know this is generic to say but it really does sucks.", "Trading suspended on S&amp;P and Dow futures markets because they have fallen so far they triggered an automatic stop.\n\nEdit: Thank you kind stranger.", "Bernie had the popular vote hillary fucked it.", "I really don't see why they needed to rig the fucking system aganist Sanders.  He had momentum they should have figured it out. ", "An *artificial liberal circle-jerk financed by a SuperPAC which illegally colluded with a criminal and failed presidential candidate.", "For the first time in nearly forty years I don't feel safe in my own country.\n\nedit: Nothing great comes at your countryman's expense.", "Well to be fair, /r/politics could not have foreseen the stupidity of the American people. I have read Trump's awful book from last year, followed his rallies and amazingly poor debate performances—and yet this snake oil salesman will win the presidential election? Christ! You Americans just elected the caricature of a pathological narcissist, a cartoon villain. It is surreal to say the least.", "I don't blame them. I would've done the same thing.\n\nI'm putting this election outcome on the voters not on Clinton. She owned Trump in every single debate, and her policies actually made sense.", "I am German and I just woke up. Are you fucking kidding me???", "I don't think you understand. Donald Trump is going to be our president. Donald Fucking Trump. People on the losing end say it every year but this year, Donald Trump is truly going to run our country to shit. This man is a hatred-filled, bigoted man who is completely unqualified to run the United States and will run it into the ground. ", "I would if I didn't have to live it too.", "On the other hand this was definitely Hillary's only chance. If she couldn't win against Donald Trump, then she's apparently unelectable. Despite voting for her, the part of me that voted for Bernie in the primaries is certainly feeling vindicated. This is what happens when the Dems put up a candidate who drew most of her primary support from deep-red states. ", "it wasn't his turn though!", "But huffington post and buzzfeed!", "4  years? He's going to install 2-3 SCOTUS justices. They don't have terms.", "I am none of those things and I am very afraid. ", "have moved on from anxiously waiting and have decided to just get drunk. i feel much better", "well he said he woudl do it.  if people didnt want that they would have voted against it.  People want mass deportation.  People want the wall.  People want trade tariffs and tax breaks.  Give it all to them.  Let them live with it.", "&gt; Why the fuck is she losing?\n\nBecause she is a shitty candidate and stole the nomination from bernie. If people didnt blindly follow corrupt hillary and bernie was the nominee this wouldnt be happening", "The rust belt went for a guy who got his steel from China?", "Honestly though this is a huge loss for every prediction algorithm, every analyst, and every pollster in the country. I voted Clinton, but it's kind of amazing how wrong everyone was. ", "Ha. He'll have control of the Senate the House, and he gets to appoint the tie breaking SCOTUS judge. This is going to be the most conservative moment in recent US history. He'll have free reign. Get ready. It's going to be fucking terrible. Bye bye climate agreements. Hello Guantanamo!", "I'm too depressed to masturbate and trust me that never happens.", "How must Hillary Clinton feel knowing she's about to lose to Donald fucking Trump way to go DNC, even with a softball opponent you couldn't pull it off. It should have been Bernie, hopefully they'll learn from this to give the American people the candidate they want. ", "hahaha\n\nI have watched this subreddit shill at a fever pitch for months now\n\nWhich makes your tears so much tastier", "#Once again more importantly, Canadian Immigration Website\n\n    http://www.cic.gc.ca/english/index.asp\n\n**EDIT: IF ANYONE IS ACTUALLY FEELING SUICIDAL FROM THE RESULT OF THIS ELECTION: PLEASE [CLICK HERE](https://www.reddit.com/r/SuicideWatch/wiki/hotlines) TO GET HELP!**", "Poor you. The majority of the country does not feel the way you do apparently..", "Same story as with Bernie in the primary. People REALLY dislike Hillary. The DNC shouldn't have interfered in the primary.", "Clinton supporters have no one to blame but themselves; as they and they alone, voted for a candidate in the primary under ongoing criminal investigation.  Um, the primary is made explicitly to weed candidates like this out.  What were her primary voters thinking?  Were they fooled by her bullshit‽  Were they utterly uninformed on the reality of Clinton's legal problems?  Americans simply aren't going to go for Grandmama Nixon even if the alternative is a fascist nincompoop.    \n\nThe people to really throw shade on tonight are Clinton primary voters, they are to blame for the coming Trump regime.  ", "Does anyone have the list of actors who vowed to leave if Trump won?", "Ironic since she came from a more working class background while Trump was born a gilded prince of NY real estate.", "CNN map guy is loving this. So much zooming in and out to be done!", "I cannot wait to see the South Park spoof of this. SJWs performing seppuku in the aisles and stands behind Hillary.\n\nedit: a word", "She should have dropped out because she's a terrible candidate. We all saw this coming. Should have been Bernie ", "She should never have ran based solely on her FBI troubles. She should have realised that she screwed up there and it was far too risky to run after that. ", "I've never been so genuinely and thoroughly embarrassed to be an American. ", "the FLOTUS just went from being a double-ivy league educated IP lawyer to an ex-Soviet ~~prostitute~~ mail order bride \"model\" who plagiarized the former's speech\n\nthe party of family values y'all : )\n\nand the president has 4 kids from three diff baby mommas LOL... america = white trash wonderland", "Yes and when it was found out Hillary was being fed debate questions prior to the debate, it was just another stab at her already pathetic credibility. This is on Clinton, not the populace.", "Yay for social regression! It's a good thing I don't have any gay relatives or a sick wife relying on the \"preexisting conditions\" clause of the ACA! Oh wait! JK both those.things are accurate", "No fuck that I will take none of the blame for this. ", "It was obvious but Hillary voters would have called you a \"conspiracy theorist\" if you mentioned she sounded like she was reciting a script... before Wikileaks ", "Congrats to everybody who wanted to blow up the system. You did it. Now see how you feel when it all goes to shit. ", "i dont think were ashamed they were berated and shamed publicly so they kept their mouths shut.\n\nWhen every pro-trump post gets down voted to hell it makes people stop posting pro-trump stuff.\n\nWhen trump supporters are called racist, it makes them stop publicly identifying as a trump supporter.\n\nThe issue is with the way his supporters were handled that created a echo champer of Hilary support.", "You'll wake up with a hangover and President Trump.", "Good. For months and months this subreddit posted article after article calling anyone not supporting Hillary Clinton sexist racist, homophobic, uneducated, white privilege trash regardless if they were voting for Trump or a third party. It was just as bad when people were supporting Sanders in the primary.\n\nYou are the reason why she lost. You insulted people instead of reaching out to them. You downvoted them and mocked them instead of trying to reach out to and connect with them. You belittled and mocked them for having differences in opinion.\n\nThis isn't on just Clinton. ", "Honestly what this vote tells me is that people are so tired of the political elite forcing their candidates on them that they are willing to vote for even someone as controversial as Trump over a pre-approved candidate. Like HRC has the charisma of a potato to not be able to stand up against a man that alienated several voter groups completely. As a non-American that watched the election semi-seriously.", "They pushed us Bernie supporters away.  A lot of us voted for Trump.  Honestly they can all suck it.  This sub was a fucking cancer. \n\n*Thank you for the insults, fellow democrats and progressives.  I live in Illinois which went blue and I wrote in Bernie.  Somehow this is still my fault for her losing the entire midwest. ", "So I'm probably going to get buried here but this is probably the end of Hillary Clinton as a political figure, right?\n\nTrump won't appoint her to anything, and she's tried for a decade and failed to get the Presidency. So she'll probably just get paid to do million dollar speeches now, or what?", "This is funny coming from Washington post of all people. And being posted on this subreddit just adds to that irony ", "She lost the rust belt. The same states she lost in the primary. For the same reasons. The amount of those people who voted Johnson or Stein and not her. The amount of those people who pressed the big fuckit button. The amount of those people who were angry and she never fixed that anger.\n\nI said it during the primaries, and I'll say it again. People are angry. Angry voters vote Trump. You don't beat Trump by being more of the same. You beat Trump by using Anger to form Hope.", "People were really pissed with the status quo. *Really pissed* and all anyone offered them was more status quo except Trump. Even if Trumps answers are nonsense, he at least recognized some of the questions. ", "It all started with /r/Enough_Sanders_Spam those are the most toxic, vile group of people I've ever interacted with\n\neg here was [their sidebar](http://i.imgur.com/EWDoN7e.jpg) when Bernie lost New York", "For today's lesson the word of the day is \"Hubris\".", "We were offered Bernie. The DNC didn't like that and chose Hillary anyway amidst scandal after scandal, people cheating for her in the primaries and all sorts of bullshit.", "Are the record correction people gone? ", "Female Jeb Bush lost. ", "DAE remember all the Clinton people talking about the salt harvest from when Bernie lost the primary? ", "Fuck you WP. You ran 18 negative articles on Bernie in one day during the primaries. You are part of the problem!", "Yeah they fucking should. They fucked Bernie. He would have beat Trump. Now they pay the price. I'm gonna smoke weed and play GTA now fuck politics. ", "I can't believe America has pretty much voted someone who called mexicans rapists claimed Obama was born in Kenya, proposed banning an entire religion from entering the US, mocked a disabled reporter, said John McCain wasn't a war hero because he was captured, attacked the parents of a fallen soldier, bragged about committing sexual assault, was accused by twelve women of committing sexual assault, said some of those women wern't attractive enough for him to sexually assault, said more countries should get nukes, said he would force the military to commit war crimes, said a judge was biased because his parents are Mexicans, said women should be punished for having abortions, incited violence at his rallies, called global warming a hoax perpetrated by the Chinese, called for his opponent to be jailed, declared bankruptcy six times, bragged about not paying income taxes, stiffed his contractors and employees, lost a billion dollars in one year, scammed customers at his fake university, bought a six feet tall painting of himself from money from his fake foundation, has a trial for fraud coming up, insulted an opponent's looks, insulted an opponent's wife's looks, and bragged about grabbing women by the pussy ^\\(lots ^of ^citations ^needed) into presidency.", "Man this wasn't worth it at all. A majority in the Executive Senate, House, and Judicial branch is going to fuck over the lives of so many people. We're gonna go backward on things we gained over these past few years, now. This is just, if people understood what they were trading away for this... man... I'm gonna be fine, y'know? I'm not going to face any of the problems that people I know will face. Idk... it's just, I just feel awful.", "Clinton corporate Democrats wrote off rural voters and their concern about losing jobs to NAFTA 30 years ago. Chickens are home.", "&gt;\"“Everything HRC touches she kind of screws up with hubris” Powell wrote in an email to private equity investor Jeffrey Leeds. “I told you about the gig I lost at a University because she so overcharged them they came under heat and couldn’t any fees for awhile. I should send her the bill.”\"\n\nfrom a leaked email. http://www.huffingtonpost.com/entry/colin-powell-hillary-clinton_us_57d96524e4b09d7a6880bf1c", "This.\n\nPeople who disagreed were marginalized and driven to the extremes. \n\nThey went where their voices could be heard.\n\nEnjoy four years of Trump. It couldn't have happened without you.", "Colorado with legal weed and suicide sounds like the place to be. ", "Four more years of r/The_Donald.\n\nI can't fucking believe it", "I felt like she mocked that anger. Consider the anger of all those who financially backed Sanders. She made no attempt to bring them to her side it was just \"I won, so now you have to vote for me or Trump will win.\" And... that wasn't as strong a threat as she thought.", "With Pennsylvania calling for Trump the race is over. Trump will be the 45th President of the United States of America.\n\nThe American people have elected a President and Vice President that deny climate change, evolution, that endorse the anti-vaccine movement, are anti-choice, anti-immigration and anti-science, to name just a few.\n\nTo my American friends that voted against him and will now have to live through not only Trump, but Pence, a Republican controlled Senate, Republican controlled House of Representatives, and the promised conservative anti-LGBT SCOTUS judge, I am so sorry.", "Bernie would've won", "Let's do a quick review:\n\nTrump just beat HILLARY CLINTON. THE HILLARY CLINTON spent the GDP of a small nation had a president support her, had a former president campaign for her, had Bernie Fucking Sanders campaign for her, managed to beat two heavy scandals, and had the media back her up with polls and nonsense data, AND STILL LOST.\n\nLost to Donald Trump, who was riddled with scandals, barely spent anything, and won handily.\n\nWew lads. The DNC should have chosen a better candidate", "You want something really scary. \n\n- Control of the House\n- Control of the Senate\n- Trump\n- Pence\n- Modern media. \n\nThe Republican Party has the strongest grip on America it has ever had.   Ever.  \n\nIf you are LGBT non-religious, work in science, are an immigrant or liberal; be fucking prepared.  \n\nClimate Change consensus just got kicked into the fucking trash can.  ", "She can still pretty much pick any job she wants from the private sector. But yeah probably done as a politician. ", "This is exactly it.  \n\nThere are a big group of people who are genuinely Trump supporters to their core.  But on their own Trump wouldn't have come close to winning.  \n\nDonald Trump, for a lot of Americans, is the Anti-establisment vote.  \n\nHe's revenge.  ", "You want something really scary. \n\n- Control of the House\n- Control of the Senate\n- Trump\n- Pence\n- Modern media. \n\nThe Republican Party has the strongest grip on America it has ever had.   Ever.  \n\nIf you are LGBT non-religious, work in science, are an immigrant or liberal; be fucking prepared.  \n\nClimate Change consensus just got kicked into the fucking trash can.  ", "2016: Cleveland Cavaliers come back from a 3-1 deficit to win the NBA Finals. Chicago Cubs come back from a 3-1 deficit to win the World Series. The UK passes Brexit. And Trump wins the presidential election.\n\nIt's basically the year of upsets.\n\nEDIT: And Leicester City wins the English Premier League. (Credit: /u/Dhylan18 and /u/RinkyRink)", "Seriously. You don't change people's minds in the booth by shaming them. You change what they'll say publicly or when the pollsters call, but they just turn around and say \"I'll get back at you for this on election day\".. ", "i can just picture Bernie sitting in front of the telly just shaking his head and shrugging his shoulders, saying \"i tried\"\n\nHeart goes out to him. You did try man. Thank you for it.", "Clinton had every damn advantage and lost against a groomed turd.", "If you supported Bernie and then voted for Trump you voted on emotion and not policy. \n\nEdit: \"I'm mad at the establishment\" is not an intelligent policy stance. ", "Bernie was the people's choice. Now Hillary Clinton will be remembered as the woman who lost the democrats the presidency to Donald Fucking Trump. Welp. Well it's bed time I feel a bit sad for women in America but you all didn't really want your first woman president to be a weasily sociopathic plutocratic hypocrite maybe one day we will get a good woman president with integrity and ethics who will actually make the world a better place. I'm actually happy trump is winning because we need things to get worse before they can get better. We needed to hit rock bottom so that the people can unite and truly make America great again. Apathetically voting for another estBlishment plutocrat would be the opposite of that. No matter what bullshit trump and the republicans throw at us we can unite and stand against it, and actually change our country for the better. WEneed to change it. The plutocrat elites won't do it without us making it happen.", "&gt; Now they pay the price.\n\nNow WE pay the price.  I'm with ya on the weed (congrats CA &amp; MA!) gonna boot up Fallout New Vegas and go see what life after several years of President Trump looks like.  ", "He's not the president America needs but the one they deserve", "We literally just saw this exact same scenario play out 6 months ago with Brexit. The arrogance of the DNC is astounding.", "you can downvote me all you want but Hillary and the DNC are completely at fault for this fiasco.\n\nWith all the colluding the DNC did to nominate Hillary and bash Bernie, from leaking questions, to doing everything they could to keep Bernie from earning the nomination, even possibly some election primary fraud.  The DNC did this to themselves.\n\nAdd that Hillary, did everything she could to divide the democratic party and keep pro-Bernie supporters from voting for her.  She ran a terrible election.  She committed many election violations to try and win.  \n\nHell, even the commercials she did, just mad bashing of Trump, until 1 day until election day, then comes out with really her only positive make nice message.  People see thru that BS, that was clearly the most divisive campaign in history, and trying to do that was just disingenuous.\n\nI firmly believe if Sanders had won the nomination like it looks like he clearly deserved to win, he would have been President.  \n\n", "Yes. Now everyone who voted Clinton and supported corruption are now trying to blame the DNC for their collusion. It's glorious.\n\nEdit: On reddit there are more \"fuck the DNC /Clinton\" than there is \"fuck 3rd party\"", "They somehow were worse than the trump people I don't know how", "I hope Bernie drops the act now that he's almost certainly going to be scapegoated and given no seat at the table. I want to see the claws come out!", "**You** backstabbed Bernie chum. Enjoy that thought for the next four years.", "Good job Americans you elected a fucking meme for president ", "That's what the DNC gets for running the most corrupt and disliked candidate in recent history.\n\nSupreme court as well you forgot that.", "It was a change election people were clearly pissed off by the establishment, Bernie was one option, the DNC completely sandbagged him and the \"hell yeah Hillary\" crowd told everyone else to sit down and shut the hell up because it was her turn.   So the ultimate establishment candidate versus some crazy cartoon spouting insane nonsense and the crazy cartoon won because he was the only anti-establishment guy by default.   \n\nI guess people owe thanks to Debbie Wasserman Schultz, Donna Brazille and all those other fantastic folks who marched in lockstep with a clearly compromised, highly polarizing candidate because she deserved her coronation.  ", "I've been in this echo chamber for a while I think things will change now that there is no agenda to be had. I don't see it not being anti trump though. Because there are too many reasons to be anti trump", "South Park is about to be epic.\n\nedit:  Obl. Thx for the gold kind sir I hope tonight's ep makes me as happy as the gilding did.  ", "Honestly  I'm more concerned about the republicans getting control of both the house and senate (and the presidency). There will be no balance.", "She had Sarah Silverman say \"you're being ridiculous\" to them and expected it not to be patronizing. ", " Remember \"she is the most electable candidate\". HAHA", "Superdelegates had it decided before it began.\n\nThey backed the wrong pony.", "You maniacs! You blew it up! Damn you! God damn you all to hell!", "I think people underestimate the effect of healthcare premiums for 2017 coming out in the last week or so. ~50% rate hikes in my area and many others. People are losing their houses paying their healthcare premiums.", "Canadian here just listened to a truck driver talk about how the Clintons are all connected to the Rockefellers and the evil economists and that she doesn't believe in America because she's a lizard person. This is why you have Trump America.\n\nEdit: I could go on and on about all the ignorant, insane things I've heard truckers say, but 9 times out of ten they're American. Sorry, but please invest in education.", "Thank god. I can't believe I had to completely abandon this subreddit for months to get impartial coverage.", "Just decades?\n\nThe GOP is more emboldened than ever and has spent the past several years learning how to press an advantage.", "Legal marijuana is the real winner tonight expecting heavy use throughout the next 4 years. ", "As someone who voted for Bernie in the primaries (but absolutely hated the attitude most Bernie supporters had in the primary) I think the Democratic Party should've paid more attention to what the future generation (millennials) wanted. Sure I voted for Hillary in the election, and so did everyone I could convince. But the people I talked to were never crazy for Hillary like people were for Bernie. \n\nThe fact the entire Democratic establishment went for Hillary before even the debates started was a bad sign that she was not going to get properly tested. It was completely disproportionate to how the voters did vote and made a lot of would be Democrats lose faith in the process.\n\nMy recommendation for fellow liberals will be to do to the Democratic Party what the Tea Party did to the Republican Party. Only when the leaders of the party fears the base will we get what we want. Pushing through a candidate with so much baggage was a terrible mistake and the DNC needs to be punished for it. #PurgetheDNC", "This sub was its own worst enemy.", "Colin Powell fucking hit the nail on the head.", "Wow. Well this was unexpected.\n\nI hope Trump is a better president than I worry he will be (for all our sakes). I hope that I am wrong about him and until he proves otherwise I will give him the benefit of the doubt.", "U.K here.\n\nThe division won't end with this vote. No matter how many people call for \"coming together for the country\" it won't happen.\n\nYou're fucked into being a divided country and this will continue to widen. ", "The DNC will never admit their mistakes. They're still pointing fingers at Ralph Nader.  Nothing is ever their fault. ", "Anybody \"shocked\" by this outcome honestly did not follow Brexit. It was basically the same thing. The attitude at the end was \"haha yea it cant happen\" and yet it does. These polls consistently over-estimate youth turnout", "Wow. What a sad day for America.", "I can't believe this. Dow Futures and the Stock Market are falling more than what 9/11 did from this election. They're actually freaking out more from the chance of Donald Trump winning the election *more than a terrorist attack that killed ~3000 people.*\n\nOn 9/11 the Dow fell 540 points. Earlier it fell around 800 points.\n\nIt's time to stop.\n\nEdit: Okay, I get it, the percentages are different. I don't know much about the stock market but I thought I knew enough that this was worse than 9/11.", "Why am I still awake? This is only making me feel worse ", "Ah fuck I can't believe you've done this", "I got to give it to Trump...he was *way* more active on the campaign trail while Clinton seemed to only do the minimum when it came to public appearances.  Huge mistake.  I hope for the best for the next 4 years but I don't think we'll recover from this for a very, very long time.", "Who would pay her to do a speech now? She has nothing left to sell.", "In a weird fucked up way, we're hoping that the Republican congress we've had for the last 6+years  will be the checks and balances we need...My hopes are not high.", "...And here we are. Congratulations to the half of America that will be celebrating/rejoicing at their presidential choice. To the half that feel this is the end of the world just remember once you hit rock bottom, the only direction left is up.\n\nUnless there's a nuclear holocaust. In which case, up is not such a good idea.\n\nGood night, America. Regardless of the results, the world does indeed keep going, work included.", "Its so funny because they should have seen this coming. The poll booths are private for a reason. This is one of them. ", "Hands down.  Both sides respect him and the independents were all his", "they wanted a president that's not a politician well they're fucking getting one now. ", "But r/politics has been telling me for months that she legit won the nomination. Now the system was rigged? Boy does that sound familiar. ", "Didn't you hear? It's the millennials fault for not voting for her. /s", "My feed is filled with angry democrats cursing third party voters.\n\nLike yeah, Gary Johnson's supporters were totally going to vote for Her..", "You backstabbed Bernie if you didn't vote democratic this election. \n\nBernie Sanders supported Clintons mission and her campaign against Trump completely.", "The Clintons operate as if it's still the 90s and what happens behind closed doors won't affect them. Sad it's cost us the election.", "The funding finally ran out you won't hear that around here anymore. ", "She lost everything except very blue cities.  It's an absolute shamble.  But not to worry the DNC is so corrupt, they will continue screwing up.\n\nAnd after this election the money will drain out, as pulic finds out the depth of DNC corruption.", "The guy who claimed climate change is a product of the Chinese won the US elections. \n\nWe did it guys. We did it.", "http://imgur.com/8IVOWo6", "Just in time to be deported!\n\nEdit: You're all idiots didn't think I needed this but here it is, /s", "&gt; In the end they nominated the only candidate in the country who could lose to trump 1 on 1.\n\nThis nails it right on the head. For all their differences Bernie and Trump had one thing in common: they were both the candidates their respective parties *didn't* want.\n\nMark my words, the largest demographic Hillary will have lost vs projections will be the Bernie voter. The end result will be that they didn't come out for her because they knew their choice was stolen from them.\n\nThe question will be whether the DNC learns their lesson or not. They're already writing themselves a narrative of white voters + bad polling + Russians!, so probably not.", "Wow if only we supported the party with universal healthcare on its platform", "So since Trump is going to replace Obama is Orange gonna be the new Black?", "The entire DNC is still getting paid. They did what they were told to do.\n\nNovember 9th and onward time to keep the revolution going.", "No way. The entire DNC surely regrets favoring her when he had a better shot against any republican", "waaahhhh i dont like democracy when the people don't vote the way i want", "He must feel like shit. Any hope of his progressive platform ever being implemented has been dashed. Dem party will likely move way center to regrab white voters. ", "It's pointless he'd have to perform better than Clinton in key states like Michigan anyway to beat Trump.  ", "Why is there such a huge backlash against 538? They were the only people who continually said this kind of thing was a possibility much to their mockery of the rest of the media.", "Hello to future historians citizens of the world, explorers of the ancient Internet.\n\nSorry.\n\nWe tried.", "As president Trump will have major pull over the Supreme Court. \n\nThis election will literally affect us for the rest of our lives. ", "Can't believe I'm saying this but /r/The_Donald was right.  The silent majority stands with trump. The media is rigged.  Trump crushed her", "They did it.  /pol/ actually did it.  \n\nThey shitposted a man into the White House.", "Not just the president but the house and the senate too.\n\nWhich means the Supreme court is in the hands of a 100% controlled Republican US government.\n\nThe GOP is officially in charge of *EVERYTHING.*", "Hilary was supposed to win this election handily. Then Trump wins just about every battleground state (FL/OH/NC/PA/MI/WI) and proved every single poll wrong. This will be written in history books about how the polls were so wrong and how Donald fucking Trump was elected as president. \n\nMy god yes, President Donald Trump. It's been real, America.\n", "I love how people gave Silver shit for saying Trump had a 30% chance because it was \"too high\".", "Breyer and Ginsburg better start taking their vitamins.", "&gt;Magathread.\n \nNice.", "What an unexpected voter turnout. Keeping all political biases aside I'm shocked how inaccurate the polls were - it seemed Clinton had a sure win at the beginning of the day. Not only will this election be a huge one in history, but this election day in particular as well. \n\nIt's been a very intense, divisive, explosive, and energetic past year in American politics and culture. I'm interested in seeing how this will all play out in the next few weeks and once Trump eventually takes office. \n\n", "MI WI, were not **perceived** battleground states, that's how HRC fucked up.", "just as everyone expected^whatthefuckjusthappened^ohmygod", "Hahaha 4chan won an election what the hell", "Good. Maybe they can actually start doing their job for once instead of acting like whiny brats. Anything that goes wrong in next two years they own it ", "Sorry UK --- and I'ma let you finish --- but the Americans made the worst political decision OF ALL TIME. ", "If Trump is replacing Obama then orange is actually the new black.", "**It should have been Bernie.** ", "Britain - \"Brexit is the stupidest most self-destructive act a country could undertake!\"\n\nAmerica - \"Hold my beer.\"", "What the fuck.", "Congrats Trump. I hate your guts but congrats on completely destroying the political establishment and winning.", "\"hey guys.. we got Mountain Dew to cancel their 'name our flavour' contest what do you wanna do next?\"\n\n\n\"let's elect the next president..\"\n\n\n\"dude that's brilliant!\"\n\n\n\"i was just joking..\"\n\n\n\"fucking brilliant!\"", "I can't wait to see that what that dude who wrote that Huffpost piece slamming Nate Silver for not supporting a 98% chance of her win is gonna say.", "Hi my name is the United States of America, and welcome to Jackass.", "She didn't bother visiting Wisconsin after the primaries.  Fuck.", "I think in fairness to the polling again with as many political biases aside, there was a lot of animosity among both bases but it was publicly \"OK\" to back Clinton over Trump. There was always the possibility that this would be the ultimate outcome because of the fear placed on individuals who supported Trump in secret.", "Is anyone getting the Surface Studio?", "Of all sad words of tongue or pen the saddest are these: /pol/ was right again.", "Good job DNC...", "Trump used his prime rarest pepe in his arsenal while Hillary was just pumping low quality non-ironic shit post.  \n\nYou win the memes you win the peeps.", "Our next president actively denies climate change and his VP has voted in favor of gay conversion therapy. I'm disgusted.", "Hubris. ", "Let's also congratulate Hillary and her crack team that ousted Sanders through illegal and dishonest means. \n\nReally excellent job by everybody, all around.", "Looks like visiting Wisconsin wasn't a stupid fucking move now was it CNN?", "**It should have been Bernie.** ", "At their core /r/the_donald was never truly serious. I subbed there back when they had less than 20k subscribers, the night of the New Hampshire primary, and it was just a nonstop barrage of memes and shitposts and people having fun. It changed over time, got more conspiracy driven and meaner, but they were always more fun than mean at their core. ", "I hope he gets into twitter wars as President.", "I honestly think if I was Donald Trump in this moment, I would have a hard time *not* believing in my own immortality.", "WTF just happened?", "If you were a Bernie supporter and voted for Hillary you never cared about policy.", "The DNC tried to tell us who we wanted for President instead of letting us decide on our own. Now it has blown up in their faces.", "Hillary personally declared a war on pepes.\n\nIt angered Kek. The rest is history.", "Could've had Bernie but nah. Get fucked DNC.", "She's 70 worth over $100 million as a couple, and just finished an exhausting campaign.  If it were me, I'd retire.", "What a fucking charmed life this guy has lived.", "Then that means Clinton was a shart...", "Just stay alive four more years. You can do it!", "He actually did it the absolute madman.\n\nOn a serious note: yes, Republicans took an unprecedented control in the the overall stake of American policy-making tonight, but still, I think we should hold our breath before declaring this the end times.", "You're deluding yourself imo. The GOP leadership has shown that they are not willing to stand up to Trump. \n", "Yup. Just watched it click over. Let's see how long it takes for all the news stations to call it. Different numbers on every channel. ", "Four years we get to listen to his rambling bullshit.\n\nAnd in four years we have to sit through another goddamn election season where he's a candidate.\n\nI fully expect him to appoint every conservative wingnut he can find to positions of power.\n\nWe're going to try trickle down economics one more fucking time.\n\nWe're going to boot 20 million people off of their health care, and institute health savings plans instead (great if you live well enough above your means that you can afford to set money aside).\n\nWe're going to ignore the Paris Climate Accords. The EPA will be left in tatters.\n\nWe're going to waste half a trillion dollars building a fucking wall, to address an immigration problem that is nowhere near our top concern.\n\nWe're going to defund the Department of Education.\n\nAnd on and on and fucking on.\n\nAnd I fully expect the Trump administration to be rife with scandals. There's a reason he didn't want to get into financial disclosures. He will use the office to further his investments.\n\nPresident Trump, the greatest shitshow on earth!", "Please clap.", "What happened is the DNC fucked over their best candidate then proceeded to underestimate their opponent and his supporters. GG.", "Reporter: Kid are you tired?\n\nKid: no\n\nReporter: *Shh shh* yes you are. Rest your head for a bit, like 30 secs. *shh pats kid head*", "More curious/worried how one party controlling the entire system may shape the country in the next four years. \n\nGuess we'll hold onto our butts and see.\n\n---\n\nWant to take this moment and add in something I wrote elsewhere - since emotion is running high (on both side) and I'm spotting quite a few doom/gloom/ecstatic predictions. Take this as you will from an \"old\" guy that has been on reddit for over a decade:\n\n&gt; I honestly think either camp calling it being the end of the world is going be pleasantly surprised at the resiliency of our country.\n\n&gt; Despite the country (or part of it) voting one particular direction there was also waves of progressive laws being passed across the country on an individual state level. Marijuana, for example, is now legal for recreational use in California. This is also a clear wake-up call in many parts of the country as its evident a lot of people felt their voices aren't being heard. Hopefully civil discord will continue to rise up and solutions for *all* are considered.\n\n&gt; There's going to be a lot of disappointed people - particularly younger folks and people that are involved in the process for the first time. For you guys, I want to leave you with [this nugget from Conan](https://www.youtube.com/watch?v=ByYdvbX_P_c).", "Yep. Truth. \n\nThey couldn't play fair she really believed it was \"her turn\", and despite online manipulation / record correcting they still managed to throw it away.\n\nHave no doubt, I'm not a Bernie supporter, but he would have won. If for no other reason that he didn't have a stink of scandal on him.", "Hehe shame the millions from the Saudis and wall-street couldn't buy hillary the election eh?", "This is the darkest timeline.", "I would say it's the DNC not liberals.  I know a lot of people who hate Trump but didn't go vote because of how apathetic they were about Hillary.", "Trump as president wouldn't be bad if the Democrats had the house or senate. The system isn't designed to not have checks and balances.", "Why go that far  just go to yesterday. ", "Lmao the fuck are you talking about", "Shill bubble? Literally every reputable poll and survey conducted for the entire campaign went against Trump.\n\nEdit: Honestly it *is* actually possible to get such a wrong answer when conducting a perfectly scientifically rigorous survey. There doesn't have to be anything wrong with the procedure, there doesn't have to be any fiddling of numbers. A properly conducted survey can be wrong. A *lot* of properly conducted surveys can all be wrong. It's just damn unlikely. \n\nIt seems we hit the jackpot.\n\nEdit2: ProfoundBeggar looks to have the most sensible explanation. This was simply the defining moment that brought the deficiencies in the current models of polling and survey-taking to a head. Trump so broke the mold that he broke the model. It's not *perfect*, nothing can be, but deciding to just throw away everything we have now that we can finally properly *see* the biggest problems instead of trying to fix it is...well, it's stupid.", "It actually happened... ", "I hate everything about them but I've gotta admit they had some spicy memes ", "I'm sick to my stomach.\n\nHe mocked a disabled reporter.\n\nMultiple reports that he made sexual advances on the women in the Pageants. \n\nHe bragged about grabbing pussy and it being okay because he was a celebrity.\n\nHe's made fun of many women on their appearance...\n\nHis hats and his ties are made in China...\n\nThe bully the antagonist, the villain of the reality show... won.\n", "The first president to get memed into office", "Hilary Clinton blew a 3-1 lead", "This is the 3rd time in the last 24 months that polling has been so completely wrong.\n\n1. UK General Election - Predicted to be Hung Parliament end up with Conservative majority. All poll'ers were left trying to explain their mistakes\n\n2. Brexit - Everyone saying how they'd predicted everything, university counties would go hard for remain. First result came in instead of 70/30 around 52/48. I went to bed early knowing we'd vote out. They'd got it so wrong again.\n\n3. US Election - Now for the 3rd time, polling continues to show something, over and over, but it turns out to be wrong. At this point I think all polling companies are really going to have to go back to the drawing board. \n\nSo discussion point, how do they keep getting it so wrong, it's not country unique anymore? ", "People who've stayed in this shill bubble are so surprised lol ", "dankest*\n", "More money spent. Better ground game. Support of powerful celebs and the incumbent and first lady. Still lost. \n\nShitty red hats. Won.", "I'm still feeling the Bern. It hurts.", "One year ago I thought I was going crazy.\n\nOh wait I still am", "That says more about Clinton than it does about Trump. In the end the American people didn't like or trust Clinton. That's really all it boils down to.", "Meanwhile Bernie Sanders, the most popular politician in the US, who handily beat Trump in all head-to-head polls is warming the bench.", "Yup.  I kinda blame Hilary for the loss because if she'd won or lost to Bernie fairly, the dems would have rallied together.  Instead she proved that she thinks cheating to win is legit, and what the people want doesn't matter.  So now all the people she fucked over decided that they'd rather have Trump than a lying, cheating snake.\n\nTrump is outspoken, rude, misogynistic, and has no place in politics.  It says a lot that people hate Hilary more than him.\n\nI hope his win helps burn our current bullshit two-party system to the ground. ", "The final plot twist of 2016.", "&gt;You are the reason why she lost. You insulted people instead of reaching out to them. You downvoted them and mocked them instead of trying to reach out to and connect with them. You belittled and mocked them for having differences in opinion.\n\nThis is so powerful. They acted exactly like what they claim to hate about Donald Trump. ", "We all thought the Republican party was a mess. Well then Dems are some other type of fucked.\n\nWe lost all 3 races.", "Ugh...she actually just sent Podesta out to tell everyone to go home and speak on her behalf.  She couldn't even appear on stage for that.    I begrudgingly voted for her but damn...", "If only there was a Democratic candidate who pulled similar upsets in the exact same states during the primary?\n\nThat person would surely have been electable...", "When I saw MI going red I knew something was up. I mean its basically a UAW stronghold and the UAW endorsed Hillary for president. It was supposed to be easy for her to take it right?\n\nBut then one looks at what made MI a powerhouse, the automobile industry, and Trump message included bringing back those factory jobs. This message is what resonated with MI voters. ", "Jesus the DNC really fumbled the ball.", "John Oliver is not happy right now.", "Dear media if you treat the fucking election like a reality TV show, you get a reality TV show host for president.", "So Trump was the most disapproved candidate in US history. I think it's safe to say that makes Hillary Clinton the **worst** candidate in United States History. ", "She mistakenly thought that Trump would implode if she kept giving him enough rope to hang himself and just quietly waited out the clock. She failed to give people something to vote for instead of just something to vote against. I'm sure the voter suppression efforts in several battleground states didn't help as well.", "I want to travel back in time 2 years and show this to people to see what they'd think.", "Er...Bush had all three branches.  And look how well that turned out.", "Because \"Russians\" \"Berniebros\" \"everyone elses fault\".\n\nNo. It's your corruption and electing of a dumpster candidate. You had a chance with bernie but you ignored them and slammed the door in their face.", "I mean the guy is a slap in the face but if you can take $14 million and turn it into the Presidency I'll be damn impressed. ", "Bernie told you she wasn't perfect. But he also told you that she'd fight for you for the ideals of the revolution... and that electing her was the only way the revolution could have a chance of succeeding. \n\nYou. Fucked. Up. If you ever cared about Bernie and his message, you took a shit on it tonight. I hope you take great comfort in your spite for the next four years. It will be a cold and bitter comfot, but at least you aren't Mexican, or gay, or a woman, or Muslim...", "Yeah it wasn't the speeches they were paying for it was influence, of which she now has none", "&gt; Sad it's cost us the election.\n\nNo you voted for the worse candidate in the primary. You went for the pre-approved, but amoral and deeply corrupt asshole. That's what has cost you the election.", "He already apologized on twitter.  Ryan Grim if I recall his name correctly.", "As someone who thinks Trump is quite detestable I actually believe this is a big part of the reason. So much grandstanding of SURELY he won't win. He can't. Well, he did.", "Because she cant face people who she owes favors to again.\n\nIt was supposed to be her time in 08 but Obama showed up and got young people and black people to vote it was then her time in 2016 for reals, and she and the DNC stacked the deck for her. Somehow she was supposed to beat Trump when she couldnt really beat Sanders in major swing states it came to tonight. Sanders who she and the DNC then conspired against. \n\nWhats she going to do now, run again in 2020? She isnt a candidate anyone wants to a degree that she would have an easy win.\n", "So it goes.\nMaybe we'll get lucky. Candidates have been known to lie to get into office; perhaps we will have the luck of judging Trump by his actions rather than his promises.", "Make America Segregate Again", "You forgot about putting moot on the cover of TIME", "I cannot believe this. I want the last six years I spent in the military back. I have blood on my conscience in support of a country which voted for a human being I wouldn't fucking elect to be a dog catcher.\n\nEdit- A lot of people seem to think this is a post about party affiliation or sadness that my candidate lost. I wish the world was that simple to me too. ", "As a Bernie supporter I can't tell you how frustrating it is to have predicted the results of tonight over a year ago. \n\nMy reward for raising the alarm? Smeared as a sexist, called a 'Bernie Bro', and told I was living in a fantasy....", "The DNC really fucked this election this year. \n\nNice work. ", "It's impossible to say if this would have been the case but Clinton did lose states like Michigan and Wisconsin that Sanders not only performed well in the primaries, but also polled well in general election scenarios.", "Fuck the DNC", "I guess this isn't gonna get removed now.", "I am absolutely baffled that the Democrats decided to run with a candidate who had already spent 8 years in the White House for a election that was clearly shaping up to be a referendum on establishment politics. We've seen the writing on the wall since the Tea Party and Occupy Wall Street. We were still arrogant enough to think that her experience would be an asset and it clearly wasn't. \n\nBut people were so furious for change that they no longer cared what it looked like. And we've probably missed our chance for a long fucking while.\n\nI can't even delight in how fucked Trump supporters are going to be by this decision. This is a fine day for democracy but a horrific day for everything else.", "2016 takeaways. Need to root out corruption so Democracy can flourish. Use strong passwords. Don't use a private email server.", "Another way to say it would be Donald Trump would have lost if Hillary hadn't cheated to get her nomination.\n\nTurns out corruption eventually can catch up with you even if you're Hillary Clinton", "Let's put it this way:\n\nBernie won Michigan.\n\nBernie won Wisconsin.\n\nBernie even won Kansas and Nebraska and New Hampshire. *By a lot*.\n\nWhat states gave Trump the presidency?", "John Oliver is going to lose his mind on his show on Sunday.", "As a human being I'm unhappy trump won but it's always nice to see a cheater losing.", "Fuck it I'll  say it again\n\nFuck those who blame voters for voting for their conscience. The dnc handed us a candidate who lost to fucking trump. That is HOW FUCKING BAD clinton was. 3rd party voters aren't to blame. They got less than 5% of the popular vote cumulatively. Nationwide. Democrats you did this to yourself. Own it and change.", "Wish saying \"Fucking told you so\" felt better", "No shit thanks Debbie and Donna!", "Next to 9/11 I can honestly say that this is the most surreal moment of my life.  ", "Wow.  Is this a real politics sub now?", "The fort has been retaken.", "No question about it.  The Dems got the candidate that they wanted one who couldn't even beat a game show host.  If there is anyone to blame its not those diehard Bern supporters but the likes of DWS, Podesto, &amp; Hillary herself who turned out to be her own worst enemy.  I hope you are happy with yourselves now!", "Everything that Democrats hoped would happen (Turn red states purple winning back the senate, etc), didn't happen.\n\nThis is basically the worst possible outcome for them.", "CNN has completely fucking sucked. Absolutely garbage. I feel glee that CNN has been exposed as a propaganda mouthpiece.", "Today is 11/9. Shit's crazy ", "'Member when bernie supporters pointed out how he was polling higher against trump that people were tired of typical politicians, that Sanders had foresight and no skeletons, but Clintons staunch supporters said he couldn't accomplish anything and was unelectable?\n\nWell she just lost to the most unelectable candidate ever because Democratic elitists who steer the party didn't see this. As a Sanders supporter I wish I was wrong.", "Hillary is the very definition of the political elite's predetermined chosen one. Corrupt to the core and deeply rooted into the party. Still the party had to work in the shadows to ensure she got an unfair advantage over Bernie. They still promoted and pushed her even while under investigation for some pretty fucking serious crimes.\n\nThey got it wrong. They got it so, so wrong and the people were so angry that they'd even vote for someone like Trump. It should have been so trivial to beat Trump. They could have nominated the bloated corpse of a dead whale and beaten Trump. Instead they went for probably the only person who could possibly lose to him, because they were told to.", "But but Hillary Clinton is the most electable candidate\n\n", "So... the Democrats set themselves up for it by trying to shame people for supporting Trump. They literally created the \"silent majority\" that claimed it's vengeance today.", "[deleted]  \n ^^^^^^^^^^^^^^^^0.0773 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/43886)", "As a Brit I'm more annoyed that America has decided to one up us YET AGAIN.", "We should have listened to Michael Moore. He straight up told us this would happen in the Rust Belt.", "Whew boy.  Still processing all of this.  Despite the urge to panic and predict doom and gloom I think everyone who voted against Trump (because I think few people actually voted for Clinton) will have to calm down over the next few days and weeks.\n\nThe world (shouldn't) end tomorrow.  Yes we have President Trump, a Republican House and Republican Senate and (coming soon) a more conservative Supreme Court.  But I think at most what we'll see is the repeal of Obamacare, a more conservative Supreme Court, and the ignoring of global warming for another four to eight years.\n\nBut 90% of what Trump said he wants isn't going to happen.  He isn't going to be able to build a wall along thousands of miles of border.  He isn't going to be able to deport any legal immigrants and the possibility of mass deportation of illegal immigrants is low.  \n\nBut I think the people who believed that he could/would do the other things are going to be disappointed as well.  Manufacturing jobs aren't coming back.  We aren't going to rewind to where a high school graduate could get a job in an assembly plant and support a family on a single income.  Big coal jobs aren't coming back.  We aren't going to put insane tariffs on foreign goods to get countries to start buying things we make.  Unless the working class population accepts $0.20 an hour or magically turns into robots, it isn't happening.  Globalization also isn't going away.  The house of cards that is the global economy is too big and too essential to modern life as we know it.\n\nIt's going to be an interesting four years.  But we'll get through it.", "Her and DWS should have a hard nights sleep tonight. The DNC dropped the ball they coulda taken the presidency and the houses if it was Bernie.", "DAE remember when they said Bernie is a crazy communist and Hillary is more electable?", "Fuck those who blame voters for voting for their conscience. The dnc handed us a candidate who lost to fucking trump. That is HOW FUCKING BAD clinton was. 3rd party voters aren't to blame. They got less than 5% of the popular vote cumulatively. Nationwide. Democrats you did this to yourself. Own it and change.\n\nEdit to add u/whatiobserve 's commentary\n\n&gt;Clinton vs Trump generated something like 115 million votes. 20 million less than 2008. Blame the 5% all you want but it's the shit candidates that lead to low turn outs.", "Can i officially come back to viewing this sub??? I mean i was a legitimate undecided voter going into the general and after the primaries this place just became an echo chamber.", "**Yes. WE FUCKING TOLD YOU MONTHS AGO!!!** ", "Fuck them", "To channel John Oliver:\n\nHillary Clinton losing is like catching an ice cream cone that flew out of the hand of a child struck by a van. I mean we'll eat it it's nice, but there's still little bits of kid everywhere", "I actually agree with this 100% and was mentioning it the entire election.\n\nThere were so many closet Trump supporters that weren't being accounted for.... but they were accounted for today.\n\nIt would make a lot of people social pariahs in their local area to publicly support Trump but the voting booth gives you the freedom away from that. ", "No matter your opinion of the man you must admit that he beat all the odds since the beginning.  Everything was stacked against him, and he fought through it", "And most of your children's.", "She couldn't even win the primary without cheating what in god's name made the DNC think she could win the general?", "The DNC utterly destroyed their own party.  They alienated the youth tried to adopt a very conservative centralist platform, and committed scandal after scandal.  They fucked up, they literally couldn't have done worse.", "It's not Washington Post's fault.  Didn't you read the leaked DNC emails?  Bernie never had a chance from day 1.  Hillary was the anointed nominee ever since she conceded the primary to Obama in 2008.  2016 was her turn.  That was the deal.", "\"There was far more uncertainty than we were accounting for\" what? You gave 99% probability, that's not leaving uncertainty unaccounted for, that's straight up incompetent. What a joke of an apology from a joke of a prediction.", "Yes.", "while its a hypothetical I will take my time to rub it in the faces of people who pushed her so hard.  I really wanted him to win, I knew he lost after New York. The DNC and democrats got exactly what they deserved. \n\nThey made their bed. Now sleep it in.", "Am I allowed to say yes without being downvoted now?  Is the artificial narrative squad gone?   ", "It's 9/11 in Europe.", "I mean who could've predicted 31 days of wikileaks James Comey, and ridiculous rural turnout that blindsided all pollsters and both campaigns?", "People derided Michael Moore for years. All that liberal shame made people forget how on point he normally is.\n\nTV Nation was genius work.", "She's finished. ", "You can't continuously paint your opponent as Jabba when your candidate witnessed Vader force choke Admiral Motti. \n\nBernie was inspiring had bipartisan support and a history of compromise and bipartisanship, and didn't have a corrupt bone in him. It truly is sad to not have seen a general election matchup between him and Trump. It would have been engaging to see the stereotypical talking points that plague Clinton simply not be an issue, and the debates might have been about something of substance. \n\nOh well. ", "For fuck's sake yes. Same populist fervor but with actual experience.", "Isn't it great the fucking echo chamber these idiots created was their own downfall. Refusing to even listen or acknowledge the concerns others had thinking some how creating a \"safe space\" on /r/politics was going to help win hillary the election. hahahahahaha top kek. Now he better make do with his promise LOCK HER UP.", "Is this sub finally going to go back to upvoting negative stories about Clinton?\n\n", "Blew up the Clinton and Bush political dynasties ", "I 'member a sub called /r/enoughsandersspam!\n\nBoy howdy did they do a good job crushing the Sanders movement. What a bright idea that was!", "I truly hope this will be the birth of a liberal tea party. Time to purge corrupt Democrat shills starting with Hillary and everyone who voted for her.\n\n", "Bernie would've won Michigan and Wisconsin. So yes. He would've defeated Trump.", "You're telling me this candidate did not win...\n\nThe one with abysmal favorability numbers who is deeply establishment in a time of anti-establishment sentiment, who couldn't genuinely empathize with real working Americans who are suffering... \n\nThe one who supports fracking when millennials are scared shitless about climate change, whose history is fraught with flip-flops (supporting gay marriage only three years ago?), who was extremely condescending to millennials (a critical demographic for her) during the primaries, and who gave speeches to banks in exchange for millions?\n\nImpossible.", "Why do you think Trump won? Clinton made memes racist. Trump made memes great again. ", "Effectively yes. They used thought policing, shaming tactics and at times outright bullying to get their way. In a tyranny, that has a degree of effectiveness, in a truly free democracy that supports private voting, it somewhat backfires at times. \n\n", "Yep.\n\nThe strategy of accusing all your political opponents of being racist white males is officially o-for-two this year. ", "The 2016 Election\n\nAmerica: \"We tired of the establishment! We are voting for an outside candidate\"\n\nDNC: \"Well you can't vote for him if you do you are a racist, sexist, bigot\"\n\nAmerica: \"Okay I guess we could go third party\"\n\nDNC: \"No, then you wasted your vote. And you would support Trump\"\n\nAmerica: \"Well, then who should we vote for?\"\n\nDNC: \"Well our candidate has been the face of the establishment for 30 years\"\n\nAmerica: \"I don't know about that, that's kind of the opposite of what we want. Maybe if you nominated that old guy...\"\n\nDNC: \"WHAT! you are all a bunch of racists, bigots, and sexists!\"\n\nAmerica: \"Well screw you then I'm voting Trump just to piss you all off\"\n", "If this shows anything it is that there is a large group of Americans who haven't been represented in the mainstream media. The results of tonight's elections don't match the narrative that has been played by mainstream media outlets for the past year.", "This exact joke has been posted 300 times. Why is it still getting gilded?", "Best paragraph:\n\n\n&gt;Start at the top. Why oh why, did it have to be Hillary Clinton? Yes, she has an impressive resume; yes, she worked hard on the campaign trail. But she was exactly the wrong candidate for this angry, populist moment. An insider when the country was screaming for an outsider. A technocrat who offered fine-tuning when the country wanted to take a sledgehammer to the machine.", "I feel ya but I also feel slightly vindicated. It just sucks because their incompetence/over confidence/ blaming everything on Russia and and elitist group-think BS fucked everyone in the end. ", "Believe it or not Trump isn't an idiot. He was new to politics, and he learned very quickly. He used simple rhetoric to begin with and evolved it over time.  I don't personally enjoy his personality, but he is a force to be reckoned with. The media really did lie to us.The DNC cheated Bernie out of a win.  That's why the Democrats lost, i think.", "As someone who works in the environmental field I feel empty inside. \n\n\nHe wants to get rid of the EPA for fuck's sake. ", "Fuck voters for electing Trump. I don't give a flying fuck about your motivation. You did what you did don't externalize your choices.", "I thought it was common knowledge that CNN is owned by Time Warner a supporter of the Clintons? Also Trump has openly said he would oppose the AT&amp;T and Time Warner merger.", "Except their job involves helping the rich and fucking the poor. 20 million fellow Americans just lost their health care...and your fucking premium will STILL go up next year they never go down. ", "Agreed. She's shown twice in 8 years that she doesn't have the favor of the American people. Everyone she owes favors to is going to be calling in and soon. Don't be surprised if the Clintons end up \"donating\" lot of money soon... or dead, if the favors are as bad as some on reddit seemed to think.", "You could already see MSM sculpting the blame game even before the race was called. 3rd party candidates Comey, and \"stupid\" people. \n\nNo one likes a liar, I truly hope the pundits move on and stop projecting everything on everything else but the real issue.  ", "Hillary was a flawed candidate to begin with.\n\nGood job Democrats voting in an extremely flawed candidate instead of a candidate like Bernie Sanders.\n\nGo ahead and blame Hillary though yeah it's her fault. It's not your fault for being an idiot and voting for a candidate who was mired by scandals.", "Just re-subscribed. Couldn't bare this place for the last few weeks. I don't like Trump either but they wouldn't even allow discussion.", "it came down to enthusiasm... Clinton fans weren't that enthusiastic whereas Trump fans were angry and fired up as hell. Made a huge difference with the turnout ", "This was not an election **FOR** Trump this was an election **AGAINST** Hillary.", "No it was not WP's fault. But, the entire main stream media was favoring HRC, and that probably did sway some votes. \n\nAnd yes, I have read the DNCs emails. The primaries were rigged, even though many people still do not want to admit it. But here are the consequences. \n\nThe next 4 years are going to be shitty. The next two I am very fearful of. ", "That's really the only good thing out of this. ", "Swamp", "Drain", "The", "Hillary was \"New Coke\" the candidate everything about her was artificial and lacked passion, whenever she was confronted with a problem she couldn't buy her way out of she went with ridiculous accusations of racism or sexism, rather than talk policy she attacked Pepe the Frog, rather than rally her base she hired Correct the Record to troll online forums. ", "wtf dude dont do that. i'm stoned enough now you're gonna give me anxiety.", "A few days ago this post would've had 34% and been condemned to the \"Controversial\" Tab. Currently at 100% upvoted. I wonder what happened?", "Should we send her to jail yet?", "Get rekt... oh wait that's us.", "This sub called every trump supporter racist bigots for months. I voted for Clinton cause I don't like trump but to act like that place was the only place slinging mud is hilarious.", "She lost 6 states that Romney lost in 2012. ", "This has to be one of the biggest epic fails of all time by the Democrats.", "Yes. Of course he would've. Clinton was a terrible candidate that shouldn't have gotten the nomination. I'm sorry, it had to be said. \n\nShe had no message at all, it was just \"vote for me because I'm the lesser of two evils\". What kind of fucking campaign is that?! Sanders had a following, a real revolution and a real fucking message but the DNC is so out of touch they couldn't even see it. Embarrassing.", "No Clinton acted like there was no contest. They fucked up. ", "I'm not holding my breath. Given their attitude we're about to hear a lot about 'the mess that Obama left behind.'", "Ah but Kaine had stepped aside to help get Hillary's person in at the DNC.", "The climate just got 10 degrees warmer. ", "What a time to be alive", "Lets see if Trump keeps his debate promise about prosecuting her.", "The DNC squashed their populist and elevated the republican populist. \n\nLOL.  Just think about that for a second.\n\nThey were oblivious to the fact that populists had been gaining support for years and this was the precipice.   All they had to do was throw their own populist out there instead of going with plain Jane scandalmaster.   \n\nYah Bernie was far left but that doesn't matter.  All people wanted was candidates who weren't afraid to talk shit to corporations, whether they meant it or not.  ", "Sanders has favorables.\nSanders would've mobilized voters looking to vote for something.\nI could've told you this a year ago but I didn't know just how crucial it would end up being....Sanders would've splintered the trade voters that just made Trump President....a damn shame", "Maybe next time they will run a fair nomination process so as to get the strongest candidate, and not the one who can call in the most favours.", "Well it looks like /r/politics is back to its old ways!", "We need to kill this idea that Bernie was \"far left\" or we won't go anywhere in the next election, either.\n\nMost of Sanders' ideas were *mainstream* and liked by 55%-75% of Americans (depending on the exact issue). But the corporate media and its elitist pundits failed to grasp that, because they have NO clue about what an average American or the bottom 50% of America actually believes.\n\nThe recent [Reuters poll](http://www.reuters.com/article/us-usa-election-poll-mood-idUSKBN1332NC?il=0) done in the election day reconfirms it:\n\n- 75 percent agree that \"America needs a strong leader to take the country back from the rich and powerful.\"\n\n- 72 percent agree \"the American economy is rigged to advantage the rich and powerful.\"\n\n- 68 percent agree that \"traditional parties and politicians don’t care about people like me.\"\n\n- 76 percent believe \"the mainstream media is more interested in making money than telling the truth.\"\n\n- 57 percent feel that \"more and more, I don't identify with what America has become.\"\n\n- 54 percent feel \"it is increasingly hard for someone like me to get ahead in America.\"\n\n", "&gt; Those liabilities became nuclear when WikiLeaks the hacking group, started releasing troves of emails it says it hacked from Podesta’s Gmail account.\n\nWikiLeaks is not a hacking group, they are a publishing group.  They do no hacking of their own, they only publish what other people give them.", "The thing is the #NeverSanders group would've been made up of Trump true believers he never had any chance with anyway.  Whereas the #NeverClinton group was comprised of a coalition of people burned by the DNC primary, independents, and republicans.  ", "They have a point.", "I like how r/politics has turned on Hillary all the sudden.", "Hopefully this highlights the true problem in America the business class would rather risk Donald Trump being president than Bernie sanders. It tells you all you need to know.\n\nThe dems fucked Bernie, gambled, then lost to trump, they deserve him. ", "&gt; This is a fine day for democracy but a horrific day for everything else.\n\nWell put. ", "And Hillary couldnt even face her supporters who stood around all day to support her.\nShe turned around and went home speechless...", "Also while there still would have been a #NeverSanders group, it wouldn't have been anywhere near as big as the #NeverClinton voters.", "Make r/politics great again. :')", "I never thought I'd see the day", "I'm pretty sure Trump could have sat at a podium and stared at the camera for 6 months without saying a word and he'd have probably done BETTER. Trump didn't win because he did anything amazing. Trump won because Hillary was the quintessential embodiment of everything that people hate about our government. The DNC has reaped what they have sown.", "Let's also bring up the reason she won is the south... The same South that voted Republican. The same South that they claimed they are going to get because she is just so darn charming?\n\nI have no idea their thought process. The problem is the states she won (in the south outside of Florida)... were meaningless in the grand scheme because those are the states that the Republicans are going to win decisively when it comes to the electoral. \n\nWhat makes it worse is that the South basically crushed Sanders' momentum and made her seem stronger when in fact, she was just as weak as when she was losing or tying with Sanders.", "This whole election is an exercise in \"never trust the media.\" If they can't get basic facts - like the scope of Wikileaks mission and what is fundamentally their involvement in the story - then why should we trust their other declarations?", "If we learned anything tonight it should be that we cannot believe the polls!", "It feels nice to be able to comment in /r/politics again without being down voted again tho..", "Yeah how odd", "If anything this really shows that experience just doesn't matter.  It's all about who can tell the better story and inspire more people.  Obama was amazing at this, and Trump, even though he inspired a very different group of people, was also successful in this regard.  Though I refuse to believe Trump did this with any sort of brilliance - he was just the right asshole coming along at the right time.", "He won't even know what year it is.", "Cheating is a bit strong of a word. It was more that she colluded with the party to cripple Sanders chances of winning the primary.\n\nThe party is *supposed* to be neutral and not pick favorites during the nomination process. Technically there are no rules saying they have to; in fact, the entire primary process is a show of good faith to their constituents. \n\nBut the DNC was confirmed through email leaks to break that tradition, and worked to influence the primary process through things like controlling the media narrative and hampering Sanders ability to get his name out there, as well as discrediting him among minority groups. There were also a few more specific allegations about fraudulent behavior with certain states election officials.\n\nThere's no telling if he would've won otherwise, but it's entirely possible given that he was an incredibly popular candidate. His message was strong with the working class, which is where Hillary fell short tonight...a lot of people think he would've pulled it off.", "Colin Powell explained this succinctly if accidentally when he admitted everything she touches she kind of ruins with her hubris. Now here we are in the ruins of her hubris and nothing feels okay because we were told nothing would be okay without her. Against all odds I will continue working towards a brighter more inclusive future ", "Screw the candidate with an enthusiastic following and high favorability rating let's nominate a tired old candidate with more political baggage than Amtrak. She's got a 3-1 lead! What could possibly go wrong? /s \n\nThe Democrats had this election handed to them on a silver platter and they fucked themselves out of it spectacularly. I hope this election teaches the DNC never to pull this dishonest, corrupt shit ever again, but I'm not holding my breath. ", "She had so much baggage that she shouldn't have even been running to begin with...  Joe Biden would've been a much stronger candidate.", "I'm tearing up a bit tbh", "Well let's hope they all learn from their mistakes. hahaha. We all know though, they are just going to blame third party voters instead of taking a look in the mirror.", "They're still blaming Nader for Gore's 2000 defeat. Hillary's campaign shared some uncanny similarities to Gore's.  Most importantly the fact the Democrats insisted on a weak-sauce candidate like Clinton proves they didn't, and most probably never will, learn anything.\n\nClinton got beat.  By Donald Trump.  Even with most of the media in her hip pocket.  Clinton lost by ~70 EV.  To Donald Trump.  Gird yourself for a tsunami of blame directed at 3rd party voters.", "Can't wait for @POTUS telling us to check out a sex tape at 3am", "I wonder if they'll ever enable posting again or if they're just going to shut down the subreddit completely.", "It feels good to post in here knowing the hillary spammers in here didnt succeed.", "That's what they get for cheating. They tried to shove an unlikeable corrupt Wall Street bankrolled crook down our throats and this the result", "The media spent thousands of hours covering Trump in 2015 but maybe two minutes total covering Sanders.\n\nThe media doesn't want to talk about things that actually solves people's lives.  [Don Lemon talks about black holes sucking up Malaysian flight 319](https://www.youtube.com/watch?v=ZpVd7k1Uw6A), or [Megyn Kelly telling America that Santa is necessarily white](https://www.youtube.com/watch?v=7XYlJqf4dLI).\n\nThank fucking God we don't have a Hillary administration with advisors such as John \"UFOs are real\" Podesta.  I realize a Trump administration is really hard for people to stomach but hopefully it's the beginning of a wonderful transformation for our country.", "It's even more satisfying to see John Oliver losing.", "The Dems would be raking Trump over the coals if he had done this.", "The Christian right is going nuts. What they are demanding Trump do: \n\n1. Deport 20 million \n\n2. Build a 100 foot cement wall from the West coast to the Gulf.\n\n3. Repeal health care\n\n4. Outlaw abortion nation wide.\n\n5. Repeal Gay marriage and make homosexuality a crime.\n\n6. Place evangelical \"advisors\" on school boards\n\n7. Repatriate American companies that have moved out of the country\n\n8. Make it criminal to say anything bad about the Government.  ", "Nobody gives a shit about clintons any more effective immediately", "I agree with all of this except climate change. We needed to get working on that NOW. ", "DWS won reelection she should be rewarded with the 2020 dem nomination!", "You wanted to be right but not like this.", "Don't forget the DNC. They are just as much to blame for kowtowing to Clinton cheating for her, and trying to stop not just Sanders, but Lessig and O'Malley, too. ", "That is unacceptable to me. I can't recall the last time a candidate did this.\n\nEdit: Outside of Gore's which didn't happen until December (due to Florida etc) they have all made one as far back as I remember. \n\nhttp://www.newsweek.com/brief-history-presidential-concession-speeches-518527", "Biden and Bernie... Trump would have lost I can definitely guarantee it.", "And they called you sexist \"bernie bros\" for bringing it up. They paid for it big time tonight. ", "It's like in TRON when all the red lights turned back to blue.", "Right there with you and was predicting the same thing along with most ardent supporters.   Democrats abandoned progressives, entirely.    The level of shilling in this sub-reddit, and the timing of it within various odds and ends of the primaries/general election was a sight to behold.\n\nThe DNC can go fuck itself, along with its paid shills.", "Blaming third party voters for the thin margin Gore lost by is one thing (it's stupid but it's one thing).  \n\nClinton decisively lost the EC, and was multiple points down in the popular vote.  She can't really blame the 3rd party like Gore could.  ", "That is cheating.", "They believed the polls they rigged", "She had ZERO campaign stops in Wisconsin. She lost the state.\n\nThey spent lots of money trying to flip Arizona and Texas how did that turn out for them LOL", "And Jesus Christ at least use a SSL certificate right away. Don't wait 2 months.", "The \"liberal media\" ain't liberal they're corporatist. Just like the DNC. \n\nI blame them both. I'm a leftie and I dislike Clinton, the party is better without the Clinton baggage. ", "Definitely [most Americans](http://www.inquisitr.com/3258910/poll-most-americans-agree-with-bernie-sanders-the-economic-system-is-rigged/) agree with Bernie. \n\n\nI get emotional seeing a picture of him, we could have had a Badass POTUS. ", "Trump didn't screw over Hillary. Hillary screwed over Hillary", "Actually one poll that has been #1 in accuracy the last few elections was pretty much spot on. The Investors Business Daily Poll. \n\nThe mainstream media made them sound like they had Republican ties because they showed Trump ahead the past week. They actually just use a more intricate methodology to predict actual turnout of past voters than other polls. ", "I think Bernie will be remembered more than Hillary will when talking about this election in the future. I've never seen such an uplifting and charismatic candidate. Fuck the DNC.", "Ooooooh are we finally allowed to talk bad about the queen bee?", "not much else to feel good about tonight.", "Bernie is not far left lmao he's a centrist maybe center left", "While it is technically a hypothetical it's a very convincing one. Most people would agree that it's the truth. Bernie is the most-liked politician out there right now. He had half of the Democrats voting for him in the primaries (well, a little less, but factoring in how hard they tried to stop him...) and they just used Superdelegates to ignore that half of their base, the *enthusiastic* half, wanted him.\n\nPart of Obama's success is that the youth liked him, but he was moderate enough to appeal to everyone. While Sanders isn't \"moderate\", he's got the youth vote, and he's got a promise of \"change\", which worked quite well last time, and still could. If anything, this *should* be more effective now, with another half a generation of adults joining the population that's eligible to vote.\n\nInstead, they all stayed home, or if they're hardcore anti-establishment, voted Trump or third-party.\n\nSpeaking of which, Sanders probably could have pulled third party votes. Meanwhile, every State with significant third-party gains came at a bigger cost to Hillary.\n\nAll of this was predicted. All of this was expected. The only thing that wasn't? The polls.\n\nI don't think Sanders winning is that much of a hypothetical. It would have given anti-establishment voters two choices, and while he'd never pick up the hardcore Republican voters with his policies, the moderates, the hardcore Democrats, and younger voters would have been enough to sweep several contested States. The States Trump used to win. ", "Not after the second one.", "So they elect a liar and a cheat?", "Funny thing is that this so called extremist left tea party would probably be the standard for Europeans", "And none of the distaste.", "Many could have  and did predict this if they considered that Clinton was mired in at least 3 different scandals. Unfortunately the DNC decided to ram through a scandal-ridden warmonger who was known to be corrupt because \"it was her turn\" instead of a genuinely liked massively popular candidate who had a decades-long record of integrity just because he wouldn't play ball with their corporatist agenda. ", "Facts won't stop furious Clinton supporters from laying the blame on 3rd party voters.\n\nThey will never ever admit their candidate totally shit the bed.", "So it turns out that most Americans don't like people that lie and cheat...\n\n", "To be fair none of the other Republicans in the primary could beat him either, it was like anything negative just slid off him in the eyes of his supporters.", "lol the clinton echo chamber was manufactured by shills. They'll start to recede.", "Congratulations to any idiot who voted against Bernie in the primaries.You are officially a short sighted moron. ", "she was too short sighted in her campaign. when she was against Bernie all she cared about was beating Bernie but she did not think about also getting his supports support for the General. Same thing happened against Trump. She insulted all of his supporters before thinking that she needs them to win the election. now this is the result.", "For once I agree at least his circle jerk will end", "&gt;Good job ~~Democrats voting in~~ DNC for coronating an extremely flawed candidate instead of a candidate like Bernie Sanders.\n\n", "The Democrats aren't in a position to do anything.  GOP will eliminate filibuster and then we're a one-party government.", "I don't even know how many posts I wrote during this election that ended with \"I hope i'm wrong.\"\n\nI wasn't.", "Also closing registation for democratic and independent voters very early in some states before the primaries and the debate about the different candidates were well underway. \n\nEdit: also purging registered voters before the primaries which might be legal but didn't seem to help the process of finding the candidate with support. ", "The best argument against democracy is a five minute soundbite of Trump.", "At least I felt there was a bit of balance with Jon Stewart. His rally to restore sanity was surprisingly refreshing to see during the end of his career.", "But how? Populists were not popular in Washington DC dinner parties and private fundraisers. Are you telling me not everyone thinks like me? OMG!", "Yes that was hilarious I'm a light skinned brown girl from NJ but I got accused of being a sexist bro pretty regularly. I got so frustrated I remember calling one of them an out of touch, middle-aged white woman.", "&gt; Cory Booker\n\nThe guy who attacked Obama of all people for being too hard on the wealthy?\n\nlol yeah, that's the ticket.  \n\nCory Booker is black Hillary.  No, that's not right...he's actually worse.  He teamed up with the New Jersey GOP to wage a war on Newark public schools.  Cory Booker is an enemy of the working class.  If you guys nominate him, a ton of us will be attacking him from the left just like we did with Hillary this time around.\n\nhttp://www.ibtimes.com/cory-bookers-bain-capital-money-finance-industry-bain-gave-565000-2002-mayoral-campaign-699488\n\nhttps://seattleducation2010.wordpress.com/2016/03/22/cory-booker-is-no-friend-to-public-educaton/", "She acted like there was no contest in the rustbelt is what I think that u/SoTiredOfWinning was referring to. For example she hasn't been to Wisconsin since right after the convention. They took that region for granted and didn't even consider Michigan to be a contest until a couple of days ago. ", "They'll have less of a point if Clinton ends up winning the popular vote which is still projected as I write this. It's the way *our* democracy is that elected Trump. A different democracy might not have.", "That is cheating in the moral sense.\n\nThink moral sense.\n\nAnd it's breaking the DNC charter, which is a rule or is it not?", "Bingo. You can be shamed by your peers but not in the voting booth. When saying your sorta kinda like Trump makes you put your friendships relationships, job etc at risk, you're not going to come out and say it. But when you can vote and no one is watching, you'll vote how you see fit. ", "Or Biden &amp; Elizabeth Warren...", "In loop foreigner here. There was a shitload of maniuplation in the media with town hall meetings. CNN was feeding her questions via e-mail for her to prepare for in debates making her look more composed.\n\nIf you want to look as far as wikileaks then it also seems like Bernie Sanders was to be 'supported' up until a certain point by the DNC then have his support completely removed prior to the primaries. Very undemocratic stuff that make an undeserving mockery of him. \n\nEdit: Spelling kinda drunk and in a weird state of disbelief. ", "Reddit was totally pro-Bernie and I'm sure there were a lot of Trump people too who didn't talk about it a lot. ", "Holy shit this kind of rhetoric literally just lost you an election and you're **still** doing it. Fucking ASTOUNDING.", "He came in with no experience in politics or military. He was viciously attacked by both the right and the Left and yet he still managed to wreck his way to the top and right into the white house.\n\nThat is the definition of anti establishment bud.\n\nbeing rich is irrelevant to being part of the  establishment ", "Not only does experience not matter but in this case, it might have hurt her. When people view the political elite as the problem, it may not be a good idea to run a candidate who has been involved in the highest levels of government since the early 90's.", "I wonder if Clinton got really drunk and threw a fit.", "you have no idea what this election was abut. It's about being anti establishment and the only 2 people that were anti establishment were bernie and trump.\n\n", "Cheating to me implies that rules were broken but really, they weren't. It was scummy, underhanded tactics, for sure, and I believe it cost them dearly.", "Exactly. Didn't most of reddit actually support Bernie and Trump?", "Amazing what tens of millions of dollars of astroturfing will do. \n\nAnd what it won't: win an election. ", "They aren't getting paid anymore so I imagine things will go back to normal.", "Three things cost the Democrats the election:\n\n1. There was a Trump wave that the polls missed. There was far more support for Trump than anyone on the left realized.\n\n2. Hispanics weren't adequately mobilized. Hillary's campaign figured they'd be riled up enough by Trump's anti-Latino rhetoric nothing else was needed. They were ignored, very little money was spent on them even when it was clear that outreach efforts were failing for lack of money.\n\n3. Forcing Bernie out cost the Dems a lot of college educated whites who had overwhelmingly picked Bernie over Hillary in the primaries. This included a lot of swing voters and independents. These college educated whites then picked Trump over Hillary by margins of 6-8%, which cost her essential states in her Midwest and Rust Belt firewall - MI, WI, PA in particular. The Dems would probably have lost OH anyway, though by a smaller margin. But keeping the other 3 would have given the margin for victory.\n\nQuite aside from these, I think the Dems grossly overestimated how much Trump had offended women voters. They were expecting women to vote Hillary in far larger proportions than they actually did.", "They also didn't support her when she ran against Bernie but that was dismissed by her DNC apologists. The bubble.", "It's been known for awhile that the Saudis donated to the Clinton Foundation.  It doesn't mean the Foundation is profiting from terrorism anymore than buying from an American company means you support the invasion of Iraq.", "People act like it's just disagreeing with HRC.  As if the only thing in the election was that HRC and Bernie disagreed on key points in policy and she won the primary.  \n\nHillary Clinton went after bernie supporters harder than she went after bernie!  There was a straight up campaign to demonize supporters with shit like broscialist and calling his supporters sexist. \n\nThen, on top of that you have the email leaks showing, at the least, collusion on the part of the DNC to torpedo bernie.  \n\nThen, after DWS resigns in disgrace, she hires her onto her campaign, as if cronyism and entrenchment politics wasn't already a major political issue this campaign.  \n\nIt's a hell of a pill to swallow.  You can't blame people for failing to vote for a candidate who has denigrated them, and then had the height of corruption in the party exposed as a key part of their campaign.  That's more than being spurned.  ", "Hear hear.\n\nHad Bernie lost the nomination fair and square, I might have been inclined to toe the party line. But as soon as delegates started pledging along the popular vote only when Hillary was winning and against the popular vote when Hillary was losing, it soured me on the entire process.", "Well DNC...play stupid games win stupid prizes", "Seriously fuck you Washington Post, you Clinton-colluding pricks.  You broke your social contract with the American people when you starting trying to create the news rather than reporting it.  You can now join Fox News, Breitbart, Drudge, CNN and others as just another partisan rag that should go extinct as soon as possible.\n\nYou sandbagged Sanders and you treated Trump supporters like villains rather than understanding why their voices should be heard (and not the KKK supporters, but the ones who lost their jobs in the financial collapse). You acted like Clinton should be president on some mystical higher virtue of simply not being Trump, and just guessed at why people supported Trump rather than actually investigating why things were the way they were.\n\nThis election is a failure of so many levels of institutions that long stopped serving the electorate.  Along with the DNC, you should go away and let more competent people fill your space so that you cana no longer damage this country the way you have.", "This a thousand times. What with this Brexit, the latest UK general election... Polls have been fucking weird these days. ", "As Michael Moore put it a \"human Molotov Cocktail thrown at the system\".", "Don't blame this on the people *she* alienated. Clinton has no-one to blame but herself.", "Seriously they wanted to prop up this horrendous corrupted candidate and expect to win? I don't  understand the logic there. Bernie would have WIPED THE FLOOR against Trump no doubt in my mind. DNC brought this upon themselves. ", "Now **THIS** is the /r/politics I remember so dearly!", "And fuck Debbie Wasserman Schultz. Heard she's trying to rewrite the narrative now that Hillary lost. ", "Their info gathering methods are either antiquated or the antiglobalist movement around the world is creating fluke polling results. Maybe a bit of both.", "Sanders was heavily winning the rural areas in the primaries.\n\nThe same areas that had record turnout (50% of the counties in the USA rural ones, had record turnout this election).  Those are the ones he won and Clinton told to \"fuck off\".", "If this had been posted 24 hours earlier it would have been absolutely buried. Gotta love this sub.", "It takes a movement to beat a movement and Sanders had a movement like you wouldn't believe it was a viable rival for Trump's movement in its enthusiasm and size. ", "Difference is this is /r/politics it's supposed to be for ALL politics not just one candidate. Of course /r/the_donald is an echo chamber it's a subreddit specifically for Donald.", "mods are too busy crying themselves to sleep.", "It's her turn?", "lmao", "The desire for someone not from Washington was too much.\n\nI sympathize immensely with that actually I hate politicians with every fiber of my being now.\n\nI just couldn't stand the first guy to come around..turns out Americans could.", "I honestly can't argue with that.", "A wonderful transformation where the poor become even more destitute and the rich become more advantaged. What a joy. ", "I should enjoy the vindication.\n\nI don't.\n\nHowever I would like it if every pro-Clinton writer and anchor for NYTimes, WaPo, CNN, NBC, CBS, Vox, Slate, POLITICO, Mother Jones, Salon and HuffPo quit their jobs, because they lied us into the worst Democratic landslide loss since Mondale.\n\nI would also like it if the Clintons and their campaign staff never so much as donated or spoke or otherwise communicated with their Party peers ever again.\n\nLastly, if Bernie has it in him to run against Trump as a Democrat in 2020 or support a similar candidate to do the same, the entire Party must line up behind him, give him their absolute unequivocal support and not dare run any challengers against him. The man has earned his right to be in charge. In *charge*, do you understand?\n\n**EDIT:** For those wondering why I said the Democrats should not run *anyone* against Bernie Sanders or his chosen candidate: we are going to be diminished and weak. Democrats have further lost control of the House, Senate and now the Presidency. We need to be absolutely united, with Sanders or his chosen one leading the charge for the hearts and minds of the poorest of this country. We cannot divide ourselves in the slightest.", "As a Bernie supporter Im laughing in the DNCs face right now. So bitter sweet.", "\"Clinton Loss Demoralizes Cancer Riddled Orphan\" is tomorrow's headline. ", "They benched their star quarterback to put in the coach's kid who then proceeded to throw an interception to their fastest defender.", "I'm Chinese. Back then we always used America as an example to urge the government to make progress towards democracy. It seems we can't do that anymore. Thanks a lot. Chinese public started to doubt western media since 2008 and things just kept getting worse. I don't think my generation have much faith in democracy or liberalism anymore. I thought my country would be better once those old government officials die out. But no young people are praising Xi, Trump and Duterte. ", "/u/astronomyx really fucking missed the whole \"deregistering\" millions of likely Bernie voters in a few states to stop them from voting for him.\n\nWhile that's not technically illegal, because the state parties aren't regulated and can do whatever they want, it's about as morally bankrupt as you can get and absolute is **rigging** those primary elections.\n\nBut hey, rigging a primary is legal. They don't even have to do a vote at all. So that makes it okay? That's what I'm told, and why I didn't vote for \"those people's\" candidate.", "Yes clearly half of educated women were just too stupid to vote the *correct* way.  Its impossible that they hold ideological preferences of their own or that they look past liberal and conservative caricatures of party opponents, in defiance of our low expectations of them. ", "A lack of empathy for the other side is arguably what lost Hillary the rust belt and the election.  Instead of saying \"the middle class is desperate and I will fight corporations corruption and foreign interests to make it right\", her campaign called them racists and women-haters.\n\nBalance, or empathy, at a minimum, is how you move people to your side and build unity among the American people... not that that's the goal of a comedy show, but it is definitely a nice thing to see.", "Not to mention she marginalized and alienated Sanders supporters.\n\nRemember this?\n\n&gt;MADDOW:  Senator Sanders has been asked about how this all ends. He seems to be saying now that **even if you beat him in the primary it's not necessarily a given that he will implore all of his supporters to go out and work for you. He says that he thinks that they'll support you if basically you adopt some of his platform on the issues that are most important to him.** He's specifically talked about Wall Street and some other things in his platform. Does that make sense to you? Is that something you'd be open to? Are there significant enough differences between you on what you'd like to do for example about Wall Street, about the bridge too far?\n\n \n\n&gt;CLINTON:  Well Rachel, let's look where we are right now. I've got 10.4 million votes. I have 2.7 million more folks, real people, showing up to cast their vote, to express their opinion than Senator Sanders. I have a bigger lead in pledged delegates than Senator Obama when I ran against him in 2008 ever had over me. **I am winning. And I'm winning because of what I stand for and what I've done and what I stand for.**", "Definitely. The people who voted for Clinton would have much easier time to rally behind Sanders than what now has been the case. Hillary was just indigestible for some democratic voters. On the other hand republicans seem to be able to digest a lot...", "I didn't mind the echo chamber aspect as long as it was fluid, and it had information that was at least an interesting stepping stone to doing more research. But it really rubbed me the wrong way on how Hillary Clinton was a monster person during the primary, almost to the degree that this sub sort of perpetuated the #BernieOrBust phenomenon. But then a couple weeks after the media pre-emptively gave her the nomination, they switched agendas and it was #NeverTrump. How you can portray one person as being a lying, manipulative, terrible human who doesn't deserve your vote, but then lend your support because she's just an iota less terrible than someone else.\n\nBut now that she lost, I see a shift of some blame going back on her, and other people. The very reason why this sub was taken off default was a combination of it having become a liberal echo chamber, and lacking any sort of integrity or backbone.\n\nI was excited to see the narrative shift back to an anti-Hillary one for the next 4 years, but I guess we won't be seeing that at all.", "Something something internalized misogyny....", "It wasn't just their candidate that fucked up.  It was the entire party.  ", "Those people have no monetary incentive to downvote you anymore.", "Because Hillary supporters taunted Sanders supporters with suicide and then gaslighted them for months afterwards to vote for her?\n\nIt's not \"being a poor sport\", it's dialectical humor.  Hopefully our country never gets this toxic again.", "USA Today. Asking the important questions 10 months too late.", "Yea I re-subscribed today knowing that it would go back to \"normal\".  This place became a shilling ground on a scale that was unbearable.  It'll be good to have r/politics back to its less shitty state.", "well it is absolutely ridiculous to claim this sub is *radically* left wing", "Too few of us put our pride aside and voted Dem. despite disagreements with HRC. \n\nI definitely disagree with Trump more but aparently my other Bernie supporting friends would rather swallow a president who is polar to their views than vote for the one who spurned them.", "Those people stood around all day waiting for her.  She must be a basket case", "Yup I've got no sympathy for them, they totally brought it on themselves to go out of their way to manipulate a great candidate out of his fair shake. God I miss Bernie", "You can't compare a primary to the other because they usually have different participation rules, they are not general population elections. \n\nJust for kicks though, here you go \n\n**Michigan** \n\nDonald Trump \t- 483,753 \t\n\nBernie Sanders - 598,943\n\n**Wisconsin**\n \t\nDonald Trump - 387,295 (he lost it to Cruz)\n\nBernie Sanders -\t570,192\n", "&gt; Bernie supporting friends would rather swallow a president who is polar to their views than vote for the one who spurned them.\n\nHRC was pretty polar to Bernie before she decided to steal his campaign platform from under his feet. And before you start with the 93% nonsense that 7% was a deep fucking chasm.", "Everything else aside can you imagine being Clinton right now? I don't like her, but I respect her ambition and intelligence. I work incredibly hard at my own job and I try my best every day to do at least one thing that can help me progress to the top of my field. To have entertained such a public, gargantuan loss - not just for President, but for all branches of government - when I had expected to win up until the day of, and against a monster and supreme incompetent like TRUMP? I would be crushed beyond measure, most definitely would break down in tears but in all honesty I'd probably have to be hospitalized for the rest of the day. This is just a failure of your whole life's ambitions - in one fell swoop, against a cartoon villain who stumbled his way from the set of a reality show into the field you've been working in for decades - on a scale I can't even comprehend. To have your hubris blind you and be confronted with such an outcome...goddamn.\n\nI actually feel a bit sorry for her, but she and her cronies should have known they were approaching this all wrong. It's her sycophants that propped her up as the Democratic nominee in the first place I have more of an issue with. I can't blame her for pulling out all the stops in trying to win - most people would. But I can fault her bullshit supporters pretending she was the most electable Democrat and actively alienating any internal challengers so she could ascend to her rightful position as Queen of the Democratic party. That lack of foresight cost us so much more than the Presidency, and for a lot longer than just the next four years. ", "No shit all the Democrats had to do was NOT nominate a wall street puppet and the dumbasses couldn't even pull that off.", "That sub was fun. This sub was just infuriating. The culture here was so fucking toxic ", "I think they personally turned off Redditors for voting for Clinton.  I think they were a net negative for her.  ", "Every post over there is locked - they're done. ETS on the other hand thinks they're going to turn themselves into some sort of vigilante watchdog group bringing light to the evils of Trump's presidency. The desperation is real.", "I'm sickened by this outcome. I sucked it up and voted for her because he was so awful but I understand why some didn't. This shit is Clinton and the DNC's fault. They just fucked our country and possibly the world. God damn...", "That's the problem with parties/candidates that are generally badly viewed in everyday life people tend to hide their support. We have the same problem with polls and the Front National in France. You can always count a few points higher than polls for them.", "Holy cow! An anti Hillary post on politics!? ", "They (the DNC media, oil/gas companies, etc) were thinking they'd rather have Trump as president than Bernie Sanders. \n\nThey were much more concerned with making sure Bernie Sanders was NOT president than making sure a Democrat won.  They'd rather have \"any Republican\" as president because their bad candidate lost than someone who will fight for the other 99% of Americans.\n\nIt's as simple as that. That's what it really boils down to.  \nThe DNC and Clintons campaign knew she was the weaker candidate, from the emails.", "You know I didn't even realize but there was a candidate named something McMullin who ran.  He got fucking 21% of the vote in Utah and like 7% of the vote in Idaho.  \n\nWhat the fuck? \n\nAnd yeah, Jill Stein got basically nothing.  The independent vote was split between this Evan McMullin and Johnson, a Libertarian and former republican.  ", "WikiLeaks does not release documents the moment they are received because vetting and analysis is required. Releasing 50,000+ emails *while maintaining standards and under active attack* is a non trivial task. 'When it mattered' is also entirely subjective.\n\nIt is also worth consideration to what extent the DNC may share esponsibility for the rise of Donald Trump.\n\nFrom [this attachment](https://www.wikileaks.org/podesta-emails//fileid/1120/251) of /r/wikileaks [Podesta email 1120](https://www.wikileaks.org/podesta-emails/emailid/1120):\n\n&gt; Friends, \n\n&gt; This memo is intended to outline the strategy and goals a potential Hillary Clinton presidential campaign would have  regarding the 2016 Republican presidential field. Clearly most of what is contained in this memo is work the DNC is  already doing. This exercise is intended to put those ideas to paper.\n\n&gt; **Our Goals &amp; Strategy**\n\n&gt; Our hope is that the goal of a potential HRC campaign and the DNC would be one-in-the-same: to make whomever the  Republicans nominate unpalatable to a majority of the electorate.  We have outlined three strategies to obtain our goal:  \n\n&gt; 1) Force all Republican candidates to lock themselves into extreme conservative positions that will hurt them in a  general election;\n\n&gt; 2) Undermine any credibility/trust Republican presidential candidates have to make inroads to our coalition or  independents;\n\n&gt; 3) Muddy the waters on any potential attack lodged against HRC.\n\n\n&gt; **Operationalizing the Strategy**\n\n&gt; *Pied Piper Candidates*\n\n\n&gt; There are two ways to approach the strategies mentioned above. The first is to use the field as a whole to inflict damage  on itself similar to what happened to Mitt Romney in 2012. The variety of candidates is a positive here, and many of the  lesser known can serve as a cudgel to move the more established candidates further to the right. In this scenario, we  don’t want to marginalize the more extreme candidates, but make them more “Pied Piper” candidates who actually  represent the mainstream of the Republican Party. Pied Piper candidates include, but aren’t limited to:\n\n&gt; • Ted Cruz\n\n&gt; • Donald Trump\n\n&gt; • Ben Carson\n\n\n&gt; We need to be elevating the Pied Piper candidates so that they are leaders of the pack and tell the press to them  seriously. \n\n&gt; *Undermining Their Message &amp; Credibility*\n\n&gt; Most of the more-established candidates will want to focus on building a winning general election coalition. The “Pied  Pipers” of the field will mitigate this to a degree, but more will need to be done on certain candidates to undermine  their credibility among our coalition (communities of color, millennials, women) and independent voters. In this regard,  the goal here would be to show that they are just the same as every other GOP candidate: extremely conservative on  these issues.\n", "HRC would have been on the right side in europe. Sanders would be center labor and Trump would be around UKIP or further right. Close to brown more than blue on Trump.", "&gt; Hell even other subs imitated /r/the_donald and it looked forced and awkward\n\nThis is incredibly true. After /r/politics devolved into this Hillary circlescissor that it's now recovering from the people at /r/The_Donald were basically the *only* source for people to hear the other side of the election story. That made it pull a massive amount of attention to itself, and it worked.\n\nLike that other guy said, at the end even /r/politics began to try to imitate the style of /r/The_Donald, even throwing around the same memes. But it was too little, too late, and too unoriginal.", "FOR THE LAST TIME! -ist bullshit labels don't fucking cut it anymore.\n\nBy all means tho. Keep it up. It's really working.", "\"-Say no more sir.\"", "Why does there need to be balance? I mean it's his show. He can say what he wants. ", "Reddit is always like this. God help you if you don't agree with the hivemind. ", "&gt; I'm sure there were a lot of Trump people too who didn't talk about it a lot. \n\nThat right there is how he won and how he took everyone by surprise in doing so.", "&gt; Now he better make do with his promise LOCK HER UP.\n\nOh and what will you do if he doesn't?", "Don't forget the massive charges of Voter fraud in many key Primary victories for Hillary. Also far exceeding exit polls as well. \n\nEdit: Election Fraud", "The shills are gone.  It feels free in here again. ", "Democracy is fine. America is not. We don't deserve Democracy. Americans are fucking idiots and vote for whatever the media tells them or puts in their head. \n\nThat goes for half of you fucks in this sub too who voted for Hillary in the Primary you dumb shits. The whole country knew she'd lose to Trump and you did it anyways. Prime example. \n\nBut enough ranting, in all seriousness, the country *hated* both candidates. And instead of banding together and finding a good 3rd party candidate to elect, we think we're pigeonholed in to picking Republican or Democrat nominee. Most people don't research the amendments they vote on beforehand. Most people only \"research\" a candidate what they hear on CNN, Fox, or MSNBC. \n\nWe don't deserve Democracy. The system of government is fine. \n\n**We're** the fucking problem. ", "This is really fucking important. I know we need levity now but so many people have and continue to suffer because of backwards views of euthanasia and death in general. A step forward. ", "I think this is my favorite logic of all:\n\n&gt;did all of the people who vote for him; not know he has no respect for women? do women know this? I am trying as hard as i possibly can to wrap my head around this and no answer comes up as complete.\n\nYeah so, it turns out that I value my intelligence and autonomy more than my genitalia. I really dislike the way Trump has referred to women, but I hate even more the condescending liberals who decide that I must be an idiot for having a dissenting opinion. The world isn't black and white, politics is not right versus wrong, and judging me for my personal beliefs is far more offensive than someone making a rude comment about physical appearances.", "Legal weed and suicide... but no universal healthcare", "And guess what? He's gonna line his cabinet and his staff with people who don't share that view and they're the ones that handle all the small details. His attorney general ain't likely to share that opinion, either. He ain't gonna get a GOP congress to go along with it, as well.\n\nSo even if he does, somehow, actually have a consistent opinion on that particular issue. . .it *still* doesn't mean a whole lot.", "And yet the DNC will learn *nothing* in this mess. They'll continue propping up establishment candidates and suppressing any chances of another \"Bernie\". They have their hands too deep in the pockets of big business at this point. The only solution is to get money out of politics (and while that obviously won't happen within the next 4 years, hopefully it will eventually happen).", "Trump didn't say stupid things. He proposed a ban on a minority religion he proposed to use torture \"worse then waterboarding\" on the  families of suspected terrorists. He said he would go to war with a country if they so much as made rude gestures at our ships. Strip American citizens of their birthright so he can have an easier time deporting them. Deport legal refugees, close all mosques. Sensor the internet. Open up libel law to attack press he doesn't like. Appoint a supreme court justice to investigate Clinton's email (investigations isn't even what the supreme court does)\n\nIf these positions aren't enough to disqualify him for dog catcher in your eye let alone president. Then you're the one voting with emotion, you're either lying to us, your yourself. ", "Rape letter being in a crowd in Nicaragua that was chanting anti-american things, self described socialist, atheist-jewish religious views, communist flag in his mayors office, honeymoon to ussr and thats just the stuff from memory that would definitely be damaging to his campaign. ", "Improving the rights of minorities is progress.\n\nScience is progress.\n\nBoth of those are either stunted or reversed now.", "&gt; ridiculous rural turnout that blindsided all pollsters and both campaigns?\n\nI mean Bernie won those swing states handily in the primaries.. Clinton won in the south which, ironically, went completely red. Just as predicted.", "That's a lot better than selling Stingers to our enemies.", "To be fair Trump won the Michigan (and probably Wisconsin) primaries as well.\n\n~~And I think Trump may have actually pulled in more votes than Bernie did.~~ Edit: This was only true for my county specifically. Statewide, Bernie got over 100,000 more votes than Trump did.\n\n~~I unfortunately cannot find the actual number of votes for each candidate in the primaries, as all search results are swarmed by the November election instead of the March primaries (even when I search for March, sites like New York Times have overwritten their Michigan page with the November election results).~~\n\nFound a source: http://www.mlive.com/news/index.ssf/2016/03/live_results_michigan_primary.html\n\nThough with Bernie's campaign style, with him focusing on the issues, there is no doubt he would have gotten a lot of support. And the \"lesser of two evils\" would have been soooooo clear.", "Pence does.", "Instead Podesta came out and told them to stay awake. \n\n\nIt seemed cold, kinda sums up why so many people dislike her. ", "20+ years.\n\nLGBT Rights Abortion, Weather Change, hell me may even have to pray before clocking in to work.", "I mean yea but I'll just settle for a fair primary.", "Just sayin'. Republicans are the ones who typically vote for more NASA spending.", "&gt;\"Let’s face it: Our biggest problem here isn’t Trump – it’s Hillary. She is hugely unpopular — nearly 70% of all voters think she is untrustworthy and dishonest\" wrote Moore. \"She represents the old way of politics, not really believing in anything other than what can get you elected.\"   \n   \n...and this is what happens. I only knew a few people who *loved* Hillary (granted, I'm young). Despite living in an extremely liberal area, I knew more people who were die-hard Trump than die-hard Clinton. I say this as a liberal myself: We can't push mud up a hill with our hands.    \n   \nI just hope for two things:  \n   \n* reform in the DNC    \n   \n* end of the 'anything to win' mentality in politics. That means not taking the help of several multi-million dollar superpacs during the primary season where you face off against a small Senator from Vermont who only takes donations, alienating his base. ", "Not by millenials.", "You're absolutely right.  WTF were they thinking?!?!", "It's possible she literally didn't write a concession speech.", "When she wasn't busy for months at a time dodging reporters and refusing press conferences", "Think about the stuff that came out about Trump during this election. And yet the voters didn't bat an eye. You think some rape-fiction story he wrote in the 70s and occasional \"communist sympathy\" would have had that big of an impact? While I think it might have had some effect I think ultimately HRC lost because she is the epitome of the establishment, which is 90% of the reason people voted for Trump. Bernie ran his campaign on being anti-establishment, anti-Wall St. etc. It wouldn't have been the same.", "If you continue with the victim-blaming this shit will just go on.\n\nDon't buy into DNC propaganda, I beg you. Instead of bowing your head and listen to their tune, blame those responsible and make them change it.", "Funny how the all of the Hillary supporters always said \"but she won by 4 million votes\". Pretty easy to do when you:\n\n1. Have full media support\n2. Have questionable vote favoritism in states without an audit trail\n3. Managed to get super delegate support well before anyone else is allowed to vote\n\nTo think she did not cheat her way to that 4 million vote majority is rather naive given the outcome of tonight's election.", "You can't run a corporatist pro-establishment centrist democrat against a centrist populist republican. She alienated the left and all the lower-income people who wanted some hope.", "Young people are shifting conservative actually. It's becoming a more even split than we have been led to believe. \n\nCollege-educated young people remain overwhelmingly liberal, though, and that is partly because of the intense liberal environment that colleges provide."], "links": ["5byrar", "5bygln", "5byvn1", "5byrar", "5byrar", "5byrar", "5byorc", "5byrar", "5byrar", "5bygln", "5byrar", "5bwdrp", "5bygln", "5byrar", "5byrar", "5byrar", "5bygln", "5byorc", "5bygln", "5bygln", "5byorc", "5bwdrp", "5bygln", "5byrar", "5byvn1", "5byorc", "5bygln", "5bygln", "5bygln", "5byorc", "5byorc", "5bygln", "5bygln", "5byqky", "5bygln", "5byrar", "5byorc", "5bygln", "5byorc", "5byorc", "5bygln", "5byorc", "5byvn1", "5byqky", "5bygln", "5byorc", "5byrar", "5bygln", "5byrar", "5byrar", "5byorc", "5bygln", "5bwdrp", "5bwdrp", "5byorc", "5bygln", "5byrar", "5byorc", "5byorc", "5bygln", "5byorc", "5bwdrp", "5bygln", "5bygln", "5bygln", "5byorc", "5bygln", "5bygln", "5byorc", "5bygln", "5bygln", "5byorc", "5bwdrp", "5byrar", "5byorc", "5bygln", "5bygln", "5byrar", "5bygln", "5bygln", "5byorc", "5byrar", "5byrar", "5byrar", "5byorc", "5byorc", "5byrar", "5bygln", "5byorc", "5byrar", "5byorc", "5byqky", "5byorc", "5byrar", "5byrar", "5byrar", "5bygln", "5bz3wn", "5bygln", "5byrar", "5byrar", "5byrar", "5byrar", "5byrar", "5byrar", "5byrar", "5bz3wn", "5byrar", "5bz70q", "5byrar", "5byrar", "5byrar", "5byrar", "5byvn1", "5byxwj", "5bygln", "5bz70q", "5byrar", "5bz70q", "5byy3d", "5bygln", "5byrar", "5bz70q", "5bz70q", "5byrar", "5byy3d", "5byrar", "5byrar", "5bygln", "5byrar", "5bz70q", "5byrar", "5bygln", "5byrar", "5byrar", "5byrar", "5bz70q", "5bz70q", "5bz3wn", "5bygln", "5bz3wn", "5bz70q", "5bz3wn", "5bygln", "5byrar", "5bygln", "5byy3d", "5byrar", "5byrar", "5byrar", "5byrar", "5byxwj", "5bz70q", "5byrar", "5byrar", "5byxwj", "5byy3d", "5byrar", "5bygln", "5bz70q", "5byy3d", "5byy3d", "5byy3d", "5byrar", "5bygln", "5bygln", "5bz70q", "5byrar", "5byrar", "5bz70q", "5bygln", "5bygln", "5bygln", "5bz70q", "5byrar", "5bygln", "5bygln", "5bz70q", "5bygln", "5byzy9", "5bygln", "5byrar", "5byy3d", "5byrar", "5byrar", "5byrar", "5byrar", "5bygln", "5byy3d", "5bz70q", "5byy3d", "5bygln", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5byrar", "5bzh35", "5bzh35", "5bzh35", "5byrar", "5byrar", "5bzh35", "5bzh35", "5bygln", "5bzh35", "5byrar", "5bzh35", "5bzh35", "5byrar", "5bzh35", "5bygln", "5byrar", "5bzh35", "5byrar", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzljz", "5byrar", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5byrar", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5byrar", "5bzh35", "5bzh35", "5byrar", "5byrar", "5bzh35", "5bzh35", "5byrar", "5byrar", "5byrar", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bz70q", "5bzh35", "5byrar", "5bzh35", "5bzh35", "5byrar", "5bzh35", "5bz70q", "5bygln", "5byrar", "5bzh35", "5bzh35", "5byrar", "5bzh35", "5bzh35", "5bzh35", "5bzh35", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5bzscq", "5bzot4", "5bzot4", "5bzot4", "5bzuef", "5bzh35", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5bzh35", "5bzscq", "5bzscq", "5bzot4", "5bzh35", "5bzh35", "5bzh35", "5bzuef", "5byrar", "5bzot4", "5bzh35", "5byrar", "5bzh35", "5bzot4", "5bzh35", "5bzot4", "5byrar", "5bzljz", "5bzscq", "5bzuef", "5bzot4", "5bzot4", "5bzh35", "5bzh35", "5bzh35", "5bzot4", "5byrar", "5bz3wn", "5bzh35", "5bzuef", "5bzot4", "5bzuef", "5bzh35", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5bzuef", "5bzscq", "5bzscq", "5bzh35", "5byrar", "5bzot4", "5bzuef", "5bzot4", "5byrar", "5bzh35", "5byrar", "5bzh35", "5byrar", "5bzh35", "5bzljz", "5bzot4", "5bzh35", "5bzh35", "5bzljz", "5bzh35", "5bzh35", "5bzot4", "5bzot4", "5bzz3v", "5bzscq", "5bzh35", "5byrar", "5bz3wn", "5bzh35", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5bzh35", "5bzuef", "5bzot4", "5bzh35", "5byrar", "5bzh35", "5bzh35", "5bzuef", "5bzot4", "5bzh35", "5byrar", "5bzh35", "5byvn1", "5bzh35", "5bzz3v", "5bzot4", "5bzot4", "5bzot4", "5bzz3v", "5bzz3v", "5bzot4", "5c049k", "5bzscq", "5bzot4", "5bzot4", "5byrar", "5bzot4", "5bzscq", "5bzscq", "5bzot4", "5bzuef", "5bzz3v", "5bzot4", "5bzot4", "5bzscq", "5bzot4", "5bzh35", "5bzot4", "5bzz3v", "5bzot4", "5bzz3v", "5bzscq", "5bzot4", "5bzot4", "5bzh35", "5bzot4", "5bzot4", "5bzz3v", "5bzz3v", "5bzot4", "5byrar", "5c049k", "5bzz3v", "5bzh35", "5bzot4", "5bzot4", "5bzz3v", "5byrar", "5bzz3v", "5bzuef", "5bzscq", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5bzljz", "5bzz3v", "5bzz3v", "5bzh35", "5bzz3v", "5bzz3v", "5bzot4", "5bzz3v", "5bzot4", "5byvn1", "5bzz3v", "5bzot4", "5bzuef", "5bzot4", "5bzot4", "5bzz3v", "5bzot4", "5bzot4", "5bzot4", "5bzz3v", "5bzot4", "5bzz3v", "5bzot4", "5bzuef", "5bzot4", "5c049k", "5bzot4", "5bzz3v", "5bzuef", "5bzot4", "5bzot4", "5c049k", "5bzot4", "5bzh35", "5bzz3v", "5bzot4", "5bzot4", "5bzh35", "5bzz3v", "5bzot4", "5bzz3v", "5bzz3v", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5c0e5h", "5bzscq", "5bzot4", "5bzot4", "5bzot4", "5bz3wn", "5bzot4", "5byrar", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5bzscq", "5bzot4", "5bzscq", "5bzscq", "5bzot4", "5bzot4", "5c0e5h", "5byrar", "5bzz3v", "5bzot4", "5bzuef", "5byrar", "5bzh35", "5c049k", "5bzot4", "5c0e5h", "5bzot4", "5bzz3v", "5bzot4", "5bz3wn", "5c0e5h", "5bzot4", "5bzuef", "5byvn1", "5bzuef", "5bzot4", "5bz3wn", "5bzot4", "5byrar", "5bzot4", "5bzuef", "5bzot4", "5bzot4", "5bzot4", "5bzscq", "5bz3wn", "5bzot4", "5bzot4", "5bzot4", "5bzscq", "5bzot4", "5bzot4", "5bzz3v", "5bzot4", "5bz3wn", "5c0e5h", "5byvn1", "5bzot4", "5bzscq", "5bzot4", "5bzscq", "5bzot4", "5bz3wn", "5c049k", "5byvn1", "5bzh35", "5byvn1", "5bycvt", "5bzot4", "5bzz3v", "5bzuef", "5bz3wn", "5bzot4", "5bzh35", "5bzuef", "5c06cp", "5c05x5", "5bz3wn", "5bzot4", "5bz3wn", "5c0b5g", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5bzuef", "5bzot4", "5bzot4", "5c0b5g", "5bz3wn"]}