{"comments": ["Although this has been a sad and troubling day for many people I think it has been an extremely valuable catalyst for reflection on the current state of the Western world.\n\nSupport for Trump, much like Brexit, was based upon an extremely widespread feeling that average people are not getting their fair share of the benefits of globalisation. This is neither a specifically Democrat or Republican problem, and people have been saying it one way or another for years.\n\nIt was also the foundation of Sanders' campaign. The difference is that Sanders blamed deregulation and big corporate bonuses while Trump blamed immigration and open borders. I'm sure that there are elements of truth to both of these positions.\n\nWhat Trump has shown us is that this issue is now so potent that a candidate, regardless of his flaws or his 'unelectability', can become president almost entirely by promising to change the status quo. \n\nWhile personally I deplore Trump for his positions on race, gender and religion, I also do not believe that this is the end of the line for the liberal ideals of tolerance, progress and diversity. I do not believe that the Democratic party is dead, but I believe that it needs to heed the call of the electorate, and focus on delivering a message that combines these ideals with policies that ensure the average, working class American is not left behind either. By appealing to intellectual elites and refusing to drastically overhaul the 'establishment' the Democrats have missed a big opportunity for real grassroots change.\n\nIn short, I think that Sanders-brand progressive liberalism is the only future for the Democratic party.", "Not just this year. For the next 30-40 years. Good job DNC for promising us a Heritage Foundation Supreme Court.", "Sanders does well with white working class rural voters. \n\nGuess who just elected Trump?", "Who could possibly have foreseen this?!\n\nOh right like every Sanders supporter.", "Honestly this sort of astroturfing makes people think that they're being called stupid and probably pushed quite a few people towards Trump ", "I'm not anti-Hilary but this strikes me as a bit of a \"fuck you\" to her supporters waiting all night to hear her speak...", "Or at least made it impossible to stomach voting for Clinton.", "This is what bothers me. This election just reinforces all of those behaviors the GOP did and nobody held the accountable. Government shutdown holding hostage the nomination of Supreme Court, absolutely refusing to work with the president on anything. \n\nDemocrats will have to rise up and realize they have to fight these people. ", "Well that means Republicans will never get rid of the electoral college.", "&gt;In Oakland demonstrators smashed a window at the Oakland Tribune newsroom and ignited dumpsters and tires\n\nWhy engage in vandalism?", "The media lied knowing they were lying it wasn't a lack of professionalism.", "I DON'T EVEN KNOW IF IT'S CURRENT YEAR. I DON'T KNOW. I DON'T! [hysterical hand gestures]", "Oakland.", "Nailed it. This should be higher up.\n\nThe DNC knew that Clinton was a weak candidate. But favors were owed and they and their donors preferred \"any Republican\" over Bernie.  This isn't conjecture it's in the fucking emails.", "I've said this for a whole full year. If we get Clinton we get Trump. Everybody told me I was nuts. And here we are.", "**The fucking nerve of you people.**\n\nThis is why Donald Trump won.  Sneering liberal elitism.  \"Can't trust the unwashed masses to make the right decisions\"  \"Maybe we should have voter tests\" \"Democracy might be a mistake\".\n\nThis is why we lost Wisconsin.  This is why we lost Michigan.  This is why we lost North Carolina.  Because of this fucking attitude right here.  You want to know why \"the masses\" the poor, working white man, the bread and butter of this country, didn't vote Democract?  Because all the way, up until it was too late, they acted like they didn't need their vote.  \"Oh, are you uneducated?  Sorry, we don't need your kind to vote for us\"  \"Oh, are you not as socially liberal as we'd prefer you to be?  Vote for the fascist, he's right over thataway\".\n\nChina is laughing at us, because they get to be elitist fucks while pretending to be communists.  They get to have their cake and eat it too.  That's nothing to fucking admire.  Democracy isn't the problem.  Not giving people enough of a reason to vote for us was the problem, and we have no one to blame but ourselves.  Would the prospect of voting against someone even \"worse\" help?  Absolutely.  But not when you drive away every potential voter for not having been on board since the beginning.  And when the other guy welcomes them with open arms.  With a hat and a coat.  \n\nAnd here we fucking all are, sore losers trying to blame the poor bastard who lost their automation industry job because the economy moves faster than any generation can sanely be expected to keep up with.  And we have nothing to offer them but more of the same, you think they're gonna agree with that?  So they vote for the guy whose at least selling them something, at least wants their vote, at least tries to level with them.  And what do we fucking do when we realized what fools' we've all been?  Line up the scapegoat pinata and start hitting.  Yeah, democracy as a system, that's the problem here.  All those poor, stupid people who just don't know what's good for them.  In fact, we should let them know!  As loudly as fucking possible.  Well whoop-dee doo da day guys, now we can set ourselves up to snatch defeat from the jaws of victory all over again in 2020.  That's the takeaway from all this.  When we lose an election because people don't like being talked down to by the elitists, we remedy the situation by acting like a bunch of indignant, elitist little shits.  Bravo guys.  Let's walk away from this and learn zero lessons about what we should have done differently.  Society crumbles when it's people lose their principles.  ", "Sanders voter here. I'm taking zero joy in this. ", "I'm a thirty year old woman and a feminist. I can tell you that not even dragging me through glass shards could force me to vote for that corrupt sack of crap. She has a vagina? So do I. You know what real feminism is? Not voting for someone just because they're a woman but because they are *qualified* for the position. \n\nI voted third party. And yes, I would've voted for Bernie (and did during the primaries). Calling the massive amount of women who supported Sanders \"Bernie Bros\" was a stupid move. \n\nEdit: I find it extremely disgusting that a large group of you, who claim to be 'enlightened' and 'kind' in your support of Hillary Clinton, are also the same people who as SOON as a woman doesn't agree with you is eligible to have her *pussy* grabbed. I find it obscene that you think I don't understand the importance of Planned Parenthood, and the right to abortions. After all, this article we're discussing is about college-educated white women. Did it occur to you that almost every college educated white woman like myself has had and used birth control at some point?\n\nRoe v. Wade is far, far more important to folks like myself than you realize. Our right to do with our bodies as we please is crucial- something several of you seem to have determined can be ignored because I chose to vote 3rd party. But did it occur to you that perhaps some of us realized that the \"lesser of two evils\" is still *condoning evil*? That we have to take a stand at some point, and say that we are no longer willing to put people like the corrupt, untrustworthy monstrosity of Hillary Clinton in the White House where she will continue her destructive path against the environment and foreign policy- where she LAUGHS, talking about little girls being raped?- that maybe we have to stop telling our establishment that the \"lesser of two evils\" is acceptable? Because they will KEEP fielding their WORST candidates possible as long as they aren't \"as evil\" as the alternative? \n\nThey didn't want Bernie because they don't want real change. But they COUNTED on people like me not to vote against our best interests. I will take the fight to my Senator and my House Representative, I will take the fight to the streets and rally every vote as best as I can, I will threaten and conjole and sue my way through the next four years if I have to, but I will NOT continue to allow a corrupt and disgusting establishment to continue to count on me being willing to turn my back on what we NEED in order to preserve the few freedoms we've already won.\n\nFurthermore, we've already won them! We can take them back if some asshole pushes us again. We can mobilize in greater numbers now than ever before and accomplish what we need to accomplish but another war-hungry, money-grubbing establishment candidate who wants to screw our future into the ground is the last thing we need.\n\nI mourn what will become of our environment. I mourn the hardships we will face under this presidency. But do you know what I hate more even than that? The secret misogynist assholes who were only willing to value my right to my body as long as I fell in line with their beliefs. The bastards who feel confident in saying since I voted third party, I voted Trump, and that makes me ignorant and puts my pussy on the line to be grabbed. You want to talk about what's really wrong? It's *you*. My body is only sacred as long as I agree with you? You entitled pricks.\n\nFriendly reminder; if you look at the polls, if every single person who voted 3rd party voted one way or another it wouldn't have changed the outcome. In other words *no*, it's not the people who voted 3rd party you're mad at. It's all the women who are too afraid of telling you they voted for Trump because you clearly don't respect their right to control their bodies when they say they disagree with you. Maybe if you weren't secretly waiting for the moment a woman says \"I feel differently\" to unleash vitriol and hatred on them, those women in your life who voted Republican would feel comfortable telling you why. And if that was the case, maybe you could try to actually make a change in politics that would encourage them to vote the way you want them to.", "&gt; I voted third party.\n\nWell as a fellow Bernie voter in the primary, I want to congratulate you on your victory over Clinton and the Democrats last night. \n\nNow we have Trump as the President elect, and he's totally not corrupt, or a bigot, or a lying dishonest tax avoiding sack of crap representing the absolute 0.1% of our country. I'm sure Trump will do tremendously great things for women everywhere, and feminism has a really bright future!!\n\nJust remember that third party voters have zero right to complain about Trump or any of the shit that he and his republicans say and do over the next four years (or lifetime for the new SCOTUS judge). As Bernie said, we all knew the stakes of this massively important election, and you're either voting for Trump or voting to prevent Trump.\n\nWell, now we have Trump!", "The media pundits sat behind their desks and lied to America over and over and they looked left and they looked right and repeated their lies back and forth to each other so much that they forgot they were lying. Then they were shocked when Trump won the election because they had been in an echo chamber of lies throughout the whole election. Then they took off their microphones clips and went home and it wasn't until they lied down in bed that they realized that they were all lying liars.", "But you dont understand it was her turn.", "They did release stuff about the election being rigged against Bernie. That's why the DNC head resigned when the leaks came out. Nobody cared though and still supported Hilary. Terrible it should have been Bernie the whole time.", "I don't think either party will stop picking candidates that establishment people benefit from but they will be more attentive to their charisma.\n\nI don't think government officials will stop dodging transparency attempts like FOIA, but they will certainly take security more seriously.", "[Those were girls looking for attention from boys remember ?](https://www.theguardian.com/us-news/2016/feb/06/bernie-sanders-gloria-steinem-women-voters-men-hillary-clinton) ", "I agree with 1 and 3 but as for 2 Hispanics were quite mobilized and they had great turnout. \n\nHowever, unfortunately for the Democrats, about 35% of them voted for Trump. And less of them voted for Hillary than voted for Romney in 2012. ", "So strange to have our old site back. This would never have made it past /new 20 hours ago. ", "All the things the media thought would hurt him didn't. [Despite being characterized as racist he did slightly better with than Mitt Romney did in 2012 among African Americans and Latinos. Despite the Billy Bush tapes, Hillary did worse among women than Obama did in 2012 (54% vs 55%).](http://www.cnn.com/2016/11/09/politics/clinton-votes-african-americans-latinos-women-white-voters/)", "They control all the branches of government now.", "You're going to have to face the reality that Fox News gave the most unbiased reporting of any major outlet this election cycle.   They hated on Trump as much as they supported him and they're the only outlet that gave Clinton's scandals the attention they deserved. ", "At the end of the day we will still have democrats in charge of every aspect of state government.  We will be pretty well insulated from whatever the Orange One is going to unleash.  Others states won't be so lucky.", "I liked when they said Bernie was a gun nut responsible for Sandy Hook", "It's not experience that hurt her. Bernie was the clear anti-establishment candidate despite being a life-long politician who has held some form of office for like the past 200 years. It was all about Hillary's friends connections, donors, and piss-poor record.", "Definitely sends the message that politicians don't need to bother catering to college-educated women. ", "Many of us were telling people exactly this a year ago but just got blown off like \"no no Hillary is the better choice to defeat trump cause reasons.\"", "It's true though - when was the last time you saw an anti hillary thing this far up?", "DWS should be removed from any position of influence in the Democratic party: this is just as much he fault as anyone else\n\nedit: meant to say party not DNC.", "It wouldn't be the first time it has happened.", "lol yeah sure", "Yep living in California is a saving grace, and we have recreational pot now too.", "&gt;Honestly this sort of astroturfing makes people think that they're being called stupid\n\nHell, I literally was called stupid over and over again. ", "I laughed so hard because she is a feminist who hates men and apparently hates women who would support one.", "Trump had 9.9% in San Francisco county last I checked. He also lost Orange first Republican to do so since... I don't know when.\n\nIt's pretty damn obvious the Mexican American vote was overwhelming. Just not as much as the working class white vote.", "Classic shitty campaigning. Her supporters should have realized how divisive that is and ditched her for Sanders to prevent this exact scenario. The primary is about picking the most electable candidate in the general not alienating your own base. ANYTHING contrary to electability needs to be punished, especially if it undermines turnout for your side.", "I've braced myself for President Rubio/Bush since 2012. Not this. In fact this still feels like a joke.", "It was really uplifting seeing the comparison of his announcement rally with a taped up banner in front of like 30 people and one of his later 30000+ rallies.\n\nAnd really depressing knowing we missed out. I really hope history remembers him fondly, but I have a feeling the DNC and their media lackies are going to scapegoat him for Hillary's loss. They were already blaming millennials for voting third party last night. \n", "Trump won because he had an energized base found people who felt disenfranchised with the establishment and he was traveling the country filling stadiums with people waiting half a day to see him.  That's Bernie's MO.  He would have won.", "Trump got the people who never voted in their lives and they went to vote for him because washington ignored him but he didn't the same with brexit, people voted leave on a protest to give the uk government the finger", "Holy fuck. A negative clinton article in /r/politics", "His critics have been thoroughly repudiated by the events of last night.  He's long been speaking of these lost rust belt voters and warned what they could do.  And they have done exactly as he predicted and thrown the baby out with the bath water.\n\nThe despair I felt last night watching an inclusive American future burn is fading into embers, but some small portion of me finds it ironic that I'm experiencing the exact emotion that those voters have likely been feeling for *years*.  Revenge election, indeed.", "We'll see. They already forgot eight years of Bush and have since blended it into Obama's presidency. And Trump won in large part campaigning on the notion that things are terrible now in spite of low unemployment and an improving economy. Trippling down on a false narrative wouldn't surprise me.", "People need to learn to accept the fact that roughly 50% of the elections in your lifetime are going to be won by the major-party candidate that you dislike more. \n\nOnce you've accepted that fact politics is much easier to face. ", "And if there's one thing we know about young people it's that they *fucking love Hillary Clinton*.  So much so that you couldn't get a negative story about her (or a positive one about Trump) on this subreddit for four months straight. \n\nBecause young people.  Yeah. ", "Probably because all the paid shills flooding r/politics with shitposts are out of a job.", "We do. Those who should not be named are gone.", "She comes from an ethnic group who has been severely underrepresented and faced significant discrimination since the southwest was annexed 160 years ago. It's a proud day in our country every time we can prove race/creed/heritage/gender does not matter when it comes to what some one is capable of. ", "In 4 years you'll reminisce about 4 years ago. I hope everyone who voted Republican has a snapshot of what the economy looks like today having a market dip lower than that of 9/11 is what's on the horizon. ", "I think the media's largest mistake wasnt even the massive amounts of anti-Trump pieces but the fact that they tried to pass Hillary off as a saint which very few people actually buy that. ", "&gt; and then switched to trump and voted downballot republican even though we don't agree with any of their policies\n\nYou don't agree with any of their policies but you just helped them take control of every branch of government. I don't understand.", "The beauty of the American system is that it is a Representative Republic and not a Democracy. That way the majority of America is represented and not the majority of Americans. No one wants the leader of America to only be representative of a few select populous states.  The Founding Father's knew that if you had a Democracy then at the time, New York, Massachusetts, and Virginia would control the fate of Georgia, New Hampshire, Maine etc...  We are the United STATES of America. Is the system perfect? No. But it is fair in a nation as big and diverse as this country.  ", "And sending Taylor Swift to perform a concert at a school for the deaf. ", "So we vote for the guy who has a history of abusing small businesses and ripping off contractors and employees.", "With Trump at the helm every white supremacist, xenophobe, homophobe, transphobic, misogynist, anti semite, etc has been galvanized. \n\nThings are about to get a lot, *lot* more toxic.", "if the outcome of the presidential elections last night weren't the most karmic fuck you to the DNC then i would be shocked.  because Hillary CNN and the DNC cheated we are now stuck with this blow hard for 4 years.  thanks, DNC.", "I was talking about r/hillaryclinton. They disabled submissions and comments on a lot of threads without making any announcement about an hour before Trump won. I'm not sure if they were getting paid over there or not. We all know what's going on here.", "I don't think we've seen the end of astoturfing on reddit. We've seen how effective it is at quelling popular sentiment and politics never ends. There will be other monied agendas that use astoturfing.\n\nEdit: grammar", "They did polling back then although it was far enough away that you couldn't call it reliable. However, it had hillary and trump at a tie, with bernie beating trump by 10 points. Also, hillary was able to win the nomination primarily through a firewall in the south. Unfortunately, many of those states frequently go red during general elections. So her strength in the primary did not translate to a general election strength.", "Identity politics doesn't work.", "That one honestly disgusted me. I was pretty kind this election despite being called some horrible things.\n\nWomen MAY chase dick just as men MAY chase vagina.\n\nBut our vote is a little more private. No need to attack people for it.", "The shitty part is Clinton lost Wisconsin and Michigan and then just never decided to shore up those states after the primary. She just assumed that everybody would fall in line and didn't bother to campaign. If she didn't feel so damn entitled to the presidency then she might have had it.", "And you'll have plenty of them once contraception is banned.", "I was called sexist a Bernie Bro and made felt like and idiot by various  people correcting my record. Those who laugh last laugh best. DNC stole the election from Sanders and handed it over to Trump all because it was \"her turn\".  I'll never vote DNC again, we need real progressives not corporate progressives. ", "True. It's always just that little extra salt in the wound kind of feeling though.\n\nShit happens. ", "Dems are gonna be pissed if their candidate winds up winning the popular vote again but still losing the election. \n\nEDIT: Called it.", "If that's his only legacy it might still be worth it", "Propably I hope no intern was hurt.", "It was the intense propaganda storm from Clinton that ultimately lead me to go Trump &gt; Johnson in Florida. ", "No Roe for you. Real feminists don't need that.", "Kinda late for protesting", "This is true. Picking Kaine as her VP was probably her biggest screw up (outside of the primaries). The VP slot was a great way to reach out to the left and she blew it by picking someone even more centrist than she is. ", "Remember when Newt Gringrich ran for president and he wanted to increase NASA spending and return to the moon?  Ultimately paving the way to reach Mars and he was immediately laughed out of the goddamned room.  That really pissed me off.", "There's a protest going on in portland OR right now for the same thing. Would be crazy if these protests continued. Though I fear they will probably do nothing to change the fact that we are all fucked. ", "Pretty sure all the lights are red. Shit our government is red.", "Just remember to be civil.", "It's important to note that this doesn't tell us what the outcome would have been if it were based on the popular vote rather than the electoral vote. People factor in their state when deciding who they will vote for or if they will vote at all.", "It's all the same mods dude. Let this sub die.", "Jeb had a huge amount of money going into the primary. Romney didn't run because Jeb hired away all the competent campaign staff. So you had Jeb with money and a bunch of nutters with no chance and Trump. Trouble with Jeb is he's toxic because of GWB. He couldn't get the votes.\n\nSo the Republicans shit their bed to.\n", "George W. Bush was friends with a guy who supported the hijackers of 9/11. The Saudis have been doing this for a long time.", "&gt;California. Secede. \n\nWith what weapons???\n", "&gt; They chose insulting the other side over trying to understand what motivated them. \n\nThey're still doing this by and large. ", "A family? You think we're a family? Family doesn't turn their back on their brothers and sisters because of their religion. Family doesn't disparage an entire swath of their kin because of the color of their skin. Family doesn't treat their sisters and daughters like they are toys to be grabbed and played with.\n\nWe might live under the same roof, but we are no goddamn family.", "Voting for downballot Republicans was a spectacularly idiotic move if you truly supported Bernie's policies. It's fine if you want to spite Clinton by electing Trump - I almost did the same - but to hand him both the House and the Senate so he can actually do some damage? You fucked up. ", "Trump is not a typical Republican. In fact he used to be a Democrat with moderate views. I don't think it's a guarantee that he will ban abortion and all that other stuff you mentioned. I strongly suspect he's not even religious. As Sam Harris said, it's ironic that evangelists may have elected our first atheist president.", "Podesta literally told everybody to go to sleep. And they applauded. What?", "which is why i said it's stupid to compare them ", "Maybe they didn't vote because with their degree they saw she was ultra fucking corrupt and decided to vote for someone else. \n\nOr...\n\nMaybe they have views different from other college educated women!", "West coast states came out huge for Clinton. Too bad innercity voters are worth 3/5ths the vote of rural voters. ", "Too bad the DNC and Hillary camp could care less about all those people you mentioned and who would best serve them or they would have made it a fair campaign and actually given Bernie a fair chance.  Their egos are what got us into this mess.", "Debbie Wasserman Schultz and the DNC lost bernie Sanders' candidacy.", "Classy.\n\nAnd there's a word you're not going to hear used to describe the president for the next 4 years...", "Worst candidate in American history.\n\nFirst she's beaten by an unknown black man with a Muslim-sounding name.\n\nThen she nearly loses to an unknown self-described socialist and only wins by rigging it.\n\nNow she loses to a misogynistic racist, xenophobic, reality TV star.", "It's already fucked. When elections are not about policies but about  picking Supreme Court judges to push your policies you know something went wrong somewhere. The Supreme Court is NOT supposed to be that important. ", "For them to have a point we'd need to have a democracy.", "That's going to be awkward.", "The Bernie Sanders candidacy didn’t die a natural death — it was murdered. And the murder weapon has the fingerprints of the Washington Post all over it.", "And fuck the smug fucking bastards here on reddit constantly bashing Bernie supporters and their analyses of this election.\n\nWE CALLED IT! WE FUCKING CALLED IT YOU SMARMY ASSHOLES!\n\nTurns out constantly ridiculing everyone who even slightly disagrees with you makes them not likely to vote for your representative. Funny that.\n\nI just want all of you who constantly shat on us Bernie supporters throughout this election to realize that you are the cause of this. Every time you called someone who dared disagree with you a Trump supporter, every time you called us naive and childish, every time you shat on our opinion, you helped radicalized more people and convinced them to vote Trump. I voted for Hillary, but god damn did I hate doing so, and all because of the holier than thou attitude shown by the massive amounts of assholishness shown by the Clinton camp.\n\nSo thanks for that, Democrats. You brought this on yourself. Maybe next time you'll start by reaching out instead of ridiculing.", "This is everything that I like about Obama. He needs to spend both his lame duck months and his time after his handover teaching us all how to accept one another and rebuild the bridges we all burned during this election.", "\"You don't look like Hillary\".", "It's almost... as if... a lot of people were paid to suppress what people actually wanted to say.", "I think this is what people are missing... Trump didn't get voted in because he represents change or because he's going to be a great President... he got voted in because people were sending a message to the government establishments... \n\nand bernie supporters sent a loud and clear message \"next time... don't fuck with the primaries... let democracy happen, and let them win and lose fair and square\"", "Holy shit... Is this non-leftists that I'm seeing? On /r/politics???.\n\nedit: thank you for dragging my comment karma for this sub back from the negatives! I can now post without a restriction again weeeeeeew", "They were so disillusioned about the whole thing it really shows not just the Republicans need some serious reform. Both sides didn't take Trump seriously until he basically swept up the elections by encouraging the rural voters to show up. Both sides have been so fucused on trying to get the minority and city vote they kind of forgot people still lived in the undeveloped areas where Trump really kicked ass in.\n\nI hate the fucker but he really shit on the party's view of things. Hopefully this will he a lesson not to underestimate the rural and suburban white populations.", "\"Thanks.\"", "Or people are embarrassed to tell the truth. ", "Sure as hell pushed me towards Johnson. If I couldn't even discuss her sketchiness without getting toxic vomit all over me... If that's what her supporters were like then there was something wrong. It's like Scientology, I don't have to know shit about the religion to not like it, I just need to see Tom Cruise. ", "Gold plated everything isn't classy?", "That's a \"win\"? Are you fucking kidding me?\n\nTrump insulted:\n\n- Woman\n\n- Mexicans\n\n- Latinos\n\n- Blacks\n\n- The disabled\n\n- Veterans\n\n- Gays\n\n- And on and on and on.\n\nAnd despite ALL OF THAT Hillary couldn't do better than .1%?!\n\nThat's not a win. That's an indictment of her as a person. ", "I didn't even vote for Trump and I fully approve. Clean up this fucking shitpoodle of a place!", "This ⬆. The elephant in the room. Say you'd vote for Hillary to avoid being labeled misogynistic xenophobic, bunny boiler, kids' lunch stealer and what not; then vote for Trump when the D day comes. ", "The same kind of attacks happened here on Reddit too.  There seems to be quite a few status quo Democrats on Reddit attacking anyone who dared to denounce the system or promote Sanders. ", "The bubble has popped. There's no longer any point in pretending she ever was a good candidate.", "So what happens when the anti-clinton stories fade away?  Do we wake up with a terrible hang over that Trump Pence, Ryan, Newt, McConnell and the rest of the tea party and alt right are in charge of the country.  Do we realize that ending gay marriage, privatizing education and roads, ending social security, giving the power back to the insurance companies and building a wall are the cornerstone policies of the administration?  This sub has proven to be very left leaning and the \"clinton is the literal devil\" and \"bernie should have won\" will eventually dissipate and we will have to face the fact that the tea party, christian conservatives, and right wing now control all levels of government.  \n\nedit to add: I'm watching a couple of things to see what we are getting with Trump.  I know people being sick of the elites and \"pay for play\" was a big part of what got him elected so I will be watching [this space](http://www.politico.com/story/2016/08/trumps-economic-advisers-are-also-his-biggest-donors-226758)\n", "You Americans won't get rid of your terrible two party systems by blaming and insulting everyone who goes against it.", "They're busy packing for Canada.", "I'll never trust this sub again. I hope the group running it are happy that they wasted what little integrity this place had for a failed candidate.  ", "So in other words Clinton supporters were just mindless people who ate up whatever their side said, and then ignored everything else and dismissed them as Russian conspiracies. \n\n", "We elected a dead gorilla. Whats the difference.", "It's likely that people don't take media's accusations of racism sexism, homophobia etc. seriously anymore. I certainly don't. \n\nIf [air conditioning conditioning can be sexist](https://www.youtube.com/watch?v=MNH0bmYT7os), why can't Trump? ", "We saw a lot of things we've never seen before this election.  I think it was incredibky rude and disrespectful but she's probably going to say something today.\n", "The political elite *deserve* a giant middle finger for 30 years of sacrificing the interests of the voters for the benefit of connected interests (the 1% corporations, et alia). But why reward the very party that has done the most to screw us over?? That's the part i don't get. ", "god...i still can't believe she fucking LOST michigan and wisconsin. damn...worst candidate ever. ", "Hey this guy is pulling in historically large primary rallies... Rallies of a size that have never been seen before so early in the game. He also has such a passionate base, they volunteer around the clock and donate every time he smiles. In every poll we conduct, he dominates every Republican. Blue collar workers love him.\n\nSo we are going to go with the candidate who has historically low favorability ratings, riddled with insider scandal, and can't even fill a highschool gym. That's the best choice. ", "Or Anybody but Hillary &amp; Anyone else...", "So after all the talk of a rigged system it looks like it was actually \"rigged\" against the dems.", "Exactly any time you made a negative comment about her it was responded to with look at how much worse trump is. Was disgusting.", "Women voted against someone who has been fighting for their rights for decades.\n\nWomen voted for a guy who is proud of sexually assaulting women.\n\nWe are living in an SNL sketch right now.", "Cool victory Donald wanna bring it to the White House?", "Not like this.", "Yeah that's a problem when one side demonises the other to the point of their fanatics believing that the opposition are literally sub-human. It's a dangerous game. And I bet it screwed up Hillary's game plan too, perhaps fortunately.", "Hopefully Obama is welcoming and rises above Trump.\n\nThe country needs to believe the world isn't coming to an end.  That is still Obama's job for the next 2 months.  Part of that is getting the country to feel ok about Trump.\n\n", "Something something glass ceiling.... her turn... Time for a female president etc.\n\nWith reasons like that, I'm sure the DNC will think they have a winning candidate (again).", "What inclusive American future?  The Democratic party is still run mostly by rich white people who occasionally pander to minorities when they want them to turn out for an election.  \n\nSorry but that's the truth.  How many true blue states do we see with reps from 80% black districts but both senators are rich old white people?  And you really expected them to turn out in the general for a rich old white lady who hasn't done a fucking thing for them?", "Zephyr Teachout lost.  Russ Feingold lost.  Roy Cooper came damn close to losing despite being pretty far ahead.\n\nThis is not just her this is 2012's \"missing white vote\" actually showing up to the polls and overwhelming all of the minority votes combined.  And they were not down with Democratic policies in general.", "Get that garbage out of here and stick with facts. Only one party in this election wanted to take away the ACA and leave poor people with pre existing conditions absolutely fucked for healthcare. Only one party wants to slash corporate taxes and income taxes while slashing social services. There's no factual way you can say the Dems would have been as bad for poor people unless you cling to the notion that Hillary was going to abandon every single aspect of her official party platform. ", "Yeah that's what happened. My roommate's mom actually said \"Do you really think Hilary sold ambassador positions? Cmon. She's an old lady.\" When that stuff was coming out", "Those people who told you that you were nuts will now be telling you it was all your fault because you said it.", "It's terrible for them too. They'll just be happy they \"won\" while actually being harmed. It's quite a con. It's only great if you're a *rich* straight white male.", "I don't get it either. Donald Trump is supposed to be able to drain the swamp but his party is the same which has obstructed government action, failed to pass a budget, shut down the government, passed tax cuts for the wealthy, ensured that businesses get to take advantage of the poor, and many other problems.", "The electoral college is not inherently biased against democrats but the this is the second time in 5 elections it has fucked us.  ", "Things are looking great if you're a poorly educated straight white male.  Everyone else might see things differently.", "You are absolutely right. It was designed to be this way so that the big states couldn't push the agricultural states around.\n\nSo the Democrats MUST find a way to appeal to rural Christian, and less-educated voters AS WELL AS urban groups. Dems threw in with the cities and it's clearly not a winning strategy, especially when the old once-unionized Midwest is no longer in play for them.\n\nPeople have jobs, but they don't have union jobs. Unions aren't perfect, but they do keep pushing wages up. Bringing back low-wage factory jobs won't fix the problems, if that's even possible. Protectionism will drive up prices and without better wages, people will be hurting.\n\nThere's no easy solution to globalization. It wasn't done well. Taking pressure off companies like Wal-Mart and letting them import cheap shit, keep labor low, and let the money go to a few people was a REALLY BAD MOVE. I both parties are to blame for that and NEITHER party has offered any serious solution to problems like Wal-Mart.\n\nSo we'll see. There are positive ways to move forward even under Trump's vision, but if there's a double-down on slashed taxes and a general disregard for low wages, nothing will change and protectionism will make things worse. Killing the ACA might be a feel-good move, but stripping people's health care will hurt if there's not a new plan put in place that is serious about providing care for people. If the GOP is serious about actual governing and not looting the Treasury, maybe things will improve. The problem is, as a party, their track record hasn't shown that.\n\nAs for abortion rights, gay marriage rights, I predict a new SCOTUS that will limit rights in general, which will be a marked turnaround from the last 30-some years. Losing those rights will hurt, and it will hurt the rural poor as equally as it hurts the urban elite, but if abortion is taken off the table for the next generation by making it illegal again, then maybe the political alignment can finally change. Once the GOP gets their 2-3 justices in, things like abortion won't be on the table for 20 years or so.", "Hillary screwed America.", "I'd say it was larger. look at the fundraising ", "The only thing amusing about this whole thing is that there will probably be a stripper pole in the white house now.\n\n\nEdit: I get it guys Bill probably had one too.", "Jesus Christ I thought we left the year 2000 in the rearview 16 years ago.", "&gt; Trump always seemed to respect Bernie's efforts.\n\nPrior to the election Trump seemed to respect Hillary also. Trump didn't see Bernie as a threat, and never had a need to attack him.", "It's as if someone stopped paying some of the posters here.", "As did older Democrats and black Democrats.  Reddit was vituperative toward anyone who suggested that the latter group might be voting against their own self interests though, so it became a taboo subject during the primaries.  We'll see how it goes, but my guess is that North Carolina is only a taste of things to come.", "Well that's the electoral college, basically.  There's been more Democrats than Republicans for awhile now.", "Well yea they are running out of money with all the sanctions of course he wants normal relations ", "Obama won because he got a significant amount of independent voters to vote for him. Sanders was widely popular with independents moreso than anyone else. A lot of independents didn't even vote this time, compared to when Obama ran. \n\nSanders would have defeated Trump if he'd been the Democratic nominee. ", "Not just them. This is the fault of the DNC the Clinton campaign, and the media who worked against bernie. That was the only reason he lost 46-54. They gambled with the country and lost. ", "What I wouldn't give to be a fly on the wall during that meeting...", "This is the takeaway people are missing. Don't cater to Bernie voters don't cater to educated women: these demos won't win you the election.", "Bit late....you've got to say something to the supporters who have worked so hard for you.\n\nWe just had an election here in Oz. The result on the night of the election was close and the incumbent PM wasn't planning on saying anything that night. One of the right-wing radio announcers blasted him on air and the PM sheepishly drove to a studio to address the nation.", "Your observation is spot on. ~ As an aside Trump always seemed to respect Bernie's efforts. Trump usually trashes those who are against him. I honestly wonder how well our new president will work with the legislature. Could Trump and Sanders work together on trade issues? ", "The online astroturfing made her loss even more shocking to her non paid supporters.", "&gt; You know what real feminism is? Not voting for someone just because they're a woman but because they are qualified for the position.\n\nYou can't claim a moral or a rational judgment/position, if you only evaluate voting for Clinton - while ignoring what allowing a Trump presidency entails.", "Well part of that is because he addressed those people as people. He would hold town halls and rallies in deeply conservative states. He was going on Fox News to debate. He was making the effort to change minds and people can at least respect that.", "I voted for Hillary but I volunteered for bernie and donated to him and went to his huge rally in Atlanta.\n\nUs bernie supporters lost the election 6 months ago fighting against a rigged primary.", "Which is fucking pathetic honestly, when *Fox News* is the most unbiased media source you have.", "\"The \"liberal media\" ain't liberal they're corporatist\"\n\nThank you. When the \"liberal media\" starts reporting regularly on climate change, heavily covers the fight for $15 and gives an objective view on the historic impact of minimum wage increases (protip: its beneficial http://www.businessinsider.com/minimum-wage-effect-on-jobs-2016-5), and start speaking about the real reasons that we're involved in the middle east, then we can call them the liberal media, and I would call them that as a compliment. ", "Oregonian here maybe we should join forces, maybe let Washington in.  ", "Let's get this straight the DNC and Clinton people are the SAME people. Bernie never could have won. ", "I'm an energy scientist. And I am completely tanked right now. So I am going to tell you exactly what I think.\n\nIt's easy for me to pretend that that's it for alternative energy. Trump thinks climate change isn't real and he's going to destroy the DoE and the EPA and all the funding organizations that pay for our work. So on a basic level we're fucked.\n\nI'm lucky enough to be at an institution that isn't gonna have to cut back its research for lack of funding. That means that our work is more important, not less.\n\nBefore, we could hope for incremental policy and technological improvements, to kill climate change by inches and steady progress. That's not good enough anymore. We can't hope for policy changes or carbon taxes to drive investment in infrastructure. Now, we have to spin straw into gold. We have to make wonder materials that are competitive with fossil fuels without a political handicap. And we're gonna bloody well do it.\n\n", "This has been a fascinating ride [and it's not over] and I have to agree. FOX was honestly the only one I trusted or took more seriously. \n\nWhat a strange year.", "Trump crushed the two most powerful political dynasties in America. \n\nLike him or not this is a good thing. ", "Hillary should not have run. If she stays out of the spotlight after her term as Secretary of State then she and Bill remain the arch figures of the Democratic Party and their legacy would be successful public service unduly maligned by Republican witch hunts.\n\nMoreover the support for Bernie Sanders among white blue-collar independents, as seen from his historic primary turns in Michigan and Wisconsin, means the blue wall stays in one piece and the the Democrats most likely take the White House.\n\nThe Clintons harmed their own legacy. And because they put off white blue-collar independents they handed all three branches of government to the GOP -- which suggests they either harmed or destroyed the legacy of Barack Obama as well.\n\nThey need to step the hell off. At this point Carter is less of an embarrassment. Time to press for progressive populists in positions of DNC leadership. The reign of the Clintons is over. ", "And eight years later they had invaded the wrong country and nearly tanked the world economy. ", "Yeah but there are no more campaign funds to pay them off.", "Then blamed it all on Obama while obstructing him from cleaning up their mess.", "do you understand how voting works in the u.s.? or the electoral college?", "kek", "They'll settle for trickle down economics and crippling debt.", "I remember talking to my family more than a year ago about how excited I was and that just you wait, he's could be a great candidate.  I also remember supporting Bernie here on reddit, and how condescending and dismissive Clinton's supporters were after the primary, telling us to suck it up and fall in line.\n\nAnd you know what?  I did...I bit my tongue and voted for her because I was terrified of the alternative.  And it didn't matter, because she was a horrible, flawed candidate from the start.", "Id accept anyone but Trump. Any republican guy but him. Americans have no idea what theyve done and they will pay for it. The economy will collapse. People learn the hard way. ", "The DNC and the MSM knew all this because lots of people said so at the time.  It's obvious that the South is deeply republican only MSM propaganda claimed it would vote for Hillary.\n\nThey knowingly threw the election to prevent the anti-establishment, progressive Bernie from winning and to give Hillary another shot at power.  Every terrible consequence of a Trump presidency will be their fault.", "...Raiders?", "&gt;it's a subreddit specifically for Donald.\n\n\nAnd how glorious and magical a place it is and was.  I cannot wait to see what it turns into but as much as i'm glad the ride is over i enjoyed the hell out of it.\n\n\n\nContrast the donald with the Hillary sub, and know that they NEVER had a chance.", "Which is kind of odd when you [compare the subscribers count](http://redditmetrics.com/r/hillaryclinton#compare=sandersforpresident+the_donald) on the subs of those who ran. 270k Trump 211k Bernie (been shutdown since the conventions), and 35k Hillary.", "my god what happened", "White identity politics got Trump elected. ", "I think they were de-funded. ", "I fucking love this thread. I may resub soon. ", "&gt; Probably I hope no ~~intern~~ *Secret Service member* was hurt.\n\nShe supposedly had a tendency to let out her frustrations on her bodyguards.\n\n", "The rigging sure backfired this time around.", "Debbie Wasserman Schultz helped The Democrats lose the House and Senate for 2 midterm elections.\n\nShe kicked out The Conservative Blue Dogs The Progressive Wing and anyone who isn't \"Establishment Democrat\" and the result is a loss for Hillary Clinton because Hillary doesn't have the same blue collar support that The Blue Dogs had.\n\nImagine how easier would be for Hillary to reach out to the American white working class if she had the support of a Democratic House and Senate Majority.\n", "Since the Democrats have nothing to lose they might as well give him the Clinton treatment. Keep him mired in legal battles so that they can campaign on the fact that he is mired in legal battles.", "It's supposed to be important..but it's not supposed to be politicized. At this point they shouldn't serve life terms. That was entirely to avoid this bullshit and it has failed.", "This is going to be a long 4 years.", "It's funny I posted this article twice in the past two weeks and it got destroyed to oblivion both times. None of the facts here changed since then too.", "Obviously they need to force Hillary into the running during the next election cycle. That will solve this mess.", "They need to learn some tough lessons from all of this.", "Exactly. Let's just have investigation after investigation scandal after scandal. Let's just sit on our hands and obstruct the government in any possible ways. Hell lets default on the federal debt if we don't get what we want.", "Trump was also pretty civil during his speech. Thanked clinton for her service as SOS and everything. Maybe we can have collective amnesia over the nastiness and forgive each other", "I'll never forget when I saw coverage of a Sanders speech cut away to an empty Trump podium. ", "if she even utters a breath about running again I will personally drive down to her house in NY and start protesting. \n\nRight now, her and every single DNC person closely linked with her has to leave.\n\nIn my dream world Obama takes over as head of the DNC and purges out all the HRC cronies and pulls in completely new blood. They need to start planning for the 2018 congressional races now. ", "I wonder what today will be like in the Clinton camp. They seemed so sure in the result. If I lost to Trump I'd be doing a deep introspective into what kind of human I actually was. ", "As long as you aren't gay black, brown, have a pre existing condition, or possess a pussy.\n\nIt's not a matter of civility, there are real world implications for many people.", "I have been told by Republicans who say Obama and Hillary are socialist \"Bernie is a good guy and they would support him over Trump\". ", "That is the one outcome we can safely assume will not occur.", "CNN NPR, and MSNBC are at the top of the to blame list. My favorite was how NPR would run through all (don't even remember how many) Republican candidates daily doings, do an extended video/radio coverage of part of a Hillary speech, then a much shorter grainy cell pick or low quality recording of a sentence or two from Sanders. It was just so ****ing obvious from the get go they were in Clinton's pocket. \n\nThen, once it was Trump/Clinton the entire debate was \"how stupid is Donald Trump?.\" I mean, I hate the guy too, but the networks refused to air the legitimate criticisms of Hillary's past &amp; campaign as well as never addressing the few good ideas Trump had (like his ban on lobbying.)\n\nI enjoyed the faces of the anchors on the Clinton networks, they deserve this, we on the other hand...don't. ", "Yah well we will see what the new  freedom-caucus sponsored Supreme Court has to say about what civil liberties are allowed. Citizens United was only the beginning... ", "I felt a great disturbance in the force... as if millions of voices stopped spewing paid lines and were suddenly silenced. I hope something good has happened.", "She literally snatched defeat from the jaws of victory. This was the DNCs to lose and they lost it. They propped up an establishment candidate that was just as unliked as the anti-establishment candidate running against her in a political climate where everyone was anti establishment.\n\nOn top of that she has had a low energy campaign from the start and it played out exactly as expected. People simply didn't get out to vote.", "Clinton wouldn't even address her supporters last night whereas Trump immediately congratulated Clinton on a hard fought race and talked about united people and moving forward. It reaffirms just how much Clinton doesn't give a fuck about people and that it is all about her.", "Well ya. The dnc invested millions into paid internet shills on facebook and reddit.", "Guess who's gonna decide the constitutionality of life term limits;)", "It was almost an hourly hit job. There were opinion pieces every hour against Bernie. ", "&gt;I don't think either party will stop picking candidates that establishment people benefit from but they will be more attentive to their charisma.\n\nNo, they won't, at least on the Democratic side.\n\nThis was NOT a big surprise.  Look at 2000 and 2004: the Dems ran uncharismatic candidates both years, and lost.  They tried it yet again in 2008 with Hillary, but charismatic Obama surprised them by winning the primaries, and then won the election.  You can probably make the same case for many earlier elections too.  Dole (the uncharismatic one) lost to Bill Clinton in '96.  GHWB (uncharismatic) lost to him in '92, with the help of lots of people voting 3rd party (Perot).  I don't remember Dukakis being especially charismatic, and he lost to Bush in '88.  Nixon I believe wasn't well-liked either, but he won in '68 because the DNC nominated a horribly unliked candidate who didn't even win their own primaries (sound familiar?).\n\nI'm sorry, but the Democrats have had about a half-century to learn this lesson, and they still don't get it.  Nothing's going to change with them.\n", "Yeah I won't forget months of 'lock her up' and 'special prosecutors' just because he was civil for 5 whole minutes. ", "Lets see if the D or T keys on the keyboards are taken in January. ", "They didn't care about just being in power. They wanted CLINTON in power. They knew Sanders was a better choice but they rather risk getting Clinton in... Because it's a well established fact that the Clintons help all those around them by hooking them up with great consulting jobs, and other such high paying rewards. That's why they all fought for her. ", "Worked hard? She disappeared for weeks at a time in the middle of the campaign. Couldn't even be bothered to show up to her own HQ on election night. For all the people that say Trump didn't really want to be president she's the one that sure acted like it. ", "Part of me is praying that he's just been pulling a long con this whole time. Like the last 30 years of his life have just been an act to set him up for this moment and now he's going to turn into a very moderate, reasonable statesman.  \n\nHey... a guy can dream", "Super weird to see this shift from yesterday i'm just a lurker from france but the mega threads yesterday were full of full on hillary supporter, and now everyone is telling them to fuck themselves because bernie was a better candidate ? LOL", "Oh right, we have 150 million people living outside greater metropolitan areas, whoops.", "They're probably rethinking that. That name is now associated with corruption and losing to a reality TV guest star.", "I love Obama and desperately wanted Trump to lose... but I don't think this really says anything about Obama. To quote Tyrion Lannister \"its expected of him\"", "I'm still too stunned to say much but it occurs to me that it wasn't that Bernie was that good.  It was that Hillary was that weak.  We nominated the most hated politician in history, and wouldn't have done so in a fair primary that had more real challengers.", "I have a feeling that a lot more than 15000 people voted based on circle jerking memes because they think it's funny.", "What a coincidence.  ", "She lost to someone who bragged about sexual assaulting women. That's how much she is hated.\n\nEdited to add *sexual*", "You're totally right. They even worked WITH Hillary - leaking her campaign questions writing flattering puff pieces (and emailing her campaign to check over before publishing), giving her campaign polling data first, etc etc etc. They didn't just lie. They colluded.", "The same \"South\" that outside of Texas doesn't have that many electoral votes?  Republicans in the South honestly don't even look at who the candidate is they just select \"Straight Party Republican\" and click it and leave.  If Satan was running on the Republican ticket in the South, the Evangelicals would support him.", "&gt; and teach them what they've learned\n\nI guess you haven't been paying attention. There is nothing to teach Donald Trump. He knows everything. He knows more than the generals. He knows more than the tax department. He knows more than the bureaucrats. He knows more than everyone. He's said it himself over and over and over again.\n\nWhat could Obama possibly teach Trump that Trump doesn't already know?", "Still cannot wrap my head around the fact that we've elected a reality tv star as president of the United States of America. Fucking hell DNC you screwed the pooch so hard on this one. Now the GOP has control of *everything.* ", "I cant believe so many educated white women turned out to be toothless racist, stupid redneck men. That can't be right though.", "Do you know how much evil we are missing to do that? And do you know that us being the voice of reason is whats keeping us from a civil war. The day we get dems like the gop crew is the day Lincoln returns. \n\nDont forget republicans dont look in the mirror, all\nThey know is god is giving them a free pass to fight satan infront of them, so if we act like they do, its all fucked. ", "This is the first step to fixing the mess that is our electoral system in this country. Not only does it bring more viable candidates to the table but extremely disliked candidates (cough cough) are now at a disadvantage. ", "Bush did it for Obama too. I think it's a great tradition. I hope that every President has a chance to sit down with the next and teach them what they've learned. Not in a political sense but in terms of how to deal with the stress and things like that. Its a unique position that very few can advise someone on in any real sense", "Somehow this is Jill's fault. Jake Tapper kept implying third party voters were to blame all night. And you know his head is firmly planted in Hillary Clinton's ass so thats probably what she thinks too.", "Same.  I find zero joy in this but this is EXACTLY what Sanders supports had been saying around here during the primaries. ", "&gt; People complaining she couldn't give one last night can you really blame her that much? They and much of america expected her to win fairly easily, instead they got shocked by a completely unexpected turn of events, even losing places they didnt even think were in play at all. Anyone would be upset by something as crazy as what happened.\n\n**Yes I can blame her and the hypocritical media.**\n\nIf the tables were flipped then they'd be railing on Trump. In not conceding herself, last night she continued to show that she has no class and does not give a fuck about continuity, togetherness, or unity in this country.\n\nClinton cares only about Clinton.", "Trump IS a negative guy. That's part of his character. Mud just solidifies it. Meanwhile Bernie is a positive guy, so mud just hurts him.\n\nYou're comparing apples and oranges. ", "God forbid anyone said this about Clinton.  FFS Reddit", "The greatest lesson here is that echo chambers like /r/politics are the real threat. If we cannot hear our countrymen's cries for help we certainly won't hear their angry yells.", "The DNC basically [disowned her](https://wikileaks.org/podesta-emails/emailid/3609) for supporting Sanders.  This election for the DNC was not about the will of the people but the will of the Clinton political machine and that is why they lost.", "Member calling it a Trump victory the day that Hillary won the primary?\n\nI member. I'm proud to go down in history as one of those that voted for Bernie to try to stop an awful Clinton run.", "Trumps gotta be loving this. Literally the perfect revenge for that infamous White House Correspondents dinner 5 years ago. Now Obama has to call HIM \"Mr President.\"\n\n\n\n", "The Clinton name is done. ", "Can we hold someone accountable for letting the entire sub be completely 100% taken over by a superPAC and shills? Or are we going to pretend it never happened?", "People complaining she couldn't give one last night can you really blame her that much?\nThey and much of america expected her to win fairly easily, instead they got shocked by a completely unexpected turn of events, even losing places they didnt even think were in play at all. Anyone would be upset by something as crazy as what happened.\n\nEdit: Everyone does realize she is giving her concession speech today, right???", "/r/EndFPTP /r/RanktheVote\n\nThe current first past the post, winner take all, one vote per person is one of the biggest issues in American politics, so I'm glad this happened.  Even if the method (ranked voting) isn't your favorite, *all* of the alternate voting methods people are discussing are better than our current system.", "&gt;I think this is what people are missing... Trump didn't get voted in because he represents change or because he's going to be a great President... he got voted in because people were sending a message to the government establishments... \n\nThat message was well received but the bigger question is where do we go from here? If Trump's election was based on anti-establishment sentiment and not on his competency then what does this mean for US' economy?", "As a poor person who has only been HURT by ACA I am glad it is likely to be thrown out now.\n\nCan't afford the insurance. Make \"too much\" (ha!) to qualify for subsidies. Lose our tiny tax refund in the spring. Never get to see a doctor about my \"pre-existing condition.\" I just hope they get rid of it before I file our taxes this year.", "Actually the orange coat suggests it's an orangutan. ", "As a feminist you must be ecstatic about the far right Supreme Court we're going to have for the next 30-50 years.  \n\nAs a feminist you must really be looking forward to Roe v Wade being overturned. ", "You do realize that Trump is not in any way an anti-semite.  His son in law is Jewish as well and he values Israel as a great ally.", "&gt; world isn't coming to an end\n\nsilly people. we still have two more months before that", "This is stupid. I'm upset and shocked. I'm not happy in the slightest. I don't understand how this happened other than blaming the electoral college that another candidate won without winning the popular vote. \n\nBut Trump won. That's the way it works in America, he is our President. We need to accept that, move on, and prepare for the mid-terms", "Both my sister and I voted for Bernie in the Michigan primary and we were having a political discussion on Monday night, and I told her the election would be a lot closer than pollsters are claiming it will be.\n\nWhite, working-class voters and the rural poor (CNN's \"Silent Majority\") don't feel like the Democrats give one single shit about them. Many of the programs that the Democrats invoke (or at least Campaign on) are centered on the Urban poor.  The rural poor don't either qualify for these programs, or they're not anywhere close to benefit from them; all while having their taxes raised.\n\nThe Republicans don't offer any relief programs except for promises of tax cuts, but that's at least something.\n\n", "This was widely known.  Anyone mentioning the system was rigged especially on this sub the last few weeks, was met with instant down votes and ridicule.  \n\n", "Comments like this drive me nuts. When/if they repeal Obamacare I'm going to lose my health insurance and therefore access the medication I need to function and hold a job. People who voted to spite the DNC didn't just hurt the DNC, they hurt me and people like me all over the country. So maybe consider that as you go through the next four years. I hope all the policy that's going to get passed while the GOP controls the federal government was worth sending the DNC a message.\n\nEdit: Said health care when I meant health insurance", "Well I was just trying to look at things in a positive perspective. Its nice that they can be friendly and put politics aside for a moment and have a serious discussion but I guess that isn't a popular way of thought these days.", "It's funny because Israel's official stance is rather joyous since they consider Trump a better ally than Obama.\n\n", "I dont see a wonderful transformation in a system where Mike Pence is going to try and get final say on every woman's uterus in the country.", "Yeah. I'm way off. All first ladies have lesbian photo shoots in they background.", "Looks like their payroll was cut.", "Add it to the list of inevitable broken promises just like the Brexiters have had to do.\n\nWhat will those Trump voters do when they realise that they're not getting their wall, nobody's being deported, muslims are still free to enter the United States and the hated trade agreements are still in place?", "If she does indeed win the popular vote (edit: it's fluctuating right now so I won't prejudge), it would be the greatest irony of all. Four years ago, Trump railed against the electoral college by calling it a disaster. Look at where it's brought him now.", "Already got multiple texts from relatives gloating over the results. Relatives that were planning on retiring in the next few years. I told them to look at the market futures and asked how much of their 401ks are in stocks. No responses yet but at least the gloating stopped.", "I can't believe that so many people have such contempt for democracy that they would do this as well as other 'comedy' votes.", "Obama's too. Every executive order can be undone with only a signature. I guess that's why they are a bad idea?", "Exactly this.  If Trump lost people would have been like \"Typical Trump\" or \"he's a sore loser.\"  But because it's Clinton, it's \"I understand why she couldn't do it.\"", "As a middle class college educated white male with a decent job.....fuck it . I did my part and you fucking can enjoy having your rights limits and being uninsured.", "That's because this election on reddit turned out to be Trump (The_Donald) vs. Trump Sucks (r/politics). There was no popular sub where you could have a conversation. At least (The_Donald) wasn't pretending to be an unbiased sub unlike /r/politics, which, as an ex-default sub with over 3 million subs had no other threads on the front page than threads about how Trump will never win and is obviously a man eater.", "Women never genuinely liked Hillary Clinton or looked up to her. Ask any woman if they see Hillary Clinton as a personal role model that they would personally emulate or would they name their daughter \"Hillary\", and 99% of women would be like \"Eww, no\".", "Wouldn't have needed any more than Hillary got he was strongest in the States that costed Hillary the win. ", "Wrong. This is what happens when you have  UNINFORMED AND UNEDUCATED citizens.", "I knew Trump would win the second Sanders lost.  Clinton was unelectable in 2008 and she was unelectable in 2016. ", "&gt; Obama won because he got a significant amount of independent voters to vote for him. Sanders was widely popular with independents moreso than anyone else. A lot of independents didn't even vote this time, compared to when Obama ran.\n\nI think the media has a lot of blame for this.  They were a lot more sympathetic for Obama than Sanders.  They were writing Sanders off from the very start, he didn't have a chance.", "Hurriedly deleting emails burning filing cabinets, hitting phones with hammers etc most likely.\n\nShe still has an ongoing FBI investigation into her Clinton Foundation.", "&gt; They chose insulting the other side over trying to understand what motivated them. They transformed opinion writing into a vehicle for high moral boasting. What could possibly have gone wrong with such an approach? ", "Do you understand that we wouldn't even be having the spoiler argument in the first place if the U.S. simply adopted run-off voting? You know why it hasn't happened yet? Because the two parties in power want to keep that power.", "No Donald Trump definitely won. Sorry CBC. He'll be the president next year. ", "Bernie would have taken Florida easily.  That's a lot of electoral votes.\n\nSanders' momentum was crushed by the party itself.  Then he endorsed Clinton and alienated a bunch of his millennial supporters.\n\nThe Democrats just completely blew this one.  They knew what was gonna happen but they just had to keep pushing Hillary in our face.   The current DNC chair leaked debate questions to Clinton.  The DNC top level needs a purge with the Clinton supporters weeded out and more neutral people placed in charge if they want to have any hopes in 4 years.", "I honestly couldn't believe how biased NPR was during the primary.", "CNN MSNBC and NBC were all in the tank for Hillary up to and including blatant collusion.", "Don't  forget Pennsyl-fucking-vania! How embarrassing...", "This is the thing I don't get.  Lots of people say Hillary just isn't an acceptable candidate.  But Donald Trump is?", "To the Clinton supporters: WE FUCKING TOLD YOU!  Dude we fucking told you.  We told you time and time again that Bernie didn't have the stupid ass political scandals attached to Clinton's name.  We told you that he had legitimate crossover appeal.  We told you that he wasn't desperately hated by the republican party.  We told you that he had a stronger record than Clinton.  We told you that he was POLLING BETTER AGAINST TRUMP than Clinton.  We told you that he didn't flip-flop on issues amidst political pressure.  We told you that he was an HONEST man running in a DISHONEST time, in a DISHONEST party.\n\n\nWe tried to fucking tell you.  You guys wouldn't listen.  You propped up a candidate plagued with baggage, who was polling worse, who has a history of shady things.  You chose the most disliked politician from your party, one almost NO republicans could vote for, and one even many democrats could not stomach.\n\nWe fucking told you guys.  The DNC fucked up.  Clinton supporters fucked up. \n\n\nAnd to a lot of posters on /r/politics.  Don't you guys come in here trying to act all fucking wise and shit.  You guys took a shit on Clinton during the primaries, and then welcomed her with open arms afterwards, somehow forgetting all of the criticisms you said before.  You never had to accept Clinton, and your acceptance of her told the DNC that they can put up who ever they want, and in the face of a republican candidate, you'll still hop on their train.  Its time to step up, all of us own our mistakes in this, and say ENOUGH with the shitty, shady candidates.  In 2020, lets put up someone who is worth a fuck.", "I'm hoping that they determind it to be unsuccessful. Given how mean some of the comments have been the past few weeks can you imagine if they had access to the information that the NSA has? ", "Except that the left loved to turn:\n\n\"I have a problem with illegal immigration they should be required to go through the legal channels.\"\n\nInto;\n\n\"You're a racist/misogynist, etc.\" \n\nNot all of the left did this, but a very vocal section did. This isn't my single issue either, of course, but it's a good example. ", "Both establishment parties were smashed by Trump. ", "Morning Joe made the exact same comment. \n\nI wonder what Republicans are going to think when Trump screws them just like he screws his other business partners? ", "I said when Obama was elected in 2008 that Republicans as we know them would never hold the Oval Office again.\n\n\nThat hasn't changed.", "Er... what?\n\nJust The Washington Post?\n\nThe DNC was colluding with many more media outlets than that... CNN PBS, CBS, and so on were probably bigger ones.", "Let this sink in: Hillary Clinton will probably never be involved in politics again.", "Good both parties should be smashed up into tiny multiple parties and you guys can have a real democracy rather than this two party bullshit ", "I'd like to hear from some HRC supporters over this:\n\nI thought it was incredibly distasteful for her to not come out last night and thank her supporters for all of their work. She didn't have to have a 15 minute concession speech but just a brief statement and 'thank you' to those who worked for her. \n\n(I'm not a Trump supporter in the slightest.)", "I don't know if we can conclude that either establishment is \"finished.\" All we can conclude is that the status quo isn't working for the American people and that Trump's message resonated. Let's see what the Trump administration actually does before we bury either party's establishment for good.", "&gt; I wonder what Republicans are going to think when Trump screws them just like he screws his other business partners?\n\nI'm not sure what will constitute as screwing them over in this context but I'm going to assume what will happen is they are going to treat him like a rookie/novice (which he technically is) a bit too much when he calls whatever audibles he wants that might not be GOP dogma.  They will be pissy and start beakin again, and... well I have to give him the benefit of history here,  I can only assume he murders every one of them until they shut up again.", "Well the paid shills are gone now.", "Two party system is a symptom of First Past the Post voting. That's the equilibrium that always emerges in this system. We've seen a shakeup for now (as has happened in the past) but it always settles back to two major parties.", "Twice in my lifetime.  The first one led to two wars two recessions and the destruction of most of the American economy.\n\nThe second will be worse.", "And then he will run for re-election.\n\nWe will have to go through this fucking shit again in 3 years. Just kill me.", "As a democrat who did not support Trump I can honestly only see mainstream democrats hopping right back on the establishment bandwagon.  It is going to be viewed as the easiest and quickest way to oppose Trump for the next four years.  They won't do their time and research lesser known candidates, they'll see names they recognize and vote them in because they think they will obstruct Trump.  I'm really worried for the democrat party.  I honestly still don't think their eyes have been open to the anti-establishment trend, and I don't think most people outside of Reddit will even realize the chance they had with Bernie. I hate it, but I honestly believe it. ", "If she doesn't take responsibility and hand the party to progressives... I'll go ballistic. \n\n-\n\n[edit] MSNBC saying that this is still a win for women because \"look how far she has come\". WTF?! And they still can't even tell why she lost. It wasn't about women. Yes there are sexists - who would vote for Trump no matter who was running against Trump. But she failed to stand for something except for herself and she ignored poor ex-middle-class people.\n\nhttps://www.reddit.com/r/WayOfTheBern/comments/5c14z8/bernie_predicted_this_whole_entire_thing_more/", "Everyone's talking about the presidential election but this is something we should be paying attention to as well. If it works out, perhaps we can see it spread. ", "Ya for real. Dems have lost but still exist GOP, not so much.", "\"I'd like to apologize to America future generations that I have fucked over, and to real progressives.  I didn't get things done, I screwed over Bernie, single handedly put Roe V. Wade and womens rights at risk, and I caused 37% of millennials to vote for a fascist.  \n\nBut it WAS my turn\"", "Hand the party to progressives or face utter destruction. While the media talked about RNC falling apart the DNC was slowly drifting apart because of Clinton. She didn't care about progressives she couldn't even be bothered to come to TyT (TheYoungTurks) - with ~60million mostly millennial viewers. ", "Just to be clear that doesn't actually matter.", "Get used to it America. You elected a con artist.", "Didn't people say this exact same thing about the Republican party last time?\n\nEdit to add at the risk of downvotes: I meant just the headline, of course the reasons given supporting said headline were different. I'm not making any statement one way or the other except pointing out that there were \"Republican party is finished\" articles last time.", "That kind of attitude is exactly why the dems lost. Label republicans as sexist racist, etc and put your fingers in your ears. \n\nTime to come together man, or gtfo", "Im a liberal and you can pry my firearms from my cold dead hands. This all dems hate guns rhetoric is stupid", "Wow. Has their ever been a bigger step down in presidential quality? Going from a thoughtful intellectual and family man to a crude profane racist who speaks at a fourth grade level and lowers the office with petty personal attacks on anyone he doesn't like at that particular moment? \n\nHow embarrassing to be an American today. What happened to the shining city on a hill, the beacon of light and hope and tolerance that was the idea of America?", "Both parties featured their worst possible outcome. The Republicans now have to deal with a rogue Trojan horse as their commander in chief the Democrats face the nightmare of being a powerless minority. It's TrumpWorld now.", "If he gets indicted by some miracle this is not an automatic win for Hillary or the Democrats. Pence would just ascend up the ticket and claim the Presidency. For some, that might be an even worse outcome than what we have now.\n\nEdit: Apologies, I was referring to the child rape allegations against him in December. This article is referring to the Trump U lawsuit in November.", "Looking back Obama was probably one of the best candidates to go down in history as \"the first\". Say what you want about him the man is a class act through and through.\n\nAlthough there is a long history of cross party presidents taking the piss out of the next line. Bill Clinton's staff stole all the 'W's off the keyboards and stuff like that...", "House of Cards is just a show on Netflix.\n\n", "The Dems exist but are largely irrelevant. The GOP is also irrelevant they just don't know it yet", "I really wonder how she feels right now because they made it seem like there was no way she would lose.\n\nI don't want to feel like her right now because of how sad I already feel right now as just a supporter", "Time to treat him exactly like how he treated Clinton: a criminal. No one is above the law including the douche bag. I hope he gets everything that is coming to him.", "The Republican Party is more powerful than they've ever been before. They are anything but smashed.", "The high road doesn't work. I'm sorry. We tried.\n\nWhen they go low...we lose.", "This is awesome. I hope it works well for them. We need to spread this to every state in the union.", "I disagree. The republican establishment is the big winner here. Democratic corruption has been exposed and they've been heavily punished for it. However this means that now republicans essentially have free reign to do what they please. Their corruption remains in the shadows.", "The entire system needs to be rebuilt.", "We don't have either the senate or the house. Or the White House. \n\nOur ability to obstruct is so small. He's got a blank check basically to do anything he wants, and the minority has limited means of check/balances. ", "While canvassing for Bernie I met so many Republicans who would have voted Bernie if he was against Trump, but they would vote Trump if Hillary got the nomination.\n\nSad that we lived out the worst possible timeline.", "They'll have at least one thing in common. A personal dislike for Hillary.", "The hiring if DWS the night she resigned for screwing over bernie.\n\nWill go down as a historically bad move.", "I'm just glad /r/politics is back to normal.\n\nBack to hating both Hillary and Trump and still loving Bernie.", "2016: \"Everybody's fucked 'cept the cubs\"", "&gt; Debbie Wasserman Schultz and the DNC lost the White House.\n\nFTFY.\n\nThey sunk the stronger candidate that likely would have been the people's choice, had the primary taken place on even ground.", "I shit you not a billion dollars was spent trying to get Clinton elected this cycle.\n\nA billion dollars, an army of paid astroturfers, collusion at varying levels in virtually every major media organization, endless celebrity endorsements, and none of it was enough to make her likable.\n\nAnyone could have told you that anti-establishment fever was in the air this cycle. So what did the DNC do? It tipped the scales in favor of the most distrusted, disliked, establishment-cozy candidate they could muster.\n\nIf anything, dems should be thankful that the loss wasn't bigger than it was. If she was up against Rubio or Kasich, she might have faced a 1980-tier blowout.", "http://fair.org/home/washington-post-ran-16-negative-stories-on-bernie-sanders-in-16-hours/", "This had nothing to do with right or left.\n\nThis happened because the only thing Americans can agree on is they're sick and tired of establishment politics on both sides. The DNC put up a candidate that is just as unliked as Trump but is the embodiment of everything that Americans find wrong with this country. They put that up against a person who at the very least, wasn't.\n\n", "Democrats need to find a way to export liberal ideals to Middle America or Trump will win a second term. I really hope the press wakes up and realizes the mess they created.", "It doesn't matter legally no.\n\nIt does matter, perhaps to some people's peace of mind, that the majority of Americans didn't vote for what Trump was selling, and that can be a consolation prize that the next election isn't out of reach.", "It's far more true about the Republican party this time. This really wasn't a victory for republicans. In fact it was really their worst possible outcome.", "Oh just wait.  Despite the Republicans having the White House, House of Representatives and the Senate for the next two years, they'll successfully blame the Democrats for all their problems.\n\nIt's like health insurance rates - they've gone through the roof in the last two years. However, for people subsidized under expanded Medicare in the states that chose it, insurance is now affordable.  In states where Republicans successfully blocked the Medicare expansion and subsidies, *everyone's* insurance went up dramatically.  People are mad as hell about it, but they don't blame Republicans, they blame Obama.\n\nThere's no winning.  The average American has no interest in considering complex and nuanced policy issues.  Trump won because of his brand.  He literally never articulated a single policy position - it's all sloganeering.  And it literally doesn't matter.  The age when voters were concerned about policies is over. Period.\n\nIt's only about branding now.  Repetition, repetition, repetition.\n\nTrump may well be a one term president, but the next candidates for president will simply be even worse.", "Just to be clear she still won the popular vote. ", "You realize this is in civil court right?", "Well you can't fully blame America for this. Clinton still won the popular vote similar to 2000 election. \n\n", "Can you imagine though. Her political opponents have been promising to throw her in jail if she loses and some have been calling for her execution. I'm sure she is terrified right now.", "There's going to be a lot of blame in the coming days and weeks.  The Democratic elites in a frantic attempt to keep their status, are going to blame Bernie's supporters who stayed home or voted in protest.  The media will likely discuss how Hillary didn't reach out to this group or that group well enough and try to find numbers to lend credence to the establishment's view of things.  \"Oh we would have won if not for those damnable voters.\"\n\nLet's not forget that every time Trump opened his mouth, the media covered it for days.  He didn't need ads until the very end because all he had to do was stand in front of a microphone and the media delivered his message for him ad nauseum. \n\nLet's not forget that the DNC and the media conspired with the Clinton campaign to tip the scales of the primary in her favor.  Harry Reid's bullshit in Nevada, leaked debate questions, slanted coverage.  \n\nLet's not forget that Hillary Clinton, though a very accomplished person, has a track record of scandal and bad decisions, and surrounded herself with sycophants, lobbyists, and shills so that in the echo chamber all they could hear were their own self-congratulations.\n\nIf you're a liberal or a Democrat or just not a Trump supporter, last night felt like a kick in the throat.  But don't let the establishment trick you.  It's their fault.  It's not Bernie's or his supporters' or the people who stayed home.  It's the fault of the media and the party and the slimy, greedy neo-liberal corporatist roaches that have taken over the American left.  ", "Bernie had a winning platform.  The NY Democrats rigged the party for Hillary.  All I got to say is \"good luck\".", "Hahahahaha Hillary Clinton...take responsibility...\n\nThis is the lady that literally was on the verge of accusing comey of being a russian agent after accusing Australian Assange of being one.", "Obama is going to pull off a Red Wedding and save USA once and for all", "I most certainly can blame America. The fact that anyone voted for this fucking guy says it all. Washington has fucked over the American people for so long that they voted for *Donald fucking Trump* just to spite the system.\n\nWashington handed us a gun and turned the barrel backwards. America was dumb enough to pull the fucking trigger.", "I think that was a major reason why Hilary ended up losing that will be largely overlooked. Many people attribute Obama's success to his ability to get young voters to the polls. Hilary tried to do that by employing every celebrity she could get her hands on in Hollywood and having them pander about how stupid Trump is and how they can't believe that he's a candidate. \n\nWell, look where that got us. Sure, they won the 'votes' of most kids aged 12-25 on Facebook and Twitter, but they largely drove away many blue collar workers and older Americans. That's where Obama and Clinton differ. Obama didn't drive away those voters in his process of bringing in young voters.. You think that celebrities sitting in their $15,000,000 home making a Snapchat about what an imbecile Trump is, helps bring in the vote of 45 year old Joe Blow working in a GM factory who can barely pay the bills? Give me a fucking break.\n\nThis entire election process was centred around Hollywood, social media, and 'legitimate' news outlets spending the entire time bashing Trump and calling his supporters racists and bigots, all while maintaining the view that there was no chance Trump could win in the most condescending of manners. Every news source on television for the past year has been spending a majority of their airtime talking about the flaws in Donald Trump, all while ignoring or largely dismissing concerns and controversies in the Clinton camp. I bet you there was 10x more airtime about Trump \"grabbing pussies\" than their was about Debbie Wasserman Schultz stepping down due to being legitimately involved in helping Hilary Clinton win the DNC. Every social justice warrior on the internet will try to rip me a new one for this view, but guess what, the DNC controversy was infinitely more important than Trump saying \"Grab her by the pussy\". It's the active pandering to the SJW view that words hold just as much weight as actions that caused Clinton's downfall. Every issue put forward by Clinton supporters in an attempt to say why Trump was unfit for president involved things he *said*. Every issue put forward by the Trump campaign about Hilary Clinton has been things that she has *actually done*. There's a massive difference between the two, and America seems to agree that actions speak a whole lot louder than words. \n\nMonths ago I made a post in a thread about how stupid all of the people posting constant memes about Donald Trump and making fun of his supporters were, and how they were just further alienating a large majority of society and driving up his support. I was largely dismissed by many people, and look who's laughing now. Education is a whole lot more powerful than ridicule. \n\nI am not a United States citizen nor someone who truly believes in Trump, just a Canadian who thinks that half of your country is foolish for dismissing a legitimate competitor while largely ignoring the massive flaws in their own candidate. ", "Watch him lose 90% of his braggadocio now that he's President. He used it to fire up voters now he can chill.", "&gt;I hate the fucker but he really shit on the party's view of things. Hopefully this will he a lesson not to underestimate the rural and suburban white populations.\n\nAnd people should probably take a closer look at where they are coming from. Both Trump and Sanders did well with that demographic. How can these racists and sexists support both Sanders and Trump you might ask?\n\nBecause both of them opposed the TPP.\n\nAnd Hillary is going to do to them the exact same thing as Thatcher did to the working class in the UK. People on the left rightfully hated Thatcher. What happened?\n\nLet's face it. The democrats voted out of fear of Trump, but to the working class the real monster was Hillary. Outside of the liberal bubble she's more scary, and to people living in trailerparks, rich cosmopolitans social causes seem like deflection. And, truth be told, Hillary used it as deflection.", "Ah yes back to the /r/politics of old. ", "Donald Trump profited millions from the Saudis personally. ", "I hope you get exactly what you want America. You deserve it.", "You mean the blacks that the DNC sent voting mailers out to while ignoring rural areas because for some reason, they only wanted as many black votes as possible during the primary?\n\nThere's way, way, way more factors to why he lost, that all have to do with collusion, conspiring, and cheating, than \"a group that makes up 13% of the population, and doesn't turn out to vote much, didn't like Bernie so he lost simple as that lol\".\n\nAnd really, in the north, he seemed to do reasonably well with them.", "She's just such a bad candidate. Count the number of times she says \"I\". She never says \"we\".\n\nHer slogan was even \"I'm with her\". You simply can't get any more tone deaf.", "The democratic party has no one to blame but themselves.", "before Donald Trump raises his right hand to take the oath of office in January he’s set for a less-auspicious swearing-in: taking the witness stand in his own defense in a federal court civil trial over alleged fraud in his Trump University real estate seminar program.\n\nTrump faces a legal ordeal no president-elect has ever encountered: juggling defending himself before a jury with preparing for the vast challenges a political novice will face in assuming the presidency.", "Theres a differance between doing business with companies verses accepting donations and in turn shaking them up with paid speeches for Bill.", "Do you really think this is the only legal battle Trump is/will be facing? Believe me I don't like clinton but if Trump was going to play that card during the election he better be ready to deal with it as the president. ", "holy shit an unbiased r/politics. I can't fucking believe it.", "This kind of hurts. As a black man watching him have to congratulate this guy...it's just not right.", "Trump's victory speech was very classy. Not sure how long he can restrain himself though. ", "She did it to herself couldnt even beat a nazi in clownface", "If 3rd party voters had wanted Hillary to win they would have voted for her.", "This election was easily 18 months.  2.5 years.", "It's inherently biased against urban centers and when they consistently go Democrat the result is the same. ", "\"Conservative solutions for real change\"\n\nAre they fucking serious? ", "I've been eating downvotes in /r/politics for months for (among other things) saying that *almost any nomination other than Hillary* would've been better to put against Trump. She's basically the dictionary definition of an opaque insider and career politician doing shady backrooms deals. Basically represents the exact aspect of the political establishment that Trump struck gold by criticizing.\n\nIt's felt very strange to post on /r/politics today without having all my comments downvoted to -30 immediately.", "15000 people vote for who they want to be president and reddit loses their shit.\n\n100 million people don't vote for anyone and no articles about it", "Nah. You're wrong. See the right wing bashed Michelle Obama nonstop for 8 years – attacked her for not having sleeves. SLEEVES, for fucks sakes!\n\nAnd it worked for them!\n\nSo now there is a first lady came to the country and worked illegally, did porn shoots, and blatantly ripped off other people in her speeches. That's gotta be worse than sleeves, right?", "Humorously the DNC lost the majority of these voters when they submarined Bernie.", "And on the flipside 59 million people voted for a nazi in clownface.", "Congratulations to Trump and to all Trump supporters. \nI've been listening for days on how this was a \"blue collar\" vote a \"working class\" vote, and a vote against Wall Street and the establishment. Budweiser America vs Starbucks America. Whatever. \nA part of me is happy if this is the reason you voted. Fuck Wall Street and fuck the establishment. \n\nBut another part of me is wondering - what *could* a Trump presidency possibly accomplish? Can he truly make 1970's era factory jobs appear by the hundreds of thousands? Can him and Pence truly turn the clock back to the 1950's? Are you all truly hyper-religious conservatives who think that the biggest problems facing this country is gays fucking and people smoking pot and women voting? Truly? \n\nI don't know. I personally expect almost nothing to change on the economy side of things but many set-backs on social policies. \n\nAlso, fuck the DNC. Seriously. Hillary goddamn Clinton. That's the best they could come up with. ", "If nothing else I can hope this election puts the brakes on the dynastic BS that's been going on.", "The articles were full of pro-Sanders stuff but the comments...\n\nHoly shit, the comments.  So much vile, pedantic, condescending stuff from Clinton supporters.  They couldn't control the upvotes of the articles but they coordinated really well on the comments that less Sanders supporters wasted time on since they were busy actually campaigning instead of attacking people online.", "\"Hmm maybe we shouldn't have completely ignored every rural area and small town in America.\"", "Campaigns over people aren't getting paid anymore. ", "I used to work with a lot of Italians. They went through this with Berlusconi. Every time I'd ask them about him they'd get depressed.", "So... Clinton didn't even have a concession speech prepared? ", "&gt; Nancy Pelosi will still lead the Dems in the House.\n&gt; Chuck Schumer will still lead the Dems in the Senate.\n\nSame old then.", "How especially after this election, can you be so confident about anything?", "\"even satan was an angel once!\" ", "Speaking as a Hillary voter this is a massive failure by the Democratic Party. They need to take a long look in the mirror because this upcoming term they will not control either house in the legislative branch, the executive branch, or the judiciary branch. Obviously their message this election did not resonate with Americans.\n\nThis should be a wakeup call to the Democratic Party that the super delegate system and rigging your own primaries to choose a more flawed candidate, who draws far fewer supporters at rallies and does not equally energize the base, is a recipe for failure in the general election. They chose an elitist in a year that was overwhelming dominated by populism all over the world. Their political strategy for this campaign was a complete failure, and they must adjust the direction of the party if they want to re-gain any meaningful voice in the federal government, because obviously this populist movement is bi-partisan and is here to stay for the foreseeable future.", "We have always needed to support fearless independent journalism.  Not just now that someone we dont like was elected to be president.\n\nFearless, independent journalism would have given us a Bernie Sanders democratic nominee instead of a Clinton.", "I dont think I will ever be able to forget the DNC and DWS for this monumental national disaster. NEVER!", "Good job Hillary supporters. Your blind submission to an oligarch with too much baggage left us with a President Trump. \"It's HER turn!\"\n\nYou ignored all of the polls that showed Clinton losing to Trump SINCE JULY! \"You can't trust polls this far from the general!\" Those same polls showed Bernie winning in a landslide because of the rust belt support for a populist candidate.\n\nYou bullied Bernie supporters into ignoring the polls that showed she was the weakest possible candidate. And guess what? You get to sleep in the bed that you've made. I sold out all of my principles to vote for your shitty fucking candidate in the general and it still didn't matter.\n\nNow it's time to join the real political revolution and support real progressive candidates like Bernie Sanders Elizabeth Warren, etc. We are done listening to your gutless argument that the establishment candidate can \"get things done\".\n\nAt least this will galvanize the progressive movement.\n\nedit: Thank for the gold kind stranger. Want to do karate in the garage? yup", "And you KNOW the DNC is going to ignore this fact and *blame Sanders* for Hillary's fumble. ", "I doubt this will pass GOP congress. They don't want 2 more Dem senators. ", "CNN in regards to Clinton's bad campaign plan: \"We reached out to a top advisor for the Sanders campaign for comment on Clinton's campaign and they said **\"We have nothing nice to say right now.**\"\n\nDamn son.", "Speaking as a Hillary voter this is a massive failure by the Democratic Party. They need to take a long look in the mirror because this upcoming term they will not control either house in the legislative branch, the executive branch, or the judiciary branch. Obviously their message this election did not resonate with Americans.\n\nThis should be a wakeup call to the Democratic Party that the super delegate system and rigging your own primaries to choose a more flawed candidate, who draws far fewer supporters at rallies and does not equally energize the base, is a recipe for failure in the general election. They chose an elitist in a year that was overwhelming dominated by populism all over the world. Their political strategy for this campaign was a complete failure, and they must adjust the direction of the party if they want to re-gain any meaningful voice in the federal government, because obviously this populist movement is bi-partisan and is here to stay for the foreseeable future.", "You want to know what would be hilarious and the cap of absurdity after all the rest of this absurdity?\n\nIf Trump asked Clinton to be his Secretary of State.\n\nI mean it won't happen, but could you imagine?", "The first black President is going to have to hand over the keys to the White House to the guy who questioned his citizenship.  ", "Exactly...now is the time for social media to disrupt journalism even further than it already has.  We have a crisis of confidence in the fourth estate...just look at [Don \"Malaysian airlines was sucked up by a black hole\" Lemon](https://www.youtube.com/watch?v=ZpVd7k1Uw6A) or [Megyn \"Santa is white\" Kelly](https://www.youtube.com/watch?v=7XYlJqf4dLI).\n\nOr look at how [Andrea Mitchell bravely interrupts Congressional leaders who are talking about the NSA to talk about about Justin fucking Bieber](https://www.youtube.com/watch?v=XtcucHPkFkg).\n\nJournalism is a **failure**.", "I really don't know how traditional media maintains its credibility. The Trump people have been calling print and cable news the \"legacy media\" implying that they're obsolete. I'd have to agree.", "At least on Reddit the reason I stopped coming to r/politics wasn't the bias, it was the sources.  The only links that went to the top were about 50% WaPo articles, all with the same bent.\n\nSocial media itself was purchased by a presidential candidate.  Let that sink in.", "I also found it distasteful last night. Almost cowardly too since she had Podesta come out for her.\n\nBut then when you think about it, she was prob devastated. Whatever you think about her, her whole life has been shaped around becoming President. She wanted it more then anything. She spent everything (time and money) trying to win. The media and everyone around her told she was guaranteed to win.\n\nHer campaign actually started looking past Trump in October, and was campaigning against other Republicans. So they thought it was over.\n\nThe shock must have been insane. And if all the conspiracy theories about her health were true ( not saying they are), I can't imagine how devastated she must have been. She probably couldn't go on live TV.\n\nHad she not called Trump to concede, then i would have found it distasteful. I don't like Hillary at all. But I kind of get why she couldn't come on live TV. She was supposed to make history, and she completely failed. ", "The democratic party is completely fractured and at this point I don't see any way they can conceivably recover.\n\nAs an independent voter that is absolutely terrifying.", "What Obama really needs to do after leaving office is team up with Senator Sanders to rebuild the DNC as a more progressive and stronger establishment.", "Exactly.  Too bad the democrats have spent the last 6 months attacking Wikileaks.", "Thank God finally. ", "Never before has so much money been spent trying to elect a presidential candidate. And she still couldn't win. She had the backing of every major media outlet numerous celebrities. And she still couldn't win. ", "Orange really is the new black", "It's time for the Clinton wing of the party to step aside. And if they don't it is incumbent on the populist wing of the party to forcibly sweep them into the dustbin of history. The Democratic Party needs to be a class-based party again, not the identity politics monstrosity it has become.", "In an ironic sense it kinda makes you proud to be an American.\n\nNo matter how hard the scales tipped in her favor, if the people don't like you, you're not going to get voted in.", "Maybe he is going to kill trump and pardon himself.", "It's amazing how many shills the Hillary campaign unleashed onto this forum. I didn't believe it at first but all of the downvoting that happened any time that I posted something new that criticized Hillary or the Democratic Party establishment substantially ramped up in the weeks leading up to the election, and now POOF! The armies of downvoters apparently turned into pumpkins as soon as the polls closed.", "He was labeling Trump as a sexist anti-gay, racist person, which Trump has demonstrated throughout the campaign. Ignoring his behavior won't make it disappear. The issue is, now Trump is in a position of power over all of these already marginalized citizens - those are the implications for many people.", "Now Sanders and his former campaign officials can tell us how they really feel.", "At least until Chelsea starts her political career. They still have a lot of political connections and money they'll just keep comming back. The establishment of the DNC will try really hard not to learn anything from this.", "By flips the bird I hope you mean starts progressive party with bird as symbol\n\nHe lost any leverage he attempted to have by agreeing to the platform so he has nothing to lose declaring all out war with the DNC.", "Sanders was robbed and everyone knows it.  Good Bye Crooked Hillary.", "&gt;Trump intends to replace most of them anyway. \n\nHe's running with the likes of Guilliani and Christie with a side of Pence. Not exactly replacing the establishment there.\n\nTrump is a wolf in sheeps clothing. He was never anti-establishment. He's always been a power broker with the rest of them. This is a modern day version of Reagan's quote during his first inaugural address - 'government is not the solution government is the problem' - while he would go on to expand government, especially the defense department, wildly.", "That kind of attitude is why she lost. It was never her job. We as the American people, did not say \"alright Hilary after Barack its your turn dont you worry\". That was the elite at the DNC who had that brilliant brainfart. She took it for granted she would be president, underestimated what Trump could do in terms of voter turnout and how fucking unlikable she was an has paid the price. She'll go down as the person who lost to Donald Trump. What a legacy.", "The only positive to come of this election.", "Her entire 50+ year career lead up to the mascot of an early 2000s reality show walking in and taking her job.\n\nIt's gotta feel like absolute shit.", "The GOP is the opposite of irrelevant. Do you think Donald \"Foreign and Domestic Policy\" Trump is going to be interested in blocking any of Congress's bullshit? Or do you think last night is going to make siding with the dems look like a good idea to moderate republicans?", "CNN said the reason she's late is because they hadn't planned at all for a concession speech. Sums it all up really.", "Or: they promised not to attack each other on certain things.  Hillary agreed not to attack his wife's dealings at the college she ran and he promised not to attack her on emails.\n\nThat isn't blackmail", "Exactly. As it stands it looked like 'Well you people can't do anything for me any longer so just fuck off.' ", "At least the Bush administration had policies. They had ideas about lowering prescription drug prices and reforming k-12 education. They had an ideology. It was a terrible ideology that was heavily invested in starting a war for the funsies and profit but they had a guiding force.\n\nI have no idea what the fuck is about to happen. ", "Not really related to Hillary but the election in general.\n\nTwitter is so bad right now Im sure you can imagine. Had discussions with a few friends who did non stop complaining last night(and still are) and THEY DIDNT EVEN VOTE.\n\nThat pisses me off so much, if all young people would put half the time into voting as they do trying to change the world on social meida we wouldnt be in this position ", "Imagine if you had been told in 2008 that Obama would be succeeded by Donald Trump", "I remember that too! I was amazed in the worst possible way. Fuck CNN and the DNC.\n\nEdit: Fuck all the corporate media.", "he was trying to protect his legacy.  That's why he campaigned so hard.", "Yet all those fearless people looking to being light to the people are labeled traitors like snowden \n\nAnd when stuff is reported like the avalanche of wiki leaks against Clinton people just bury their head in the sand and vote off opinion not facts \n\n\nThis election has shown that Americans are simply too gullible ", "Yeah at least it's proof that democracy is alive and well. The polls weren't rigged. A non-establishment outsider was actually able to take the nomination. ", "As an interested Canadian it seems more like she lost the election than Trump won it. She and the DNC should be ashamed and embarrassed by what happened.", "Youre right. He's just disconnected enough to not be held down by the DNCs shittiness. Remember: he was the outsider back in 2008. That wasn't too long ago in perspective", "yup.  she just sends out podesta and tells them to leave.\n\nshe could have come out thanked them, said that the votes are still coming in, etc.", "Ohhhh so after your shady ass candidate loses is when we can start doing real journalism again. FUCK YOU /r/POLITICS SUCK A BAG OF DICKS", "They stole the nomination from Bernie and Hillary and the dnc paid hugely for it.\n\nUs Bernie supports said for the longest time that Hillary was a very weak candidate mired by scandals and simply had no charisma.\n\nBernie and Trump both felt authentic and could draw massive crowds without saying a word.", "There won't be 12% unemployment in 2 years. Obama's policies will sustain us for a time and Trump will get credit. All the leverage he needs.", "How many times does the FBI need to tell you she didn't do anything illegal before you believe it?", "&gt; Their corruption remains in the shadows.\n\nI don't think this is necessarily the case so much as they've been openly corrupt for so long that it's not a surprise anymore. The corruption in the Democratic party feels like more of a betrayal because people actually thought they could trust them.", "Yeah she's now responsible for destroying his legacy. I can't imagine Obama is a big fan of Hillary at this point. ", "Had a good hearty chuckle. Opened up this sub today wondering what it would be like and saw this at 1k FUCKING lol", "He's not a math major. Go easy on him. ", "im calling it now Sanders flips the bird to America telling them to fuck themselves", "NPR is already doing it. They keep interviewing Sanders supports and asking how they voted and just move on to the next story. Pretty obvious what they're trying to say.", "oh that makes her sound ready to be president wtf", "TIL that all the reasons I have been patriotic all my life are not actually true; most people don't care about those things at all. And the choice of values was laid out so clearly in this election that there is no use debating it. It was an extremely clear choice democratically decided, and I am in the minority. All the Trump supporters were 100% correct, and much more in tune with what this country is actually like. I hope I am equally wrong about the bad times we all have ahead.", "Our media is completely compromised.  They created a media black out surrounding Clinton's criminal activities and attempted to usher in a criminal into the white house.  They ignored Wiki  leaks and blamed all of it on Russia.  They shit on Trump all year.  Fuck the media they are a lost cause.   The main stream media's complete and total inability to do their job is now responsible for the rise of Breitbart and the likes.  ", "Talk about a toxic politician...\n\nDebbie Wasserman Schultz is so toxic she'll be lucky if anyone takes her calls or gives her the time of day in Democratic circles after this fiasco at her hands.", "No only did she not win she lost to a guy like Trump.  Talk about salt on a wound.", "Yea the down votes happened immediately, and in volume for anything critical of Clinton.  How can they expect to get a proper litmus test for where their campaign is at if they sensor the info they are giving themselves.  Makes no sense to me.", "Just as a reminder: the Republicans now control the Presidency the House, the Senate, and soon the supreme court. They also own a hugely disproportionate number of state legislatures.\n\nIf you self identify as a liberal, we do need to take some time to do an autopsy, for sure. But we also need to get through this period of pointing fingers at each other really fucking quickly. Our backs are against the wall, we have almost no seats of power, and yelling at each other about whose fault this is does not seem very productive.", "They meant the election was 18 months so we'll have to go through it again in 2.5 years, not 3 years as the post above said. ", "This is the sad sad truth. Hell inherent a growing economy and never shut up about how it was all his doing.", "oh my fucking god shut up about Bernie already. He wasn't going to win. I also voted for him in the primaries, but he wouldn't have done any better. If anything he would have done worse. ", "My mom is an ardent Hillary supporter and that's exactly how she felt.", "That would be the best possible outcome. I keep trying to imagine campaign Trump comforting the nation after a mass shooting or other disaster and it just makes me cringe. ", "I'm not a republican.", "150M people who never showed up to vote.\n\nUntil they did.", "It's entirely possible he makes himself too unpopular to reelect.  The Republican party barely held on to him this time around what's stopping them from giving Trump the boot and trying to put in one of their own guys in 4 years?", "All those wasted millions hahaha", "Especially after Obama's remarks on Jimmy Kimmel Live: https://www.youtube.com/watch?v=XvgnOqcCYCM&amp;feature=youtu.be", "Pretty incredible considering Obama now has to hand the keys to the guy that perpetuated the birther movement against him.  This cannot be easy for him.", "I'm not a mathematics major but I think 18 months is 1.5 years", "I remember those policies to help education... my local schools ended up losing their art programs", "Amazing. Who would have thought carrying on a campaign with an attitude of \"I can do whatever I want. What're you gonna do? Vote Republican? Ha ha ha ha\" would have indeed caused people to vote Republican.  ", "My heart breaks for Obama. Eight years of hard work and grinding to make things better inch by inch will be undone in a day. ", "This really infuriates me and gives validation to the idea that it doesn't matter if you vote or not. Everyone in California Texas, New York and every other state that leans heavily one way or the other can just stay home because it's the electoral college in a dozen swing states that will decide the election.\n\nI live in Texas so it's a forgone conclusion that the state's electoral votes would go to Trump whether he won by 1% or 90% so my vote for president means absolutely nothing at the end of the day.  I know a lot of people on both the Republican and Democrat side that didn't vote for this exact reason.", "The other side repeatedly calling him a nazi in clownface most likely did not help", "Good riddance this is her fault.", "Now she knows how Clinton really is.", "Well there is a report out that she had a concession speech ready but was too distraught to be able to actually give it.", "So... NC didn't elect a governor over anti-LGBT law but voted for a president and vp that are very anti-LGBT... totally makes sense /s", "Fuck that. Trump rose to prominence with a racist strategy of questioning the legitimacy of the first black President. This is not the time to come together. This is the time to recognize that we are two nations not one. ", "One of the many microcosms of why she was a **terrible** candidate and I say this as a liberal. \n\n(also checking to see if I'm still shadowbanned) ", "The electoral college should be abolished and we should decide the President by popular vote. I know that will sound like a Democrat complaining because Clinton lost but abolishing the electoral college is something I've always thought we should do.", "&gt; walking in and taking her job\n\nThat is the attitude that lost her the election.  All along she believed that the job was already hers and the election was just a formality.  She forgot that the Presidency isn't a job you earn by \"paying your dues\" or having the right resume or making friends with the right people.  It's a job you earn by convincing the American people that you are going to work for them and give them hope and improve their lives and she didn't do that.", "The worst part. Podesta didn't even provide the Spirit Cooking recipe. ", "&gt; All first ladies have lesbian photo shoots in they background.\n\nYou're saying something is wrong with being a lesbian?  Or a woman giving consent to have photos taken?  She was a model.  That's kind of what they do.", "It was already stated that Pence will be in charge for the most part.", "I guess some people got laid off this moning", "This is what the dnc gets for choosing Clinton over Bernie..... He wouldn't have lost ", "it's true.  all of the mainstream news networks including PBS and NPR, were either biased towards or colluding with the Hillary campaign, from the very start, perhaps even for years prior to the election.  But the worst of them all was indeed the Washington Post.  Their snobbery against Bernie throughout the campaign was atrocious.  Dana Milbank and Jonathan Capehart can fuck right off.  If anyone wants a good (infuriating) long read on this subject, consider reading [this essay](http://harpers.org/archive/2016/11/swat-team-2/).  It tears WaPo a new one.  Here's a good excerpt explaining where their writers are coming from:\n\n&gt;The Washington Post, with its constant calls for civility, with its seemingly genetic predisposition for bipartisanship and consensus, is more than the paper of record for the capital—it is the house organ of a meritocratic elite, which views the federal city as the arena of its professional practice. Many of its leading personalities hail from a fairly exalted socioeconomic background (as is the case at most important American dailies). Its pundits are not workaday chroniclers of high-school football games or city-council meetings. They are professionals in the full sense of the word, well educated and well connected, often flaunting insider credentials of one sort or another. They are, of course, a comfortable bunch. And when they look around at the comfortable, well-educated folks who work in government, academia, Wall Street, medicine, and Silicon Valley, they see their peers.\n\n&gt;The professionalization of journalism is a well-known historical narrative. James Fallows, in Breaking the News (1996), describes how journalism went from being “a high working-class activity” to an occupation for “college boys” in the mid-1960s. The Washington Post’s role in this story, as a compulsive employer of Ivy League graduates, is also well known. Indeed, the concentration of obnoxious Ivy Leaguers at the Post was once so great, Fallows writes, that editor Leonard Downie (who went to Ohio State) was known among his colleagues as “Land-Grant Len.” At present, five of the eight members of the Post’s editorial board are graduates of Ivy League universities.\nNow, consider the recent history of the Democratic Party. Beginning in the 1970s, it has increasingly become an organ of this same class. Affluent white-collar professionals are today the voting bloc that Democrats represent most faithfully, and they are the people whom Democrats see as the rightful winners in our economic order. Hillary Clinton, with her fantastic résumé and her life of striving and her much-commented-on qualifications, represents the aspirations of this class almost perfectly. An accomplished lawyer, she is also in with the foreign-policy in crowd; she has the respect of leading economists; she is a familiar face to sophisticated financiers. She knows how things work in the capital. To Washington Democrats, and possibly to many Republicans, she is not just a candidate but a colleague, the living embodiment of their professional worldview.\n\n&gt;In Bernie Sanders and his “political revolution,” on the other hand, I believe these same people saw something kind of horrifying: a throwback to the low-rent Democratic politics of many decades ago. Sanders may refer to himself as a progressive, but to the affluent white-collar class, what he represented was atavism, a regression to a time when demagogues in rumpled jackets pandered to vulgar public prejudices against banks and capitalists and foreign factory owners. Ugh.\n\n&gt;Choosing Clinton over Sanders was, I think, a no-brainer for this group. They understand modern economics, they know not to fear Wall Street or free trade. And they addressed themselves to the Sanders campaign by doing what professionals always do: defining the boundaries of legitimacy, by which I mean, defining Sanders out.", "He also knows that once the republicans take all the branches of government his legacy is one of the first things to go. ", "They won't listen. They don't care what the facts are only about how they *feel*.", "To the Clinton democrats you know how you're gonna feel watching Clinton come out and concede. That's how we Bernie supporters felt at the DNC, gutted, cheated, and crying to Simon and Garfunkel ", "It must suck to be Bernie right now. You've been a voice in the wilderness since the 60s standing up for causes you believe in and fighting for the rights of the disenfranchised. You climbed the political ranks from the absolute bottom to the top and decide to run for president. You put on a supremely strong, positive, respectful campaign that spoke to the lower and middle class. You competed in a primary the DNC would never let you win even though the analytics overwhelmingly indicate you would have wiped the floor with Trump. When you lost, you did it with grace and recognized and supported the victor because you realize how unimaginably dangerous the opposition was. Now, the Democrat lost because she was woefully out of touch with the American people. The same voter pool you appealed was swayed by a charlatan, a person who has never had to go through 1/1000 of the shit you've had to deal with in your life. Now, at age 75, instead of being able to ride off into the sunset with your head held high, you have to hop back into the fight against demagoguery, indecency, nationalism, and bigotry. \n\n\nMy heart goes out to you, Bern. ", "o now its time?", "I mean think of the absolute insanity of this:  The whole point of the primaries is to ask the American people who they like best all so the party can have the best chance possible at winning the general election.  _Everything_ that Hillary and DWS and by extension the DNC did went against that.  They set up an absolute delusion from the start and now they're surprised about the outcome?  They crafted the narrative for the media, they relied on super delegates to present a false notion of \"she already won\" from the get-go, they spent _millions of dollars influencing grass roots discussions online_, they siphoned money from races that democrats ended _losing_ last night, and they continually attacked and degraded the guy who closed a 60 point gap in less than a year and had proven to appeal to the independents needed for a general election.  They have fucked the democratic party, they have fucked America, and they have fucked the entire world with regard to the inaction on climate change that we will now see. \n\n ", "Calling this a \"painful\" loss for her is one of the biggest understatements ever.\n\nEdit: I've watched a lot of sports in my life and  that was the most stunning collapse I've ever witnessed. She just couldn't put him away", "All made a thousand times worse by the fact that she lost to a reality TV star who's not once held elected office.  ", "For me oddly enough, Trump never seemed more presidential than during his victory speech and Clinton never seemed more likable during her concession. ", "If he does nothing else in his presidency killing the TPP would be a pretty significant impact globally.", "Her life ambition is literally over and she will never be president. Even though I've never liked her I cannot imagine the mental turmoil she must be experiencing.", "Now it's the end of the Clintons and Bushes.", "If you're a Bernie supporter looking for a silver lining Trump did a genius thing a couple weeks ago that kinda got lost in the madness of wikileaks and Comey. \n\nHe proposed term limits for Congress. He is 100% serious about this and he brilliantly waited until the last minute so it was too late for any congressmen who had endorsed him to back out. They're furious. \n\nHe can start a movement with the states to get this done. It's 75% popular with the country. It can absolutely happen. ", "&gt;This election was not about me  \n  \nHer logo was a giant H and her slogan was *I'm With Her*", "Wow.  Imagine how Bernie feels. Omg. They stole it from him gave it to Clinton, who then lost. He knows he would've beat trump too. Poor fucking guy man smh", "Social media has been a huge fucking gigantic failure, don't you dare give it a pass. It's shitty viral fake or misleading news sourced from places like Breitbart, Infowars and Drudge Report spreading through social media including half of fucking reddit that gave America trump. There is absolutely no quality control, no accountability, almost no consequences for fucking lying, and the 'truth' is decided on how many shares, likes or upvotes it gets rather than whether it's fucking true. People in glass houses should not throw stones, do not ever, ever, **ever** give social media a pass on this.\n\nSee maddox on why your alt news site sucks:\n\nhttps://www.youtube.com/watch?v=qwLWq5roN_k", "Oh we're now allowed to upvote this stuff?", "That isn't the problem. The problem is that Democrats are too boring. They're always middle-of-the-road whereas Republicans always go to the right, so anyone who leans even slightly right is going to vote Republican. They're also very establishment.\n\nLook at this election. Bernie was the most left leaning candidate in long, long time and energized the Democratic like no one has done since Obama. Then they put in Hillary who actually leans a bit right of center, and all the enthusiasm evaporated.\n\nThey made the same mistakes with Gore and Edwards. Boring candidates that offer no real change. If they want to win they need to grow a pair and nominate a truly leftist candidate.", "She is such a hilariously failed candidate two failed presidential bids with the odds stacked in her favor. Political history will relegate her to the place she belongs.", "She's not a victim. She dug her own hole. Remember that.\n\nShe won 51% of college-educated white women. That was a huge underperformance.\n\nThis wasn't about bigotry or sexism. She is just a terrible corrupt candidate and the people are tired of establishment elitism.\n\nShe is done, and so goes the rest of the establishment left. This is absolutely historic. ", "He made it clear as soon as he tacked Pence onto the goddamn ticket. ", "And now we offer Trump our best wishes and hope he can rise to the Office and surprise us all. \n\nEDIT: My first gilded comment is about coming together. Thank you kind stranger.", "It looked like she was on the verge of tears throughout.", "She was sad and didn't much hide it. I assume last night it would have been outright tears. This was a goodbye speech. It felt honest to me. \n\nEdit: first ever gold. Thank you!", "\"This loss hurts but please, never stop believing that fighting for what's right is worth it.\"\n-HRC", "There's a good reason to think he would've done better than Clinton given his performance in Michigan and other midwestern states.", "Yes. Only the foolish be fooled. This election was 100% about her.", "Nor should we. We need to get more organized and involved. From National to Local levels. We also need to clean house in the DNC. Otherwise nothing will ever change for the better for Democrats, and it will get worse. Get organized!", "I'm pretty sure that was the most human speech I've ever heard her give. Not much political bullshit no overly prepared buzzwords just a real concession speech", "You've been allowed to there's just not a swarm of paid redditors downvoting anymore.", "Painful loss for the nation. All 3 branches of government will be Republican so expect Obamacare to be repealed, loss of LGBT rights, tax cuts for the rich, no college-tuition reform, loss of protections for minority groups like Muslims, no gun control reform, and devastating effects to the economy.\n\nTrump will likely appoint multiple Supreme Court justices. This election will have effects for generations.", "Yeah okay... Republican congress isn't going to let that happen.", "Problem is that the framers of the constitution and founding fathers clearly didn't want DC to be a state because of the possibility of local politics interfering with the federal government. There is no way they will ever be a state if it gets drawn into a legal battle. \n\nEdit thanks for the gold ", "just like over half of america\n\nedited to put over half putting just half really bothered people", "Tulsi Gabbard knew exactly what she was doing when she broke ranks and endorsed Bernie at the convention. She's a strong contender for a 2020 Berniecrat ticket. ", "They need to abandon issues that are not getting them anywhere. The perception of being anti gun is clearly not getting them anywhere.", "&gt; Then he added \"***When you hustle money like that, you don't sit in restaurants like this. You sit in restaurants where you spend, I don't know what they spend, hundreds of dollars for dinner and so forth. That's the world you are accustomed to. And that's the worldview that you adopt. I'm not going to condemn Hillary and Bill Clinton because they've made a lot of money. That type of wealth has the potential to isolate you from the reality of the ,world***\" he said.\n\n\nThe DNC should jump off a cliff.", "True. That era is officially over unless the DNC fails to purge the Clintons from the party. ", "The Clinton legacy goes from a really nice Presidency to selfishly taking out the Democratic Party.", "Hilary Clinton's brand of politics needs to be put out to pasture. Never again should democrats flirt with a candidate so corrupt. Everyone who voted for Clinton because \"she had a better chance at winning\" should do the right thing and admit over the next week that Bernie Sanders is the heart and soul of the democratic party. They have a moral obligation to come clean with us about the kinds of politics they're now responsible for.", "Term limits mean nothing without a fix to gerrymandering. Parties can just line up extreme pro-corporate candidates one after the other in safe districts. Term limits take power and influence away from elected representatives and give it to lobbyists and staffers. Money wins.\n\nBesides we already have term limits. Their called \"elections\" and they happen on a regular schedule. What we need is campaign and election reform.", "Well I am excited for John Oliver this week.", "Like ex-Berners?", "Good news on that front Maine just passed a ballot measure for ranked choice voting. ", "If every state awarded their electoral votes proportionally instead of winner take all The final results would look like:\n\n\nClinton: 270\n\n\nTrump: 264\n\nJohnson: 3\n\nMcMullin: 1\n\nNote: This is using 100% proportionality, unlike the systems Nebraska and Maine use today.\n\nEdit: Here's the state-by-state breakdown using this methodology:\n\nhttp://imgur.com/a/YmRfc\n", "There's no telling how he would have done in the general election. Bernie probably feels just as sick as the rest of us do.", "I don't feel bad for shady politicians who don't get their way nothing sad about it. ", "It's gonna get buried 100%\n\nThe republican have full power now. They will try with the hardest ever to exert it to full extent.", "The Republican Party is at its strongest since Reagan\n\nConservatism however is dead", "The DNC wrote questions for CNN to ask Trump. There is absolutely ZERO REASON for CNN to be communicating with the DNC over an interview with Trump before the interview. It would be one thing to ask for comment *after* the interview but to give the questions to CNN to ask is ridiculous.\n\nhttp://16004-presscdn-0-50.pagely.netdna-cdn.com/wp-content/uploads/cnn-trump-questions-dnc.jpg", "I don't see that happening.  Trump riding a whitelash to the white house just took the ideological gloves off the republicans.  Trump just proved you can say and do *anything* to *anyone* and still get elected.\n\nYou think the pubs were delusional before?\n\nNow they have an excuse to go full alt-right.  Put an alt-right judge on the supreme court.  Dump obamacare outright.  Gut the already mostly gutless dodd-frank.\n\nThe most pathetic part of this is when it blows up in our faces again like it did with junior? The trumpites like the bushies before them, will quietly slink back into their corner until a democrat cleans up enough of their mess for them to feel brave enough to come out crying again.", "Silver lining.", "Ohhhhh.... NOW is the time for journalism.\n\nThe Guardian in the US is a shit-stain on the Guardian's original reputation back in the UK.\n\nThey really need to ditch their US bureau and start again from scratch... it's been as bad as other US MSM sources in this cycle.", "Use that energy that *rage* (at both Trump and the DNC that screwed you over and allowed this to happen), to create a new progressive party, Bernie.", "I mean it's not going to happen, but if you buy the theory that his only goal is upending everything then it would be pretty dang funny.\n\n\nBut I think we all realize that Pence as his VP pick means none of this is an accurate reflection of him. He's going to just keep meandering right.", "Because he would have won.  He was the type of candidate that would have motivated people to come out and vote.  He had no scandals he had a positive message, he has extreme likability.  He was cheated, but he decided what was done was done and it was time to defeat Trump.  Now that Hillary has proven to be a complete fucking loser (289 to 218, are you FUCKING KIDDING ME????) he has nothing polite to say.  Why would he?  ", "You know I really did not want another fuckin Clinton or Bush. I'm tired of them and the presidency is not a fucking monarchy, so that's good.\n\nBut, Trump? Jesus christ. So much fail from the parties.", "We've been saying for 8 months that Trump's candidacy is the end of the GOP as we have known it.  His election just cemented that reality but not in the way most of us were thinking.  Trump has cleared new ground, set new examples, shifted paradigms, and completely bulldozed long-standing assumptions.  GOP leadership will use his run as the template moving forward.  ", "Yeah see this is the thing that I think a lot of people are missing. Bernie is honest, consistent, respectable: a \"good guy.\" Those qualities can go a long way with Republicans, even if they don't agree with all his policies.", "&gt; We also need to clean house in the DNC. \n\nWe have been saying this since 1992. DNC is capable of fucking up the simple act of breaking an egg to make an omelet. History has proved this over and over again. \n\n", "In addition team hillary pushed for the likes of trump to be the lead of the pack (podesta email id 1120) so their would have the easiest election possible and win in a landslide.\n\nThrough their meddling we had trump as a nominee in the first place.\n\nWithout meddling hillary would still have lost, but instead Wed have a republican like kaisich and the room republican. Which doesn't strike me as being nearly as bad.", "I remember in 2008 listening to Republicans saying \"not my president\" and states talking about seceding. I thought it was pretty stupid then too.", "No he was trying to win. \n\nTrump always tries to win. He'll say anything to you to get you to side with him, to like and trust him. \n\nHe has countered his own policies over and over throughout the election, and he may have lost the popular vote. \n\nAs a man who wants more adulation, not less, we have no clue what he'll do come January. I just hope he keeps Ghouliani on a fucking leash.", "I cracked up laughing.", "YES YES YES! Fuck climate change! Fuck LGBT people! Fuck minorities! Yes! Finally we are back to the good ol'days! When is our next bloody sunday scheduled for?", "Congratulations America. Instead of choosing the *much* *much* better candidate (although still not good, obviously) who doesn't hate LGBT people and racial/ethnic minorities, you choose the candidate that does. \n\nEveryone who voted for Trump will most likely regret their decision.", "All of that money spent...being convinced all year it was hers in the bag...and Donald Trump a man who had way more scandals than she did, beat her. This race is gonna be talked about for fucking decades.\n\ne: For everyone saying \"But she had more scandals!!!\". I know, the FBI investigating you is obviously 100x worse than any things Trump said, but lets be honest, the man was in the news every single week dealing with things he'd either said or done in the past and nothing phased him, and he played the media like a fucking fiddle (like C'mon the whole \"...*Wrong*\" thing and holding his index to thumb have become pretty popular for people to do jokingly as it was shown so much.\n\ne2: u/vortex30 made a great point below in that with most of his scandals, he owned up to them or downright denied them in some cases, where a lot of politicians would've given \"politician answers\" and pussyfooted away from them and infuriated people wanting answers even further.\n\ne3: For the last time I'm a Trump fan and I'm saying the MSM covered things he said which I'd call 'scandal's over and over and over again for months on end, yet he *somehow* weathered the storm.", "&gt;We're told Tim Kaine could be the future of the Democratic Party\n\nNo one has ever or ever will be excited by Tim Kaine.", "Bingo. Fuck corrupt Clinton and her DNC.", "First woman president is like George Washington Abraham Lincoln level history shit. It must be painful to be so close and lose it. ", "Van Jones already did it y'day on CNN. Calling Sanders a \"rebellion\" that had to be put down before a conversation on race can happen.", "That's the joke ;). It's incredible how apparent it was.", "The CBS stream showed people in the crowd bawling their eyes out", "The democrats have came back from worse. In 2020 we have Warren, Sanders, Kander, Feingold, Newscom, and Brooker. They'll look for new faces, and try again. Its a end of a era for democrats, but not the end all together", "\"Such a nasty woman\"", "This is honestly my favorite news of the day. I hate the idea that America has political dynasties. Of all the Americans in this country and we have to keep going back to the same set of families for good leaders?", "There is nothing polite to say.\n\nAmerica is gone.   Welcome to Murica.", "Thankfully we have a massive amount of angry Republicans in charge of everything to 'Make America Great Again!'\n\nHow? \n\nTax breaks, getting rid of regulations, and trying to actively piss off every other nation in the world.", "I think I remember HRC fundraising with prosperous elites in the UK while Sanders was campaigning in the US. And that's post-Brexit.\n\nSays it all really ", "Clinton really snatched defeat from the jaws of victory on this one", "I mean... half the posts were from people who were literally on Hillary's payroll who then would circle-jerk upvote party each other's posts.  What do you expect?", "Unreal cognitive dissonance.\n\nYou should have been investigating the Institutions all along. You might have uncovered the massive corruption in the DNC.\n\nI don't doubt the RNC is much better but without leaks we will never know.", "Both WaPo and the NYTimes bombarded us with anti-Bernie pro-establishment propaganda.\n\nIt was never about the issues. It was about the DNC cronies getting their way. They would have lined up to kiss Clinton's feet regardless of her positions. Now look at them! Fucking losers.", "Better quality of life for whom? The dozens of Foxconn workers jumping off the roof of the manufacturing plant who work 19 hour days for paltry wages? Or the slave labor used to create the overpriced garments that align the shelves at places like Kohl's and Macy's?", "Taking that a bit further I think /r/politics should be especially ashamed of itself for upvoting anything pro-Hillary by default.  This is primarily because damn near nothing down-ballot got promoted to the top, and look what happened.", "Could be a little assassination insurance too.", "OK Trump/GOP you won. It's time to lead.     \nYou got the House, Senate and POTUS.     \nYou now have no excuses, nobody to blame, no place to point fingers.    \nIt's on you now.  All I ask is that you don't start another damn war.", "This is such an odd fantasy.  They control the house the senate and the White House.  That doesn't sound irrelevant to me, that sounds like we're going to be living under radical Christian fundamentalist government.", "I just realized something.\n\nHillary Clinton worked her entire life for this. This has been her life goal since she was a teenager. Everything she has ever done was meant for this moment.\n\nAnd then two years ago Trump thought to himself \"You know what? I kind of want to be President.\" Then he made it happen.\n\nStunning.", "Disgusting. ", "Bernie people will take this line differently. ", "I would have voted for Bernie or O'Malley. But the DNC chose to run a war-mongering Republican instead.\n\nParty politics are horrible. They don't represent us they represent their donors.", "&gt; They didn't lose badly enough.\n\nOh no they lost **BIG**. You have to look at the context. In a normal Presidential election, yeah, they didn't lose badly. But this was an election where they put forward what they considered to be their strongest candidate by far, to run against a person who by all accounts was the weakest candidate in American history. They had record breaking campaign spending for their best candidate vs. virtually nothing coming from their extremely weak opponent. And yet they *still* lost.\n\nKeep in mind, if the tables were turned and Hillary won by the same margin Trump did, it would still be considered something of a loss for her because this race shouldn't have been even remotely close. But an outright loss is brutal.\n\nAnd don't forget, the dems didn't just lose the Presidency, they've lost every branch of government. They don't control the house, senate, Presidency, or Supreme Court. 30/50 states are controlled by Republicans. The Democrats currently have no power in this country, it's impossible to deny that their strategy has utterly failed by every metric.", "Would be funny if he pushed Bernie or Obama for the Supreme Court.", "Well the joke was on them. People don't get excited to vote for the candidate that is openly turning reddit into a paid shilling machine. Imagine that.", "&gt; but Alex Jones had been calling lots of these conspiracies for a while now and many turned out true\n\nHoly fucking shit. 99.999% of everything he says is utter bullshit and lies just because a stopped clock is right once(edit: twice, thank you pedants) a day does not mean you should use it. He is an absolute lunatic who thinks aliens and demons are depriving him of life extending drugs (this is not hyperbole, this is what he actually believes), that Obama is a demon who smells of sulphur, that Sandy hook was a false flag etc... He is the biggest bullshitter in the world, and anyone who gives him any credibility is a terrible human being.", "He's one of the most widely recognized and well-regarded Democrats in office now and Clinton and all her friends have just screwed up in a way they can't ever sweep under the rug.  Why would he choose a harder fight than simply sitting where he is, being himself, and pulling the Party to the left?", "Outside of america he was the only thing that made you lot of bastards look somewhat decent. Got that suave black president playing basketball and shit.", "That was the point.", "1.  This is old news.  Pence announced this policy in early October.\n\n2.  This is consistent with the state by state approach Trump has taken on the issue.  \n\n3.  While I agree that Trump's statements on LGBT issues have at times been quite bad they should also be viewed through the lens of his need to consolidate evangelical and other religious conservative voters as well as weighed against other things he has said about LGBT people.  Although it was a low bar, he really was the most pro-LGBT candidate the Republicans have ever nominated and just a week or two ago he was holding an \"LGBTs for Trump\" pride flag at a rally.  There have been very conflicting statements out of Trump on this issue. \n\nBelieve me, as a gay American I am very concerned about his judicial appointments.  But I don't see the need for panic, and I think that these click bait articles are a part of the problem with our political discourse right now.  ", "what's stopping them? same reasons that stopped them this time around.\n\n", "He's anti-gay for promising to nominate SCOTUS justices that will overturn Obergefell v Hodges.", "The DNC leadership and elite will definitely push another establishment prick under the guise of \"pragmatism\" and \"electability\" like they did in 2004 and now. This is why 2018 is basically going to be the most important midterm for progressives.\n\nmake sure your registered by 2017."], "links": ["5bzot4", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5byrar", "5bzot4", "5bzot4", "5c0ltu", "5c0kbp", "5bzz3v", "5bzh35", "5c0kbp", "5bzot4", "5bzot4", "5c049k", "5bzuef", "5c0e5h", "5c0e5h", "5bzz3v", "5bzot4", "5bzz3v", "5bzot4", "5c0e5h", "5bzot4", "5bzot4", "5bzot4", "5c0ltu", "5bz3wn", "5c0kbp", "5byrar", "5bzot4", "5c0e5h", "5bzot4", "5bzot4", "5bzot4", "5c0ltu", "5bzscq", "5c0kbp", "5bzot4", "5c0e5h", "5c0ltu", "5bzot4", "5c0kbp", "5bzz3v", "5bzot4", "5bzot4", "5bzz3v", "5byrar", "5c0e5h", "5c0kbp", "5bz3wn", "5bzot4", "5bzz3v", "5byzy9", "5c0e5h", "5bz3wn", "5bzuef", "5c0ltu", "5bzh35", "5bzz3v", "5byvn1", "5bzot4", "5bzot4", "5bzot4", "5bzot4", "5c0e5h", "5c0e5h", "5bzuef", "5bzh35", "5bzot4", "5c0ltu", "5c0kbp", "5bzh35", "5bzz3v", "5bz3wn", "5c0e5h", "5c0kbp", "5bzz3v", "5bz3wn", "5c0kbp", "5bzscq", "5bzscq", "5c0ltu", "5bzscq", "5bzot4", "5bzscq", "5c0kbp", "5bzljz", "5byvn1", "5bzuef", "5bz3wn", "5byrar", "5bzuef", "5c0e5h", "5c0ltu", "5bzot4", "5c0uw7", "5c0ro3", "5bzz3v", "5bzot4", "5c049k", "5c0ro3", "5c0uw7", "5bzot4", "5c0ro3", "5c0ro3", "5bzscq", "5bzot4", "5bzscq", "5bzot4", "5c0ro3", "5bzot4", "5bzot4", "5c0ro3", "5c0ltu", "5bzscq", "5bzot4", "5c0uw7", "5bzscq", "5bzz3v", "5c0e5h", "5bzscq", "5bzot4", "5bzz3v", "5c0t4u", "5bzot4", "5byrar", "5bzot4", "5bzuef", "5bzot4", "5bzz3v", "5c0ltu", "5bzot4", "5c0e5h", "5c0ro3", "5bzot4", "5bzot4", "5c0ro3", "5bzot4", "5byrar", "5c0ltu", "5bzz3v", "5bzz3v", "5bzot4", "5c0ltu", "5bzot4", "5c0ltu", "5c0ltu", "5c0ltu", "5bzz3v", "5bzot4", "5c0ro3", "5c0ltu", "5bzuef", "5bzscq", "5c0uw7", "5c0ltu", "5c0ruy", "5bzz3v", "5bzot4", "5c0ro3", "5c0e5h", "5byrar", "5bzuef", "5bzz3v", "5c0e5h", "5bzot4", "5bzuef", "5bz3wn", "5bzljz", "5c0kbp", "5bzz3v", "5bzh35", "5bz3wn", "5c0pb4", "5c0pb4", "5c0ltu", "5bzz3v", "5c0ltu", "5c0e5h", "5bzscq", "5bzscq", "5bzuef", "5c0kbp", "5bzuef", "5c0kbp", "5bzscq", "5bzscq", "5bzh35", "5c0e5h", "5bzscq", "5bzscq", "5bzz3v", "5bzot4", "5c0uw7", "5c13n6", "5bzot4", "5c13n6", "5c0uw7", "5bzh35", "5bzh35", "5c13n6", "5c0ro3", "5bzz3v", "5bzh35", "5bzz3v", "5c0ro3", "5bzz3v", "5bzz3v", "5bzot4", "5bzot4", "5bzscq", "5bzot4", "5c0ro3", "5c0uw7", "5bzot4", "5c0uw7", "5bzot4", "5c0ro3", "5c0ro3", "5c0uw7", "5bzljz", "5c0ro3", "5bzot4", "5bzot4", "5c0uw7", "5c0ro3", "5c0uw7", "5c0t4u", "5bzz3v", "5c0uw7", "5bzz3v", "5bzuef", "5c0ro3", "5c0ltu", "5c0e5h", "5c13n6", "5c0yjd", "5c0ro3", "5bzz3v", "5bzuef", "5c0zqa", "5c0uw7", "5c0ro3", "5bzot4", "5bzz3v", "5bzot4", "5c0ro3", "5c0uw7", "5bzuef", "5c0zqa", "5c0yjd", "5bzot4", "5bzz3v", "5c0t4u", "5c0e5h", "5c1117", "5c0ro3", "5c0kbp", "5byrar", "5bzz3v", "5bzljz", "5c0ro3", "5c1117", "5bzz3v", "5c0ro3", "5bzscq", "5bzscq", "5c0ltu", "5c0ltu", "5c0t4u", "5bzz3v", "5c0zqa", "5c0e5h", "5bzz3v", "5c0e5h", "5c0uw7", "5c049k", "5bzuef", "5bzz3v", "5bzz3v", "5bzljz", "5c0e5h", "5c160d", "5bzuef", "5bzot4", "5bz3wn", "5bzuef", "5c0e5h", "5bzot4", "5bzscq", "5bzh35", "5c1ae6", "5c1ae6", "5c1ae6", "5c0uw7", "5bzz3v", "5c1ae6", "5c1eep", "5c1ae6", "5c1ae6", "5c0uw7", "5c1ae6", "5c1hux", "5c13n6", "5c1ae6", "5c1eep", "5c1htg", "5c1ae6", "5c1eep", "5c1ae6", "5c1eep", "5c13n6", "5c1ae6", "5c0ro3", "5bzot4", "5c0ro3", "5c1ae6", "5c13n6", "5c0ro3", "5c1ae6", "5c1ae6", "5c1eep", "5c13n6", "5c1ae6", "5c13n6", "5c1htg", "5c1ae6", "5c1ae6", "5c13n6", "5bzz3v", "5c0ro3", "5c1eep", "5bzz3v", "5c1ae6", "5c0uw7", "5bzot4", "5c0uw7", "5c1eep", "5c1hux", "5c1eep", "5c1ae6", "5c0e5h", "5c1eep", "5c13n6", "5c13n6", "5c0ro3", "5bzuef", "5c1ae6", "5c1eep", "5c0ro3", "5c13n6", "5bzot4", "5c0ro3", "5bzot4", "5c0uw7", "5bzscq", "5c13n6", "5c0uw7", "5bzz3v", "5c0uw7", "5c13n6", "5bzscq", "5c13n6", "5bzscq", "5c0ro3", "5c0ro3", "5c1eep", "5bzz3v", "5c13n6", "5c0ltu", "5c049k", "5bzuef", "5c0t4u", "5c0ro3", "5bzz3v", "5c1eep", "5bzz3v", "5c0uw7", "5c0uw7", "5bzz3v", "5bzz3v", "5c0ro3", "5c1eep", "5c1ae6", "5c1ae6", "5bzuef", "5c1ae6", "5c1ll8", "5c1rql", "5c0uw7", "5c0uw7", "5c1sa0", "5c1eep", "5c0uw7", "5c1ae6", "5c1eep", "5c1ll8", "5c1ll8", "5c0uw7", "5c1eep", "5c1rql", "5c0ro3", "5c1ll8", "5bzz3v", "5c1eep", "5c1eep", "5c1eep", "5c1eep", "5c0ro3", "5c0uw7", "5c0ro3", "5c1eep", "5bzz3v", "5c1eep", "5c1eep", "5c1ae6", "5c1eep", "5bzz3v", "5c1eep", "5c1ae6", "5c1eep", "5c1rql", "5c1eep", "5c1hux", "5c1eep", "5c1eep", "5bzz3v", "5c0ro3", "5c1ll8", "5c1eep", "5c1eep", "5c0ro3", "5c1eep", "5c1ll8", "5c1eep", "5c1ae6", "5c0ro3", "5c1ae6", "5c0ro3", "5bzscq", "5c13n6", "5c1eep", "5c0uw7", "5c1eep", "5c1jfw", "5c1ll8", "5c0uw7", "5c1eep", "5c0uw7", "5c1f7s", "5c13n6", "5c1ae6", "5c13n6", "5c1eep", "5c0ro3", "5c1ll8", "5bzot4", "5c13n6", "5c0uw7", "5c0ro3", "5c0ro3", "5c13n6", "5c1hux", "5c1eep", "5c0ro3", "5c1hux", "5c1eep", "5bzz3v", "5c1eep", "5c1eep", "5c1r5u", "5c0ro3", "5c1eep", "5c1hux", "5c1eep", "5c1eep", "5c0ro3", "5c13n6", "5bzz3v", "5c1ae6", "5c0uw7", "5c0ro3", "5c0ro3", "5c1eep", "5c1xwm", "5c1ll8", "5c1rql", "5c273f", "5c273f", "5c273f", "5c22jw", "5c273f", "5c273f", "5c1xwm", "5c273f", "5c1rql", "5c1ll8", "5c1rql", "5c1ae6", "5c0uw7", "5c273f", "5c25tv", "5c273f", "5c273f", "5c273f", "5c273f", "5c1rql", "5c273f", "5c1rql", "5c273f", "5c1rql", "5c273f", "5c1sa0", "5c1sa0", "5c273f", "5c1rql", "5c1ae6", "5c1rql", "5c273f", "5c0uw7", "5c1rql", "5c1xwm", "5c273f", "5c273f", "5c1ae6", "5c1hux", "5c1rql", "5c273f", "5c1xwm", "5c1ae6", "5c0uw7", "5c1ae6", "5c22jw", "5c1ll8", "5c1xwm", "5c1ae6", "5c1xwm", "5c273f", "5c1ae6", "5bzz3v", "5c1rql", "5c0uw7", "5c0kbp", "5c1ae6", "5c1ae6", "5c25tv", "5c25tv", "5c273f", "5c1eep", "5c273f", "5c273f", "5c0uw7", "5c1rql", "5c273f", "5c1rql", "5c0ro3", "5c273f", "5c1xwm", "5c1ae6", "5c1rql", "5c273f", "5c0uw7", "5c1ll8", "5c0uw7", "5c22jw", "5c0uw7", "5c1ae6", "5c0ro3", "5c1ae6", "5c1eep", "5c1y2h", "5c273f", "5c1ae6", "5c1ae6", "5c1ae6", "5c1rql", "5c1ll8", "5c1xwm", "5c0ro3", "5c22jw", "5c25tv", "5c13n6", "5c0ro3", "5c1rql"]}