{"comments": ["Leave him be. He was the first honest politician in my 50 year lifespan and he did it the right way and got fucked. When we deserve an honest leader we will get one. Apparently we deserve a reality TV con man and his middle school dropout supporters at the moment, so let the chaos reign. The buyers remorse will be only be overshadowed by its denial. ", "&gt;The same voter pool you appealed was swayed by a charlatan a person who has never had to go through 1/1000 of the shit you've had to deal with in your life.\n\nNot true. Millennials turned-out in about the same numbers as in Obama's 2012 victory. __They were by far her best age demographic__. She lost with older people, won with millennials. Link - http://www.nytimes.com/interactive/2016/11/08/us/politics/election-exit-polls.html\n\n-\n\nInteresting flashback;\n\nBernie's statement on how this will play out from one year ago;\n\n&gt;\"Let me be very clear. In my view, Democrats will not retain the White House, will not regain the Senate, will not gain the House and will not be successful in dozens of governor’s races unless we run a campaign which generates excitement and momentum and which produces a huge voter turnout.\n\n&gt;With all due respect, and I do not mean to insult anyone here, that will not happen with politics as usual. The same old, same old will not be successful.\nThe people of our country understand that — given the collapse of the American middle class and the grotesque level of income and wealth inequality we are experiencing — we do not need more establishment politics or establishment economics.\n\n&gt;We need a political movement which is prepared to take on the billionaire class and create a government which represents all Americans, and not just corporate America and wealthy campaign donors.\nIn other words, we need a movement which takes on the economic and political establishment, not one which is part of it.\"\n\n~ Bernie Sanders August 28th, 2015", "The irony of this being in r/politics is silly\n\n*also   https://voat.co\n\n*also fuck reddit mods and admins.  ", "OH! Well now /r/politics wants to talk about Wikileaks! How interesting!\n\n", "Obama got 10 million more votes in 2008 than Hillary got today.\n\nHow horrifically pathetic is that?", "Isn't there a guy half his age with the same ideas in America?", "He'll be 79 years old by then. There are older people in Washington but I think someone younger with the same ideals would be a safer bet.", "This is coming from the guardian? Why are these major media outlets flipping their ideals overnight?... oh.... wait that's right... ", "It seems so obvious when you look back on it. How did they take the literal loser from eight years ago and try it again against a voter base that had been preparing for a Hillary campaign the literal day Obama took office...both times. The RNC didn't have to rally hard to find support against Hillary they only needed to shuffle behind one person. We now know that Obama was actually the best candidate we could've hoped for in an otherwise conservative era in Washington politics.", "Sanders is now the most powerful democrat in America. The next democratic presidential candidate will either *be* him (not likely given his age) or will depend on him for validation and support.\n\nLike it or not corporatist democrats like Clinton and her allies are irrelevant after last night.", "&gt; they siphoned money from races that democrats ended losing last night\n\nFucking seriously this is why all the down tickets lost. She stole all the money. There were dozens of articles about it.", "That and not going to war with Russia over Syria will have a pretty big impact as well.", "Bernie was right. God damn it.", "She spent twice as much money on the campaign as Trump----and still lost.   Trump despite all the wacky shit he's said, had a higher percentage of the Hispanic and African American vote than Mitt Romney did.    \n\nAll of that points to an unlikable, out of touch candidate that should have never been nominated to begin with.  It should have been Bernie or Biden, the \"but its her turn\" BS doomed the Democrats.  ", "*Again*.  Dude's foresight is practically in an entirely different league from basically everyone else.  Especially considering \"Hindsight is 20/20\" doesn't even seem to apply to most politicians or pundits in general.", "Imagine spending 40 years of your life building a political career only to lose the presidency to a guy who picked up politics as a hobby just last year.\n\nI almost feel bad for her almost.", "See the difference between RNC and DNC, the RNC just flat out said they don't want Trump. Over and over again to the cameras, the American people, everybody, but they were stuck with him.\n\nThe DNC put on a mask and said \"We want both! They're so so great both of them.\" But internally away from the cameras and the American people the DNC had only one candidate that they really wanted to show support for. That to me is disgustingly corrupt.\n\nI have never been so happy to see such a corrupt system crash and burn. It really is sweet poetic justice. True democracy won in the end.", "This. I can't imagine how much more pain this causes she's just lost to a fucking businessman.", "To say that far left publications had no role in this is a joke as well. This subreddit itself was stating for months that Donald Trump had a 0% chance of victory. Articles from Buzzfeed Daily Beast, Slate, Vox dominating the front page and upvoting a crafted narrative.\n\nInflated and manipulated polls. Calls to crush Trump supporters. It backfired tremendously.\n\nSure enough the echo chamber bubble popped last night. ", "This. I can't imagine how much more pain this causes she's just lost to a fucking ~~businessman~~ con artist.", "I want to know how Joe Biden is feeling this morning. If he was torn up about not running during the primaries he must really be feeling it now. He would've won easily.", "I couldn't believe my ears when he said Hillary deserves our thanks for her service to the country. ", "Exactly.  Where was this call while the \"most transparent administration in history\" was setting records for FOIA rejections and denials?", "I was thinking the exact same thing. Why couldn't they be like this throughout the whole damn thing?\n\nReally hoping the trump bit holds. ", "Came here to say basically this. Screwing Bernie over alienated and marginalized all the young people who had been completely disillusioned with politics to begin with but had finally found a candidate that made them care. The DNC completely shut them out. DWS is a fucking idiot, and the democratic party got what it deserved. We've lost the House, Senate, White House, and the Supreme Court—and it's completely the DNC's fault.", "You have to give Trump credit.....\n\nHe destroyed the crooked Bush and Clinton family for good in less than a year. ", "You're assuming they don't double on their centrist bullshit. (They will)", "Not just that but most Republicans I've talked to seem to respect him. I did some canvassing for him during the primaries, and while I mostly met Trump supporters, a reocurring theme was \"I like Sanders more than Clinton\" or \"I can respect Sanders, but I think Trump is better for America.\" \n\nNo one, and I mean *no one*, had anything good to say about Clinton. Sanders may not have won, but the Trump voters would have at least listened to him more than Clinton. ", "I've never wanted to be proven wrong so hard before.\n\nAllright Republicans you won literally everything. Will you use this opportunity to push vengeful social policies that further divide the nation, or will you prove us all wrong and show us what a functional government *for the people* really looks like. Please oh please prove the democrats wrong, for all our sakes.", "A *superior* con artist. ", "He will be too old hell Trump will be to old as well.  We all know how being president seems to age presidents faster.  ", "She didn't just lose she sank the boat.", "The Clinton presidency wasn't even as great as people thought at the time. All the scandals and foreign policy blunders deregulation that helped cause financial problems, and trade deals that cost American jobs. He just happened to be president during the dot com boom.", "Maybe winning the election will help him finally pivot to the general?", "I completely blame Hillary and the DNC. They expected most Sanders supporters to fall in line. They did little to win them over. They wanted us to go from a candidate who said \"Not me Us,\" to \"I'm with her.\" How are people supposed to feel good about someone who simply feels it's her turn, and completely leaves her base in the dark. Still waiting on those transcripts. She was never able to drum up the excitement. You can see this in her rallies before the election. How many a list celebrities did she have to get in order for people to turn out?", "The right woman candidate will come. It has to be organic not forced", "Tulsi Gabbard the first female president", "I think it's less about rhetoric and more about results. A lot of Obama voters were hoping for much more change than they ended up getting and feel let down by their party.\n\nThe Democrats compromised on the wrong issues(interventionism environmentalism) and took hardline stances on the wrong issues(immigration, feminism, LGBT rights). A lot of people feel like the feminist movement and LGBT rights movement already accomplished as much as they could through the political process and didn't understand why the issue has been pressed so hard. Well intentioned people are tired of being made to feel like oppressors. Impoverished white people are tired of being told to check their privilege. \n\nThe people want a party that will put Americans first, and represent their interests over the interests of the global elite and $250,000 paid speeches from JP Morgan is not the way to go about that.", "somebody a few days ago made the analogy to being a kid that loves playing a particular video game...and you get very good at it...but then you have that ONE friend who comes over and literally doesn't know what any of the buttons do but he just mashes them wildly and somehow beats you every time and you get super pissed off that you are losing to somebody who has no clue what they are doing ", "Chelsea Clinton has the personality of a moth ball.  ", "Elizabeth Warren is only 67 though. She'd be 71 in 2020 plenty of time to run for president.", "Agreed Trump was having 4, 5, 6 rallies a day in swing states all over the country, some of which he ended up winning by less than a point.  He was getting made fun of in the media for hitting places like Minnesota, Wisconsin, Pennsylvania and Michigan.\n\nShe got straight up outworked for this.  Trump refused to quit, even though the polls had him down, the media shit all over him for months and some of the aggregators had Clinton at 98 or 99% odds.\n\n", "Trump might be the first candidate in history to wait until after the election was over to suddenly pivot.  Republicans won it all.  He could've come out and bragged about everything they were going to do with the majority but he didn't.  It was... odd.  I hope he continues on this 'unity' path but who the hell knows at this point.", "Not to mention killing of EPA more coal and offshore drilling, and a fuck you to global warming.", "Hillary ran the most entitled campaign in the history of US elections and the results show enormous rejection. She ran because she believed \"she deserved it\" and it was \"her turn\" while simply assuming women were going to vote for her like blacks voted for Obama.", "Not bad. Not a $200k speech  but not bad.  ", "I now consider Bernie Sanders the de facto leader of the Democratic Party.  Time has proven him right about the message that would have won the election; he is ethically clean enough to be immune to the \"crooked\" narrative that now taints the DNC; and he commands the respect of the rising and overwhelmingly liberal Millennial generation which is the Democratic Party's main hope for a comeback.", "The whole lead up was for show. He knew what he was doing", "Well if she wanted, she shouldn't have underestimated  her opponent and wrapped up campaigning about 5 weeks before the election.", "If Trump had spoken like he did last night during the election he wouldn't have won.", "Clinton's entire general election message was just \"I'm not Trump, and I have a vagina.\" That could have been the reason why her message didn't resonate with people.", "Bernie polled quite well with rural americans as he had the same kind of anti-establishment pro-average person stance that Trump did he just wanted to execute it differently.", "Clintons forced him out.  if joe entered it would have split the establishment vote and Bernie would have won.\n\nthey kept Bernie out at all costs.", "If he rejects this and TPP stops Pence's anti-LGBT tirade, and manages to not start a war/give away all of our secrets to Russia, I won't cry.", "Because it was.\n\nThat's the said thing about Clinton she spent her whole career trying to craft the perfect political image and she spent the entire campaign listening to establishment advisers, speech writers and pollsters during the one election in U.S. history in which the American public wanting anything but a polished establishment figure and went against all the political norms. \n\nHer entire life's work was leading up to this election, and she failed despite sticking to the \"rule book\". ", "I don't think this election was a \"failure for her to break the glass ceiling\" or w/e. If anything I think gender played a lot less of a roll in this than expected I think she was counting on a lot more women voting for her because she's a woman. People just fucking hate her, gender aside", "This is what scares me the most about this election.  It's not so much Trump it's entire Republican control of congress.  They control both house and senate so they can push virtually anything they like.", "She planned this for decades spent enormous sums of money, worked endless hours, made deals for god-knows-what, compromised ethics and security -- ALL for the sake of being the first woman president... and now she loses to the most ridiculous, reality-star television candidate.\n\nHer legacy went from being \"1st Woman President\" to... disgraced, scandal ridden presidential candidate who lost to Donald Trump of all people.", "Okay. Here's what I'm really scared of—the long burn:\n\nLast time a Republican populist candidate former silver screen star got put in office it gave us Reaganomics, which has arguably been slowly strangling the working class and lower class for decades afterwards. If Trump can't wrap his head around macroeconomics on a global level, and numbers start to slip, he's going to turn to the first proposition that promises growth. It won't be Trump making the calls in the same way that it was Cheney who hid behind the Bush II mask in giving us so *generously* the Iraq War. In short, my fear is that we're looking at Reaganomics 2.0: *now with even less trickle-down!*\n\nPeople are already saying, \"It's just four years—eight at most,\" but they forget that stuff like Reaganomics is still shaping the economy, globally, even today. And it'll be called Trumpenomics, and it's going to be an even more raw deal than its predecessor.\n\nOf course, I could totally be wrong. But with a Republican majority in the House and Senate and a \"bottom line\"-focused president susceptible to manipulation by his advisors, that is a very real possibility.", "Well when you sabotage someone in 2016 it's quite easy to find out how it's happening due to their virtual trail ", "Yeah. HRC thought she could get away with all the standard shady back room politics and she got exposed due to new technology. ", "Funny how rigging and blackmail was an impossibility on /r/politics until Trump won and everyone here started crying about how Bernie should have won the nomination.", "Remember Kansas. \n\nBrownback came into the governor's office making the same promises Trump did. He assured Kansans that his tax cuts would usher in an economic miracle business would boom, jobs would come flooding in.\n\nNone of it happened.  He became one of the most unpopular governors in the country.  The people were outraged by government service cuts (that hit rural areas particularly hard). His own party became hostile towards him. \n\nAnd, Kansans reelected him. \n\nI've learned that it's foolish to rely on people's rationality. \n\nEdit: obligatory thanks for the gold, kind redditor.", "No. He's too old and we've made a mistake relying on sufficiently advanced age to meet the rising challenges of tomorrow. \n\nSecond point you progressives need to get your heads out of your collective asses. You lost and should not be focusing on 2020. You should all be planning for 2018 first. Be realistic and understand how to implement change from bottom up. Take the congress first in 2018 and then the presidency second in 2020. Don't let 2020 come out of your mouth or through your fingers before you're hoarse with cries of \"2018 or bust.\"\n\nLastly, there's always Tulsi Gabbard and others like her. We keep it young, forward looking, and united. We stand together or we fall divided. \n\nFor now, hope that Donald Trump experiences measured success that doesn't adversely affect any population group or identity in America. His success is our success now. Respect the office and keep and open mind until he proves unworthy. Enjoy your status as the counter culture ideology. A lot can be done in the way of unification amongst our coalition here. This is a good place to be.\n\n2018 or bust! \n\nTulsi 2020 #YoungBoldProgressive \n", "closed primaries are a problem too. lots of independents left the Democratic party to because they didn't like how far to the RIGHT it went.  So not letting anybody else vote in your primaries means the people on the left whose votes should be yours, but who are independent--will not get their say.", "&gt; She won 51% of college-educated white women. That was a huge underperformance.\n&gt; This wasn't about bigotry or sexism. She is just a terrible corrupt candidate and the people are tired of establishment elitism.\n\nyou know, the more I think about this statement, the more it seems sexist to assume these college educated women would vote for her sight unseen. To assume that just because she's a woman means that all women will vote for her based on shared gender; that's pretty insulting to women if you ask me.\n\nwhat's equally astonishing to me is the performance of Trump with non-college educated white women.I saw an interview at a local Trump rally here with one lady who quite literally couldn't explain why, as a woman, she voted for him. She kept spitting out marketing slogans from the campaign but never actually said anything about his stance on issues. I was dumbfounded by the apparent lack of actual thought that went in to it for her.\n\n**edited for grammar. **", "The Guardian has a nerve given their partisan coverage of the election. They also turned on Wikileaks when its' truths became inconvenient for them, having previously held Wikileaks up as poster boy for transparency. It is the fault of publications like The Guardian that we have reached this point. They are too busy pushing their agenda, where all things happen because of racism, sexism, homophobia. A world in which the white male is a figure of scorn, or worse, hatred. ", "She was chasing that title more than any other policy this election.", "Yeah lmao this was the most selfish election ever. She somehow managed to be more narcissistic than Trump.", "No you are wrong. Term limits are so damn important. Allowing incumbents essentially stand for nothing while they continuously win office by only focusing on campaigning and not on real issues is SUCH A PROBLEM. Gerrymandering is still an issue but allowing two new candidates to run instead of having the election bias of an incumbent will change results dramatically. How can you not see that???", "No no no if such a person exists the DNC needs to keep their hands the fuck off him/her ", "She got it from her mother.", "Oh so NOW you guys want to talk about Wikileaks....", "Democrats do rig primaries.", "This will be her last political race in any aspect probably. I feel bad for her for the past 15 years or so she's been working towards the presidency, and she fell short on the very last day, in a way that nobody expected. Can't imagine how painful this is for her. ", "clinton foundation is useless without govt positions to sell", "They also didn't intend for so many people to be living there. It was supposed to be a neutral place of business only.", "I remember hearing a couple years ago... when it was apparent that Hillary would run... That the GOP could train a monkey to beat Hillary Clinton and it seems they really took that challenge to heart.  I don't like Hillary, I don't like Trump, but I can't help to feel that the dems did this to themselves.", "Free range female president", "The mistake if the left this time around was presuming the era of the voting white male was over. With minority turnouts and the assumption women would vote for Hillary because it's \"her time\" they thought they could finally smugly watch the right crumble. But it didn't work. They turned out in droves and the echo chamber only became apparent when the noise outside got too loud. They didn't try to win voters, they tried to shame opponents and it didn't work. They threw around facist and racist labels hard and thought that was all there was to it.", "Jail time for what? Do you folks even know what you're angry about?  You just gave the foreseeable future of our country to a hard right faction of the GOP because of innuendo and phantoms ", "I never want to hear 2 things ever again from Republicans:\n\n1) We are the party of family values\n\n2) Democrats rig elections.\n\n", "Actually she won the popular vote so the populace spoke. The electoral college killed the majority. This is something that is fundamentally wrong.", "Yeah. DNC REALLY fucked over Democrats (and the country) by doing that. They could have at least won the Senate but they just HAD to push HRC so hard. \n\nThe whole upper leadership should be thrown out immediately. ", "Don't forget to kiss net neutrality goodbye. Enjoy your metered package plan on the internet where you have to pay extra to see certain sites!", "Well kiss the ACA goodbye meaning millions are about to lose health insurance. Kiss any hope of the advancement of green energy goodbye and a reversal back to fossil fuels. That also means the Keystone Pipeline will pass. Expect the tax policy to pass which means that rich people will get richer while the poor will get peanuts back. Oh, and that also means the federal government will see a decrease in revenue just like GOP states which cut taxes have seen. That means we will see larger deficits and a need to slash budgets. Expect no effort to be made whatsoever to heal divisions in society and actually a backlash against any complaints by minorities of any sort. \n\nI seriously don't understand how people bought into the BS that he could just cancel trade policies and bring back manufacturing. He isn't gonna do that. If he does, all it will do is help a few people...maybe a few thousand....while harming over 300 million people with increased costs of goods either due to domestically produced goods which cost more or else due to tariffs which will be imposed on foreign products.\n\nIt is a shame she ends it all like this. She wasn't likable to most, but her policies were clearly better.", "This is literally an advert for the Guardian's premium service.", "Thought that was odd too. \"The election wasn't about me or one person\" and \"I'm with HER\" don't really mix.", "This is true.  While I'm vehemently apposed to 90% of Bernie's policies I always say that while I disagree with him I still respect him and that he's seems genuine.  Many of the other Trump voters I know or have spoken to feel the same way.  Hillary is just known to be liar and a puppet who will do whatever it takes to win so she can be in the history books.  Majority of Trump people would have been OK with Bernie.  Hard to hate someone who is genuine and feels authentic - we all like that people we get that kind of vibe from.", "Continuing with their theme of unprecedented obstructionism. ", "Like \"shit we can't create an 'accident' on Trump now because Pence is even crazier\" type of insurance?", "Dude no looking back 10 years about it. People were saying that when she won he primary.", "I'm just going to copy paste these responses I saw from other threads when ppl repeat this nonsense\n\n-----------------------------\n\nLet's put it this way:\n\nBernie won Michigan.\n\nBernie won Wisconsin.\n\nBernie even won Kansas and Nebraska and New Hampshire. *By a lot*.\n\nWhat states gave Trump the presidency?\n\nLet's also bring up the reason she won is the south... The same South that voted Republican. The same South that they claimed they are going to get because she is just so darn charming?\n\nI have no idea their thought process. The problem is the states she won (in the south outside of Florida)... were meaningless in the grand scheme because those are the states that the Republicans are going to win decisively when it comes to the electoral. \n\nWhat makes it worse is that the South basically crushed Sanders' momentum and made her seem stronger when in fact, she was just as weak as when she was losing or tying with Sanders", "Martha Stewart / Snoop Dogg 2020", "Nah. She was frequently like that at her campaign events and people close to her always describe her in those terms. She lost because 1) rust belt voters believe Donald Trump will bring industrial jobs back and 2) e-mails. ", "[deleted]  \n ^^^^^^^^^^^^^^^^0.4932 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/07722)", "The vice president is Mike Pence they didn't lose anything.", "Yeah honestly Trump was mature and well put together during his victory speech, but I think it's easy for him to seem that way when he's getting his way. It won't last. ", "In all honestly and this is speaking as a Trump supporter, where was this Hillary during the campaign? That was the most sincere and down to earth I've ever seen her. If she was somehow able to give off that authenticity throughout this election, I honestly think she would've won.", "1. He's too old.\n\n2.  It's too late.  Four years from now everything Obama did will be undone and then some.  Now was the time.  Not four years from now.\n\nThanks Hillary. ", "Let's not just focus on presidential races again next time. The house and Senate are just as important. ", "Welcome to 3 months ago r/politics ", "I mean yeah, there could be a 45 year old with the same ideas, but I don't think you can find someone with a history of principles and honesty such as Sanders. ", "The beginning of bipartisan teamwork? Let's hope. ", "He won more college educated white votes than Clinton. Not all of his supporters are uneducated unwashed, backwater buffoons.", "She was selected not elected. ", "Well many of the *new* /r/politics posters seem to have vanished... Like they got fired or something.", "You know at the end of a video game when you like defeat evil and your world is vanquished of bad things and you can explore the rest of the world and no enemies are around. It kinda feels like that.", "I think Michael Moore had it right when he described the element of society hidden from the pollsters the group that is both highly educated and also trollish. I know my support boiled down to exactly how he described it:\n\n&gt; Finally, do not discount the electorate’s ability to be mischievous or underestimate how any millions fancy themselves as closet anarchists once they draw the curtain and are all alone in the voting booth. It’s one of the few places left in society where there are no security cameras, no listening devices, no spouses, no kids, no boss, no cops, there’s not even a friggin’ time limit. You can take as long as you need in there and no one can make you do anything. You can push the button and vote a straight party line, or you can write in Mickey Mouse and Donald Duck. There are no rules. And because of that, and the anger that so many have toward a broken political system, millions are going to vote for Trump not because they agree with him, not because they like his bigotry or ego, but just because they can. Just because it will upset the apple cart and make mommy and daddy mad. \n", "Exactly. \"It's *her* turn.\"\n\nAnyone that watched the previous primaries with her vs. Obama should have seen that one coming.\n\nShe literally took the presidency from Bernie and gave it to Trump.", "Your comment is so depressing because it's so true :(", "Well now that Correct the Record is out of the picture...", "Whoa whoa, whoa... Who wants Mike Pence as president? Best to let this dog lie.\n\nEdit: *wants", "Interesting I'm no going to lie this made me feel better.", "If we're going to not vote for every democrat that supported Clinton that's a long list.", "Popular and Charismatic? Yes.\n\nGreat? Absolutely not. If Obama was a great president republicans wouldn't of swept literally everything. House Senate, governors and presidency. \n\nEdit: Oh and state legislators, can't forget that one.", "/r/politics seems to have changed overnight. Funny thing huh?", "Step 1. Control the House.\n\n\nWell shit.", "To be clear Sanders came out against it before Trump. On the other hand, happy both if these guys are on the same page, good on Trump.\n\nEdit: there seems to be a consensus that I was wrong here. I remembered Sanders calling on Obama to oppose this, and I remembered a few days later reading that Trump came out for it. Apparently he had already done so on the announcement day. Either way, if he means it and will fight to stop it, I'm happy either way. Apologies, sometimes we just comment and have no idea it will end up being upvoted significantly", "Bernie Sanders needs to find someone young and charismatic to carry his torch and run with it. I say this as a Clinton supporter in this election. \n\nClinton's approach has clearly failed. I may personally prefer Clinton's economics to Sanders' but I *vastly* prefer either of them to what we have now.\n\nSanders' philosophy is clearly the future of the party. Find people like him and push hard as soon as possible. ", "What else do you want to do? There is a certain real-politik aspect to all things Russia.\n\nRussia will have a Black Sea naval base and if the Ukraine doesn't like that they can give up Crimea.\n\nRussia will have puppet regimes in the Middle East and will not allow failed states to develop in close proximity to its borders.\n\nYou can not like how the game is played, but it will be played. Your choices are either all out war, or a peaceful division of spheres of influence. Personally I would rather let Russia have Crimea than have a bunch of US soldiers die for the democratic rights of a bunch of Ukrainians.\n\nYour concern should be that somehow this snowballs. Russia grabs Crimea, and once their control is consolidated the grab the rest of the Ukraine, and then its on to Romania, Slovakia, and Hungary. However I don't think that is a realistic concern. \n\nRussia doesn't have the economic power to sustain all those puppet states. We beat the USSR once without firing a shot, purely by having a better economy, they just couldn't afford their territorial ambitions, and that will happen again if they reach too far. Its just the ebb and flow of empires.", "Trump should consider tapping Bernie for a key role in his Administration as it would go a long way toward fixing what neoliberals broke in the country.", "&gt; Dude's foresight is practically in an entirely different league from basically everyone else.\n\nIt's as if he has a combination of experience honesty, and intelligence.  Real shame nobody thought to put a guy like that on the ticket.", "Great line from her concession speech: \n\n&gt; Our campaign was never about one person or even one election. It was about the country we love and building an America that is hopeful, inclusive, and big-hearted. \n\nyeah. okay. ", "I love Obama. Very much. Today more than ever.\n\nI very highly doubt that he'll go down as one of the greats. Historic of course, but not great.", "DWS isn't a fucking idiot she's a fucking cheater. Remember -- DWS was Clinton's campaign chief when she ran against Obama in 2008. \n\nShe lost then, so Clinton promised then-head of the DNC Tim Kaine (2009-2011) that he'd be her VP pick in exchange for him resigning from the DNC and allows DWS to take over in order to create a perfect environment for corrupted collusion.\n\nShe cheated, lied, and obfuscated the numbers for Clinton actively, and still wasn't able to steal a win in the general.\n\n\nNow, because of their incompetence at both cheating AND running a genuine campaign, Clinton lost and Trump won. Trump, a man who stated that global climate change, an issue of global prominence that will likely affect the way humans exist as a species on planet Earth for generations to come, was a fucking hoax, is now president of the country responsible for the most greenhouse gas emissions per capita.\n\nThe DNC cost the White House to the democrats, the democrats lost the senate, the house, and the SCOTUS.", "We can post about Wikileaks now?\n\n*looks around nervously*\n\nAre they gone?", "How about a woman like Tulsi Gabbard?", "Honestly this is one of the most upsetting things about the Trump presidency for me. After all the progress we made under Obama, here our next president and his VP come to snatch it away. It's so painful to think about..", "Yeah that's why she hired the lady who rigged the primary for her after she resigned in disgrace while telling the guy she ran against along with his massive block of voters that his positions wouldn't influence her policy. So big hearted! So inclusive!", "It really does seem different today", "Lmfao 24 hours ago you'd have been permabanned for saying this on /r/politics. ", "Yeah you really can't talk shit about Breitbart and Infowars and even fucking Alex Jones when you've spent the last months parading around every BS article from HuffPo and Vox and Slate, which I would argue are even worse than their conservative counterparts as far as bias goes. I mean, for fucks sake, The Daily Beast had a Pro-Hillary post on the front page at all times, and Chelsea Clinton is on their board of directors! ", "The irony of Guardian being part of (biased) attack base during elections, not differentiating themselves from  other Western Main Stream Media - now preaching and distancing themselves from the herd.\n\n", "They should just pay people to get on the internet to make fun of anyone who says they are not credible.", "I hope not. Political dynasties are why we're in this mess in the first place. ", "He didn't spend any money. He told his own party to fuck off whenever they criticized him. There are still elements of this I do not understand. ", "This is what many overlooked. Politics is a game. Trump knew that and he played it better then anyone in the country.", "Hillary tried that and it didn't work out so well.", "Add Puerto Rico and it's a nice even 52 like a deck of cards. ", "&gt; They did little to win them over.\n\n**LITTLE**?  They spat on us!  From the repeated calls of \"Sexist\" \"Misogynist\" and \"Bernie Bros\", to the nicest being \"Unreasonable Ideologues\" and \"Socialist Marxists\", they expected us to just up and forget that in the name of the lesser evil?\n\nFuck the DNC.\n\n", "But also you've been secretly using gameshark and they're still winning. That's the kicker. He beat a cheater. ", "I'm ignorant here but surely his \"appeasement\" attitude towards Russia isn't exactly safe?", "Plus b/c I'm a simpleminded person: 50 is such a nice round number... :p", "Damn that's 100% accurate", "People have been crying that since it's just now that Hillary lost her supporters aren't silencing the discussion.", "Holy shit Hillary is Mitt Romney. ", "&gt; She got straight up outworked for this.\n\nThis. For somebody who wanted the presidency so bad she wasn't willing to grind when it counted. She had literally every advantage.\n\nThe one thing Trump can say that she can't is that he worked his ass off down to the buzzer. And it made all the difference.", "He's going to be playing golf at his country clubs and deferring to his evil cabinet to make every important decision for the next 4 years; he won't age like all of the presidents we've had in the past.", "this is coming from r/politics?   After being so pro-clinton i un-subbed lmfao  \"fearless independent journalism\"  like downvoting any pro-trump posts right? \n\nlmfao\n\nEDIT:\n\nnot saying im pro trump or pro hillary, but \"independant fearless journalism\" should start with allowing pro's and cons to freely reach the front-page of your subreddit.  r/politics was very clearly biased towards hillary and the fact that literally a day afterwards its front-page that we need fearless morally upright journalistic integrity enrages me internally.  r/politics should have been a unbiased place to get political news and instead i found myself browsing r/all and then being forced to sift through all of the clearly biased subreddits such as r/the_donald or r/enoughtrumpspam to find any kind of information on either side.  Which for obvious reasons is not the best way to get news. From there I then had to deduce just how biased everything was and which facts were valid and which were made up propaganda bullshit.   Fearless independent journalism is dead in r/politics or at least its reputation has been soiled for me to the point i now see it was r/democrats. The mods should feel ashamed of themselves for their clear lack of proper journalistic integrity.  We expected to be informed and instead we got propaganda.    ", "And even then barely. Clinton only won 51% of the college-educated white woman vote that's practically a tie.", "You know what I really disliked about him he never went after Hillary once, even though she had lots of shit against her.  At what point do you become a funny Limbaugh.", "He was speaking about things that are still completely relevant today back in the 80s and 90s. ", "Sanders will work with anyone as long as its toward a good cause. He honestly wants to help people; say what you want about his policies but he's honestly maybe one of the few honest politicians left.", "Wikileaks suddenly was right overnight.", "Because thats what drew the voters. If he just stuck with the plan of the party he would have lost the primaries. Instead he did a hostile takeover of the party and people found him to be the breath of fresh air that is needed. He didn't need the party but the party needed him. And he won it for them. ", "BINGO.  And do you know who is primarily responsible for revealing this discrepancy?\n\nBarack Obama. He was TOO GOOD as sounding like the most inspiring progressive Democrat in all of his speeches. People, especially millennials, started figuring out the pattern right after the second election. Drones, no bankers ever prosecuted, whistleblowers being heavily prosecuted, we talked about how important it was to put a left-leaning judge on the Supreme Court and he nominates a pure Centrist with a straight face.\n\nIts like inadvertently finding out where the magician does his slight of hand when performing a magic trick. And the trick no longer impresses you.", "\"Ok we're going to be making an omelet so let me just grab this perfectly good egg a-\" \"STOP RIGHT THERE! WE WANT YOU TO USE THIS EGG!\" \"But that Egg is spoiling, shouldn't I just use the good o-\" \"WE NEED TO USE THIS EGG, IT'S THIS EGG'S TURN TO BE USED BEFORE IT'S TOO LATE!\" \"Bu-\" \"LALALALALA USING THIS EGG!\"", "according to vice whites from every demographic voted for trump, with the exception of college-educated women. ", "I doubt Sanders is interested in another run at the presidency but if someone in the Democratic party wants to be president in four years and has any brains at all, they'll ask him to be their advisor and they will *listen to his every word as if it were gospel*.", "I don't care how old he is I'd still vote for Bernie. I'm sure he'll find a good VP anyways.", "Gun control has the power to turn lots of people into single issue voters. Guns are part of American culture they don't cause people to do terrible violent things and no one is going to be able to convince gun owners they do. Bad people do bad things it doesn't matter if they use a gun or a pressure cooker, bad people are bad. If the left let up on the whole gun thing it would allow people to vote based on other issues rather than feeling they have to vote red to protect a constitutional right. ", "It is noticeable the lack of insta downvotes. Thankfully", "The concern is that Trump gets out of NATO agreements and Russia starts grabbing border states.", "Who said anything about millennials? This race was decided by working-class whites a group Bernie won over handily in the primaries. ", "We're free at last!", "They were always right. In their 10 year history not *one* of their leaks has been proven false. The propaganda and lies in here didn't permit this simple reality through, is all. Hell, Clinton defenders are *still* insisting that Wikileaks is a Russian front.", "Fucking sad when Fox News is *actually* fair and balanced compared to the rest of the media. Like, what? \n\nHas there always been a \"the liberal media\" like this and I'm just now noticing it?", "I have to admit I never thought I'd be reading a headline with \"sanders\" \"joins\" and \"trump\" in the same sentence. ", "Bernie got more millennial votes in the primary than all other candidates (DNC&amp;RNC) put together. They were his #1 demographic.\n\nBernie lost minority votes in the south - but Hillary lost the south in the general election anyway so that primary minority support had no effect in the general election. The biggest reason why is because Bernie almost didn't campaign in the south because he was short on time and low on name recognition - so he abandoned most of the southern states, especially the ones with closed primaries. If you look at blue and swing general election states Bernie did just as good with minorities as Clinton. He won the most diverse states like Hawaii and Alaska.\n\nBut one group that was always significantly pro-Bernie no matter the state were millennials.", "I was told I was quite the fool and conspiracy theorist.  Hmm seems not to be the case, after all.", "Interesting how her real and genuine supporters just stopped correcting the record all at once isn't it?", "... He did... All damn campaign. I heard him say it over and over, and over again ad nauseum.  He was literally screaming in the streets surrounded by tens of thousands of people that they should unite behind his cause because the other candidate was the establishment, and the people were sick and tired of it.\n\nEdit: I believe he said about 100 times that all the polls were showing him doing better in key states and with key demographics, and including all the head to head polls he was beating Trump by larger margins than Clinton.", "&gt; They stole it from him gave it to Clinton, who then lost.\n\nYou could cut out the middleman and just say they stole it from Bernie and handed it to Trump.", "So true. Trump won because he was an organic candidate. He came from a movement. Whether or not you agree with that movement doesn't matter he was inspiring people. \n\nHillary was chosen and therefore was an inorganic candidate. She didn't come from a movement. She was uninspiring. \n\nI'm surprised so many people are shocked at the outcome. ", "Do....do we still need CNN's permission before looking at them?   Somebody Facetime Cuomo I'm not sure what to do!", "Oh are we allowed to say good things about the email leaks and wikileaks now? A day ago you couldn't speak well of either, or Assange, without name calling and enough downvotes to drown in.", "So how do we vote out the Moderators for letting this sub go to a completely biased hell??", "I mean do you really think the Democrats would behave differently?", "His brother is in his 80's and holds political office in the UK. We'll never know how ol' Bernie will hold up over the next 4 years. The dude is in fantastic shape for his age. ", "To be fair the 'liberal media' hasn't shown its true face like the 'conservative media' already has for a while now. CNN, MSNBC among other agencies really fucking sold out hard though. They put all their eggs into this basket, and gambled on the fact that they would be vindicated once they helped Hillary win. \n\nI mean, look at what people think about Breitbart and Infowars today, nobody can deny that they are blatantly conservatively biased, but nobody can deny that they were closer to the truth than the mainstream media all along. I have a feeling that CNN wanted to feel what Breitbart is feeling today, but it backfired on them pretty badly. ", "Can we talk about how grooming people isn't going to work?\n\nObama - black dude from Illinois with Hussein in his name it was surprising how fast he grew from basically nothing\n\n\nSanders - white old Jewish dude from Vermont, it was surprising how fast he grew from nothing\n\nThe next person is not going to be someone you suspect. He/she will motivate quickly and passionately and fast and the DNC needs to let go of their groomed candidate when he/she comes.", "Don't forgot slate and buzzfeed lmao!! And don't forget this sub banned Wikileaks.org as a source... Let that sink in.", "This is an insightful comment I think it's more that the democrats compromised on Wall Street. That was the 'Original Sin' of this race, That's what Sanders  (And Warren) tapped into and what Clinton could never shake. ", "People were not supposed to be a permanent residents of DC. They were supposed to still be able to vote in their home state. However that isn't the case today. As of 2014, there were over 650,000 residents in D.C. that have absolutely 0 representation in Congress. ", "Why do you fall for this shit?  Don't categorize yourself into idiocy.  People like good politicians full stop.  Get your \"can't win because xyz\" bs out of here.  Unless that xyz is corruption.", "I wish I knew what she was feeling right this second. I really do ", "Without the house or senate that ain't happening.", "MY biggest fear is that he's going to put Trumpanomics into affect (Just Reaganomics 2.0) and we'll get the short term boom that comes with it and in 3 years, when things are just starting to crack, and corruption and greed is just starting to swing us back the other way, before anyone notices, we'll be electing a Democrat into the white house who will essentially be taking the wheel after the car has lost control, but just before it slams into the wall, and on the insurance claim, it's going to say \"Democrat ruins the economy\"\n\nWith Bush, we got the full 8 years, and the economy went to shit with him still at the helm. If he had only been there for 4, who knows where the blame would have fallen in the eyes of the people.", "His owners at Time Warner were financially supporting Clinton", "And at the end of the day they have no omelet and their dick is stuck in the ceiling fan.", "As a bisexual I'm genuinely scared of what's going to happen next. I fear this country is going to take several steps back in LGBT rights and it's scary that half of the country doesn't see that as an issue. ", "Well the idea behind that is that Bernie cared. If he fucked something up or maybe one of his policies wasn't so good he probably would've tried to fix it. He cared about America.", "You realize that the leaked emails prove Citibank decided on Obamas appointments right? Guess who chose Hillarys appointments.", "That part matters to me the most. Trump showed that he's willing to work with people by having multiple packed rallies everyday whereas Hillary was just sitting behind and expecting a win to be handed to her. She had the president vice-president, ex-presidents and FLOTUS campaigning on behalf of her which is pretty ridiculous considering that's what the nominee should be doing. Trump worked really hard in earning this and Hillary didn't.", "&gt; unless we run a campaign which generates excitement and momentum and which produces a huge voter turnout.\n\nAnd he generated those things yet the DNC shut him out. Such a shame. Arguably a bigger shame than Trump getting elected.", "Tusli Gabbard? She had the sense to step down from being a vice chair of the DNC in the middle of the shit show..", "Tulsi Gabbard 2020 please", "Exactly. It *wasn't* that time when they were all reporting positively on Clinton?\n\nIt wasn't that time when they were all reporting a landslide victory for her?\n\nIt wasn't that time when the same idiotic pundits spouted how whites en-masse voted Trump in...When exit polls say he lost some ground on the white vote compared to the prior election for Romney...meanwhile he *gained* black Latino, and Asian votes?\n\nNo. The last YEAR was the time for that kind of journalism and every major media outlet failed the people.\n\n\"No, no. Don't question us and how we *entirely misled you about what was happening*.\"\n\nThese same people shouting about fearless independent journalism are the same people that buried Bernie below a corporate sell-out. They are the same people that skewed polls instead of saying \"She's losing. We need your vote.\"\n\nNo. Fuck you mass media news outlets. You sold this presidency out for your own greed.\n\nAs far as I'm concerned, every major news outlet should shut down after the absolute trash jobs they've done. All they have for answers is fear mongering, doom saying, and tabloid bloggers pretending they know what they are doing.\n\n\n**Edit**: Thank you for the upvotes and responses! I wasn't expecting such a response in such a short time. I thought maybe I'd just be another voice awash; upset at the absolute mockery that journalism and politics have become through greed and pride.\n\n**Edit 2**: Thank you for the Reddit Gold, as well. I really do appreciate it. &lt;3", "How about we quit trying to elect the first ___ President and elect the most qualified regardless of race or gender?", "It looks like the regular users are back and the record correcting userbase has left.\n\nWe're back to hating Hillary and the DNC instead of jerking them off.", "I've been saying the same thing today. But look at the posts today. Not one peep about losing the Senate when Dems could have come away with 51 seats. I understand the sheudenfraude (sp?) but this site is proving the point that the left only cares about the president.\n\nedit: Fucking hell people I obviously misspelled Shwedenfrehueuede (thats why I put the sp? after).  30 people correcting me isn't helping me correctly spell Benecrepe Cumberbottom.", "That's the thing. In addition to having principles that were set in stone over decades of use he also had that history to point to, so skeptics of the system could see he wasn't part of it.\n\nHe had proof of having a conscience and not just being a player.\n\nEdit: Addled spelling.", "Highest approval ratings yet pissed off so many people that Americans gave all 3 branches of government to Republicans. ", "The record was in fact not corrected. ", "Not at all a Trump fan but Reddit is a fucking joke.", "Wikileaks is a racist Putin scheme run by that evil guy called 4chan.", "I am going to laugh so hard if this is the beginning of a powerful anti-corporatism Trump-Sanders coalition.  \nToday it's Telecom Tomorrow it's 'Glass-Steagall 2 : The Resteagalling'", "they wouldn't be stupid enough to repeal it *before* setting up a replacement right? \n\nThat would be like the time we closed a bunch of mental hospitals because they were inhuman but never built new ones so all those people just ended up on the streets", "Every indication I've seen is that Joe Biden did not want to run because he is still dealing with a substantial amount of grief. Do you have evidence to the contrary?", "I think all the Harambe votes made that pretty clear. \n\nEdit: https://www.reddit.com/r/politics/comments/5c2ig1/calls_grow_for_bernie_sanders_to_run_for/d9tip1m/", "And this right here is why democrats aren't in power anymore.  You can't simply call everyone who disagrees with Obama a racist.  People have legitimate criticisms and concerns about Obama regardless of his skin color.  Plenty of black people disagree with Obama, are they racists too? ", "He failed to protect his legacy without a legacy, he is just an important [footnote]. He has some military skirmishes that look pretty bad tied to a SoS that will be written of quite poorly.\n\nHarshly, his legacy is that he was the first black president. I say that sadly because indeed, I think he tried, he tried to reach across the aisle, and they killed him for it.\n\n*edit*: a word", "After taking an eight year break from holding the president accountable I hope their skills aren't too rusty. ", "Sanders' Living Brain In A Jar for president! ", "except /r/funny.  That is no joke. Nor funny.", "But the addition of Guam (53) would make us *indivisible* with liberty and justice...\n\n\n\nedit- I am aware there are actually 5 territories of the US (Guam American Samoa, Mariana Islands, Virgin Islands, Puerto Rico), I just added one for the very clear pun. Now let me wipe my tears from Trump being elected with this karma and stop writing 54", "Everything Obama did?  Not everything.  We'll still be fighting wars in the middle east. \n\nI'm not a trump supporter by any stretch but it's funny how many people think that Obama is some sort of saint. He made mandatory  not universal,  healthcare, bailed out the failing auto companies, has prosecuted a ton of whistleblowers who shed light on the government abuse of power...but yeah,  the guy's a regular Mother Theresa. \n\nI imagine that the Donald is gonna be a shit show, but people have such selective memories when it comes to Obama.", "Journalism died when people stopped paying for newspapers and expected journalists to write brilliant content for penny-shavings from ads on the web (oh wait, you have adblock, so they don't even get that).\n\nIf people want real journalism to come back, then go find the closest thing to whatever \"real, independent journalism\" means to you, and start paying for it (newspaper, magazine, digital, whatever). If you can pay $9/month for freakin' Netflix, then you can shell out some money for good newsprint.", "Let's try it out: \n\nI think Trump has a chance of being the moderate candidate that was attacked during the Republican primaries. \"America First\" is a reasonable policy as long as it involves engaging the rest of the world peacefully. Opposing illegal immigration is not racist. The fate of inner cities is one of America's biggest tests.\n\nNow we wait.", "&gt; The concern is that Trump gets out of NATO agreements and Russia starts grabbing border states.\n\nTrump never said or alluded to wanting to get out of NATO.\n\nWhat he did say is that NATO members need to pay their fair share if the US is going to play World Police.  No reason the USA should shoulder the financial burden to prop-up the security of countries like Germany when they can afford to either raise a competent army or reimburse the USA for the expense. ", "Trump's Supreme Court will make that moot.  Prepare for a golden age of graft.", "[deleted]  \n ^^^^^^^^^^^^^^^^0.1006 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/81481)", "\"No taxation without representation!\" (unless it's the other party that gets it)", "I like her but sadly, I feel her religion (Hinduism) wouldn't turn red states blue. There's that fear of the unknown mentality.", "Michael was one of the few who saw the writing on the wall that this election would turn out this way.", "Sure  but he'd be hitting 80..", "You mean how Trump is giving our treasury department to Goldman Sachs and giving the interior department to an oil baron? And Newt Gingritch as secretary of state. So anti-establishment LMAO. ", "The rest of the world hates America for our interventionist policy and that same policy has made Americans a second priority in America. We need to take care of the homefront, not worry about the middle east, ESPECIALLY when our interventionist policies are the reason why the middle east is fucked ", "Spending As A Percent Of GDP\n-----\n\n\n\nCountry | %GDP\n---|---\nUSA | 3.61\nGreece | 2.38\nUK | 2.21\nEstonia | 2.16\nPoland | 2\nFrance | 1.78\nTurkey | 1.56\nGermany | 1.19\nItaly | 1.1\nCanada | .99\n\n\n-------\n\nWould certainly say that France Turkey, Germany, Italy, and Canada are certainly not pulling 'their fair share'.  NATO guidelines are a minimum of 2%.\n\nAgain, if Germany wants the US to play world police, they can certainly afford to offset the cost.", "Clinton took only 51% of the Union vote.  This is what destroyed her in Michigan Wisconsin, and Pennsylvania where Union support still clings to life.  She thought she had this demographic locked down but they largely abandoned her because she (and the Democratic party) largely abandoned them.\n\nThe Democratic party either needs to get back to its roots of supporting the workers or step down so that another party can rise.  \n\nAll the corporate money in the world couldn't save this extremely flawed candidate.", "They're not going to replace it. ", "Well if it helps any the DNC knew Clinton was a damaged candidate, they knew Bernie had more enthusiastic support and a more antiestablishment approach, they knew it was an anti establishment year.  And they decided we would all get Clinton and like it", "I hope Sanders can talk to Trump about Climate Change and find common ground on other issues.", "Hopefully \"Maybe I should retire from politics...\"", "Bernie is a not-particularly-religious Jew. He did pretty decently.", "I'm trying to look on the bright side I really am. But there is just something so unacceptable about the campaign that Trump ran and all the fears he played on. \n\nWe, as a country, selected a candidate who has called Mexican immigrants rapists and criminals, who has bragged about using his fame and wealth to force himself onto women, who said women should face 'some sort of punishment' for getting abortions, who advocated for killing of terrorists' families, and who the NYT reported last week was musing of creating a super PAC specifically made for 'vengeance' against his enemies after the election. ~~*[striking NYT because I thought it was the NYT but now i can't find a source, but I am certain I saw an article on this recently, if anyone can confirm that'd be great]*~~ [Found the source article](http://www.nytimes.com/2016/11/07/us/politics/donald-trump-presidential-race.html), edited comment to more accurately reflect what was in it.\n\nI get it, he 'played to win' and Clinton also has some unsavory marks on her from the primaries to the general...but fuck hell I just can't get behind this guy.\n\nI'm getting flak for not talking more about his policies, so [I'll just link to this comment from another user](https://www.reddit.com/r/politics/comments/53zunz/trumps_economic_plan_costs_265_times_more_than/d7xq8mp/) a month ago because it does a much better job of explaining why they suck and it has sources.", "That would be fucking bliss.... aaaaand highly unlikely seeing as Trump's going to be in a sea of red", "Not only that but like the rest of her campaign, it was full of shit and half-assed half truths.  \"Go home, we are still counting votes.\" 20 minutes later: \"It's over, Hillary called Trump.\"\n\nWhat a joke.  This wasn't Trump winning - this was flat out a vote against Hillary and coastal limousine liberalism.\n", "can..can we say it now?  ", "No one is getting paid to censor you so the only way it'll happen is out of spite now.", "The dog caught the car. Did you think he had a plan?", "^\n\nYeah if his son hadn't passed he said pretty much he would have run. \n\nHe stated his heart wasn't in it, you can't lead the free world if you're heart and head aren't in it. ", "Nah. Now that we have been given rights we will fight for them. Like, actually fight. I will not lay down and allow conservative evangelical fucks to dictate what I can and cannot do.", "Please address him by his full name: \"Mittens\"\n", "Yeah the checks stopped rolling in after last night", "If you're mad at anyone it should be Hillary, DWS, and the DNC.  They are far more corrupt and response for a Trump presidency than Trump himself. ", "Trump beat Clinton with white women by 10%", "And so it begins I don't know how I'll afford my wife's medication now.... ", "i hope so. I hope Obama feels the sting (I voted for and like Obama but come on the guy has got to know he endorsed so the wrong candidate), I hope the Clinton's hang it up for good and leave us a lone and never, ever run again and I hope anyone that was responsible for any of the DNC stuff is thrown out like the garbage they pretended to protect us against and I hope the democratic and republican parties are themselves in enough disarray as platform's to *force* them to change. ", "Republicans believe that the replacement already exists in the private market.  So prepare to have your patient rights taken away and pay thousands more per plan.", "He was on the front lines in 2004 watching all his best efforts melt away as Bush won a second term. He's seen this all before.", "Uh oh you said his name. He'll hack your dreams tonight with spooky pepes.", "It's amazing isn't it.  I honestly didn't know if the power still rested with the people but today I know that it does.", "Was losing the election part of your plan?", "I think it shows when she sent Podesta last night instead of her to address her supporters.  They wanted to hear from her they fought and voted for her, not Podesta.", "How many presidents have had to produce their birth certificate twice? The republicans treated Obama with unprecedented levels of obstructionism and disrespect and if you think his race didn't play into that you're deluded. One of Trump's three newspaper endorsements was from the KKK, it's time for America to admit that it has a racism problem. ", "In the end people do thier jobs so they don't starve and die. You can't eat truth, and justice does not keep rain off your head. It sucks, but this isn't exactly a decision that reporters and journalists get to make for themselves.\n\nCertainly, some or even most journalists don't have this threat behind them, but it exists.\n\nIf your boss says \"you're writing pro-Clintion articles or you're losing your only source of income\" then what even do you do? If you comply, you're part of the problem. If you don't, the news organization can just.. *not* use your article. So now you're out of a job and also the truth still isn't out there.", "He'll be doing all the work anyway might as well have to eat the blame.", "There would be a lot more voters out too.\n\nI know lots of people who don't bother because they live in a solid red/blue state.", "And?\n\nWe've done this before. We've sent thousands of young American men to die in Vietnam and Korea in order to contain the threat of communism. To what end? The whole thing collapsed without a shot some 40 odd years later.\n\nDo I think that Trump will be good for Latvia/Belarus/Ukraine? No. Do I really care? No. Is that because I am a selfish nationalistic fuck-head who cares more about the money spent on the bridges in his city and the public schools his children will attend? Abso-fucking-lutely.\n\nIf we can do it peacefully without violence, fine. But Russia is an empire and empires have satellite states. Always have, always will. No sense denying the Russians control over their immediate border nations.", "And yet no one NOT ONE FUCKING CLINTON SUPPORTER, will recognize this. They will give excuses and excuses. They wont own up to the fact that they backed the weaker candidate. This loss is placed squarely on ANYONE who supported clinton. From the primary voters to senior leadership in the dnc.\n\nYou all backed the wrong fucking horse. Own it.", "There was something like 11000.", "He is filling his cabinet with climate change deniers and one of his stated goals is to dismantle the EPA.  A Trump presidency is literally bad for this planet.  \n\nNow to wait for up/down votes.", "Mike Pence is the perfect assasination protection.", "I'm genuinely scared for my parents. My father just started receiving some of his heart meds for free under Obamacare. I have no idea what they'll do if he has to start paying hundreds of dollars every month for them. \n\nThis is heartbreaking. ", "Exactly my message to any Hillary supporter. They wanted Trump the minute that they accepted and were OKAY with the DNC collaborating HRC to keep Bernie off the ticket. This doesn't rub Sander's followers those who were some of the more educated democrats, the right way. ", "&gt; Our campaign was never about one person or even one election.\n\nYour logo was a giant H and your slogan was \"I'm with her\"\n\nk", "Yep.\n\nSo instead, Hillary and her cronies gamed the system, chased off Bernie and spent ridiculous amounts of money (money that didn't go to downballot dems who needed it)\n\nAll so that she could end her 35 year-long career of public service by conceding to a \"pussy-grabbing\" Birther.\n\nThey're going to have to gut the DNC like a fish and start over from scratch if they ever hope raise themselves out of the crater that Team Hillary left for them.", "Snowden picked a single journalist at the Guardian because he was not in the USA.\n\nHardly the same as \"Guardian's cool\"", "We all know clinton would be fighting tooth and nail for the cable companies.", "Republicans treated Bill Clinton in the same disrespectful manner throughout both terms in office even though he was white.  Take the chip off your shoulder and stop assuming that the obstruction Obama faced was solely a result of his skin color.  Were there tinges of racism behind what Obama faced?  Yes but not to the degree you're assuming there.", "Good point.  The more I think about this thing played out the more I'm beginning to wonder if Trump isn't some kind of master tactician. \n\nEdit: Has anyone that's actually read \"The Art of The Deal\" weigh in?", "&gt; we urge our leaders to govern without deference to religion\n\nthat's *definitely* not going to swing any red states.", "True story.\n\nI was embroiled in a really ugly custody case from my first marriage. My ex wife was withholding visitation with my oldest son. He was skipping school and school officials were reaching out to me with serious concerns about his decisions. I was also monitoring his Facebook and saw some deeply concerning things. I'm not going to air my dirty laundry. We've reconciled and he's a new man today.\n\nI just want to talk about Senator Merkley. \n\nNow I remarried. Unbeknownst to me, my wife reached out to - basically every politician. Governor Kitzhaber. Rep Blumaneur. Senators Wyden and Merkley. Plus others. She wrote them all a personalized letter articulating her concerns for her stepson.\n\nEveryone ignored the letter. With the exception of one man. Jeff Merkley. He had an assistant call my wife. He left her a voice mail. And  second. She called back and was immediately routed to the associate, like the call staff was expecting her call.\n\nThe associate personally engaged the Governors Advocacy Office and when the Governors Advocacy Office stalled, Senator Merkley personally called them to urge an investigation into my concerns.\n\nJeff Merkley played a critical role in turning my son's life around.\n\nThis man is engaged with his constituents. When literally every other politician ignored us, Merkley stepped up.\n\nI can't stress enough what a great Senator he is.", "I'm a rust belt liberal and couldn't agree more with this. I voted for her to prevent Trump, but the Democrats have gone very limousine liberal. If you look at threads in this sub and also the more serious political discussions threads, it's easy to find people actively mocking people in this country's interior for not simply moving or getting a different job.\n\nWe can't all be financiers, though, and it's not easy to just pull roots and move to an area where the cost of living is enormously higher than the paychecks you've been earning.\n\nThere are plenty of people in the rust belt that fully agree with progressive policy, but until the Democrats recognize that the trade deals Democrats have backed have done enormous damage to everyday people to the benefit of Wall Street, they're not going to gain those votes.", "Sanders was not an outsider he's been in office since '91. A lot of people might not have known a lot about him but he was far from an outsider, I'd heard of him. I didn't hear of Obama or his speech in '04 until he started campaigning in '08.\n\nFunnily enough, if Hillary was ever going to win, that was her year. I was going to vote for her before Obama came out of left field.", "The irony is that the false record was the mountain of polls hit pieces, and bullshit articles twisting a narrative that Trump's support was a small minority.\n\nThat record has now been corrected.", "You're OK with Russia taking border countries back even if the border countries want nothing to do with Russia?\n\nYou're OK with Russia inciting civil war in these border countries in order to destabilize them and hope for what Russians have become masters at doing ensuring persistent \"frozen conflicts.\"?\n\nYou're OK with border countries having their identity ripped from them just to appease Russia as to avoid a war?\n\nYou're OK with all this, why? \n\nAre you, deep down, afraid of Putin? \n\nAre you so disconnected from the rest of the World that you think these things won't impact you?\n\nWhat's the use of spending money domestically when the rest of the fucking world is burning?", "It's hilarious that they call for this now. MSM is a joke and everyone knows it. Times are changing.", "I couldn't agree more.  I just look at it from the perspective of having eight years of stuff you fought for obstructed and opposed every step of the way, fighting for every inch... torn down, probably by the end of January 2017.\n\nWell, except for the stuff they *like*.  Like drone strikes.\n\nI think Obama, in private, would have some pretty choice words for Hillary.\n\n**Edit:** Consider this: his biggest mistake was making her his Secretary of State.  No SoS, no Emails and no Benghazi.  No Emails or Benghazi tarnishing her rep (deserved or otherwise) and she might have scraped through for the presidency - or maybe not, because I really don't think this was about some stupid emails.  But it sure contributed to the picture of a corrupt establishment politician.", "The primary was rigged is all over the front page now. TOP FUCKING KEK. ", "The irrelevance of southern black support for Hillary was a fear of mine since the primaries.  She was propelled to victory over Sanders on the back of lopsided southern wins that would be guaranteed red in the general.  It seemed so obvious at the time but we all pressed on and assumed somebody had their act together.  Guess not.", "The same newspaper that says if Clinton doesn't win it's misogyny.  Go fuck off.", "If he doesn't run his endorsement will mean a hell of a lot. ", "Most people don't even know what it means to impeach a President. The common thought is that it means to throw them out of office. ", "This was clearly the year of the anti-establishment candidate. One party supported that the other didn't. \n\nI honestly don't understand any of this. ", "Trump opposed it the day it was announced.", "It's more like Democrats for Big Business and Republicans pretend to be for blue collar while really also for Big Business", "So the reason journalists can't be neutral and just do their jobs is because they don't make enough money?\n\nHow much does it cost to just write the truth and keep political leanings out of it?  Hold all politicians to the same standard whether you like their policies or personality or not.", "It reminds me of that scene from The Dark Knight.\n\n\"Well we all know how much you love to say 'I told you so'\"\n\n\"On that day, Master Wayne, even I won't want to.\"\n\nAs a Sanders supporter I feel like Alfred today. ", "Yes. I've been thinking this morning what issues are actually worth fighting for? As in, real fighting? This is one of those issues.\nEDIT: I mean gay rights (and reproductive rights too btw) in general, not this specific article. Chill, folks.", "She was probably devastated. She's been grasping at being President for decades and she had the full assurance of the media and polls suggesting that her victory was all-but guaranteed. It was such a certain victory that she had turned focus to attacking down-ballot republicans.\n\nImagine being a hair's breadth away from your ultimate life goal, only to have it snatched from you by an orange Loony Tune who memed his way into the highest office in the world. She's been in politics and public service longer than I've been around, and Trump -- having no experience -- embarrassed her and the Democrats she represents before the world.\n\nShe probably wasn't in any condition to appear on live television. It impresses me that she was composed and smiling this morning. I wasn't.", "Warren and Sanders are the leaders.\n\nThe direction is workers rights progressive values, and getting the FUCKING MONEY OUT OF POLITICS\n\nEdit: For the love of all holy Christ. The fact that Trump spent less money on his campaign doesn't imply or say ANYTHING about the special interest money buying off, not only the president, but the congressional seats.\n\nRemember Cruz? Remember when he bowed down to Trump? Why? THE DONORS\n\nWho did Trump turn to when he needed money for the RNC? THE MERCERS\n\nMoney in politics didn't magically get solved today what the fuck", "What - no blatant heavy-handed censorship? No special treatment of sensitive subjects by paid partisan shills?? Am I really in r/politics???\n\n*cognitive dissonance intensifies*\n\nI… I can’t handle this sub being uncensored… it’s just been too long…", "Deep? They were running it.", "of course he doesn't. he fucking *knows* he would have had a better shot against Trump. Trump didn't win because of policy he won because he's not the status quo and neither was Bernie and people fucking knew that. \n\nIf people want anti establishment as a whole; let's put a *good* anti establishment against the more *potentially* dangerous one. Instead let us not force establishment up against anti establishment in a time when it's very, very clear that people want to do *away* with the political corruption or at the very least not vote for the damn poster child of the whole shit show. ", "Bernie predicted the outcome in August of 2015:\n\n&gt;Let me be very clear. In my view Democrats will not retain the White House, will not regain the Senate, will not gain the House and will not be successful in dozens of governor’s races unless we run a campaign which generates excitement and momentum and which produces a huge voter turnout.\n\n&gt;We need a political movement which is prepared to take on the billionaire class and create a government which represents all Americans, and not just corporate America and wealthy campaign donors.\n\n&gt;In other words, we need a movement which takes on the economic and political establishment, not one which is part of it.\"\n\nWhen will the DNC start listening?", "This is the worst story of the election.\n\nClimate Change might kill us all. Which is hyperbole and probably won't happen and even if it doesn't. Our civilization is going to be fundamentally disrupted. America, the supposed leader of the free world, will spend 4 years minimum of crunch time fucking around and going in the wrong direction.", "\"But Coal is my lifestyle! Fuck the planet and anyone living in low-lying coastal areas!\"\n\nThis is the part that infuriates me the absolute most. More than the social issues more than his man-baby vindictiveness, more than the trickle-down economics that won't work (again). It's this unswerving insistence of that constituency that man-made climate change doesn't exist because the regulations would prevent quarterly profits from being as huge as they otherwise would be, or because the idea that coal is polluting garbage is *insulting to their heritage*.\n\nFUCK you. Short-sighted egotistical greedy bastards.", "We lost the Senate BECAUSE of Hillary... Many Senators won more than Hillary in there states but it wasn't enough to overcome the Trump vote. If she would've done better we'd have 51/52 seats.", "Black guy here....don't really feel any different than I did yesterday...or last week.", "Where's the part where we hold the admins accountable for cooperating with an illegally run propaganda campaign that threatened to undermine our democratic process?", "just wait for his supreme court picks", "\"All Republicans do is fear monger!\"", "[deleted]  \n ^^^^^^^^^^^^^^^^0.8394 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/03376)", "Or Clinton could have yknow, not run a private email server at home to avoid FOIA requests that gets highly scrutinized.  There's always that option.\n\nOr at the very least, if you're going to do it, be as good as the Republicans at brazenly getting away with it, like the oft-cited Powell and Cheney.", "&gt;unless we run a campaign which generates excitement and momentum\n\nThis seems like such common sense. I've never seen anybody run for office with such an unexciting uninspiring \"vision\" as with HRC. It was like the Seinfeld strategy - everybody is doing something we'll do NOTHING! ", "Not only does this suck in general but we will lose any ground gained against the campaign of misinformation waged on climate change with 4 years of deniers in top positions.\n\nAs someone who's career deals heavily with these impacts, getting policy and funding to fight the side effects of climate change is about to get harder. I guess the only bright side is job security?", "couldnt have said it better my self. An important thing to remind people is the media didnt get it \"wrong\" they explicitly LIED", "But it's her turn.", "\"Hi I am Wolf Blitzer. Fearless independent journalist working for the independent and completely independent non-partisan CNN!\"", "Am minority.  Am not overwhelmed with terror.\n\nAm overwhelmed with clickbait.", "if you're anyone in america the terror is real. i'm a white male and i'm terrified.", "Yes.\n\nActively colluding with the media to promote anti-bernie articles?\n\nScheduling debates so as to limit the exposure of unknown candidates like Bernie?\n\nFeeding debate questions to the campaign ahead of time?\n\nGiving Hillary 400 delegates before a single vote was even cast?\n\nYes I think these things had an impact on Bernie's support.", "Shares Bernie's political values overwhelmingly popular when she ran for office, and is a veteran. Probably the best choice.", "Brown fella here. Terrified of how much more racial prejudice I'll have to deal with because it's more acceptable now. Not like it hasn't gotten worse since he announced his candidacy. ", "I have an inkling running for office in America as a Jew is much different than running as a Hindu. ", "WE did it. The Ministry of Truth is gone. WE can talk like human beings to each other without fear of fake people arguing for no point. r/Politics... we missed you.  ", "That fucking piece of shit", "[\"Meanwhile watch me drink champaign and dance at the DNC nominating party.\"](https://youtu.be/MjgdU3_RNK8)\n\nWhat a fucking joke.", "Sanders needs to get an apprentice and start showing them around now. Endorse them hard as his successor for 2020. Maybe we have some kind of reality show to find this \"apprentice\". And hell the way things are going we would even accept a \"celebrity apprentice\".", "That's what I don't understand. I watched MSM religiously last night (CNN NBC, MSNBC, FOX). Instead of honestly presenting the statistics from exit polls, the discussion was \"Why didn't minorities turn out for Clinton?\" and \"Non College educated whites overwhelming voted for Trump!\"\n\nThese are not the most interesting statistics from exit polls. But to them, these are the most interesting/important stats in the narrative they've created themselves. \n\nA better discussion would be, \"Why did Asians/Hispanics/Others demographic turnout in the 30% to 40% range for Trump when we demonized him nonstop?\" \n\nThere's a cultural divide in America caused by our media. They've circlejerked themselves over identity politics so long, they now ignore statistics that say the opposite of what they've been spouting for the last 20 years. It's infuriating. \n\nEdit: here are the stats. Please think about what they mean critically. Stop letting talking heads fill your brain with nonsense. \n\nhttp://www.nytimes.com/interactive/2016/11/08/us/politics/election-exit-polls.html", "PSA: The Paris Accord cannot be revoked by any member country for 4 years which means Trump cannot exit out of it within that time frame.\n\nJust a note of positivity in an otherwise steaming pile of shit that today is.", "Maybe. What loyalty does he have to the GOP establishment that worked so hard to disavow and screw him over?", "Hah yeah, right. You are looking at the next Attorney General.", "That's one of them moslems right? \n\n- the south\n\n", "Because a candidate who has racist policies and many racist supporters has been elected and that endorses some of the racist demographic's prejudiced beliefs? \n\nIt's not rocket science. ", "this is over dramatic bs that got trump elected lol ", "I blame the media for 80% of their fears", "That fucking piece of shit.", "I'd still support him as long as his VP matches him. \n\n\n\nI wish a long and healthy life for Mr Trump god save us if Pence gets the oval office ", "\"I'm shitting things I didn't eat into pants I'm not wearing.\"\n\n~Patton Oswalt", "Oh noooooo we better not at least act like he's going to be president let's just continue a complete mindless hate rampage. ", "Really Slate? Now it's okay to say bad things about the DNC or Hillary? After after an unrelenting Pravda push from you The Daily Beast, HuffPo, Salon and the rest of your ilk for the last six months. After dissidents were treated as badly or worse than how you treated Trump supporters. After the assholes that took over this sub silenced any criticism of Hillary or the DNC like they were the fucking KGB. \n\n\nThis are two of the first stories Slate ran after Trump;\n\n\nhttp://www.slate.com/blogs/xx_factor/2016/11/09/white_women_sold_out_the_sisterhood_and_the_world_by_voting_for_trump.html\n\nhttp://www.slate.com/articles/news_and_politics/politics/2016/11/white_won.html\n\n\nAgain, back to the poisonous well. Nothing but race, gender and identity politics above all else. Those white people who voted for Trump in MI WI and PA, the same ones who voted for a old Jewish guy in the primaries, were they racist then? When they enthusiastically voted for and elected a black president in 2008 and 2012 were they racist then? Why didn't they just vote for the white guy if they were? \n\n\nOr maybe it wasn't about race. Maybe those people are not racist. Maybe they would have voted left if you had not ran a candidate who was the literal personification of big banks, corporations, and greed. Maybe they would have voted left if the entire Democratic party had not been co-opted by big business and became the party of the same forces that destroyed their families and lives over the last two decades; globalism, downsizing, outsourcing, trade deals, and massive amounts of imported low-skilled labor. Maybe they would have voted left if you hadn't been in bed with the people who have been attacking them. Instead you crawled to those forces and begged for scraps, hoping you would get treated slightly better than the rest of America. Indeed, the rest of the world. \n\n\nWhen they say drain the swamp I hope its an opportunity for the left in America to do it at the same time. Slate, Salon, HuffPo, The Daily Beast, and all the rest of their kind. Don't read their articles, don't give them clicks, don't feed the beast. \n\n", "Those that oppose \"Obamacare\" so god damn much have no fucking clue what's ahead...\n\n●Pre-existing conditions\n\n●Getting dropped due to sickness\n\n●Getting dropped due to an error on the application \n\n●Children under parent's plan (until age 26)\n\n●Unjustified increases in premium \n\n●Medicare expansion\n\n●Lifetime maximum benefits\n\n●Free preventive care - 'Wellness Visits'\n\n●Immunizations \n\n●Gender discrimination*\n\n*Prior to the implementation of the ACA if you wanted maternity coverage there would be a significant increase in the premiums for that coverage. My wife and I were quoted a plan (with maternity coverage) that was 3x more than our regular coverage. It was absurd. There was a 12 month waiting period too!\n\n\n***Kiss all that goodbye!***\n\n**Prepare your ass cause we're all gonna get fucked**\n\nEdit: adding more ", "They were too scared to even run him as the VP.\n\nThanks for Virginia Tim Kaine", "It begins.", "But the Trumpsters tell me he's liberal.", "Not only did they lie they are trying to further divide us every chance they get.", "Nation wide stop and frisk doesn't faze you at all? Okay.", "There aren't 50+ organized paid shills all with multiple accounts vote rigging and astroturfing anymore. ", "People are getting way too Trump apologetic today. He wants to eliminate the EPA politically climate change doesn't exist anymore.", "Hillary was wrong but that does not exculpate anyone else of wrongdoing. Comey should still be held accountable for his questionable decision-making which was condemned by both sides of the aisle.", "You mods are terrible fuckin people. Worthless.", "&gt;NOT ONE FUCKING CLINTON SUPPORTER will recognize this.\n\nI recognize it. We fucked up.\n\nTo be fair, we had a reasonable argument - Sanders' positive was only so high because he hadn't been subjected to Republican oppo, and it would drop if he won the nomination, and a self proclaimed socialist would have a hard time in the general.\n\nTurns out we were wrong. So very wrong. I wish Sanders had been the nominee. I'm sorry.", "We were so blind by our ego and pityness that we forgot that the planet counted on us to at least try to save him.\n\nThis isn't something to cheer for even if you voted for him this is a very troubling sign of where things are going to be in the near future.\n\nY'all can blame or complain about Hillary , maybe that it should had been Bernie or Biden, but at her worst she wasn't Trump. Some of you chose ego over country, some of you just have hate in your heart and some of you feel so let down that you didnt even voted or cast a vote against the elites. We must fight to recover your trust, and to just fight those who have hate.", "Blame Hillary. Not Comey. Its time to grow up people. ", "what's more Believable\n\n1. Trump and his supporters are all racist women haters who want to bomb every middle eastern country and start world war 3\n\n2. the media LIED to you, just like when you knew while Bernie was running", "More like they gerrymander even more pack the supreme court and keep the house for a generation. ", "Holy shit. The transition r/politics is taking is hysterical. ", "And wait!\n\nThe media was fucking in bed with the DNC and team Clinton!\n\nAnd what happened when the interm-DNC chair (who replaced the old DNC chair after she was caught colluding with Hillary!) was caught feeding questions to Hillary?  Who knows.  She didn't get fired which is what would have happened in any organization that had even a modicum of self-respect.  ", "&gt; who said women should face 'some sort of punishment' for getting abortions\n\nHold the phone this is one of the things I will always argue when I see it. The context of that statement was an interview with Chris Matthews and the question was \"In the scenario where abortion was illegal, would you as a president punish women who perform it?\". This question is a standard trick question. Why? Because either response he gave, it could be spun against him. He answers yes, and it's quoted just the way you framed it. He says \"no\" and he'd be bashed for wanting to be a president who doesn't apply current existing laws according to his tastes. Trump's mistake was not recognizing the fact that the question was a trap and falling into it, not the answer.", "Somebody was (seemingly) nasty and condescending to me earlier and it turned out they were being sarcastic.  I was so used to being condescended to in here that I didn't realize it.", "Stop with this fearmongering bullshit.", "So would Sanders's agnosticism. Diverse religious beliefs should be assets against the system not hindrances. \n\nPpl need to get over a candidate's religion, especially in 2020. \n\nPlus she has a military background. \n\nI'd rather our 1st female president be one with principles and ethics. \n\nTulsi 2020\n\nEdit: Sanders is an agnostic, not an atheist. \nhttps://www.washingtonpost.com/politics/bernie-sanders-finally-answers-the-god-question/2016/01/26/83429390-bfb0-11e5-bcda-62a36b394160_story.html", "yep... complete horse shit. it's a fucking joke", "And that's the thing:  I could see voting for a guy who would by 79 at the end of his term but he'd be 79 at his inauguration.  Although Sanders' integrity and willingness to work with a variety of partners is invaluable, he'd be statistically very likely to die in office.  There's probably going to be a better choice.", "Cheney was fantastic at it.  How many people can shoot their friend in the face with birdshot and get an apology *from the guy who got shot*?", "I like the guy a lot, but he did a dreadful job of managing his relationship with the legislative branch, however racist and obstructionist they were.  He was a legendarily poor negotiator on important legislation.\n\nRemember:  Obama had both houses for the first two years of his presidency.  He easily could have rolled back the filibuster rules with a simple majority vote, and pushed through single-payer.\n\nEvery report is that Obama absolutely despises the sometimes grubby personal work of engaging individual Congress members.  He made next to no effort to sup &amp;amp; drink with GOP members at the White House, or get to know them or their district needs personally.  It's a different kind of retail politics, but it's effective at the margins.\n\nBeing a large-scale orator and cerebral is great, but the Washington machinery doesn't respond to that.\n\nObama will be remembered as a caretaker president, who didn't break anything, but left no significant imprint on the country, beyond giving African-Americans hope.", "And still a better choice then the two we had this election.", "I try not to make this point too often for fear of being an alarmist. But we need alarms raised.\n\nBut our civilization is on the verge of collapsing. As a species we might not be wiped out but a MASSIVE swathe of our agricultural base is going to become unusable, we will lose a ton of land to rising oceans. And changing weather patterns are going to fuck over all sorts of things. \n\nA two degrees global temperature increase becomes a lot more scary when you remember the specific heat capacity of water. +2 degrees globally means +7~ on land in some places.\n\nClimate change is the most imminent threat to every one of us. America is not going to be a global leader in dealing and ameliorating with this change for a bare minimum of four years.\n\nDo we have four years to spare? No we do not. Climate Change is already here and the time to act was yesterday.\n\n", "Somewhere in my wildest imagination I dream of a scenario where Trump wakes up this morning stunned and sober at the realization that he actually somehow won.  He has a brief moment of clarity about how poisonous and divisive the past few months have been and he decides then and there to extend an olive branch to progressives by offering Sanders a prominent position in his administration.", "Haha /u/iwingletotheleft is so on the money it hurts. The media sold itself out to the left (mainly) and right in this country. Now they want to reinvent themselves as the institution to keep our government honest? \n\nOne positive thing you can say about this election is that it showed America its true face. The lunacy of the right. The arrogance of the left. The selling out of our media. It's all laid bare for the world to see.", "&gt;Or at the very least if you're going to do it, be as good as the Republicans at brazenly getting away with it, like the oft-cited Powell and Cheney.\n\nRules aren't the same for both sides, unfortunately.", "Minority voter here. Feeling pretty damn good today. ", "Trump or Clinton the media hasn't been on OUR side for a long time now. Our media has all been sold out, instead of being a fair and impartial reporter of events or a fearless leader in discovering truth.\n\nWith Wikileaks, why do we even need your tripe anymore?", "Sadly I think that will be Rudy", "I've read the Art of the Deal as have much of /r/The_Donald.\n\nThis entire thing was almost entirely detailed in the book. His campaign and subsequent win followed his philosophy to a fucking tee. Say inflammatory bullshit to reign in the media for free press, then slowly back pedal. He knew exactly what his people wanted to hear and he gave it to them. This isn't the biggest American political upset in history by accident, there is a reason we have been posting \"4d Chess\" for a year now. ", "1st rule of propaganda: *Don't believe your own bullshit.* ", "Good. Throw out **everyone** who is part of the old circlejerk elite there. Clean it all out raze it down and build it anew from scratch.\n\nIf you don't then the democrats are done for anyway. ", "Why is racial prejudice more acceptable now? Maybe my Klan newsletter is just late and I didn't get the memo yet.\n\nEdit: I understand the latter half of my reply was sarcastic but I am only interested in replies that take the effort to defend themselves. Not opinions.", "Unless the Republicans decide to follow through on trying to put her in jail...something she probably deserves.\n\nI didn't expect this outcome.  I live in Washington State and voted for Johnson.  My vote didn't affect the outcome in this state, so don't get started saying I helped elect Trump.  The fact this state is so blue is why I felt I could vote my conscience....neither candidate deserved the Presidency.\n\nI don't know if this will wake up either party, however I'd like to hope so.  The corruption from both sides is apparent from the Presidency all the way down to the state level.  Trump and Sanders were a symptom of that.  Sanders just didn't win because of how corrupt Clinton was.  Frankly, I was expecting Clinton to win, followed shortly by an impeachment.  Boy was I wrong.", "Here are the questions hillary has told me to ask Donald Trump.", "She has a fantastic record but she pissed a lot of people off by refusing to endorse Bernie. She would also be fairly old in four years at 71 not much older than Donald but she would still be the oldest person to ever be elected (as far as I know) should she win.", "As a Hillary supporter I'm sorry. We should've nominated Sanders.", "Yeah that's just such a joke. Now the most evil, venal, psychotically egoistic bunch of shitheads the establishment can muster get into power in the name of sticking it to the establishment. If it wasn't so sad and scary it would be really funny.", "Did anyone actually read the article? The most it says is that Pence agrees with trump that LGBT bathrooms should be dealt with on a state-by-state basis.\n\nEDIT: I'm not saying I agree or disagree with the article. I'm just saying the title is EXTREMELY misleading.", "Why would you vote against no longer getting fucked in the ass by the pharmaceutical companies? Are people insane?", "&gt; True democracy won in the end.\n\nAs someone who loathes everything Trump stands for I completely agree with you.  In fact it's what I've been telling my older family/friends who were with Bernie but decided to swap to Hillary: \"I can't vote for that women.  Say whatever you want about Trump (and you'll probably be right), but if he wins it's democracy in action - if *she* wins it just proves the corruption is as pervasive as ever.\"", "That's not how it is or else Romney would have seen similar results. He didn't.", "Yes it will. This endorsement was because he had to to get the platform he wanted.\n\nIf he endorses a candidate before the primaries are held, it will have a positive impact for that candidate. ", "Enough with the persecution fantasies. ", "Both.\n\nIf you think a portion of Trump's supporters aren't racist or sexist then you're just as delusional as the people who thought Hillary was more electable than Bernie.\n\nThe important piece is that not ALL of his supporters are like that. In fact many are not, but Trump knew where his bread was buttered early on and played on the xenophobia that exists in parts of this country.", "When the children can't go outside to play because they can't breathe... it's ok because... COAL", "&gt; they spent millions of dollars influencing grass roots discussions online\n\nIt is amazing how different /r/politics is today now that the paid workers are no longer being paid.", "Brown person here this is terrifying.", "Give me one inductive undeniable, statistical fact that proves that horse shit?\n\nThe race baiting got you here. You can't elect a man president and everytime he's under fire play the race card as if that's a counter argument of endless and foolproof merit.\n\nHe spread the wars. Obamacare has been a mess, price hikes, bureaucracy. A 400 page bill full of graft and grease that got pushed through before it could even be read on. Now people are on a failed plan, and they'll suffer - that falls on Obama. The NSA, wire taps, drones can kill U.S. citizens, expanding of the Patriot Act, suspension of Habeas Corpus. Slowest economic recovery since the Great Depression, in a time when the median income hasn't risen for the middle class in 17 years. 1% GDP growth while the GNP is static, boggling economists until they saw that the Obama economy is mostly state jobs, paper pushers. There isn't private sector growth. We turned towards a big government, and it gave us wars: Iraq, Afghanistan, Libya, Syria. And regular folks are sitting here asking when will it end?\n\nAnd Democrats gave us: you're a racist uneducated xenophobe.\n\nSo, Democrats lost the Presidency, House, and Senate. There's Obama's send off.", "Same. It's amazing how comfortable white people feel speaking for minorities. Condescending assholes.", "You like being stopped and frisked?  Cause it will be national policy under Trump.  Giuliani is being considered for Attorney General.\n\nBut hey I'm a white guy, so wtf do I know or care?", "Yeah but it's *not* that simple. Hillary fucked up but so did Comey. They are not mutually exclusive.", "The bandwagon effect is real. People aren't going to vote the same way in an election where the score is 32-31 as one where the score is 432-31 right off the bat. Then there's the emails from within the Brazlie that show she tipped Clinton on the debate questions (which I admit is fishy: the Flint question was obviously going to be asked and then the other two never were asked). And there's the fact that the DNC's emails show that they weren't going in neutral to the point where they let Clinton agree to more debates but then either schedule them when nobody would be watching or just didn't bother to schedule the last one.\n\nTLDR: yes.", "Especially this subreddit.  Congratulations you made this website shit. ", "Tammy Duckworth a double-amputee, Purple Heart recipient, war hero, could run, and the right would find a way to trash her.", "At 79 years old age would matter. There's a very real possibility he'd pass away while in office. Certainly the stress wouldn't extend his lifespan. ", "Trump bombs the next 4 democrats make up some small ground in 2018. Trump allows  a huge democratic victory, with some real progressive ideals in 2020?", "She could have been SoS and not had email or foundation issues. For someone who had their eye on the presidency for so long she really didn't do anything to help herself.", "He's had 8 years.", "So the guy who is in charge of the Environmental Protection Agency doesn't believe the environment needs protecting.... \n\nI thought we would have a free weeks before the crazy started.", "I really can't believe how blatantly this sub got taken over.  I'm a Canadian with no real vested interest in US politics but if this sub was a child it deserves a fucking spanking.\n\n", "Dear god this article he wrote...\n\nhttp://www.forbes.com/forbes/2006/1225/038.html?_requestid=2170\n\nFew nuggets:\n&gt;Yes rising sea levels, if they happen, would be bad for a lot of people. But a warming trend would be good for other people.\n\n&gt;For example, cold winter storms kill a lot of people. More people die from blizzards and cold spells than from heat waves. Increased death rates usually persist for weeks after the unusually cold temperatures have passed, which suggests that the cold is killing people who would otherwise live into another season at least.\n\n\n&gt;Given our obvious preference for living in warmer climates as long as we have air-conditioning, I doubt that we’re going to go on the energy diet that the global warming doomsters urge us to undertake.\n\nwhat the fuck man......\nI can't even....", "Remember when they asked about domestic surveillance at the debates?", "Don't let the piece of shit /r/politics mods get away with their role in enabling Super PAC manipulation. Fucking disgusting. ", "I understand the blatant hypocrisy of waiting until NOW to push for this but i'll take it if we can restore our 4th amendment ", "Look a lot of people fought back and then got perma banned.\n\nAlso, the admins were defending it as well.  /r/the_donald is not even allowed to say /r/politics anymore.\n\nSeriously, the admins made it that way, they are NOT allowed to make comments about /r/politics\n\n", "*Our next president has shown utter disregard for their constitution*\n\nYou do realize that Obama expanded this program which in itself, is a direct violation of our right to privacy?  \n\nSo it's OK as long as we don't know exactly what they are doing,  but if Trumps wants to, it's a violation?  ", "Trump is off to a great start of confirming everyone's fear about him", "OH MY FUCKING GOD.\n\n*NOW* you have a problem with mass surveillance? It never fucking occurred to you before that someone you didn't like might one day occupy the White House? Like no one was making *exactly that argument* back when you assholes were blithely assuring us Obama was much too nice to abuse his power? It's way too late now, shitheads. The argument is over, and congratulations! You won!\n\nFucking hell. This country deserves what it's going to get, and it deserves it good. And. Hard.", "Normally you know what's going to happen over the next 4 years because the candidate has real policy proposals and makes them known beyond three to five word phrases.", "Then let that be why she's supported no need to shout the \"first female president\" stuff, let that just be a plus. Her sex shouldn't matter unless you're sexist.", "Not only that the admins went out of their way to warn /r/the_donald folk about taunting people, when the entire front page is full of people calling Trump voters moronic.\n\nAs a neutral person politically, I can see this plain as day (I did not vote Trump)", "The approval ratings are collected by the same people who got the general election polling hilariously wrong. So it has to be taken with a huge grain of salt. ", "It's almost like we shouldn't have a program like that at all because it might eventually fall into the hands of our political rivals... I think I remember some Republicans saying that during the Bush years anyway. ", "When it comes to jobs people seem to have a very misguided view of why the jobs are disappearing.  They want a simple answer like its because coal can't be mined or because China/Mexico stole them.  The real answer I believe is that automation has taken them.  The coal mines of tomorrow won't employ a tenth of what they employed when they were able to support entire towns 40 years ago.", "There has been an utterly amazing whitewash of Obama's administration. Mass surveillance has reached pervasive levels (we are rated up there with China on this) prosecution of whistleblowers and journalists, horrible foreign policies, the ticking time bomb known as Obamacare, his legacy will not be what he expected. \n\n", "Her campaign was in a hubris bubble.\n\n\"Look at her!  She's experienced!  She's qualified! And look at him! He's a clown! He could never beat her! Never!\"\n\nHer supporters' train of thought probably went something like that.", "Yes. Its not about losing an election merely. I've lost elections before. This is about seeing my beliefs in my country and my sense of safety crumble.", "Well... they do have 2 solid years with control of the house senate, and supreme court. They also have a patsy sitting in the oval office.  Last time that happened we invaded 2 countries and set up the ground work for a global financial crisis. ", "It's true. We call this place [redacted] now because we were accused of brigading. It was the only option to avoid being silenced.", "I died a little inside.", "Every gay person in the military is shaking right now.  Pence wants to make being gay while on active duty illegal again.  And he will.  A lot of people including my commanding officer, are going to be dishonorably discharged once it has been reinstated.  Shit, he *just* got married too.  I am dreading going into work tomorrow.", "tulsi! She was the vice chairperson of the DNC and gave up this once in a lifetime position during the primary in order to support senator Sanders (members of the DNC are supposed to stay neutral hahahahahah), despite risking her political career as a democrat being over if Clinton would have become president. Also, she is an iraq war veteran, which gives her a unique foreign policy position.", "Dear Florida: You're Fucked.", "Remember the next time you fuckers vote for pro-surveillance state/authoritarian politicians, that that power will eventually be wielded by Trump. ", "He's a good guy and I trust him more than most Politicians, but his signature piece of legislation was a dud and is falling apart.  Regardless of who won the election, ObamaCare would have had to be SERIOUSLY reworked to keep it afloat, which is the exact criticism that it faced from Republicans when it passed, that it was a foolish stopgap that would explode after a few years and leave people without insurance once again.  He's not going to be regarded as one of the greats, because he isn't one of the greats, but he is one of the few good people to hold the Office. ", "For me as a progressive I wonder how you can be progressive and not vote against him... \n\nstill that's in the past now now people just have to fight. ", "The Paris Accord is also non-binding which means he can just ignore it. ", "This subs a fucking joke too. yesterday morning when they thought queen b was going to win the mere mention of Trump in here got you called all sorts of terrible things. Fuck these mods and everybody who engaged in that.", "Sad thing is is that it probably WONT be the worst story of this election. I mean this guy thinks it's kosher to torture people.\n\nHave a looksy \nhttp://www.npr.org/2016/11/09/501451368/here-is-what-donald-trump-wants-to-do-in-his-first-100-days?", "&gt;Leading the Trump DOE team: GOP hired gun McKenna.\nThe president of MWR Strategies is well known in Republican energy circles. He was director of policy and external affairs for the Virginia Department of Environmental Quality under then-Gov. George Allen (R) and was an external relations specialist at the Energy Department during the George H.W. Bush administration.\nHis lobbying clients in 2016 include Koch Companies Public Sector LLC Southern Company Services, Dow Chemical Co. and Competitive Power Ventures Inc., according to public disclosures.\n\nSigh...\nDraining the swamp I see.\n\n\n", "&gt; god save us if Pence gets the oval office\n\nThis is the thing that scares the shit out of me. As much as I dislike Trump I at least don't think he actively hates gay people.", "Voter registration comes to mind. They outright excluded independent voters in many states Bernie's strongest base. ", "Just like the no fly list. It was terrible and racist until they realized they could use it for gun control.", "As a European I don't understand how so many Americans could have voted for Trump.  Me like so many others in Europe woke up to the news that he had won the presidency with complete chock and horror.  This is a man who is completely out of touch with reality! Why? ", "When I was in journalism school I had a prof tell me he didn't even have bumper stickers for his alma mater or favorite sports team, because he didn't want people thinking he was biased.\n\nIt stuck with me.", "Stop trying to blame someone else. Hillary was and always has been a BAD candidate. ", "They might feel the same way but now their feelings are validated and they will be more prone to acting on them. For example the desecration of Black Churches, and Synagogues, that have recently been covered by the news. ", "Oh put a sock in it Huffington Post you played a big part in putting Trump in the White House. Ignoring polls, shielding facts from Hillary supporters, and slandering regular Americans who aren't racist and sexist and who just wanted a non-establishment candidate by calling them racist and sexist for not voting Hillary. \n\nThis is your fault, keep on huffing that paint Huffington Post.", "So it's ok to spy on Americans as long as the President is a democrat? Lol", "Let's talk about the fact that the majority of people that voted for Trump will literally not be able to afford to exist if his economic plans are serious. \n\nIn 4 years the same people are going to do the same thing only it's going to be a lash out against Trump because they were simply too dumb to understand that they were being exploited. \n\nManufacturing jobs aren't coming back due to automation (not immigration) and education is a necessity in modern society. Deal with it or watch the rampant drug abuse and unemployment continue to skyrocket in rural America. ", "The blame game begins it looks like... \n\n\n- Blame Comey for not committing perjury and actually letting Clinton off the hook not once but twice. \n\n- Blame Johnson and Stein for third party protest votes. \n\n- Blame Bernie supporters for not falling in line. \n\n- Blame pissed off millennials. \n\n\nBut don't blame your flawed candidate that you pushed the boundaries of the law and your own rules to get nominated...or the millions who put their ear muffs on and covered their eyes rather than face the fact that their candidate was flawed and dangerous...or the media for biasly pushing a false narrative because they were in her pocket.\n\n\nSure, everyone else's fault but the fault of the ones who are actually at fault. ", "I'd like to announce my candidacy for moderator I have no moderating experience but let's make /r/politics great again. ", "There needs to be a serious investigation to figure out what the fuck was happening in the FBI and DOJ.", "Our campaign is about nothing!\n\nNothing?\n\nYes nothing!\n\nSo why would people vote for you?\n\nBecause I'm going to be president!\n\nNot yet.", "But at least angry white guys and Millennials got a chance to send a message!", "Don't worry they only control 31 state legislatures, they need 2 more to pass amendments. ", "It's almost like they didn't like being grouped into a giant demographic that was voting hive-mind style..? ", "and well.\n\n\nAll of the cheap coal is gone. Nobody's going to be building new coal plants, not here, anyway", "It's a logical point.. and it is seriously fucking with me. ", "Her policies were so much better! \n\nBut here we are. ", "It pissed me off to no end. I watched CNN last night when I realized Trump was probably going to win. They were jumping through so many hoops trying to say that Clinton still had a chance. Even in the end they were dishonest. It was good to see them realize what was happening.\n\nNever watching them again. I want to say that I don't care about having a little bias to the left or right but I do care about integrity and CNN chiefly has none.", "I guess this shows that they didn't vote for Obama for his policies.", "Meh. America deserves a Trump / Republican Presidency they voted for it. \n\nThe world does not. \n\nLet's see how this shitsunami plays out.\n\nEdit: Sorry, guys. #NotAllAmericans", "Tulsi Gabbard as VP ez pz", "Brown person here why should I be terrified?", "Lots of people see this shit and it makes them wanna vote trump just to make this stupid shit stop. Huffpo is a disgrace to journalism just like breitbart vox, wapo, and all the other glorified blogging conglomerates.", "Before last night I would have agreed with you.  Now....I have no faith in the intelligence of Republican voters. ", "Reinstating Glass Steagall is already in the GOP party platform. I have no idea why or how it got there.", "I agree but it's Hillaryious that *now* he should shut down mass spying- like, the idea that it could be abused was inconceivable until Trump won.", "Yeah who the fuck votes for policy?", "I'm a white male with a mixed race girlfriend (neither race white) and she's fucking terrified. As somebody who also has gay friends and Muslim friends I can't help but feel lost. They listened to his tone and loved his demeanor while completely ignoring how bad he could fuck up this country and our freedoms. Republicans are getting ready to watch what their candidate will do for them... Nothing", "I felt my stomach drop when I read the title", "Americans are stupid. This is the country that elected George W. Bush twice and now Trump with tens of millions of votes.\n\n", "Well there is a difference between having a seat in a municipal government and being POTUS", "Joe Walsh used her military career as an attack angle (\"...that's all she talks about...\") and Mark Kirk tried to disparage her claim that her family had a long history of serving this country (\"I’d forgotten that your parents came all the way from Thailand to serve George Washington.\")\n\nShe beat them both by significant margins and they looked like assholes in the process.  If she was ever on my ballot, she'd have my vote in a heartbeat.", "At this point I wouldn't put it past democrats to ratify an amendment by accident. ", "No one will remember or care in four years.", "If a program doesn't work for ALL presidents it shouldn't exist. Period.", "I think how a large group of millennials and even fairly sensible moderate voters have decided that Trump is actually not \"far right\".\n\nApparently if you are anti-free trade and you just say you want gay marriage outlawed but DO NOT say they are terrible people for being gay......BAM. You are now a moderate.\n\nAll it takes. ", "Leading the EPA transition is a climate change \"alarmist\" and leading the department of energy has lobbying clients like Koch companies.\n\nAnd so it begins. ", "I'm sure the little bit of money they got paid was worth destroying their reputation", "Lol that's cute.  You think they wouldn't just re-elect the person with the (R) behind their name.", "They only need 2 more - unless Dems want to 'compromise'", "yeah she didn't give me tingles, so i stayed home. :-) /s", "The reality is that had Blacks and Hispanics voted in the same numbers for Clinton as they did for Obama she would have won. \n\nNow black voters that did not vote can watch while Trump undoes Obama's entire legacy in the first couple of weeks he is in office. ", "To waste taxpayer money? She's out of politics now and the FBI has made their recommendation.", "So people voted republican for the Senate and President but voted for liberal policies all over the place.  Do people even know what they are doing?", "Tim who? I've never known less about a voice then Kaine. Biden was the fucking man. ", "Not really. He didn't say much on social issues at all besides leaving it to the states", "also obama didn't have a 'trust' issue like clinton did. the loathing for clinton was palpable and many were reluctant voters let alone stand for another term. ", "Thank you. I'm a progressive who is none too pleased about the Trump victory. However I personally know a couple of Trump supporters who are lovely people and definitely not racists or sexists (They're actually both women.) It is not remotely fair to assume that everyone who voted Trump is some subhuman monster. But you wouldn't know it from reading a lot of the commentary in the liberal news outlets.", "I wanted Sanders.  I bit the bullet and voted for Hillary.  I wash my hands of the next 4 years of presidency.  But I sure as hell am gonna be voting in 2018.", "Yeah I am acting like he is President and I'm taking his word at face value. People are saying to keep an open mind on him but thinking he is going to concede anything to Democrats when he has complete control of the government is delusional.", "Fucking fantastic. This is terrifying. This is why I couldn't ever vote for Trump. Good luck world, we will need it.", "The least experienced person (unless incumbent) has won the presidential election for a long long time. ", "The problem with \"Burn the house down and rebuild it\" is that we are all in the house.", "&gt;Media ~~obsession with a~~ bullshit ~~email scandal~~ helped Trump to the White House\n\nFTFY", "\"Sorry\" isn't going to stop Obamacare from being rolled back. \"Sorry\" won't stop Republicans from taking control of the House Senate, Presidency, and Supreme Court. \"Sorry\" won't stop Hispanics, gays, and non-Christians from being killed and deported en masse.\n\nYou fucked up. Big time.", "That's my biggest WTF of this.\n\nThis is a man who was born rich got into Harvard on connections, abused the system for years, and now you vote him in expecting him to change the system he has been reaping the rewards of? Baffling to be completely honest.", "Rudy and Newt are going to hold cabinet positions lol what a fucking disgrace.  ", "Apparently no one :( \n\nInstead people vote on emails Wikileaks, and pussy gate. Seriously an orange clown won because of fucking emails, sorry I am a little mad.  ", "\"It was called the Protect The Children Amendment I didn't know it banned all porn! I thought Trump had our best interests at heart so I didn't need to read it.\" - Democrats a year from now ", "\"Crooked hillary and the establishment screwed you Bernie people. You're passionate, we all see it, we like it. We want you to be rewarded for your efforts. We want Bernie on our team...\" \n\nUhhhh", "Or you know you could ask actual black voters. Polls have 60% of black voters scared and 20% concerned. Don't bother replying with whatever bullshit you'll spew, I've heard it all before.", "I mean he did not win the popular vote. Democracy did not win. A representative Republic won. ", "If we only had some sort of....administrator? who ran the site and who made sure things like this didn't happen. ", "Donna Brazile and anyone else at the DNC with a hand in this mess needs to either be forced out or resign immediately.", "There were no scandals rumors or conspiracy theories about Bernie. The media would've been forced to focus on policies. He definitely would've been a stronger candidate. ", "Maybe. As a finance guy I would never have voted for Bernie a year ago. But after watching him and listening to him, I realized he was the first politician whom I believed. He meant what he said -- I truly believed that. And I came around to the idea of supporting him quickly after the debates. It's just so sad that the DNC, DWS, media and HRC did everything to undermine him. ", "Please.  The refrain would have been:\n\n* \"Godless Commie\" had a USSR flag in his office.  \n* \"Godless Commie\" went on honeymoon in the USSR. \n* \"Godless Commie\" talked shit about Lord Reagan to literal \nCommunists in South America.  \n* \"Godless Commie\" praised Castro here's the video.  \n* \"Godless Commie Godless Commie Godless Commie\"\n* \"He got kicked out of a hippie commune for not doing his share of the work\"\n* \"His wife bankrupted a college and then made off with $200,000\"\n\nYour mistake is thinking the media gives a shit about the issues.  The media does not give a shit about the issues.  Issues are boring, and there's plenty of shit there to attack.\n", "This is the most under reported aspect of this election.", "The pivot to the general election is here.", "please [CALL her office](https://wassermanschultz.house.gov/contact/) and thank her for her contribution to the party's stunning victory. oy.\n\nEDIT:\n\nfrom hurryuptakeyourtime\nALSO:\n\nWho's with me in calling and contacting people every day until they clean house and replace all of their officers? I am trying to spread this idea. We NEED to get them to clean house.\n\nPhone: 202-863-8000\n\nContributions Phone: 877-336-7200 (probably more likely to answer)\n\nContact Site: http://my.democrats.org/page/s/contact-the-democrats\n", "Remember that the EPA is much more than just climate change policies.  We still ensure clean water and other emissions standards as well as perform remediation work and take part in international environmental efforts.\n\nPeople have allowed this \"debate\" to overshadow all the other things the EPA does, which most people in Congress (yes, even republicans) support.\n\nWhat frightens me is what he means by transition.  ", "If democrats want to salvage their brand DWS has to go in a woodchipper feet first.\n\nFargo style.", "She vacuumed up all the funds that could have been used down-ticket to try to \"power through\" as she would say. They could have been much more effective with that cash at the state and local levels. Instead they blew it all on the queen.", "I'm really not worried about Trump. It's the potential justice picks who can fuck America for 30 years straight is what I'm worried about.", "\"Mr. Trump you promised to bring back manufacturing jobs back to America...\"\n\n*Trump leans into mic* \"Wrong. I never said that.\"\n\n -- Presidential Debate 2020", "Sorry Trump supporters, you are not going to get that wall for next Christmas either. And the deportation of \"millions of illegals\"? Yeah, that's not going to happen either. Why would the business world aka Trump's world want to get rid of their cheap labor force? \n\nWelcome to the world of electing a salesman as president. He will tell you anything to close the deal.  \n", "They didn't ask about domestic surveillance at the debates....\n\nThat's the problem.", "Honestly at this stage I have to wonder what the top people in the US military are thinking given that the US military has identified climate change as one of the biggest threats to national security in the near future.\n\nBut then, thinking to how the head of the FBI behaved over absolute nothingness a week before the election, cynicism about their quality comes easily.", "Donna too. She's not even sorry about cheating. Says her \"conscience is clear\". Unbelievable. They really think they are above the law. ", "Did he just make things up? And if I'm not mistaken the weather swings will be stronger so there will be more blizzards *and* more draughts. Which he probably means is no problem because he can order bottled water delivered on trucks.", "Vote in 2018!   \nFix the senate first then worry about the next presidency! ", "They literally just voted for more of their state to be consumed by the ocean. More of their friends &amp; family will die in hurricanes and more of their homes will be destroyed. They will lose billions of tourism dollars as their coral reefs die. How the fuck do people still not understand this? ", "Another zinger\n&gt;This promising scenario of milder winters in northern regions which would become reality in the unlikely event that global warming turns out to be as considerable as predicted, comes with a catch, however. Air-conditioning is now considered a necessity\n\nForget mass extinction in the oceans, mass emigration of coastal cities, losing miles of arable land due to salt-water encroachment etcetc...\n\nnah now our air con bills are going to be higher, that's the \"catch\"...\n\nfuuuuuck", "&gt; Climate Change might kill us all. Which is hyperbole and probably won't happen\n\nI really don't think it is hyperbole.\n\nPakistan and India are two nuclear armed nations that rely on melting glaciers for their water supply. Pakistan is projected to run dry first as India becomes the most populous nation on earth. This conflict is decades away from escalating to dangerous levels, but that path has just become much more likely ", "Republicans would vote for a literal pile of shit with an R next to its name Democrats need an inspirational figure to bother voting - see Gore,  Kerry and now Clinton. ", "He is pro NSA.\n\nHe has had it for the past 2 terms and has overseen it become what it is today. It's had his approval.", "Gotta admit chucked at that one. GQ posted a piece entitled \"The Terrorists Have Won\"", "Of course they don't they're too busy jerking each other off and telling us how he's going to drain the swamp by relying on the same old swamp people ", "There actually could be [MORE](http://www.climatecentral.org/news/polar-vortex-whats-the-role-of-warming-18654) winter storms from a warming climate because one consequence is the break down of the jetstream that separates the arctic weather from the temperate weather.", "Any Trump supporters want to justify this?", "They're dumb as shit and will contradict themselves in a circle to make a point on reddit.", "&gt; Even in his acceptance speech he was talking about spending millions on infrastructure to create jobs.\n\nHave you actually looked at his [infrastructure spending plan](http://www.politico.com/tipsheets/morning-transportation/2016/11/trumps-plan-for-1-trillion-in-infrastructure-investments-217315)? It's horrifying. He's not talking about investing government money in building out our infrastructure (which is to most people, a perfectly sound use of government money). Instead he wants to fund profit-generating projects like toll roads _only_. It's a terrible plan, like all of his plans - and it's a classic Republican pipe dream.", "\"Hillary should be in prison\"\n\nThere I went ahead and gave you what their \"defense\" would be.", "On reddit racism is a red herring. In the real world minorities and immigrants are fucking terrified. ", "I hate opinion pieces in what should be a news oriented sub. \n\nAgree with top comment charismatic guy and all but really started/continued a bunch of shit I don't agree with. See mass surveillance state and drone strikes for more details.", "Don't worry.  The Department of Justice will be corruption free after Giuliani becomes the new Attorney General in charge of it. /s", "You shouldn't. You're being pushed into a dangerous mindset used to further divide the nation. ", "You guys just elected a well documented racist into the Whitehouse. Why shouldn't minorities be worried? \n\nHave you no ability to see things from another's perspective?", "The new administration is not going to help this situation.\n\nIt is now the responsibility of the Democratic party to figure out how to get these voters to turn out.", "\nDid you not see the DNC convention and how hard Sanders supporters fought along the way? Fuck DNC and the Clinton camp for rigging the primary and pushing a corrupted \"most electable\" candidate that will never win", "Glad to see this sub is gaining it's footing again. We need to be hypercritical of all the bullshit and lies about being anti-establishment over the next four years.  If his cabinet is actually Rudy Christie, Palin, and newt, his supporters should never be allowed to forgot.  ", "Technically they didn't vote for it. Not even a plurality voted for it... Trump lost the popular vote to Clinton. Twice in the last 5 elections the Republicans have come out on top because in fact, the system is rigged towards rural white areas and against cities and, by circumstance, minorities.", "I love this meme about reddit changing the algorithm because we were becoming too powerful. It's pretty good.\n\nhttps://www.youtube.com/watch?v=2i1WJCORQjU", "Progressive measures and candidates lost by bigger margins than Hillary; Zephyr Teachout Russ Feingold, single-payer in Colorado..", "Oh it will get a lot worse.  The GOP would love to shut the EPA down.  It's near the top of their list.  Who needs clean air to breathe when we can return to the 70s and 80s when urban pollution  was unbearable?  Also, we can always buy our water from Nestles.", "its too blatant the media hasnt learned a thing. Drain The Media.", "Send us a message that what? All the stereotypes of you being hate mongering bullies is actually true by electing the one guy who ran on those ideals?  Well you really showed us.", "Good. This shit is half their fault. Them and OH and PA and MI. If they suffer the consequences of climate change it's poetic justice. ", "basically her campaign was \"it's my turn\"", "There it is!", "It would be a dream come true if Donald \"Fuck 'em all\" Trump did a complete 180 and became a liberal's dream candidate. Only problem is fucking over Pence's dead body.", "Yep Donny actually got fewer votes than any republican presidential candidate since 2000.  He couldn't even beat *lamb to the slaughter* McCain and *lipstick on a pig* Pallin's numbers from 2008.\n\nHillary lost **six million** voters compared to Obama in 2012. **Ten million** compared to Obama in 2008.\n\nThe democrats picked the wrong candidate.", "Ensure that poor people die quickly so the richer can afford it.", "We can all look forward to drastically higher rates of pregnancy-related deaths.", "Well here we fucking go.\n\nI swear to fucking god people over 60 should be banned from voting. \n\nFuck you old pieces of shits. \n\nIt's going to be me watching my children and grandchildren starve 30 years from now because you can't use your fucking brain to do something else that's meanful to earn you a living. \n\nYou fucking pathetic entitled baby booming pieces of garbage. ", "I can never not watch all of that.\n\nThe_Donald owned this fucking website every instance of them trying to stop it just fed the_donald more and turned more and more users of this website into Trump or t_d supporters.\n\nIt's like a weird streisand effect thing.", "Astroturfing remains a serious **serious** problem but Hurricane Hill has passed.. A little bit of calm discussion here for the first time in months.", "I disagree.  Obama retains some popularity amongst workers for fighting for the auto-industry the bailout helping to keep their jobs around, etc.  Fairly or unfairly, Clinton was painted as the pro-corporate anti-worker candidate, and so Trump inherited that vote.  With that seemingly representing the divide in the electorate, it makes a(n extremely) perverse sort of sense when they go from Obama to Trump in one leap.  If that's your only issue - and if you watch your job vanish in a puff of smoke, you can understand why it may be - and you aren't rabidly informing yourself the way we here do, then...well, like I said above, it kind of makes sense.  \n\nEdit: forgot the word \"makes\" at the end.  ", "Yesterday progressives knew Clinton was going to win too.  So I'm not sure them claiming to know that Bernie would have won really tells us anything.  Maybe he would have, but there is no way of knowing.", "The dems need to get rid of any and all leadership even remotely associated with a Clinton. ", "I love and respect Sanders but I have to ask.\n\nWhere the fuck were these people when the DNC rigged the primary? Now after his movement was thrown underfoot and his millions of supporters insulted and belittled now that the DNC stood complacent in the rigging and collusion, now that the DNC is in their death throes, now that millions of democrats don't like the president, now they see the error of their ways they want to embrace Sanders? Where the fuck were they when it mattered?\n\nNo refunds. You reap what you sow.\n", "Huh voting restrictions cause less people to turn out. Who would have guessed.", "I kept posting this story for the last 2 months. I feel like if we had ignored his red herring racist shit we could have st least talked Policy. \n\nHe also has a $1 trillion infrastructure proposal that uses toll booths to pay for it and private corporations to manage it. \n\nEdit- poorly worded. Red herring in that the press and his supporters didn't take time to examine policies. The point that he's a racist pos was already a given. ", "\n\"Hillary Clinton is the most electable candidate\"", "They didn't come out to vote in large **because** of Hilary. In the end it's up to the presidential candidate inspire their constituents to go vote for them to get them to go to the polls and then also vote on a down ballot issues.\n\nEdit - We can argue whether it's rational or not for people to not go out and vote on down ballot and Amendment issues but people don't vote rationally, they vote with their feelings. This is something the DNC has seemingly forgot. If a candidate doesn't inspire voters in some way they are doomed. Bernie would have won, he inspired people.", "Considering he was the only Republican to stand up for Planned Parenthood and has expressed pro-choice views in the past I don't really worry about him pushing a pro life agenda. Although him picking Pence as a running mate is worrisome. That guy is a nut job. ", "This is why the concept of the benign dictator is such a bad one. It's not the nice guy who puts the country back on course in a time of crisis it's the lunatic that uses that dictatorial infrastructure to take power afterwards. ", "The DNC's campaign has a lot of parallels to the star wars prequels. [*pushes glasses up bridge of nose*] If you hire people who are there to tell you you're a genius you're going to produce absolute shit. At the very least-- the smallest silver lining is that Trump feels he has something to prove, namely that he can do a good job because 80% of the global population highly doubts he can. Guess we'll see. But yeah, HRC was a recipe for failure. Bernie was the equivalent to miraculously bringing Alec Guinness back to life to tie it all together. ", "as last night showed...", "Im an angry white millennial who voted against this horseshit because I knew the implications. That is what is more frustrating than losing; that no one seems to understand what they have done. How *the fuck* can people be so damn oblivious to what was at stake here. I keep reading how and why this happened and none of that shit should have ever mattered. It is insanity. ", "I'm curious what he'll say about the wall.     \nIt's his thing. It's what he's known for.     \nWhat happens to his supporters if there's no wall? ", "Which tramples all over due process. So not only is it terrible and racist it's also unconstitutional. ", "Leaving social issues to the states is either a sign of malice or moral cowardice. Anyone running for a high-level office should understand that there are states totally willing to deny equality to part of their population.", "better late than never.  ", "Good god do not impeach or assassinate him! Pence is a fucking nut case. He's worse than Trump by far. Pence makes Ted Cruz seem like an athiest.", "That's the one thing that gives me any comfort here. Trump is a New Yorker and has supported LGBT people more than Republicans generally do. I really hope that plays out in his policies. ", "It's not just reddit. A racist demagogue rallies people around bigotry and non-whites aren't supposed to get nervous. It's lunacy.", "But Clinton is gone. DWS is still in power. ", "Keep in mind also, that the voting rights act was gutted in 2013. I can't imagine that didn't have something to do with the reduced turnout.", "&gt; or hurting anyone by doing that\n\nExcept this ignores reality.  The entire reason that protections had to be put into place in the first place was because people were being hurt.\n\nIt took the Federal government to step in and overrule states.\n\nWith that protection gone those states will go back to hurting the same people they were hurting before.", "Fracking has destroyed more coal related jobs than any regulation ever has.", "It really is amazing just how bad a candidate she was and how poorly run her campaign was. \n\nHer whole desire to run for President was born out of her desire for the power of the office; not out of any idea that she could help or benefit the people or be an actual public servant. It was about her thirst for power. Anyone could have seen this when the Clintons left D.C. in 2001. Even though she was from Illinois and they had been together in Arkansas before, they went to NY where there was an open Senate seat waiting for her. If that seat had been in Hawaii, they would have moved there.\n\nSo she gets the Senate seat so she can built up her street cred for a future run for the White House herself. But suddenly in 2007 this upstart Senator from Illinois who, let's be honest, has nothing but eloquence as his initial qualification, upstages her. He has a goofy, foreign-sounding name, woefully little experience in politics and in D.C., and he's a nobody challenging perhaps the most powerful political name besides the Kennedy's.\n\nShe loses to him, but not before making a deal that she would be his Secretary of State, should he win, so she can build up more street cred and make a big push in 2016. She serves as SoS for his first term, resigns, and then starts putting everything in place for her big moment in 2016.\n\nWhen the head of the DNC has to leave, she likely makes a deal that her agent will be the new head of the DNC, and the former head can be her running mate. The new head of the DNC gets to work laying out the red carpet for Hillary's big push.\n\nBut then, again, out of nowhere, this upstart guy from Vermont steps forward and starts to run a campaign against her. He's an outsider and an anti-establishment candidate. He starts to gain ground. So Hillary and the DNC people she controls start pulling levers to destroy his chances and put everything in her favor.\n\nShe wins the primary, but not before developing bitter resentment over anyone who would oppose her, calling his supporters, \"fucking dumbshits\" and when asked if she would alter any part of her platform for reconciliation among the Democratic party, she responds, \"Why would I? I'm winning!\"\n\nIt would seem easy for her and the Dems to ignore the support and the movement from Bernie if it hadn't been for the fact that the *exact* same thing was happening with the Republicans. Trump was more of an outsider and anti-establishment candidate than Bernie. He destroyed Jeb Bush's career; railroaded Cruz; trounced Rubio; stiffarmed Christie. \n\nHow Clinton and her team could miss the signs indicating that anti-establishment fervor was sweeping the nation is beyond me. How the DNC could think that then putting the biggest establishment candidate they had into the fray was a good idea is mind-boggling. But then again, when Clinton controls the DNC, it's easy to see how they might miss it or at least shut their eyes to that possibility.\n\nBut Clinton's arrogance didn't end there. When it became clear that she wasn't really a popular candidate, she had the idiocy to blurt out, even if it was off-the-cuff, \"How am I not ahead by 50 points?!\" She truly just didn't get it.\n\nIf you can't win against someone who insulted and demeaned a genuine war hero in John McCain; someone who insulted and belittled the family of another fallen soldier; someone who insulting his way through the primaries and then the general election; maybe you should take a look at what *you're* doing wrong.\n\nHer response was just to air commercials and videos of Trump being stupid. That is **not** how you win elections; by giving people a reason not to vote for someone. You win elections by giving people a reason to vote *for* you. \n\nWhen Clinton had the chance to deal with policy and promote plans and goals, she didn't. Presumably she didn't think she had to touch any of that when some nut was the opponent.\n\nEven when her buddies and NBC \"suddenly\" found this tape of Trump bragging about his way with women, she couldn't do anything with it. (And I say \"suddenly\" because, let's be honest, when Trump became the candidate every single station on the planet sent people into their own archives to dig up every tape and second of footage of Trump and Clinton they had to see what was there. So if you think this incredibly embarrassing tape was just suddenly found at that opportune moment, then you're about as naive as they come. NBC had that tape for months and help on to it until they wanted to use it.)\n\nIn short, Clinton became so wrapped up in the idea that it was \"her turn\" and that she didn't really need to try to run a campaign against that nutty Trump fella that it cost her. She funneled money from Congressional campaigns into her own coffers and cost the Democrats seats in those races. She essentially demanded that the entire machinery of the Democratic party stop to support her quest for the White House at all costs. In doing so, *she* cost the country a balanced Congress and resident on Pennsylvania Ave. that is potentially dangerously unqualified to live there.", "I have friends who don't believe me when I say that Bill was impeached.", "Exactly. I actually attend a Historically Black College/University and there were KKK members passing out flyers and confederate flags around midnight on our campus. This happened in DC of all places.", "\"3. Any Democratic member of Congress who didn’t wake up this morning ready to fight resist and obstruct in the way Republicans did against President Obama every day for eight full years must step out of the way and let those of us who know the score lead the way in stopping the meanness and the madness that's about to begin.\"\n\nYES.  This has to be the least successful presidency in history. Obstruct. Resist. Fight. and make it hard and embarrassing to do anything. That is they way the republicans have taught us to win. ", "Move 200000 progressives from California to each of PA, MI and FL, and Clinton wins and still wins CA by over 2 million. No Comey and Clinton probably wins. Clinton *won* the popular vote.\n\nThe lesson of 2016 is you look at the tipping point states and the demographics in those states. Safe states and \"win only in blowout\" states don't matter. At all. Hispanic support wasn't as important as people thought because of the way hispanics are distributed throughout the country and because Florida hispanics are a bit idiosyncratic. Our 2020 candidate doesn't need to do better with New England and West Coast liberals. Our 2020 candidate needs to do better with blue collar whites and blacks (in terms of turnout) in the rust belt and/or the not rabidly liberal sun belt.\n\nBernie's *style* of messaging and communicating, his rhetoric and focus on a single big message and one or two big villains, is definitely something the Democrats need to copy. Maybe that can be paired with radical left populism, but it could also be paired with moderate left populism or even (not that this would be my preference) big, dumb centrist populism.\n\nThose whites who voted for Trump or stayed home were mostly not making a decision on policy, they were making a decision based on charisma (or lack thereof) and a desire for angry populism.", "I know right! That was their entire attitude. It was that snarky condescension which drove me nuts... And it worked because I stopped coming here, which is what they wanted. Like people would never argue the point. If you brought up a WL issue, they'd just attack you for being Russian and how the content is just propaganda blah blah blah. \n\nI hope everyone learns their lesson next time around and not let this shit happen again. Fucking mods. ", "It's the electoral college.  More people voted for Hillary than voted for Trump but the distribution among the rural areas and swing states allowed Trump to win by a razor thin margin in crucial swing states.\n\nA lot of pro-Trump believers will look at last night as a mandate of some sort but it's really the result of voter disillusion.  Neither candidate was able to command a majority. ", "Trump will drain the swamp the day after the UK NHS gets their promised Brexit money.\n\nAlso commonly referred to as never.", "As a Bernie supporter i'm so tired of this Bernie would've lost too. They would've painted him as the crazy old socialist that wants to take your money and give it to the brown people. Biden would've lost too, he would've been the career politician who has spent his life in the senate and brought you NAFTA.\n\nThe angry white people wanted a blowhard authoritarian with a simple message that they could understand.  All your problems are because of foreigners (china, mexicans, muslims, etc) and he'll fix it all by making america great again, done!\n\n  ", "Wasn't asked about it in any of the debates by the liberal media.  Hillary brought up the Chinese conspiracy thing  he said wrong, and they just moved on.", "The hypocrisy is unbelievable. \"Only Republicans can do bad things\"", "Also notably is the establishment people lobbyists and corporatists on board.  \n\nDrain the swamp! Anti establishment! Hahaha. Wait until the cabinet is just a who's who of establishment figures and career politicians!", "If we left womens rights and blacks rights to the states there would still be states today where they can't vote.  Would you be okay with that?", "Why did the progressive senator lose by a bigger margin than Clinton in Wisconsin but we get to conclude that Bernie would have outperformed her? \n\nBecause we like him? Oh. Great. ", "It's time for a woman president! And I'm a woman! Vote for me or your sexist!\n\nI don't understand that method worked so well for the Ghostbusters reboot. ", "Is she any more to blame than Clinton herself?  Don't get me wrong DWS is deserving of her fair share of shit right now but she really was just Clinton's tool.  ", "Good luck. I've had one friend and two relatives lay their life on the line by working at clinics where they were threatened harrassed and one even had their cat poisoned. So I sympathize. But it's gone. Death by a thousand cuts.\n\nThe specially chosen test cases are sitting waiting for the next justice. They were only put on hold after Scalia died.", "The mods are still there. They just aren't deleting a thousand anti hillary posts every day anymore."], "links": ["5c2ig1", "5c1xwm", "5c1ll8", "5c1rql", "5c1ae6", "5c2ig1", "5c2ig1", "5c1ll8", "5c1ae6", "5c1xwm", "5c1rql", "5c22jw", "5c1xwm", "5c1rql", "5c1xwm", "5c273f", "5c1rql", "5c273f", "5c1ll8", "5c273f", "5c273f", "5c273f", "5c1ll8", "5c273f", "5c1ae6", "5c22jw", "5c1xwm", "5c1rql", "5c273f", "5c273f", "5c2ig1", "5c1rql", "5c0uw7", "5c273f", "5c0uw7", "5c273f", "5c2ig1", "5c1ae6", "5c273f", "5bzz3v", "5c2ig1", "5c273f", "5c273f", "5c273f", "5c273f", "5c273f", "5c0uw7", "5c273f", "5c273f", "5c273f", "5c1ae6", "5c1xwm", "5c273f", "5c2i1l", "5c273f", "5c273f", "5c1xwm", "5c273f", "5c1ae6", "5c1ae6", "5c1ae6", "5c1rql", "5c13n6", "5c2ig1", "5c1ae6", "5c273f", "5c1ll8", "5c273f", "5c273f", "5c1xwm", "5c2ig1", "5bzz3v", "5c1rql", "5c273f", "5c273f", "5c273f", "5c1sa0", "5c273f", "5c273f", "5c1ae6", "5c273f", "5c273f", "5c25tv", "5c1rql", "5c273f", "5c273f", "5c1ll8", "5c273f", "5c1rql", "5c1sa0", "5c1ae6", "5c1rql", "5c1rql", "5c273f", "5c273f", "5c1rql", "5c1ae6", "5c273f", "5c273f", "5c2ig1", "5c2ig1", "5c1rql", "5c2ig1", "5c2pyc", "5c2ig1", "5c1ae6", "5c1ll8", "5c1ll8", "5c2ig1", "5c1ae6", "5c2ig1", "5c1rql", "5c2tgv", "5c2pyc", "5c2ig1", "5c2nkm", "5c1ll8", "5c2tgv", "5c2pyc", "5c2ig1", "5c22jw", "5c2pyc", "5c1xwm", "5c1ae6", "5c2nkm", "5c1ae6", "5c1rql", "5c2ig1", "5c25tv", "5c1ae6", "5c1rql", "5c1ll8", "5c1ll8", "5c1ll8", "5c1ll8", "5c1xwm", "5c273f", "5c273f", "5c1ll8", "5c1sa0", "5c0uw7", "5c273f", "5c22jw", "5c1sa0", "5c1ll8", "5c1rql", "5c1ae6", "5c273f", "5c2ig1", "5c1ll8", "5c2ig1", "5c273f", "5c1xwm", "5c2pyc", "5c1rql", "5c273f", "5c0uw7", "5c1rql", "5c2ig1", "5c1xwm", "5c2ig1", "5c1ae6", "5c1ll8", "5c22jw", "5c1xwm", "5c1rql", "5c1rql", "5c1ll8", "5c2pyc", "5c1xwm", "5bzscq", "5c1rql", "5c1xwm", "5c1rql", "5c1ae6", "5c1rql", "5c1ae6", "5bzscq", "5c1sa0", "5c2ig1", "5c1ll8", "5c2ig1", "5c1ll8", "5c1ae6", "5c1sa0", "5c2ig1", "5c1rql", "5c2tgv", "5c1ae6", "5c273f", "5c1rql", "5c25tv", "5c1rql", "5c2ig1", "5c273f", "5c1xwm", "5c1xwm", "5c1xwm", "5c1ll8", "5c2ig1", "5c1rql", "5c2ig1", "5c2ig1", "5c2nkm", "5c1ll8", "5c1ll8", "5c1rql", "5c2pyc", "5c35k5", "5c273f", "5c2ig1", "5c2nkm", "5c2nkm", "5c1ll8", "5c2ig1", "5c1ll8", "5c1sa0", "5c2ig1", "5c1ll8", "5c1ll8", "5c22jw", "5c37os", "5c22jw", "5c1sa0", "5c2ig1", "5c2ig1", "5c2ig1", "5c2ig1", "5c22jw", "5c22jw", "5c2taz", "5c35k5", "5c2pyc", "5c2pyc", "5c1rql", "5c2ig1", "5c2pyc", "5c2pyc", "5c1ae6", "5c1ll8", "5c1ll8", "5c35k5", "5c273f", "5c25tv", "5c1ae6", "5c1ll8", "5c2pyc", "5c2taz", "5c35k5", "5c1rql", "5c35k5", "5c2ig1", "5c1rql", "5c1rql", "5c2tgv", "5c1ae6", "5c2nkm", "5c1ll8", "5c2tgv", "5c1hux", "5c22jw", "5c1xwm", "5c2ig1", "5c1ll8", "5c2tgv", "5c35k5", "5c2ig1", "5c1ae6", "5c1rql", "5c1ll8", "5c2pyc", "5c2nkm", "5c22jw", "5c2ig1", "5c2ig1", "5c2taz", "5c2ig1", "5c1ll8", "5c22jw", "5c1ll8", "5c2ig1", "5c1ll8", "5c1xwm", "5c1ll8", "5c1xwm", "5c2tgv", "5c273f", "5c2pyc", "5c1ae6", "5c1ll8", "5c1xwm", "5c25tv", "5c1ae6", "5c38tc", "5bzscq", "5c1rql", "5c1xwm", "5c1xwm", "5c3jzg", "5c3jzg", "5c2ig1", "5c3c3y", "5c1rql", "5c3jzg", "5c3c3y", "5c2ig1", "5c39q1", "5c1xwm", "5c3jzg", "5c1ll8", "5c2ig1", "5c1ll8", "5c3c3y", "5c3c3y", "5c2ig1", "5c2ig1", "5c3c3y", "5c2ig1", "5c1rql", "5c3jzg", "5c1ll8", "5c2ig1", "5c1ll8", "5c3jzg", "5c2pyc", "5c39q1", "5c2ig1", "5c3c3y", "5c3c3y", "5c3c3y", "5c3jzg", "5c2ig1", "5c3c3y", "5c2pyc", "5c1ae6", "5c35k5", "5c1xwm", "5c3jzg", "5c3jzg", "5c1ll8", "5c3c3y", "5c1ll8", "5c2pyc", "5c39q1", "5bzscq", "5c1xwm", "5c3jzg", "5c39q1", "5c2pyc", "5c2tgv", "5c1ll8", "5c1ll8", "5c2pyc", "5c1rql", "5c3c3y", "5c2ig1", "5c1ll8", "5c2ig1", "5c39q1", "5c2nkm", "5c2ig1", "5c3d1q", "5c2pyc", "5c1ll8", "5c39q1", "5c3c3y", "5c1ll8", "5c39q1", "5c22jw", "5c1ll8", "5c2ig1", "5c3c3y", "5c1rql", "5c1ll8", "5c2ig1", "5c1xwm", "5c2ig1", "5c25tv", "5c3nrd", "5c1rql", "5c2ig1", "5c1xwm", "5c3c3y", "5c2pyc", "5c3jzg", "5c1rql", "5c3c3y", "5c2nkm", "5c3c3y", "5c3c3y", "5c39q1", "5c2ig1", "5c1ll8", "5c2ig1", "5c2ig1", "5c2tgv", "5c2ig1", "5c3sbs", "5c3jzg", "5c1rql", "5c3jzg", "5c3sbs", "5c1rql", "5c3sbs", "5c1rql", "5c3sbs", "5c3jzg", "5c3sbs", "5c2ig1", "5c2ig1", "5c1rql", "5c2nkm", "5c3sbs", "5c3jzg", "5c3sbs", "5c1xwm", "5c3c3y", "5c2ig1", "5c1rql", "5c3sbs", "5c3c3y", "5c2ig1", "5c3jzg", "5c3sbs", "5c2nkm", "5c3jzg", "5c3jzg", "5c1ll8", "5c3jzg", "5c3jzg", "5c2ig1", "5c2ig1", "5c3sbs", "5c3jzg", "5c1ll8", "5c39q1", "5c3c3y", "5c3c3y", "5c3sbs", "5c3pw5", "5c39q1", "5c1rql", "5c39q1", "5c1xwm", "5c3jzg", "5c25tv", "5c2taz", "5c3jzg", "5c2pyc", "5c3jzg", "5c1ll8", "5c3k1n", "5c2ig1", "5c2ig1", "5c3c3y", "5c3c3y", "5c35k5", "5c2pyc", "5c3sbs", "5c3jzg", "5c3c3y", "5c3jzg", "5c3jzg", "5c2ig1", "5c2ig1", "5c25tv", "5c2ig1", "5c3sbs", "5c3jzg", "5c3jzg", "5c1rql", "5c2tgv", "5c25tv", "5c3jzg", "5c3k1n", "5c40g4", "5c3ap5", "5c1xwm", "5c25tv", "5c2ig1", "5c2pyc", "5c2ig1", "5c2pyc", "5c3jzg", "5c2ig1", "5c2ig1", "5c3uuy", "5c1xwm", "5c2ig1", "5c3sq5", "5c3jzg", "5c25tv", "5c2pyc", "5c3c3y", "5c1rql", "5c1rql", "5c45qw", "5c43f3", "5c43f3", "5c43f3", "5c46b7", "5c4a8q", "5c45qw", "5c3jzg", "5c45qw", "5c2ig1", "5c3jzg", "5c4a8q", "5c4a8q", "5c3sbs", "5c3jzg", "5c45qw", "5c3jzg", "5c2ig1", "5c3jzg", "5c3jzg", "5c3jzg", "5c3jzg", "5c3sbs", "5c3c3y", "5c3jzg", "5c3jzg", "5c3jzg", "5c3jzg", "5c2ig1", "5c3jzg", "5c3jzg", "5c2nkm", "5c3jzg", "5c3c3y", "5c3c3y", "5c46b7", "5c43f3", "5c3jzg", "5c2ig1", "5c1rql", "5c43f3", "5c3jzg", "5c3sbs", "5c2ig1", "5c3jzg", "5c1xwm", "5c2ig1", "5c4a8q", "5c2pyc", "5c2nkm", "5c3z2u", "5c3jzg", "5c1rql", "5c1ll8", "5c2nkm", "5c43f3", "5c45qw", "5c43f3", "5c46b7", "5c3jzg", "5c43f3", "5c2ig1", "5c2pyc", "5c3sbs", "5c1xwm", "5c2tgv", "5c3jzg", "5c4a8q", "5c3sbs", "5c25tv", "5c4a8q", "5c2tgv", "5c2ig1", "5c3jzg", "5c45qw", "5c43f3", "5c25tv", "5c3jzg", "5c3rp5", "5c2tgv", "5c3c3y", "5c45j9", "5c2ig1", "5c1rql", "5c3jzg", "5c3jzg", "5c43f3", "5c3jzg", "5c3sbs", "5c3jzg", "5c25tv", "5c43f3", "5c1xwm", "5c45qw", "5c3z2u", "5c1ll8"]}