{"comments": ["Bernie understood this election from day one.  He had his finger on the pulse of the nation and he was silenced by the establishment and the DNC.  He saw which way the wind was blowing.  This was his moment.  We're all suffering the consequences now.  DNC if you ever want to win another election - don't shove a candidate down our throats.  Natural grassroots movements are always stronger.  You can't artificially create that kind of movement.  It was obvious with her empty rallies.  The fire wasn't there.  If the Republicans had run an establishment politician..maybe it would have worked.  Maybe America would have flipped a coin and landed on Hillary.  Say what you will about Trump, his support was real and produced tangible results where it counted.  What a fuck up by the DNC.", "&gt; “To the degree that Mr. Trump is serious about pursuing policies that improve the lives of working families in this country I and other progressives are prepared to work with him. **To the degree that he pursues racist, sexist, xenophobic and anti-environment policies, we will vigorously oppose him.**”\n\nCouldn't have said it better myself.\n\n", "Bernie touched the same population that Trump touched and are alienated by Hillary. Oh well", "If Democrats are smart they will line up behind Bernie and let him lead them in the Senate.", "Yet some Hillary supporters are on Twitter still putting him down for his focus on class. Uh jackasses, you just got your asses handed to you because you didn't focus on class enough.", "I could use some progressive leadership now that the world has turned upside down. Thank you Bernie.\n\n", "So true they are already claiming Tim Kaine as the future of the party. No one who lost to Trump can be the future of the party, sorry.", "Bernie Sanders for the Senate Minority Leader.  Schumer is too cozy with wall street exactly the opposite message this election sent us.", "-Bernie was polling [10+ points](http://www.realclearpolitics.com/epolls/2016/president/us/general_election_trump_vs_sanders-5565.html) better than Hillary in all polls leading up to the convention.\n\n-Bernie won handily during the primaries in the exact states that Hillary lost in the general where white workers were desperate for change and populism.\n\n-Trump was a flawed messenger but he won as a result of this perceived change to the system that Clinton herself embodies.\n\n-This message of change, upended every single other controversy Donald Trump had, which would have immediately sunk every other campaign. \"Family values\" is just as much of a republican-montra as those \"godless commies,\" yet, people still didn't care. \n\n-Bernie talks about things that people actually care about and agree with. He doesn't skirt or spin or sound like a robot, and he puts it into simple terms that everyone can understand.\n\n-Bernie has been fighting against the \"system\" his entire life, cementing his principles. Sec. Clinton typifies everything that some people perceive as [corrupt](https://www.youtube.com/watch?v=12mJ-U76nfg) about that [system](https://www.opensecrets.org/pres16/candidate?id=N00000019) and has benefited [immensely](http://www.cnn.com/2016/02/05/politics/hillary-clinton-bill-clinton-paid-speeches/) from it.\n\n-Bernie's base of energized voters would get out the vote, especially in the suburban areas where Sec. Clinton had such a hard time \n\n-Many people were voting [against](http://www.pewresearch.org/fact-tank/2016/09/02/for-many-voters-its-not-which-presidential-candidate-theyre-for-but-which-theyre-against/), not for a candidate this election, due to each candidate's historically low approval ratings. Before the election and currently, Bernie has the highest approval ratings among all Senators. In short, he is likable.\n\n-Bernie is a crowd-sourced candidate. He doesn't take any money from Wall Street or billionaires, and he himself is upper middle class. He is just as much of an outsider, if not more so, than the Donald, and he has a better message. \n\n-I do not believe there would have been as many \"Hillary-or-bust\" people who believe that the DNC \"rigged\" the system since the wide consensus is that the opposite is true. Many of these Bernie-or-busters are millennials as well, who supported Bernie because of his progressivism and against Hillary because of her centrism.\n\n-Bernie had stadium wide crowds that only increased every month he was campaigning. When he started his campaign, he was speaking to a crowd of less than 30 on the lawn outside of the whitehouse. By the middle of his campaign, he was drawing 30,000 [people](http://www.nbcnews.com/politics/2016-election/sanders-campaign-claims-record-breaking-crowd-new-york-rally-n557421) in New York City. There is no reason to suggest why this number would not grow to even larger numbers during the general, emboldening his populist persona.\n\n-Bernie is an old, salt of the earth, New Yorker with white hair and a thick Brooklyn accent. He mimics the same people who voted for Trump in droves this election.\n\n-Bernie was not under criminal investigation at the time he was campaigning.\n\n-Bernie is not married to a person wrought with controversy and a notorious womanizer.\n\n-Bernie is not wrought with controversy.\n\n-I do not believe that Bernie's campaign would have been tarnished by wikileaks in the same way it had done so to Sec. Clinton's campaign. One reason for this is that Bernie Sanders is not as well known as Sec. Clinton, and therefore not as big of a target. I also do not believe there would be much motivation to do so considering that his campaign managers (Jeff Weaver) hacks would only consist of campaign strategizing whereas Podesta's hacks included that and other things concerning the Secretary while she was in the Whitehouse. He also never gave any speeches to banks that could inevitably get hacked..so there's that.\n\n-Bernie also does not have a history of health issues that have partially marred Sec. Clinton's campaign and can be linked back to early [2013](http://www.nytimes.com/2013/01/03/us/politics/hillary-clinton-is-discharged-from-hospital-after-blood-clot.html). As you can see [here](https://www.youtube.com/watch?v=ZP_J6gmJYiU) the man is pretty fit for a 74 year old.\n\n\n\nEverything I can recall atm for why I think Bernie unquestionably would have fared better than Sec. Clinton in the general. I will update if I remember anything else\n", "Bernie should seriously reach out to Trump and try to talk about the problems we are facing and how to work together to solve them. Bernie is convincing and Trump is such a wildcard that he could actually go left. He was a Democrat up until we elected a black democratic president. Bottom line is that Trump is now President so crying about it won't solve anything. We need to try and make the most of it. I guarantee you that no progressive changes would have happened with Hillary. She didn't want to and even if she did the Republicans would have fought her every step of the way.", "She's true piece of shit. How dare she cheat our democracy. How dare Hillary cheat our democracy. \n\nThe DNC is truly corrupt. One cheat is fired and another cheat is hired. ", "With her leadership the party lost the presidency, the House and the Senate. But she got reelected. Just think about that for a minute.", "It's common in locker rooms to give nicknames to other guys.", "I despaired when I lost my candidate in the primary. He was obviously the most widely popular candidate.\n\nI cried when she lost my country.", "This is so frustrating after listening to her supporters argue for months about how much fund raising she did for the down-ticket candidates.\n\nShe spent all their money and still lost to Donald Trump. She cost Democrats the Senate in a race that they were favored to easily win if they had just picked *any* other candidate. And the way her surrogates and the media are blaming anyone they can scapegoat besides themselves and their terrible candidate - it's pretty clear they learned nothing from what just happened.", "Trump's history and actions show it's gonna be the latter more than the former.\n\nTrump has never given a fuck about working American families. Like many other American businessmen he **could have** chosen to manufacture his goods (like his shitty ties) in the USA. He didn't. He chose China.\n\nTrump could have paid his contractors – he didn't. He'd undercut them and force them to accept little or hang them up in legal bills.\n\nAnd he **could have** not bragged about sexually assaulting women. But well, you know....", "He has to be the de facto leader at this point I'm not sure he can be the Senate Minority Leader because he technically is an Independent", "As a climate scientist this bears particular significance to me. Our new president, a man who believes that my entire field of research is a vast Chinese conspiracy, has appointed perhaps *the* leading climate change denier in politics today to head up his EPA transition. If you feel that 4 years of Trump's presidency will be a giddy shakeup of politics as usual, I want you to consider that he is taking actions that will have repercussions for centuries. For you, your children, and your grandchildren. It is perhaps the most depressing aspect of his presidency and it is hardly talked about at all.", "Yep now's the time to excise the cancer... but they won't go through with it.", "Democracy dies by a thousand cuts.\n\nThis one was a gash.", "And he's spent 8 years lying to america about the extent of NSA spying and pushing to expand the program.  What fantasy world does this author live in that makes him think Obama would end one of the programs he's stood up for his entire presidency.", "\"I'm only sorry I gave potential Trump voters another reason to believe the media is biased\"", "Only 30 years? Think big!\n\nedit: By the way if you've been paying attention for the last 8 years you should be very worried about Trump also. We've lost any hope of this country ever being liberal on a national level. Now we must push for blue states to fight for the future that our country and our planet will never have, and we must start playing defense nationally. This is, by all accounts, a disaster.", "The first part is right. \"I'm only sorry I got caught\".", "Shame Trumps plans to help the middle class will destroy it. 35% tariff on imports more privatization, trade wars....  If you know what the fuck is up and want to help the middle class... You need to oppose Trump on that too. At least TPP is dead I guess.", "I love how upset the media is now that the election is over why were they not this mad the entire time when Bernie's chance was literally stolen from him? ", "#fuckthednc\n\nHelp me get this trending on twitter", "I don't think that there is any mechanism in place to actually make it happen. It's clear that the will of the people means nothing to the DNC and they aren't going to police themselves. \n", "A lot of the narrative about the 2016 election is that the Democrats ignored a large segment of voters who turned out to be necessary for their success.\n \nI'm concerned that the liberal wing of the Democratic party is making the same mistake toward the moderates.  Regardless of whether you agree with them they still supported Hillary over Bernie for their own reasons and ignoring them will not put you in a better position for the next election.\n", "Because emails bro.", "In 2018 23 democrats, 2 liberal independents, and 8 republicans are up. Several of the Dems are in red states, and it's a midterm.\n\nI'll be stunned, if the Dems retake the senate.\n\nThe house is gerrymandered to hell and back. It won't be retaken, unless **extreme** demographic shifts occur in the next 2 years.\n\nRepublicans will get a full term, unimpeded.", "They've blamed everyone but Clinton or themselves for going with Clinton ", "The most amazing part is there is still a large contingent of Hillary supporters who blame marginalized former Democraric voters for Trump winning.  \n\nWe literally have another DNC higher-up caught cheating and not even apologizing for it.  We have a DNC that is rotten to the core and does not deserve automatic capitulatuon.  \n\nYet instead of sharpening their pitchforks to reform the DNC they are happy to let these monsters continue to run amok and subvert democracy while blaming the people impacted by this travesty.", "Trump wants to get rid of the EPA so this is a good first step to achieving that.  ", "You know what. I'm still not convinced that just any other candidate would have won easily. But I do think that at this point it is clear she wasn't the right choice. I'm willing to admit that I was wrong. Having said that this is an embarrassing loss for the democrats and Hillary obviously needs to disappear into retirement. ", "Fuck everyone one of those shills for Hillary at the DNC. No one fucking wanted her candidacy.", "She's gotta go. After this rout anyone that thinks of preserving this leadership simply does not care about the electoral process, only maintaining their little club. ", "He did attack the DNC just not directly.\n\n&gt; Donald Trump tapped into the anger of a declining middle class that is *sick and tired of establishment economics, establishment politics* and the establishment media.", "Didn't he call him Crazy Bernie...?", "In a funny way I am sure it happened because they were aware that his support was growing. Should have taken the people at their will.", "Her conscience is clear because she  believes HRC  embodies their moral code. Much like many hard line supporters of other candidates.\n\nThis has been the dirtiest election in living memory.", "He just needs to make the impression that he is *trying* to build it and find someone else to blame for not actually doing it.", "Good. \n\nThe more people begin to realize cronyism and corruption are poison the sooner these people are kicked the fuck out before they can get someone like Trump elected.\n\nTrump talks about draining the swamp in January. The Democratic party needs to start today. ", "&gt;THIRD a requirement that for every new federal regulation, two existing regulations must be eliminated;\n\nFuuuuuuuuccccccckkkkkkkkk this will be a painful one for Americans", "We all saw how running with that destroyed Hillary . Using her sex as her main selling point was stupid.\n\nObama never used his skin color as his main selling point.", "It's *really* hard to argue this either way because it's purely a hypothetical.  Bottom line: we have no idea if Sanders would have done better, or worse.  He could have wiped the floor with Trump, or he could have been a modern day McGovern.  Who knows.\n\nI *do* agree that the narrative of the election would have been framed as 'American capitalism' - embodied by Trump the businessman - vs. 'godless socialism' - embodied by Sanders.  Sanders anti-establishment bonafides wouldn't have helped him as much, as Trump would also have been anti-establishment.  Trump could have done his alpha-male macho schtick in the debates.\n\nOr it could just have been that the GOP was due for a win, and no matter who the Dems put out there'd have been the same wave against them.  Who knows.  It becomes circular to speculate.", "http://dailycaller.com/wp-content/uploads/2016/10/150407-Strategy-on-GOP-2016ers.pdf\n\nThe DNC/Clinton camp strategy was to promote Donald Trump as a viable candidate. They fucking did this to all of us and to top it off they pissed away all of the money for congressional races.\n\nTHEY LITERALLY CAUSED THE TRUMP PRESIDENCY AND PREVENTED THE DEMS FROM REGAINING THE SENATE. Fuck, man.", "&gt; \"I'm only sorry I gave potential Trump voters another reason to ~~believe~~ recognize the media is biased\"\n\nAlso let's not forget it wasn't Donna Brazille who cheated in this scenario - HILLARY CLINTON was the cheater. Donna was simply the scummy enabler.", "This right here. \n\nYet another fact we know thanks to leaks. Clinton took money that should have helped them win seats so she could use it for her campaign. She with the DNCs support, destroyed the party. \n\nThe DNC needs a complete rebuild before 2018's vote and 2020's presidential election. ", "No no no.  It's all the Corrupt DNC's fault.", "They're fucking idiots. The fear-mongering hit bullshit levels almost immediately and idiots are eating the drama up. Jesus fucking Christ.", "\"See? It doesn't work BURN IT DOWN!\"", "Yes they are terrified by things like terror attacks in GA or gay marriage ruining their own marriages...things less likely to happen than a TV falling on your head. The reason schools near me are already dealing with kids yelling \"go back to your country\" and providing counselors to refugee families is because of the actual policies Trump has wantonly prescribed.", "&gt; I thought we would have a free weeks before the crazy started.\n\nThis information has been known (\"according to two sources close to the campaign.\") for over a month\n\n&gt;By Robin Bravender ClimateWire on September 26, 2016 \n\nbut EMAILS!?", "Everything will get more extreme that's the basic outcome.\n\nThat's less regularity and reliability of crops and so on.  We're already experiencing it now.", "Fuck DWS fuck the DNC unreal corruption turned into this. The American people obviously saw it, and they reflected that in the election. ", "As liberals we should have never given him the chance to confirm our fears about him. Maybe we didn't rally around our candidate enough or maybe the globally surging tides of alt-right, white nationalism were just too overpowering. I don't know. But we failed to protect our country.\n\nTo anyone who lives in a blue state, we have lost most of the chance to make our country what we had wished it to be, but we still have the power and the opportunity to realize our vision for the future on the state level. \n\nWe can fight climate change on a state by state level.\n\nWe can fight private prisons on a state by state level.\n\nWe can fight for affordable healthcare and a public option on a state by state level.\n\nWe can fight for livable wages and gender equality on a state by state level.\n\nWe can fight against bigotry and for diversity and tolerance of all people on a state by state level.\n\nThis figurative war against the alt-right has just begun. And we need to fight it from the ground up. The new Democratic party will be created from a grass roots movement. Next major election is in 2 years. VOTE!", "Happened in the UK in the wake of Brexit. All the closeted prejudice came pouring out when they felt they had some kind of sanction from the vote.\n\nhttp://www.bbc.co.uk/news/uk-politics-37640982", "And the House.... the entire House is up for re-election.   Yet youth participation during mid-term elections is less than 20%.  \n\nAnd Democrats have to really start with a true 50 state strategy -- and lay off the purity tests.  A candidate in Nebraska is going to have to be a strong second amendment supporter. So what?   Maybe even pro-life.   Yes that would cause some issues in some areas but not in other important areas, and it'd certainly beat dealing with a no-compromise Republican. \n\nInstead, Democrats just write off the entire middle of the country. It's ridiculous. ", "Superfund sites definitely won't be getting cleaned up.", "That was a nice statement. I don't agree with most of Bernie's policies but at least I think he's honest and has conviction.\n\nI just wonder why he doesn't attack the DNC. That is the first thing that needs to be fixed in the political arena.", "Even still he's consistent in his message.", "There would need to be unity in the Democrats to achieve that and there isn't. They appeared to unify against Trump but not for Hillary. Now that she is out of the picture the divisions will appear and there will be a serious lack of trust in regards to those who stabbed people in the back as well as calls for heads to roll given the massive loss that occurred this election. Clinton and her supporters went all in on the victory without giving a shit about down party candidates they also went all out against the progressives then paraded Sanders like a beat dog while they sat back and laughed. Victory solves a lot of ills, defeat brings them out. ", "I happen to agree with [Eminem](https://www.youtube.com/watch?v=YVkUvmDQ3HY&amp;feature=youtu.be&amp;t=1m40s) on this one\n\n&gt;Fuck you Debbie!", "That's Trump's doing. He's been saying that we need to dismantle Dodd-Frank and reinstate Glass Steagall this entire time.", "How different this election could have been if Bernie was running in place of Hillary.", "Such an amazing figure that will be remember for the things he did for this country.\n\n\n\n", "Fuck her fuck Debbie Wasserman Schultz, and most of all, fuck the DNC.", "\"Terror\"?  Give me a break.  What do they think is going to happen - rounding up minorities and putting them in camps or some dystopian shit like that?\n\nGet a grip people.", "Remember when she attacked Bernie for not helping down ballot democrats? ", "Trump is now a mystery candidate. I wonder if even he knows what he's actually going to do.", "Let me just fantasize for a moment about this having been his plan all along and he actually chose Pence to help him bridge the gap between parties and reach bipartisan conclusions. \n\nOk fantasy over. That was nice though. ", "Lincoln had half the country separate to form another country...", "And if you really want to fight the best thing we can do is get a young batch of Berniecrats running for office to shut this shit down. ", "I 100% agree and I wish more people took this attitude. Sanders would gain voters to Clinton's left but lose them to her right. There is literally no way to know the numbers, and there is no way to know for sure if he would have won. Far, far, FAR too many variables. \n\nI'm already beyond bored of the politics front page being \"Bernie would have won you guys!\".", "He removed his pro-life stances from his website too.\n\nThis is getting weird.", "WOW. there is some scary shit in there. i just can't...i really can't even digest that. what is this \"violent crime\" initiative? what does that even mean? crimes rates are declining dumbass. also does he want to privatize the national parks? someone please tell me no. ", "This election was saddening.", "I heard Trump will start WWIII tho... So better vote Hillary who is totally anti-war.\n\nThe fear mongering has been out of control. I've seen so many bullshit over reactions today and I'm pretty sure these people don't know Trump isn't actually president yet.", "Did we watch the same debates? She went after him on good issues. She could have done more but she didn't do bad. And by many accounts she won all 3 or 2 of the debates.", "Holy shit this guy actually thinks Global Warming means it's just going to get universally a little more balmy.", "Isn't it fucked up that DWS still has a job in Washington? After all of the fucking evidence her voters still showed up. ", "I'm pretty sure they *both* cheated... ", "lol \"before it's too late\"...? So Obama should follow the rules and constitution all of a sudden?\n\nObama should have thought of that before he normalized and expanded warrantless wiretapping. Now every president gets to spy on its citizens. \n\nGosh, thanks, Obama!", "As salty as I am this guy has 4 to 8 years being cherry joke material.\n\nOn balance, we probably would've loved Dubya if he hadn't turned the Middle East into his own personal meat grinder and crashed the economy. Fingers crossed Trump doesn't fuck it up that badly.", "Almost like the funding has died up.", "Yes! She's the one who I'd be proud to call the first female president. I honestly do hope that she does run in 2020. ", "I absolutely love this.", "Technically under half did. (Clinton won the popular vote.)\n\nLet that sink in.\n\nAnd yes, it makes it even worse. ", "There will be no Muslim ban no wall, no different trade agreements. The conservative establishment will give him some change to forward a few of his campaign ideas but that's it. We will remember this period as the Mike Pence administration. ", "And the duty of voters to make sure their local laws are overturned and repealed. We need a multi-pronged approach we can't depend on just one solution.", "As bad as stuff like that is in 30 years there's going to be problems in our face environmentally that make the bickering and injustice between groups pale. The only good thing is that the rest of the world seems to realize that it's a problem and are doing something about it to different degrees. We've possibly allowed ourselves now to slip into a scientific isolationism, where the ones calling for solutions and warnings are going to be laughed off even more than they have in the past. We may look at days when scientists had to try and defend their work in front of a disbelieving Congressional panel as the good one days, at least they had a chance to get some message out.\n\nIt's only one day into the shock, so maybe it won't be like that. But taken at face value based on the campaigning and statements, I don't have a lot of hope progress to do what little we can against climate change will get done.\n\nBasically, climate policy was my single vote issue, because it things go very bad, the rest won't matter down the long road.", "I would literally vote for bernie sanders' corpse and a large file folder of index cards he wrote on his death bed before either of these two fucks.", "But it was her turn!", "This is a global surge a riptide of hyper nationalist alt-right ideology that exists all over the world. We've seen it with Brexit, we've seen it with Trump. This can happen anywhere next - France, Japan, Germany, Canada. \n\nI believe that nowhere is safe from this ideology of hate or fear.\n\nI don't know what the source is. Maybe people were just worn out by the fear of terrorism or the great recession didn't work fast enough for some. Maybe it really just is a knee-jerk response to 'PC culture' or some crazy shit like that... I really don't know.\n\nI'm happy to have voted against him, and that my state was one of the few to stand up to his hateful, divisive, and fearful rhetoric.\n\nBut, make no mistake, the figurative war against the far right has just begun in Britain and America. And, to anyone else, if you are watching this and thinking this can't happen in your country, you couldn't be more fucking wrong! If you live in a democracy, you must start speaking out now, you must get politically active now, and most of all you must vote in your country's future elections. ", "Have to agree.\n\nTulsi was even told her actions would have consequences most likely because like Trump Hillary also kept a blacklist with her and it was nearly impossible to get off it.\n\nShe did it anyway.  How many progressives did we just watch do that?  A half dozen total during the entire cycle and all but her virtually nobody can name.", "Just like after the primary a strange wind has swept this sub. It's no longer as hostile.", "Hillary Victory Fund - quite the interesting campaign financing model. ", "The DNC has some serious purging to do.", "This man is so fucking classy. He should have run for President or something. ", "Bernie needs to groom new politicians. He is getting older but has much to inspire and teach.", "Tim Kaine was literally the most boring and milquetoast person they could have picked for VP. I think the VP selection was one of the DNC's great follies this election. They could have gone with someone much more likeable that could have energized the base more.", "Jesus Bernie's economic message was pretty similar to Trumps, which got him elected. This shouldn't have even been close. Bernie basically had zero skeletons in his closet. Republicans would have had to resort to the tired \"HE'S A SOCIALIST!\" trope that got them assblasted the previous two elections. \n\nMy only hope is that his movement will spawn 100 little Bernies who will one day control the American liberal party. ", "Sanders would have won. Biden would have won. A dog named Bark Obama would've won. Hell John Kerry might've won.\n\nThis election was theirs to lose and lose they did in spectacular fashion.", "Trump won a greater percentage of the black and Hispanic vote than Romney did in 2012 despite his divisive language. I think economics was a huge part of Trump's appeal.", "Bernie Sanders knew. Killer Mike knew too. \n\nIt was the economy stupid. ", "I supported Bernie and then supported Hillary because fuck it she's not really that bad.  Then the election results came out and showed that the Republicans got basically the same number of voters that they always get, while Hillary got like 10 million less votes than Obama did in 2008.  \n\nThe Democrats only have one objective and it's to turn out the vote.  Republicans will just vote for whoever is on the ticket, while Democrats need to be wined and dined.  If people like Bernie, then fucking let him run.  There really isn't any other option.  \n\nI think Michelle and Bernie are the only two real candidates we have.  I like Elizabeth Warren, but bullshit attacks like calling her an Indian somehow resonate with people and that can't happen.  Nobody can run if there is one line of attack that actually resonates with people from now on, period.  Michelle's \"man arms\" is not getting traction, so she can run.  Bernie is fucking teflon.  So those are the two.", "Class was part of it but plenty of blue collar workers are minorities, which Trump didn't win. He won the white vote, and a big part of his campaign was playing to white racial fears. It's a disgusting truth, but racial prejudice was a huge part of this election.", "If you ever visited the Donald there were quite a few Berners there expressing their discontent with the establishment.", "If Bernie were just a few years younger he'd be the 2020 frontrunner.  \n\nKind of a shame.  I don't think Americans will vote for a 78 year old prez understandably so.", "Then just order coffee and fill it out in 10 minutes. The democratic establishment is non-existent. Schemer is just Clinton in the Senate. Sanders is right now, effectively the most powerful liberal in the world besides Obama. ", "The moderate white vote won't get you elected president anymore.  Clintonian Third-Wayism is not a viable way to win an election now.  \n\nWe need New Deal 2.0 Democrats with progressive backbones.  Forget the Clintons they are done.  ", "You need to stop saying shit like this.  right now every Bernie supporters should be calling the DNC and every Super delegate who supported Hillary Clinton before single vote was Cast and demanding they tell us who is going to be fired and held accountable for this fucking election. You taking a defeatist attitude to begin with so you don't have to do anything you need to stop it and change immediately because we have a serious chance of taking over the Democratic party due to the vacuum that's going to be left and Hillary Clinton's failure. She was the entire Democratic establishment and now that she's gone we have a chance to take it over!", "Even after all this he still manages to say exactly the right thing. Why you DNC diehards all piled on him still blows my mind.\n\nEdit in - had to double check my upvote count. That would have been -87 only 24 hours ago. Thanks guys.", "The moderate white vote is literally why trump won.... It was because of Clinton's hubris thinking that blue collar America was going to just fall in line that killed her. \n\nWe have to be aware of the anger the common American feels. And I hate to point it out but the common fear is what the moderate white people fear. Bad trade deals immigration, and more conflicts in the middle east. \n\nThe last one is a toss up for both. Trump destroys Hillary on the first two. Bernie also destroys Hillary on the first two. ", "They will not. The ones who did resign only did so because they thought President Clinton would secure them a good position afterwards. That promise is gone so they have no reason to leave now. \n\nYou will have to smash them in the 2020 primary. ", "that's a great statement. while everybody else is crying \"omg i can't believe our country is this racist and sexist now these racists sexist xenophobic rednecks are up to bat for our country!!!\" bernie acknowledges that this is *not* what trump's huge support is about. it's the corruption and the establishment politics. ", "That's how you write a fuckin statement.", "Love this man.", "She underestimated white rural turnout by 30% in some states.  She had no idea how angry that part of the country was.  A part of the country Bernie Sanders did well in.    ", "I'm just a person that doesn't identify with a subreddit as my \"home.\" I visited r/the Donald to see what they were saying. There are users there that express a genuine distaste for establishment politicians i.e. Hillary. Some claim to be Bernie supporters that have a sour taste of the DNS's treatment of him.\n\nTrump won the election. Swing states that had Bernie support lost the blue vote. I think it stands to reason that not everyone expressing that was a troll.", "Democrats will not be smart and they will line up behind a machine Democrat like Schumer. Mark my words.", "Who does anymore? I was fully prepared to vote Dem for the first time in my life (Nader all the way baby) but they scuttled themselves months ago.", "Oh right. That was another one of their dumb ideas. We can talk about income inequality, but that isn't going to solve [insert bs issue here]", "&gt;Bernie is a ...New Yorker with white hair and a thick Brooklyn accent. He mimics the same people who voted for Trump in droves this election.\n\nOk this made me laugh. I think you might want to rethink at least this argument. I've never heard a thick Brooklyn accent in rural Wisconsin.\n\n\n\n", "That nickname never worked. It made it sound more like \"Good ole Uncle Bernie with his wacky hair\" than a mental illness. ", "&gt;why were they not this mad the entire time when Bernie's chance was literally stolen from him?\n\nwell it was quite clear to anyone following the media closely back when bernie still had a chance that they **did not** want him. NPR was fucking unbearable. MSNBC was shit (see especially- chris \"but bernie's a **SOCIALIST!**\" matthews &amp; rachel maddow). CNN was its typical dumbass self. they would put fucking HRC super delegates on their \"panels\" for fuck sakes as the person representing the \"democratic\" point of view (rarely bothering to have them reveal this affiliation). you had to turn on fucking fox news to hear anything good said about his camapaign. the new york times practically blacked him out until it was too late. the wash po was fucking off the chain with the # of bernie hit pieces they started running toward the end there..\n\n*i hope the MSM who are devastated by trump's win does some serious self-reflection, but i won't hold my breath. i totally understood a lot of the trump supporters anger at them...they overplayed their anti-trump hand. ", "The Democratic party will go the way of the Whig party if they don't rip the Third Way Democratic weasels out roots and all.  The American electorate, Progressives and political independents will never support the Democratic party as long as these crooks/sellouts are serving in leadership and influential roles.", "TPP's certain death + cannabis vote are big consolation prizes for every sad American today.", "Quiet and let the white upper class dude at huffpo to speak for you.", "I included that more to demonstrate how unrefined he is really. The point still stands though. He is an old white man who is angry at the system-exactly Trump's demographic.", "I think the racial fears are defintely a part of it but they are being overstated.  Trump outperformed Romney with minorities, and Hillary did worse than Obama. \n\nThere were also a significant number of white voters that were happy to vote for Obama that voted Trump.  Hillary failed to win some statets that went blue for Obama.  I doubt this is because of racism.\n\nPeople on the right are starting to develop some class consciousness.   Let's join them and direct our anger upwards at the 1% instead of demonizing each other, we could see some remarkable changes for the poor and blue collar workers.  Sanders' statement summed it up perfectly. ", "I know this is probably wishful thinking but I do hope there's a place for Bernie in Trumpworld.", "no more superdelegates. Period. Let presidential nominees reflect the will of the voters.", "This is the endemic problem. The fairness honesty and sincerity are a facade. A futile facade. Everybody that was part of the Clinton campaign that lied, cheated, rigged, did anything dishonest -- whether to Bernie or Tulsi or the voters or Trump -- they don't get it, won't get it, that this is why they lost. \n\nThey got caught. Obviously, everybody else must be doing the same thing, right? That's how they justify it. \n\nRise above it. Be honest. Be sincere. You can win, even if it's in hard mode, without the cheat codes. ", "\"Yeah let's totally give the POTUS more power, he's my guy, more power, more powe-- **HOLY SHIT** the POTUS is some guy I hate now, we're all gonna die!\"", "It's funny you use eating pizza with a fork as your example given [Trump actually does that](http://assets.nydailynews.com/polopoly_fs/1.130257!/img/httpImage/image.jpg)", "He was 100% submarined by a viciously favoritist colluding party that put all their eggs in one shitty basket.", "See this is why we had to start calling it \"climate change\" instead of \"global warming\" -- because idiots don't understand the difference between climate and weather. They hear \"global warming\" and think, \"but it's snowing here for the first time in years! Dumbass liberals.\"", "No they're just trolls for the Trump campaign if you're from /r/politics.  \nEdit for the dull who keep filling my inbox: With a capital S /S in case the last bit didn't make it obvious.", "Look at me. Look at me. I am the captain now. ", "The problem is centrism triangulation, and being moderate does not work in an election year looking to take down the establishment.  Clinton was delusional and she fucked up the Republic with her hubris, let us hope we never see something like her again.  ", "Agreed Little Marco was way more demeaning.", "He doesn't want to be a democrat.", "Even after the humiliation this man has faced he is still strong and dedicated to the American people. \n\nHe will forever be an inspiration i hope he sticks around for 2020  ", "I am a phd level environmental scientist who has an EPA proposal in review for funding. This will literally kill my job. Glad I spent 15 years in advanced training now!", "That and they *feel* like they want a change from something they don't know what is.\n\nYou have a progressive president who has done a number of great things for your people and limited the fallout of the previous one, but somehow progress just doesn't resonate with the American electorate.\n\nAs an outsider watching this from across the ocean I'm baffled as to why some of you are so masochistically ignorant.", "Let's hope not. Trump said he's pro-medical at least as well as pro-states choice. \"If they vote for it they vote for it\" he said once. \n\nI think it'd be worse if he was indicted and Pence took over. I don't like that guy at all.", "Not. Maryland is a perfect microcosm. Trump got what 35% in MD? How blue can you be? And yet every 8 years or so the Democratic Party nominates such a bad candidate that the Republicans hold the governorship at least half the time. I'm talking some really lousy candidates. But nothing changes.  They don't learn. They keep putting up the 'next in line deadbeat.' On the bright side, we've had some pretty darned good Governors in Ehrlich and Hogan.", "Don't worry. I hear Trump is going to bring back jobs like you wouldn't believe. You like coal right?", "Rumor is a weak word when a verified signature email -from the wikileaks Podesta email dump- exists from july of last year that confirms it. Definitely not proven but also well above the benchmark for \"rumor\"", "Hillary lost because she lost states Obama won. Ok yeah I'm captain obvious here. My point though is it shows there are true independents out there. Which isn't a bad thing.\n\nWhat does that mean for a socially progressive America? It means that it can still happen. Trump won because of 3rd party protest votes and fuck you votes aimed at both parties establishments.\n\nTrumps election is a disaster because the Republicans can pick Supreme Court Justices. They can push their conservative agenda.\n\nHowever to the latter point, just because people voted for Trump, doesn't mean they agree with the conservative party. Let's face it, people wanted to tear down the system.\n\nIf Trump doesn't drain the swamp, if the people sense that Trump is just a puppet or at best indifferent to his job, he's out in 4 years easy. But more importantly, lets focus on mid term elections. \n\nThe democrats have to paint Trump as a figurehead. someone who isn't the wildcard, bull in a china shop, swamp draining monster that the angry populist uprising wanted. If the democrats can make people believe policy is coming from up high on Conservative Establishment mountain, then the swamp draining will be getting rid of republicans in the senate, state govs, and congress.\n\nSo if the Dems can hold out, letting Trump appoint a SCOTUS for 2 years, they can get control of Congress, and force Trump to appoint a middle of the road judge.", "He was chairperson of the DNC when Debbie Wasserman Schultz (Clinton's friend) took over from him. The rumor is that he stepped down because he was promised Clinton's VP spot when she ran in 2016. He was also picked to help win Virginia since he is popular there.", "It was a main talking point but he was smart to not use it himself he let the media and the people say it, that way it felt more natural and like he wanted to win based on being better for the job then being the first non-white to get the job. Sadly Clinton did basically the opposite of this.\n\nAlso I can't wait for the 30 minute meltdown Samantha Bee has calling everyone who didn't vote for her sexist because Clinton is a woman.", "Lots of people just didn't want Hillary Clinton.\n\nHad the Republicans put up literally *anybody* but Donald I would have not voted for Clinton. \n\nShe is intensely disliked for a multitude of reasons.  Everybody underestimated just how disliked she really is - they chose a white nationalist clown over her.", "Both candidates are le same!", "Same Trump winning would be a lot more tolerable for me if Pence wasn't a fucking heart attack away from taking over.", "Also when asked to comment on the DNC after the election, he said he had nothing polite to say about them.", "He wants to privatize the road system too. Hope you like paying tolls.", "The point isn't that he's a New Yorker it's that he's unrefined. He's a normal guy. Bernie and Trump eat in diners. Hillary probably eats pizza with a fork, *if she eats pizza at all*", "Chris Christie is anti weed and might get a position to reverse that.", "&gt;If he were to do anything even remotely progressive it will result in a crushing uproar of rage from his ideologue base.\n\nProgressive literally means advocating for social reform. Term limits for congress and his ethics reform plan are widely lauded by his base and what are they if not exactly that?\n\n\"Drain the Swamp\" is a progressive statement that echos the feelings of many Americans towards crony establishment politics and that has been a core part of his campaign so you should tone down the cynicism for a bit and see how things work out first.", "Yeah when that six pack runs out and they are done spiking the ball, no magic factory job is going to be waiting for them.", "Isn't the response to this the prisoner's dilemma? While other companies can undercut preventing yourself from doing the same will sink your business giving you no jobs to talk about saving. But if national policies prevent *any* business from doing what you described, then the option remains viable.", "We need to start electing the head of the DNC and RNC.  ", "He doesn't need to be the minority leader to lead I believe he will be viewed as the de facto leader considering his popularity and his ideology is clearly winning out", "Wow I completely did not know about this. Too much MSM propaganda.", "None of those things are even remarkably controversial. Clinton would have said the exact same. I'm supposed to be impressed that he wants to \"do the good things?\"\n\nLet's talk about the *how* and especially, the *how it's paid for*.", "The ones who didn't vote should feel the most regret for their actions.  No matter what candidate you voted for you made a choice.", "You mean woman have you not seen that photo of their all white woman staff meeting they posted to pat themselves on the back?", "Bernie was the man we needed but did not deserve.", "Condescending Clinton supporters coming back in droves. Can't count how many times I've read how white male millenials are to blame for this loss today. No doubt a direct result of priming. When you undergo nearly a years worth of narrative manipulation by the Clinton campaign and Establishment Media those thoughts tend to stick inside the head. \n\nTruth is, these echoes in your mind, that you guys perceive as individual thoughts, couldn't be further from the truth. Your candidate was shit, you forcefed us the most unelectable candidate in modern History. I got in line, I followed the recommendation of party leaders, I voted for Clinton. She lost and ultimately the people responsible for President Trump are the naive, sheep of the democratic party who supported Clinton and DWS in rigging the primaries. \n\nThe blame is on those whom supported the censorship of their fellow party members, showing blatant disregard for the legitmate concerns of fellow Americans, as they asked for to reign in \"*the organization who can't be named*\". Everyone who ignored those pleas, mocked their fellow constituents and failed to recognize that the candidate they were forcing upon us had no chance. Those are the people who created a divide in their party and contributed to the lack of enthusiasm and support displayed on Tuesday.\n\nLike I said. I fell in line, I believed that Clinton, despite everything, was probably better than Trump. Some people felt differently and to be quite honest, I can't think of very many reasons to blame them for that.", "And net neutrality.", "This is precisely why Trump won. The public hates these safe space crusaders", "i'd love for a trump supporter to explain to me why this is a good thing. please..give it your best shot. ", "&gt; Bernie was polling 10+ points better than Hillary in all polls leading up to the convention.\n\nAre these the same pollsters that got this election so wrong?", "Shockingly just as planned. ", "The Senate Minority leader position is a position chosen by the party. It's not codified into law that the person in question actually be a part of the party. Nothing about political parties *is*. It's just long standing tradition. They can ask whoever they want to fill those positions. They probably *won't* because the whole point of it is for that person to make sure the party votes in line though.", "Sorry I find this bizarre but still funny.\n\nTrump is a normal guy like Bernie? wtf That's not how he sold himself at all. And he was already a pre-aware brand before he ran. That brand was not \"ordinary guy.\" It was \"powerful, ruthless boss.\" And its not like people were unaware he was born into extraordinary wealth.\n\n\nI feel like you are taking the John Kerry v George Bush race and forcing that same media narrative on all these people. There are definitely more insightful/justifiable ways to frame it imo.", "&gt; “If I had to do it all over again I would know a hell of a lot more about cybersecurity,”\n\nDisgusting. Absolutely zero remorse for giving an unfair advantage.", "If they try to take away your civil liberties because you're gay I will fight. This isn't about self interest it's about all people of our nation being equal and free. He's a threat to what our country stands for.", "Blame game begins and ends with the HRC and her campaign:\n\n* Terrible response to the email server for months and months like really not one competent PR person on that campaign?\n* Loaded the DNC with her buddies to avoid insurgent candidates and pissed off millennials\n* Did almost nothing to win over millennials besides sending Bernie on the campaign trail (nice way to remind them who they would rather vote for)\n* Touted \"Blue Wall' they didn't need to campaign in (ignoring the ~10% undecided there until the Comey announcement)\n* Including Wisconsin which she visited zero times during the campaign (she lost it)\n* Instead she and her surrogates spent time in Utah, AZ, Georgia, etc.\n* Never went positive with her message like ever. So much for we go high.\n* Campaign was basically 'elect the first woman' and 'Trump is terrible'\n* Got in a mudslinging contest with an expert mudslinger\n", "Election defeat will root them out one-by-one if they don't leave willingly.", "&gt; So if the Dems can hold out letting Trump appoint a SCOTUS for 2 years, they can get control of Congress, and force Trump to appoint a middle of the road judge.\n\nDems can't hold out, he's going to put it back to 5-4 conservative in the first month. \n\nAlso, even if he's terrible, and they only need 3 seats, its unlikely Dems will regain the senate in 2018.  They'll be on the defensive that year, and have shit turnout as usual.\n\nIts 2020 or bust, assuming Trump doesn't abolish elections before then.", "Maybe. Or maybe we just have better lenses through which to see how dirty elections in general are.", "Oh sweet summer child. Trump is an incorrigible creature of the right and alt-right now, no matter what he once believed. If he were to do anything even remotely progressive, it will result in a crushing uproar of rage from his ideologue base.\n\nSince his only actual goal is to bask in adulation, why should he not instead continue to take the path of least resistance, passing laws (along with Pence, Sessions, maybe Ryan) that will please his pre-built fanbase? Laws that he can now easily stream through the House and Senate to his desk, and that will not be challenged by a 5-4 Republican-leaning Supreme Court?\n\nSure, we can *try* to work with him. Obama tried to work with Congress, too. That went well. Worth a shot, I suppose, but I don't see it producing any actual results. He's not going to do anything to piss off the right.\n\nProgressive federal law is dead until 2020 at the earliest. The only question is just how much they're going to be able to undo. I think net neutrality will be pretty fast on the chopping block.", "It was more than Clinton hate. The reason Trump was even nominated was because of his populist anti-establishment rhetoric. Sanders is somewhat anti-establishment, but he appeals to a more intellectual base.", "\n\n&gt;the media hasnt learned a thing. \n\n(They never will.)", "&gt;During Thursday's debate Trump reiterated his claim that he would eliminate the Education Department and \"the Department of Environment Protection,\" his term for the EPA.\n\n", "&gt;Had Bush or Kasich been elected it wouldn't be an issue.\n\nYou still aren't getting it.", "Yea but those are uneducated white women.  Among college educated ones Clinton won 51% to 45% which is like ... uh... well, not as significant as we were led to believe.  ", "They can try. If censoring hashtags secured you the presidency we'd be saying Madam President. ", "How dare they not vote Democrat?!? Don't they know they're oppressed?!?", "I think what's most alarming is not that HRC had low turnout because well, obviously, but that Trump apparently had low turnout as well.  *Trump.*\n\nThat's somehow even more depressing.  It's like no one even cared.  We're just rabid political junkies getting our fixes off slap-fights in a sea of ennui.", "Not really.  You are in a thread where a DNC higher ip admits she cheated Bernie his supporters and the democratic process and is not even sorry.\n\nThe blame falls squarely on the shoulders of corrupt DNC leaders such as Donna.  Claiming that far left voters are mandated to vote for whoever the DNC tells tyem to no matter how bad or unethical the party and their candidate are is absurd.", "Romney was running against Obama so there is that....", "That's why every Bernie supporter needs to get organized right fucking now and start calling the DNC demanding that fucking heads roll and people be held responsible for the establishment rigging the system for Hillary Clinton! And we need to call every superdelegate who decided to stack the deck in favor of Hillary Clinton before a single vote was cast! We need to take over the Democratic establishment now! And we can start that by demanding they call us back and tell us what they are going to do to not only fix this but who's going to be held accountable for it!", "I love how the best argument anyone can come up with for why Trump won't be awful is that they don't believe he has the *power* to be as awful as he's promised he will be.  That is some seriously fucked up reasoning.", "Yup. A friend of mine posted a facebook vid comprising of some young people freaking out to the point of crying yelling, convulsing, throwing up, tearing random pieces of paper. Not a Trump supporter, but that's just media-fueled insanity.", "Like it or not Bernie is the leader of the democrats now. Doesn't matter what the establishment, or media says. He's the only one with any credibility now", "Exactly. The DNC pissed their leadership away. They are the establishment. But the DNC needs to learn that we do not worship him either. Forcing him to endorse Hillary never made me once think of voting for her.", "Bernie Sanders is the de facto leader of the Democratic party now.", "I know you Trump supporters are on your honeymoon but I hope you all have the courage to get outraged at his missteps rather than to worship his every move. ", "Oh as a bonus, ALL. ALLLLLL  All of the election polls from as far back as last December showed a coin flip between Clinton and Trump and a landslide for Sanders.  I always wanted to see a poll of a theoretical Sanders Independent run after he got shafted by the \"press\" after smashing each debate out of the fucking park even though his questions were considerably intolerant of him (which is fine if even-handed to hoth candidates....that's kind of exactly what it should be) and Clinton's questions were noticeable softballs tossed gently by the actor who plays the journalist, apparently out of character, or in a new character, The Shitty Journalist Who Sabotaged an Election. The Univision debate was a grand slam for Sanders if you watch the whole thing, especially the end where Hillary gets lukewarm applause and Sanders gets a standing ovation, which causes Hillary to pop some pill they say is just a caugh drop but is more likely lorazepam or some-such. Just a stab in the dark.  But CNN and WAPO did their fucking *darnedest* to clean up after every Sanders victory. \"The Press\" completely ignored Sanders when he was drawing 30k crowds, bigger than anyone else BY FAR. Every single poll had him beating Trump, and fucking CNN et ALL REFUSED to stop counting superdelegates in the running total even after DWS herself asked them to stop doing so (and more than likely gave a huge wink after the spot ended.) ", "His movement did bring out a lot of progressive candidates. Just Hillary's DNC crushed them into the dirt in a futile attempt to force her into power. So instead she just brought down the whole thing with her.", "Which is hilarious really considering his proposals are all far more likely to hurt the economy based on any objective analysis, or anything anyone who knows about economic theory has to say on the issue. Oh well I guess welcome to Reganomics 2.0, I am so excited to find out just how much poorer everyone outside the top 1/10th of one percent can get in the next 4 years.", "The wicked irony is that while Clinton used every trick and bent every rule in the Primary she got robbed by the Electoral College.\n\nYou know there would have been more Democrats excited enough to vote for Bernie. More cynical Independents finding a Candidate they can choose. More Republicans crossing over to vote for a man with integrity. \n\nBut Hillary put herself up as Mrs. Politician and played right into Trump's outsider appeal. ", "Tulsi Gabbard is pretty good too. She needs to work on being less robotic but she's going to go far.", "I know a truck driver who basically has said \"It might change things it might not, let's do it!\" \n\nI guess Republicans wanted some hope too. They found it in one Donald Trump. ", "A strictly business olive branch with not a word wasted.\n\nThat's all you need to say.", "&gt; we're going to need you guys to understand how badly you messed up so we can work together to start to fix this in 2018 and 2020.\n\nThat's not going to happen.  Republicans quickly forgot about the recession they left us with in 2008.", "Clinton couldn't win over [fucking hispanic](http://www.telegraph.co.uk/news/2016/11/09/hillary-clinton-failed-to-win-over-black-hispanic-and-female-vot/) voters! She was probably the worst candidate to go up against anybody...ever.", "Corey Booker may have gotten Clinton elected. I was surprised when he was not picked. Granted he made that guy up but other then that lie he was pretty well respected and would have motivated a larger number of minority voters.", "Trump supporters I hope you're paying attention. Because we're going to need you guys to understand how badly you messed up so we can work together to start to fix this in 2018 and 2020.", "He didn't pay the people he hired to do a job.\n\nWhy do these people think he is going to bring back their jobs? That they lost to automation? My god. \n\nHe spouts protectionism because he can afford to pay a 30% tax on anything and everything imported to the US just take more loans from Putin. The average person cannot. It's just so bizarre. ", "Tim Kaine looks like a guy who shows up to an orgy with a dozen roses and a DVD of Cher in Concert. He is part of the reason Clinton lost: not only did he not make up for Clinton's \"enthusiasm gap\" but he kind of made it worse by amplifying the image of robotic boredom that Clinton brings up.", "\"too much of an idealist\" was the worst they could do. What a terrible thing to be next to a criminal and a degenerate.", "No they were all trolls. Everyone that voted Trump is a racist, sexist, xenophobe.\n\n/s", "Brilliant response and I agree 100%. If he wants to do something like invest in infrastructure he should receive support.", "There's no way a guy that ran on a populist message will do something so unpopular...\n\nWho the fuck am I kidding? You clowns voted for him knowing this was his stance to spite the oppressive liberals who call you out when you say racist shit. ", "I used to think that the gun people who are scared of tyranny were crazy but it's terrifying to know that one of the amendments in the bill of rights has just been obliterated with nothing being said about it from major candidates on either side.", "Don't try to minimize the DNCs role in this. \n\nEdit: stop saying \"playing the blame game is immature\"  There were many issues with the electoral process and one of those issues was the DNCs preferential treatment of Hillary Clinton. Part of solving problems is figuring out where shit went wrong. Don't just sit there and pretend like the DNC had no role is electing Donny. Because they did. \n\nYou can't solve anything if you refuse to believe issues exist. Especially if you can't admit some of those issues stem from the leadership of your preferred political party. ", "Who? Bernie fucking Sanders. If she just offered it to him she wins in a landslide. even if he didnt accept, just the offer would have been a huge olive branch to bernie supporters. ", "Folks you at the local level have the power to clean things up.\n\nThe DNC has organizations everywhere in the country at the local level, in cities and counties. Many of those are controlled by mostly retired Boomers who are fucking clueless and blindly follow the machine. \n\nGet in there and kick them out. Obviously don't announce your intention right away. Be nice, join them, participate, and slowly bring your friends. Sometimes they even have open voting seats which they will gladly see candidates for. And once you guys have the numbers, take it over. If the old farts whine, kick them out. These are the organizations where you can run and endorse candidates at the local level, and network with the officials above.\n\nTime to reclaim that party. Looking at you, Millennials.\n\nEDIT: Thank you stranger! And thank you to anyone who will actually do this. Sincerely. And one more thing: I actually encourage young conservatives who are disgusted by what the GOP has become to do something about it as well.", "Honestly he and Bernie were the only ones to even address the plight of rural, White America. When Bernie lost the nomination, that left only one...", "No! I have a big problem with passing the presidency back and forth between a few powerful families. This election was also a rejection of political dynasties. JEB! was rejected in the primary not just because of the 'low energy' meme but also because people didn't want another Bush. I like Michelle Obama, but I won't vote for her. I also won't vote for another Kennedy, Udall, or Carter.", "Even if she was correct it's easy for them to see that the jobs they have now suck in comparison to a generation ago. Getting people employed is nice but you have to get them fucking decent jobs.", "Its sad that most will brush this off as \"fear mongering\" but its true. My girlfriend was on Facetime with her 12 year old cousin (who is Asian). We live in California and they live in South Carolina. She said today as her and her friends we at school, people were shouting at her friends and other kids (who are Hispanic) \"pack your bags\" and \"get ready to go back\". Its sad that this is already starting and its even more sad that its directed at children. This isn't a unified America. And its not what this country is about. But apparently its accepted now.", "The fact she was re-elected and not tarred and feathered and run out of town on the back of a mule astounds me. \n\nFlorida really dropped the ball on this one. \n", "she kept telling those people their unemployment was down. for some reason they didn't believe her.", "More like his *entire campaign* was a gish gallop.  We were just constantly inundated with so much **shit** that it was impossible to focus on any one thing.  Oh he thinks climate change is a chinese hoax allegedly assaulted over a dozen women, lied under oath, called mexicans criminals, wants to privatize roads, wants unprecedented tax cuts for the 1%, doesn't like wind power because it kills birds, kept a book of Hitler's speeches by his bedside... allegedly beat and raped his first wife over his hair surgery... made fun of a disabled person... advocated shooting/jailing a political opponent... I'm... fucking... exhausted...", "That is the obvious takehome from this election.   Hell Trump got less votes than any Republican Presidential nominee since 2000.\n\nThis was much more about Hillary losing than Trump winning.", "They tapped into the same issues but with different answers. Hillary just assumed that the democratic leaning people would just go with her anyway but it turns out most of them were fine with republican answer because atleast their candidate was hosting several rallies a day yelling about these issues. ", "Pretty much. He is now giving orders and other senators seem to be responding. I hope they give him the senate majority chair or the DNC at this point. He's the best chance the party has of rebuilding.", "We also need to look at some celebrities who told us to get in line and stop crying. I'm looking at you Sarah Silverman Bill maher. ", "Oh come on. The moderate white vote is why Clinton lost. Rustbelt states are left-leaning mostly-white demographic. \n\nThe DNC catered to BLM and refused to call what happened in Orlando terrorism, and by doing so pissed away a double-digit lead among white voters.\n\nPeople are so anxious to be \"over\" the white vote. We're still 63%, and still on track to be over 50% until 2045. When a third of the country wants someone serious to tackle TPP and NAFTA, you don't nominate the person who stumped for TPP and NAFTA.", "Only 20% of American citizens voted for him ~25% of eligible voters. So you're right.\n\nIt was down to a small minority movement. The next decade of American politics and global politics has been decided by working class people in rural districts of OH and PA. Which, believe it or not, make up a small minority of the total population. \n\nThey formed a movement around his false promise that he will get their jobs back, while ignoring all facts. Automation is a fact, gas is better than coal is another fact, global warming is real is another other fact. They will soon see the writing on the wall but by then America will have put off progress for far too long for it to make a difference, and the rest of the world will hopefully leave America behind. Shit isn't going back to the 1950s no matter how many times Trump repeats \"this is your last chance to get your jerrrrrbs back!\"\n\nThey will sourly be disappointed and continue blaming progressives, while Trump will keep winning big league. Protectionism will kill the nation and they will still have trouble finding work, but the only difference is they will be paying 30% more for everything they see at Wal-Mart. I would say that Democracy is a sham, but in this case the Electoral College prevented democracy from working and served only a minority of idiots who had the power to sway the biggest election in the last 20 years.\n\nNow that shit has hit the fan they are downplaying it, \"maybe he won't do what he says!\" \"look, he's cooperating with Bernie!\" Yeah, you better hope that the candidate you voted into public office (without knowing anything about his voting record because he didn't fucking have one, beyond flipflopping throughout the primary and general elections) doesn't stick to his original platform. \n\n\nedit: thanks for the gold, stranger", "If my other choice is to be Republican? Fuck no. Democrat all day. ", "It's not really surprising. \"The government doesn't work - elect us and we'll prove it\" has been the Republican party line since the election of Ronald Reagan.", "Ahhhhhhhhhh as a gay male in a very blue state who voted for Hillary this is exactly the type of shit that has made me so FUCKING ANGRY all day.\n\nHow did this fucking happen my heart is just absolutely breaking for my LGBTQ, POC, Muslim, and Jewish brothers and sisters who are not as privileged as I am to be in a position where this doesn't directly affect them as severely.\n\nI just feel so fucking helpless", "Most women don't care about a candidate being a woman or not. Just like men they have opinions on policy and everything else resulting in them voting for a candidate that aligns the most with their opinions.\n\nShock horror - women are people!", "If robotic is speaking to the point bluntly and directly I'll take that any day. I didn't get that impression at all from her, watching her speak at a few things is what got me interested in her future.", "I'd be willing to bet a substantial percentage of people who voted for Donald Trump neither know nor care what Superfund sites even are.", "Aaaaaaand here we go just a flood of this for the next 4 years.", "Clinton was unelectable in 2008 nothing changed in 2016.  ", "Downvotes incoming:\n\nTo all those saying \"get over it\" I do believe that for eight years now people have been unrelenting in their chiding of Obama.  \"not my president\"; \"he wasn't born here\"; etc rhetoric on repeat.  Crying foul and chastising his every move.  Even though it was all baseless and ridiculous.  Trump himself being at the forefront of that movement for a very long time.  \n\nNow when the shoe is on the other foot and people are mad about it they are being told to \"get over it\" and \"leave if you don't like it\".  Being called utterly abhorrent words because they are upset.  That's not how this works.  That's not how any of this works.  \n\nRemember to keep in mind that people in America absolutely have the right to assemble peacefully.  They have the right to disagree with people on the internet.  They have the right to express themselves through freedom of speech. \n\nNow add in all the hate mongering, lies, and straight divisive bullshit that has been spewed by trump and they very much so are allowed to be pissed.  If taking to the streets and assembling peacefully is how they want to do it right now, welcome to America where that is a constitutional right.  \n\nHypocrisy and hate get tiring at some point and sooner or later you have to look across that isle, no mater how divided it might seem, and realize they are people too.  They are not the others.  They are not the enemy.  They are people that share this country with you and I.  \n\nNow go on and call me all the names you want and downvote me.  I grew up a brown man in America.  I've heard it before.  \n\n\n", "Crazy isn't it? But that certainly seems to be how a lot of outlets are treating things in the wake of this election.", "The DNC is floating Tim Kaine to win in 2020?\n\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA!", "Nice try Palpatine", "What the fuck did we do", "I cannot fucking believe they haven't forced out Donna Brazile yet. The party faced a very straightforward opportunity to show voters that they still have a modicum of integrity by immediately dumping her when the debate emails dropped. They decided to pass.\n\nI'm not looking forward to a Trump presidency but if there's a silver lining it's that these choices were not rewarded at the polls and hopefully the party realizes it can't go on like this.", "Full statement: “Donald Trump tapped into the anger of a declining middle class that is sick and tired of establishment economics establishment politics and the establishment media.  People are tired of working longer hours for lower wages, of seeing decent paying jobs go to China and other low-wage countries, of billionaires not paying any federal income taxes and of not being able to afford a college education for their kids - all while the very rich become much richer. \n\n“To the degree that Mr. Trump is serious about pursuing policies that improve the lives of working families in this country, I and other progressives are prepared to work with him. To the degree that he pursues racist, sexist, xenophobic and anti-environment policies, we will vigorously oppose him.”", "I have been saying from day one that I thought our first female President should be Elizabeth Warren. She would have waltzed into the office. \n\nWhen she didn't run I supported Bernie. When he dropped out and the Repubs chose Trump I had to vote for Clinton. \n\nHonestly I never vote Republican as I am not independently wealthy and know that it isn't in my own best interest.", "as a minority. shut the fuck up. don't tell me how to feel. this is horseshit. ", "Could be because it's tied to reality which hasn't changed despite our new president.", "\"Democrats fall in Love Republicans fall in Line.\"\n\nNever forget that quote, because that's what always happens. Obama was the exception, he got people to do both. Democrats/Liberals **ALWAYS** flake out at the last second while Republicans trudge on.\n\nHappened in 2000 and it happened again.", "Yeah he consistently won polls on who would be best for the economy. Which is patently absurd. He's going to rape the economy like it's a 13 year old girl.", "...As is tradition.\n\nI've been waiting since 1992 for people to finally realize that oh shit maybe the Clintons are the bad guys here. Still waiting.", "He probably still is the frontrunner age be damned. ", "This is the issue where Trump can do the greatest long-lasting damage not just to the US, but to billions of people who will be fucked by climate change. Holy shit things are not looking good.", "This is it.  Clinton ran a \"we've come a long way baby\" campaign.  It appealed to some baby boomer woman at most.  It was frankly demeaning.  I was down voted in r/liberal for saying this month's ago and frankly I was right.  Making gender an issue was fucking stupid.  Obama would not have won had he made race an issue.", "I've always wanted to hear someone ask Obama whether he would be comfortable with the spying apparatus he's overseen falling into the hands of a Joseph McCarthy type president. I'd love to hear someone ask him this now.", "&gt; This was much more about Hillary losing than Trump winning.\n\nThis and it needs to be said and digested before Dems can regroup and reengage.", "She was a safe but boring candidate in 2008. Sexy Obama became the breakout star. This is like how California Governor Jerry Brown (my army smiles and never frowns) was the shoo-in for the 1992 Dem Primary before unknown but Sexy Bill Clinton swooped in.\n\nBernie was supposed to be Mr. Sexy this year. Hillary said \"No More Sexy Time!\" and she lost to the GOP's Mr. *Yuge*.", "Trump wants to build infrastructure by privatizing it essentially. Just a godawful idea.", "Trying your best and losing doesn't automatically mean humiliation unless you have an ego made of glass.", "My 15 year old heard similar jokes at school today. He tells me it's just his friends making jokes but he doesn't understand this shouldn't happen, this isn't something to joke about.", "Do what they always do blame Dems for it.", "He also screwed up the Hillary slogan. He said:\n\n\"America is already great because we are pretty good.\"", "I voted for Hillary in the primary. I worried that Sanders would be stuck as a single-issue candidate whereas Hillary would be able to build a broader coalition. I question that wisdom now.\n\nI live in Los Angeles. I'm well-educated and have a good career. I care deeply about progressive causes but clearly live in a bubble. I did not understand the level of frustration that so many people felt and I regret not paying closer attention.\n\nI don't know who the new leader of the Dems should be. But one thing is for sure - I'm far more sympathetic to the Sanders/Warren wing than I was just a day ago. \n\n", "Speaking as one of those moderate Democrats in a lot of ways it's the same issue of \"OMG you're treating us with disrespect\" that caused so many Berners to disdain not only Clinton but the DNC and moderate Democrats.\n\nTelling me that I'm not really a Democrat will not make me more liberal.\n\nAccusing me of being ignorant because I didn't love Bernie will not make me more liberal.\n\nAccusing me of being a shill will not make me more liberal.\n\nAnd engaging in the exact kind of internecine \"you brought about Trump because you didn't line up behind Bernie\" that his supporters fucking *hated* from us will not make me any more willing to subordinate my beliefs to the supposed political practicality of supporting the liberal wing's new cause celebre.", "Bernie is far more deserving of becoming the Senate Minority leader than that financial industry sellout Chuck Schumer (D-NY).  Chuck is too corrupt and has too many conflicts of interest to serve as an effective Democratic Senate leader.", "Obama lost white voters in 2008 55-43.\n\nhttp://ropercenter.cornell.edu/polls/us-elections/how-groups-voted/how-groups-voted-2008/\n\nAnd Romney? Romney won the white voters 59-39.\n\nhttp://ropercenter.cornell.edu/polls/us-elections/how-groups-voted/how-groups-voted-2012/\n\nWhite voters did not \"elect\" Obama, they voted for McCain and Romney. Trump's campaign really put their tent poles in the issues affecting White America the most: immigration, refugees, and Muslims, and he won the election.\n\nRace played a massive role in what happened yesterday.", "I get the economy is sluggish in the rust belt but Trump didnt have a serious plan for getting jobs back there. So what happens in 4 years when the economy is still the same there?\n", "The polling industry is done", "because of course it is. liberals are overreacting my ass this is hell.", "Better late than never I suppose, but earlier would have been much nicer!", "She is literally the loser of the election. :)", "Your argument doesn't really hold up. \n\nHe also pulled more blacks and Latinos than Romney. \n\nhttps://www.google.com/amp/www.nbcnews.com/storyline/2016-election-day/amp/trump-did-better-blacks-hispanics-romney-12-exit-polls-n681386\n\nPeople want hope they want aspirations,  HRC didn't deliver any.  She promised business as usual,  a toned down third term Obama,  and she  lost. \n\nI don't like the outcome,  but it isn't that hard to understand. \n", "You think a Republican Congress gives a shit? ", "&gt;infrastructure spending\n\nCut it\n\n&gt;creating government jobs\n\nCut it\n\n&gt;veterans healthcare?\n\nCut it", "People will be studying for months why white women didn't vote for Hillary. She basically ran most of her campaign on being the first woman in the white house.", "Hillary told them the uncomfortable truth some of those jobs weren't coming back and they didn't want to hear it. And it's only going to get worse with automation. ", "How about #NewDNC that way its not so vulgar and easily passable. Not that I don't share your sentiment, just considering the marketing.", "Bernie just became the leader of the Democratic Party virtually over night. \n\nNow I had hoped this would happen under *better* circumstances but I am pleased with Bernie's position of power. ", "there were threads months ago I remember posting, but they got lost in the noise of emails/business failure. Nobody cared.\n\nNobody cared because America doesn't give a fuck about the environment. ", "Did you bother to look into why the polls were so disparate in the Presidential election? Because you must be the 100th person to regurgitate this argument without really understanding why the polls were inconsistent with the results of the election.", "She knew her district her opponent didn't.", "Trump and Bernie supporters have been saying the polls have been rigged ever since the election cycle started. With the collusion the DNC and the media being basically proven and well, Hillary being thoroughly outplayed, you've now got a metric that is useless in the public eye. It'll be interesring to see how the industry shakes up how it does polling.", "So BAD she won the popular vote what a freakin LOSER am I right????", "Or couldn't vote apparently", "I feel like I stepped through a portal to another dimension.  It's not one of the good dimensions.", "Hillary is definitely one of the worst things to happen to the Democratic Party.", "Lots of opinion not enough education.", "If we don't let kids play in chemical runoff how exactly do you propose we'll get superheroes?\n\nCheckmate, *liberals.*", "He won the rust belt because of his opposition to international trade deals like NAFTA. He's been hammering Clinton on that point in those states for a long time and it worked. A lot of these people voted for Obama, so you can't just say it was about race and call it a day.\n\nI have no doubt race played a huge role in this election. But it wasn't the crux of everything. Economic issues ultimately tilted those formerly blue states against Clinton. \n\nAlso, turnout was about 56%, which isn't low at all. 2008 was at 58%.", "Please make her ambassador to Russia.", "Remember when Bush's [warrantless wiretapping](https://en.wikipedia.org/wiki/NSA_warrantless_surveillance_(2001%E2%80%9307\\)) was a big controversy that the Democrats used to denounce Bush? It turns out Dems don't actually care about civil liberties and executive power overreach. They're just another stick used to poke the other side when they get the chance.", "She can already see it from her back yard", "I'd vote for bark Obama ", "You're asking for rationality from people who call him God Emperor and Big Daddy.", "Bernie supporters that got pulled into supporting Hillary had the pleasure of losing twice.", "Secretary of the Interior. \n\nParks sounds nice but it also includes Native Americans and land rights. Oil rights. Eminent domain rights. Animal habitats. ", "I like how so many liberal white people are celebrating these things. They think it's destined for failure and it may well be. But as a non-white LGBT immigrant I am scared out of my mind.", "I have not seen any of them say anything about Trumps possible cabinet picks.  I think this election was just a big game to them.", "Shit I knew long time Republicans who were going to vote for him. Republicans who were sick of assholes like Ted Cruz/Mitch McConnell, but didn't want to vote for Trump.\n\nFuck the DNC. Hope the lot of them are shamed out of politics forever. ", "Yeah well..I can't really muster up much disappointment from her losing.  I voted for her but it's really not like when Bernie lost.  I'm concerned about what will happen but I feel like Hillary and the DNC are at fault here.  They deserved to lose.", "Please do Trumpster. Make that cabinet a veritable show of failure. Very bigly.", "The dnc just needs to pry her back out from the bus they threw her under when she endorsed Sanders.", "\"yea the rich are getting richer and the poor are working longer hours for lower wages but what about the bathrooms?\"", "Fuck yeah Corey Booker. Formerly the mayor of arguably the shittiest or second-shittiest city in Jersey who left it just as shitty or shittier than he found it.\n\nJust what I want in a politician at the highest levels of government. ", "Don't forget how fast people in Michigan forgot the federal government bailing out GM and the over 1000,000 jobs involved in the auto industry.  A move that was opposed by Republicans...\n\nBut you know, according to Trump voters, those are just details.", "They were returning a scratched back to Kaine for stepping down from the DNC chairmanship so DWS could step in and pave the road for Her highness", "The man has over 3500 lawsuits. I just can't believe he won.", "I sincerely underestimated the stupidity of the American public.  \n\nScotus will go red along with the senate and house.  There are no more checks and balances.", "Funny how I don't see the trumpets on these threads. ", "2020 is a census year where we redraw districts. If you thought this election was important, 2020 will define the next generation.", "Hahahhahahhahahaha\n\nHahhahahahhahaha\n\nWe're all fucked.\n\nThey think she's actually competent.", "Yeah that's the thing. This election was heavily focused on establishment vs. anti-establishment, with voters tired of the establishment and wanting something new.\n\nDNC had two candidates, one that was as establishment as they come and one that was the opposite of that. And the *fucking morons pick the establishment candidate.* How shortsighted can you be? They're the biggest idiots on the planet and I hope they suffer for it.", "Meanwhile they re-elected everyone else in government. The establishment remains. ", "Fuck it if Clinton had gotten Sanders as a running mate it would have been a landslide.  Clinton would have gotten the establishment dems on board and Sanders would have pulled in independents and more liberal voters.  That ticket would have been unstoppable.", "From here on out every single negative stereotype about America is justified. ", "This is a good point that's pretty overlooked. Bernie needed to start making his presidential push earlier.  By the time his name recognition started to pick up we were already through several southern states. If he were younger he would be the presumptive nominee next election.", "Please shut the fuck up. This election was lost by discounting legitimate concerns and complaints of regular middle class Americans and claiming rascism and sexism instead. \n\nAre there racists? Yep. Do the white ones invariably end up in the republican electorate? Yep. \n\nBut it is intellectual lazy and negligent to write off our loss to racism and not learn the actual lessons. \n\nClinton was a deeply flawed candidate that couldn't garner the enthusiasm and support to win even many reliably democratic areas against... Donald Fucking Trump. \n\nLet's not let the DNC make our decisions for us next time yes?", "Seriously it's like a bunch of idiots in the Midwest are pining for the 'good old days' where they had their low-skill manufacturing jobs and all was good. They haven't woken up to the fact that *those days are fucking gone*. They aren't coming back, unless you're willing to accept the same wages people accept in 2nd and 3rd world countries. They're the ones that have failed to adapt to the changing economic climate, and instead of trying to bring in people that might actually do something useful. . .they vote for a lying, conceited pile of orange crap that tells them whatever they want to hear, without any actual *plan* for getting it done.", "If Warren had a real progressive backbone she would have endorsed Bernie in the primaries. ", "Trump even said the government should have let the auto industry go under.  And those fools voted for him anyway.  It's crazy.", "For anyone who wants more of an explanation I'll repost a prior comment\n\nCory Booker may be socially liberal but he has far bigger problems than just what you listed.  The Newark Watershed case involving the FBI and US Attorney is still ongoing you are right that only one decent scandal is not much for New Jersey but that should not make anyone feel better about him.\n\nHe was also still on the books at his former legal practice that did business with Newark until 2011.\n\nThe city still has an incredibly long way to go and childhood poverty continued to rise as much as 32% during his time as mayor, not that this can all be attributed to him but his term was nowhere near transformative at the average individual's level.\n\nMany feel the way in which he handled the REDEEM Act was political pandering as he never galvanized actual support or public discourse for what was supposed to be one of his core principals.\n\nHe opposes repealing The Patriot Act.\n\nHe endorsed Chris Christie's property tax agenda. If you are familiar with the NJ property tax system this is especially infuriating.\n\nHe was the largest Democratic beneficiary of campaign contributions from the financial sector during his 2014 senate campaign.\n\nOpposed CISPA for political points but failed to speak out against it's addition to the 2015 omnibus legislation.\n\nHe is another Third Way kind of Democrat.", "The one that was removed from the Democratic National Convention speaking slot at the last minute without fucking being told so until she showed up to speak? The one that DNC establishment spit on while they coronated an unwanted Clinton and pantomimed \"unity\" by silencing anybody who so much as smiled warmly at Sanders?\n\nTulsi Gabbard would be fucking awesome. It would go a long way towards making it clear that they actually want our votes.", "While reassuring we have a Republican Senate, House, SCOTUS, and Presidency. The Democrats need to get back in there, and I hope they will be able to penetrate the working class base better than they did this election.", "I mean Hillary repeatedly talked about retraining for the jobs these people are losing that are never coming back. But Trump lied to them and told them he'll bring them all back so I guess he's better.", "Woof! and change.", "Change like that will not come unless we demand it. Join me:\n\nWho's with me in calling and contacting people every day until they clean house and replace all of their officers? I am trying to spread this idea. We NEED to get them to clean house.\n\nPhone: 202-863-8000\n\nContributions Phone: 877-336-7200 (probably more likely to answer)\n\nContact Site: http://my.democrats.org/page/s/contact-the-democrats", "There was a pervasive effort to paint supporters of anyone running against HRC as out of touch with minorities women and LGBT folks. This began subtly with her primary race against Bernie. The media could hardly discuss Sanders' success without mentioning that he was doing well with white males. At first I didn't think anything of it, but the frequency of this messaging became obvious. It was their way of signaling to minorities and others that Bernie was an old white man who only cared about white males. Nobody in the traditional media had the nerve to challenge Hillary's claim to ownership over minorities/LGBT/women despite her super predator remarks and history of being anti-gay marriage... even when a photo emerged of Bernie being arrested during a civil rights event decades ago. This tactic may have garnered her some support from underrepresented groups, but it also had the opposite effect of chasing away more of the white vote.", "I take it youve learned literally nothing in the last 48 hours about the representative sample of political supporters on social media as compared to the actual voting electorate", "Bernie as always takes the high road - while indicating he's not willing to give up on principles or tolerate that in others.", "Brown person here not even a least bit worried except about the stockmarket uncertainty.\n", "are you fucking kidding me.  Doing away with net neutrality was one of his positions.  He even stated it (several times).\n\nWTF.  Did you actually vote for him not knowing this?\n", "She was already picked before the first primary vote was cast. Read Wikileaks.", "ALSO:\n\nWho's with me in calling and contacting people every day until they clean house and replace all of their officers? I am trying to spread this idea. We NEED to get them to clean house.\n\nPhone: 202-863-8000\n\nContributions Phone: 877-336-7200 (probably more likely to answer)\n\nContact Site: http://my.democrats.org/page/s/contact-the-democrats", "Yeah but that would be so...democratic?", "That's the problem. It's a - pardon me - trickle down effect in terms of violating our constitutional rights. The popular one to violate today is the 2nd amendment and not coincidentally, it's the one alongside the 1st amendment that you *really* need to whittle away in order to get to the others. \n\nHillary Clinton once used the \"No Fly\" list - which does not allow you due process - to justify taking away your second amendment right.\n\n&gt;\"If you are too dangerous to get on a plane, you are too dangerous to buy a gun in America.\"\n\nTo the sound of applause. Meanwhile, the 14th amendment states...\n\n&gt;No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, **without due process of law;** nor deny to any person within its jurisdiction the equal protection of the laws.\n\nBah, that's not important. It's just protecting gun nuts. That would never apply to my other constitutional rights.", "Trump basically is all the stereotypes personified. ", "Because \"REAL AMERICA\" is fed up with your crap and wants their $30 an hr (in 1972 dollars) unskilled factory jobs back in their rural forgotten rust belt towns. They are obviously automatically ENTITLED to great jobs/benefits due solely to the fact they are native born heterosexual white males (unlike the welfare queens/lazy immigrants and their so-called entitlements). Working hard to get a job or getting an education is for sissies and nerds. They need to go back to the \"magical\" time when women could never be their bosses, men were \"men\", minorities had to call them sir and guys could get away with all the sexual harassment and spousal abuse they wanted without the PC police being all over them. ", "Plenty of people voted for him because establishment emails, and Benghazi. Fools. ", "No because the media has never reported such a thing", "Personally I'd pick Tulsi Gabbard.", "Don't worry so much. I went through two Bush presidencies as a progressive. We built a huge anti-war coalition that became complacent after Obama got elected. Trump has awoken this coalition literally as we speak. He will be marred by protests and direct action if he doesn't stick to working class issues. ", "Highly polluted sites designated under a federal law called CERCLA for long-term management and cleanup.  CERCLA authorizes the EPA to designate the sites and for the most part the federal government puts the burden of paying for management/cleanup on the responsible party (usually a private business), or at least tries to.  It's kind of critically underfunded already.", "gerymandering is a big part of that problem.  not just lack of term limits.  ", "Have you ever considered that the media might actually be biased?", "Obama lost blue collar workers also.\n\nWhat killed Hillary was voter turnout.  Trump got fewer votes than Mitt Romney did 4 years ago.  In fact Trump got fewer votes than Hillary Clinton (she won the popular vote).\n\nBut there are over 6 million people that voted for Obama in 2012 that did not show up to vote yesterday.", "This is what happens when your credibility with the people is so low that they choose to believe known lies over the truth you tell.", "THIS RIGHT HERE! \n\nThis is so true. Do you know what number I would need to call to ask someone about this? \n\nI'm more than willing to put in some time for a cause so overwhelmingly deserving. ", "that's the real kicker here they blamed Obama for 2008 crisis, he ended up being blamed for Iraq, blame for the Congress that said preemptively they refuse to work with him, he was blamed for not enough intervention in Syria and threatened that he'd be blamed for too much intervening in Syria. He was blamed for the toothless Healthcare law that was structured to appease Republicans by being modeled on previous republican Healthcare systems implemented by Romney, he's blamed for increases to the surveillance state that was expanded under the Patriot act revision in 2006, he's been blamed for not closing gitmo, something no president has ever been able to do even before W because it requires congress. And he'll be blamed for the diplomatic and economic catastrophe that has already occurred just from trumps 100 days declaration. Guy can't catch a break", "The DNC did what its corporate masters wanted them to do.  It's not a mindblowing mystery.  Corruption is legal in this country and the DNC was captured by corporate interests which is why they sabotaged Bernie's campaign.", "Bernie would never want to be VP. Why be VP when he can be more effective as one of the most senior Senators? He would have no power as VP and could get more done in the Senate. ", "I think there are **tons** of people like you who voted for Clinton in the primary who understood her faults, but agreed with her policies the most. I think you were not just reasonable but **morally right** to vote for the candidate who represented your beliefs the best.\n\nI think the people who are to blame are those who either actively undermined the primary process, which is supposed to choose a good candidate for the general election, those who perpetuated misinformation or bad arguments to vote for Clinton, such as her general election winnability, and those who suppressed good information about her problems.\n\nI also blame the countless Democrats who perpetuated, and continue to perpetuate, that Trump only cloud win/did win because so many people in the country are racist/sexist/homophobic/Islamaphobic/etc. It's possible that if you took all the bigoted people out of the country, Trump wouldn't have won, but Trump's win was also because a lot of decent people are facing real problems that Clinton mostly ignored. Bernie's statement I think is totally accurate here:\n\n&gt; Donald Trump tapped into the anger of a declining middle class that is sick and tired of establishment economics, establishment politics and the establishment media.  People are tired of working longer hours for lower wages, of seeing decent paying jobs go to China and other low-wage countries, of billionaires not paying any federal income taxes and of not being able to afford a college education for their kids - all while the very rich become much richer.", "Make America pretty good again.", "Yet trump got a million fewer votes than Romney Republicans didn't want this guy. \n\nClinton got six million fewer votes but still won the popular vote. Dems stayed home because they weren't enthusiastic about her but assumed she would defeat trump, big mistake.  ", "I know. The fucking morons I'm referring to are the DNC establishment.", "Exactly. Even if we somehow got unemployment down to zero it isn't a good thing if most of the jobs are service jobs that pay an unlivable minimum wage. ", "Personally aside from some of the things that he mentioned that can never happen like the wall I agree in a lot of ways. The DNC looked at half of their base saying \"we hate your establishment nonsense\" and they said \"nah you'll fall in line\" and got surprised when they didn't. They gambled poorly and would have had a lot more luck expecting establishment hacks to fall in line with the Bernie pick.  \nThe problem though is only like 1/2 Trumps behavior and the other important half is the GoP representation that supports him is all just as bad as everything they hate about Hillary and worse and they now have a majority in every aspect of our government.", "They could have invested in retraining programs the first time around when they signed agreements that closed down those jobs. Why would the people who got screwed the first time assume democrats would do it any differently this time. \n\nTrump is probably not going to do anything positive for those people, but they're desperate, and they voted for him because they were willing to take the chance. Democrats gave up on the poor and middle class to cater to their corporate donors, so it's not a surprise that they lost so heavily in the rust belt. ", "i completely agree. Thats why simply offering the position to him may have went a long way to consolidating the party. Its called having your cake and eating it too. ", "Sadly Bernie's probably too old to run again. Warren has the authenticity and progressive backbone we need.\n\nI don't think it has to be her next time, but it has to be someone LIKE her and Bernie.", "FUCK THE BLAME. How do we fix it?", "He's already stated that it was an attempt for Government to take over the internet.  Give it up The Republicans and Trump want net neutrality gone ... it will be gone within 6 months of his taking of office.\n", "There are only two real things that worry me about a Trump presidency. The privatization of roads infrastructure projects, (everything). Obama-care, I got my insurance because of it, pre-existing conditions are a bitch. ", "There are other parties you know...\n\nOther parties that desperately need to get 5% of the voters. Perhaps you should vote for them.", "There's another reason.\n\nEverybody thinks THEIR congressperson is \"one of the good ones.\"", "Lyin' Ted Cruz definitely stuck too. The 'Complyin' Ted' moniker when he finally endorsed Trump was brilliant.", "Anyone with a functional brain knew this was coming.\n\nLook at the people closest to the campaign. The shills the surrogates, and the loudest supporters. Those are the ones who will run the candidate's Administration. \n\nWe all knew Newt, Palin, Christie, and Rudy were on board.\n\nFor some reason the American people thought that he would just tell them all to go fuck themselves and pick a bunch of people from academia or something. Morons. ", "Lifelong republican here from Texas. I admired Bernie for his honesty and would have voted for him based on that one trait. I know his policies had no chance of implementation but a honest politician is to be commended. I held my nose and voted Trump only because I could not support a career and corrupt Clinton. Your party had a real chance had Bernie been your choice.\nHope Trump unites the country and good luck with your internal problems that need to be addressed.", "I felt the Bern hard still have a forlorn little sign in my yard, but I really don't know how we can say this with even a modicum of certainty.", "No really?\n\nThe Republicans in North Carolina are fucking [publicly gloating they suppressed the black vote.](http://www.vox.com/identities/2016/11/7/13552832/north-carolina-republicans-black-turnout)\n\nYou have legislatures and political parties running an election what do you think is going to happen.", "Ask not what your owners can do for you ask what you can do for your owners!", "Trump has always been against net neutrality. We'll see what happens when he takes action on it whether his support will be so high.", "No he actual said and I quote that we would be doing (again I am quoting): \"far worse\" than water boarding.\n\n\nNow Reddit can explain to me how Trump is actually sort of \"moderate\" and probably not that bad because drr TPP and drrr emails.\n\n\nYou fuckers deserve every iota of suffering that is going to come your way. So sad so many innocent people have to suffer because of it though.", "3 words....\n\nDebbie Wasserman-Schultz. ", "&gt; The reason schools near me are already dealing with kids yelling \"go back to your country\" and providing counselors to refugee families is because of the actual policies Trump has wantonly prescribed.\n\nGod this is so sad and disgusting. Those kids and their parents are shameful. Good on the schools for providing counselors, but it's beyond sick that there's a need for them in the first place.", "&gt;I think that's what they were trying to do.\n\nNo...They were returning a scratched back. TK stepped down from the chairmanship of the DNC in order for DWS to step in.", "&gt; Which is hilarious really considering his proposals are all far more likely to hurt the economy based on any objective analysis, or anything anyone who knows about economic theory has to say on the issue. \n\n99% of the voting populace is stupid to these things.", "This is how you know Trump supporters weren't really in it for \"change.\"", "Yea all the democrats say how jobs bounced back and we're under 3% unemployment or whatever. Your stats mean nothing in your echo chamber when they don't include VAST sums of people on disability and the jobs that have returned to replace all those full time decent paying manufacturing positions or small time business are big time retail or service jobs that only give out part time hours (so no benefits) and minimum wage. IE, Walmart.", "WE need to kick her out. They showed us that they are not going to apologize. We need to put pressure on them NOW while outrage is still high.\n\nWho's with me in calling and contacting people every day until they clean house and replace all of their officers? I am trying to spread this idea. We NEED to get them to clean house.\n\nPhone: 202-863-8000\n\nContributions Phone: 877-336-7200 (probably more likely to answer)\n\nContact Site: http://my.democrats.org/page/s/contact-the-democrats", "\"America: This'll do.\"", "Sanders isn't a Democrat and the DNC doesn't like him anyways as they are trying to blame him for this loss. Fuck the DNC", "And oddly enough Trump took them both out.  \n\nHe really is political chemo-therapy (not original to me).", "Tbf she also said Obamacare would bring about death panels to kill your grandparents.", "Yeah but with a black spiteful heart.\n\nThat type live forever. Just look at Cheney.", "I don't think Chelsea wants the spotlight.\n\nThe Clintons are gone from politics. Thank god.", "My favorite idea is to head propagandists off at the pass. Print out a copy of podesta leaks advocating Trump. \n\nPrint out a copy of the chart showing that even if you took all of Jill Stein's votes and gave them to Hillary she'd only pick up one rust belt state. \n\nPrint out data that shows Gary Johnson is a spoiler for Trump not Hillary (she'd have lost heavier if Johnson hadn't run).\n\nThat way when the media unloads their blame list democrats at the local level will see it and stop listening to bullshit artists like Maddow. \n\nCredit for idea goes to Ben Dixon: \nhttps://twitter.com/TheBpDShow/status/796399014598103040", "It seems the profit-driven media spent way too much time on Clinton's e-mails than on substantive policy analysis. ", "[He's off to an impressive start.](https://theintercept.com/2016/11/08/trump-transition-lobbyists/)", "Yeah with a governor like Christie anything's possible!", "The fucking states that cost Hillary the election were some of Bernie's main support states if I remember correctly...", "As an Australian watching the US election from a distance the level of anti-intellectualism that must exist over there is astounding.", "DNC fucked up", "Idk I heard they gave the job to that Apprentice guy, the one with the hair. ", "This isn't even about the DNC at this point. Technically a third party candidate should be allowed to run against the republicans and democrats and still receive just as many endorcements, if not more (in the case of Bernie Sanders). I understood that he dropped out of the race because he was afraid that splitting the vote between two humanistic points of view would give the republican an edge, but she could have done the same thing and let him run for the DNC because he was more likely to win, but NOOOOOOO!!!!!!!~~ it was her turn to win and now she has destroyed the entire United States because of a terrible campaign strategy. Never once did she try to win the middle aged white blue collar vote back by defending herself; she had the fucking ability to explain what actually happened during the Russian trade deal, what actually happened with the emails, and what actually happened with her involvement in Benghazi. Except she left her defense to the media for TV show hosts like John Oliver to explain, who, let's face it, typically aren't on the television screens of the middle aged white blue collar workers. She didn't want to be our president, she expected to be our president. After all this time fighting, to lose because she got cocky - it's an embarrassment. ", "Not like this.", "Man this is why Hilary lost. The condescending way you call them 'oppressed whites' instead of what they actually were-- disenfranchised. Of course they're not going to be on your side because you don't even understand that you're being totally dismissive to any problems they might have by calling them \"oppressed.\" You don't have to be oppressed to long for change, and you don't have to be a minority to have problems.", "He isn't a Democrat though. He definitely needs to fill out that paperwork before the next session because Bernie is the de facto face of the Democrat Party and liberals will be turning to him for guidance and hope. ", "Gore lost to a buffoon because he was less charismatic Kerry lost to a buffoon because he was less charismatic, Clinton lost to a buffoon because she was less charismatic. Meanwhile, Republicans come out and vote for their pile of shit candidate rain or shine.", "Wow r/politics not 100% falling for cheap left wing propaganda? It's a miracle ", "Steve Bannon did not do all of that work to throw a bone to coastal liberals.\n\nFor all of Trump's conciliatory language last night never forget who's in the engine room.", "It was quite literally. Just another sport like the superbowl to choose a team and root for it. They won and now think they deserve trophy. As if the other half of the country (and seemingly the majority) was going to be  \"good sports\". Newsflash for them the game doesn't end. ", "The problem was that the establishment really didn't want either Trump or Sanders. The DNC knew exactly what it was doing when it shafted Bernie. \n\nThe difference between the parties was that the Republicans didn't have a mechanism for taking out Trump but the DNC had one for Bernie. \n\nI mean maybe Bernie wouldn't have won in a fair fight, maybe, but they sold their souls to the devil to secure HRC's victory. \n\nRegardless of how effective it was or wasn't, the DNC lost a shit ton of supporters for the way they treated Bernie, for the way they treated his supporters, and the way they treated the issues he spoke so passionately about. \n\nTrump was the biggest fuck you to the establishment that this country could put together, and against all odds, enough angry people managed to cobble enough votes to give a massive \"fuck you\" to the establishment. \n\nI echo Sanders, to the extent he intends to help the working class I'll support Trump, but to the extent he does something untoward, I'll vigorously oppose him.. having said that, good fucking riddance to Hillary and DNC's outright corruption. I hope they don't ever try and pull that shit again. ", "I wouldn't call them idiots. I live in the midwest in one of the larger cities. I'm a super-flyin' liberal but I can completely understand why the folks in rural areas are angry. \n\nIf you drive through the midwest you will see boarded up storefronts, empty houses, a lack of growth that hasn't happened since the factories started shutting down and moving away. They didn't see any economic recovery, not since the 90's and perhaps not since before that.  These are folk with just a high school education, who just want to work and support their families. The only living wage jobs left in their area may be the coal factory or working in strip mines or going out to job sites to build oil pipes. Jobs that yes, not good for the environment and not healthy spaces to live near but... that's what they have. That is what keeps food on the table. Families like this have stories about dad or grandad working their entire lives at a factory with union wages and retirement benefits. Something they were denied when that same factory laid off workers and moved to places where the work could be done cheaper. They've been feeling shit on by the rich party establishment for decades, got disillusioned when Obama didn't deliver in his first few years of office.  Some are racist, they never spent any time around anyone who was not like them for most if not all of their lives and fear the 'other', fear losing their jobs or fear being forced to change. The DNC ignored these people, in some ways they mocked them directly thinking they were just small town ignorant folk, not numerous enough to court. The RNC ignored them too, has for decades as well but Trump figured out how to appeal to them directly. Appeal to their hopes as well as their fears. 'Making America Great Again' is about bringing back living wages to the rural parts of America for them, keeping their kids safe from what they fear. Change. We can laugh at them for their fear of having their guns taken and being forced to pray in a mosque but this is what people honestly believe. \n\nSome can't afford to move, many don't want to and why should they? Industry left them and their towns behind, replacing them with nothing. Some whole states like West Virginia and much of Kentucky are like this, but there are folks like this from eastern PA to west of Colorado. These folks are hard working folk, that don't want a handout. They aren't cut out for college, not because they are stupid but that's not everyone's path. Even so going for higher education doesn't guarantee you will get work.\n\nThey voted for Trump because he was the only guy who spoke to them. It's why they don't care about the lying and the politics of his running mate. They think he will bring prosperity back to them. I think they would vote for anyone regardless of party who would truly give that back to them. \n\nI don't have an answer to this, I just know what I see when I drive through rural areas and visit friends who live in small towns. Those places have been dying for 30 years or so. Those folks just want to hope again, work again. I don't think that makes them stupid. ", "This needs to be brought up every time CNN says \"WHAT HAPPENED?\"", "In the exact same way I don't want to elect someone because of their last name I don't want to rule out someone because of their last name.", "Why cant someone care about both class issues and civil rights? Bernie literally addressed that in the OP.", "Good thing we cleared that up sorry that we had to in the first place. ", "This type of stuff really does need to be cleared up so people don't use false information to fear monger. Just like some use the idea of immigrants coming to take your jobs and rape your family there is not a large cohort of people with KKK robes in their closets ready to smash the windows of all the Jews in town. ", "They'll all be back in 2020 with democratic candidate for president Jeb Bush. ", "Why would liberal white people celebrate these things?  I'm one and this is terrifying.  ", "New campaign slogan: \"Jeb???\"", "&gt; Jesus Bernie's economic message was pretty similar to Trumps, which got him elected.\n\nBernie wanted to give massive tax cuts to the wealthy, deregulate the financial market, start a trade war with China and Mexico, and eliminate the estate tax?", "I mean their subreddit was and is fucking ridiculous. They weren't all trolls by any measure, but they trolled almost constantly. I don't get why T_D became president meme, but it is what it is.", "That's exactly what happened with my dad who is a republican. He thought I was being silly getting all excited about Bernie but then late in the primaries he started listening to his debates (because he couldn't stand listening to the republican debates) and ended up really liking him. He obviously thought a lot of his views were extreme and didn't think he had any idea where he was going to find the money to fund half of his ideas. But my dad could tell the guy was honest and only wanted the best for the country.", "I've just noticed on here at least a lot of Sanders supporters are glad about this. They're glad Clinton lost. And others believe that because Trump will put together a disaster it will look good for progressives 4 years later. I don't entirely disagree but I don't think what's going to happen these 4 years is going to be good. I need a hug.", "This is definitely the darkest timeline", "That or 10 million people who sat at home yesterday.", "Is pancreatic cancer worse than stomach cancer?", "Some Americans with fake credentials are taking jobs. Some Clinton supporters are white supremacists. ", "I know that the DNC fucked up with Clinton but this doesn't excuse why the hell did we have such a massive red wave down-ballot, though.", "I think this is a good piece that touches on it.  I think it's important to be able to empathize with (or at the very least understand) Trump's supporters and their motivations.\n\nhttp://www.cracked.com/blog/6-reasons-trumps-rise-that-no-one-talks-about/", "\"Communist\" is what you would have heard instead ", "Find a way to get the left to turnout consistently for silly things like the Supreme Court climate change, debt free college, etc without needing a fucking idol to flock to. ", "&gt; bernie acknowledges that this is not what trump's huge support is about.\n\nIt's not what it was about but he would have never won without it. Hate is a very powerful motivator.", "Did you watch any of his rallies he talked about 20 different issues all in an hour? \"single issue candidate\" was a Clinton camp talking point, Im sorry you fell for it.", "Maybe because Democrat voters secretly hate her and in 2008 nominated a total newbie over her because they hate her that much", "People didnt want either of them thats why the lower turnout. Not because they thought hillary would win easily. Hillary is a failed candidate propped up by the DNC and MSM", "The storm has settled and now the facts are coming in ", "Fuck Debbie Wasserman Schultz.\n\nFuck Donna Brazile too.\n\nFuck Nancy Pelosi and good riddance to Harry Reid.\n\nWe need to rebuild the Democratic Party from the ground up and we need the party leadership to be Elizabeth Warren and Bernie Sanders.  I'd rather we form a meaningful third party, but that's not realistic since it takes 65 million votes to win a presidential election.  In 1992, Ross Perot managed to get nearly 20 million votes on election day, which wasn't even enough to win one single electoral vote, let alone 270.  I don't think forming a third party is a realistic option for success, so we need to rebuild the Democratic party from the ground up.", "Man those were some super-fun protests regarding the invasion of Iraq.  People spitting or throwing glass bottles as they drove by, calling us un-American and yelling for us to leave because we're not patriotic enough.  As if patriotism can be directly measured by the size and quantity of American flags you have strewn and adhered to your property.\n\nI can not WAIT to go through all that again.", "DWS was the best thing that ever happened to the GOP. Can you believe how many seats they won under her reign.\n\nI mean holy shit they even got Donald Trump elected president. The guy who everyone's been laughing at for decades. ", "Correct. Obama is not on the side of the people.", "I swear to god the Left better unfuck itself.  The Republicans use to be the party of fear and now the Left has taken that from them.  But with the internet it is so easy to debunk something really quickly and the Dems have not caught on.\n\nStop lying to get the fear vote.  Stop stop lying to scare people into staying loyal.", "That's unacceptable behavior. ", "Again you're pissed about corruption and the establishment so you voted in a man who is even more corrupt and was born into the corporate establishment?\n\nWay to send a message to \"the man\"!", "Ask any Sanders supporter to name his major campaign platform and most people would say: Medicare for all.\n\nAsk any Trump supporter to name his major campaign platform, and most people would say: Build the wall\n\nAsk any Clinton supporter to name her major campaign platform, and most people would say: Oh, umm... Uh... I'm with her?\n\nClinton did almost exactly what John Kerry did in 2004 and ran an entire election on \"I'm not Donald Trump\". She did not articulate a clear vision at all and did not give voters a cause to vote for. ", "Because you can't pretend to care about class issues while mocking people (or smearing them as racist/xenophobic/whatever) in low to middle class situations for concerns over losing their jobs and stagnating wages caused by cheap labor and imports created by trade deals and illegal immigration.", "He was impeached for purely political reasons.\n\nHe lied about receiving a consensual blowjob from an intern. \n\nThe president after Clinton lied about invading a country but wasn't subject to impeachment.", "Really you should talk to the Clinton supporters, we are on the same page", "&gt;Trump garnered fewer overall votes nationwide than John McCain and Mitt Romney the past two losing GOP nominees, did in 2008 and 2012. As of this writing, with almost all votes counted, Trump has tallied 59,611,678 votes; Romney pulled in 60,933,504 in 2012, and McCain 59,948,323 in 2008.\n\n&gt;By comparison, Hillary’s 59,814,018 votes (which won her the popular vote, but not the Electoral College vote) is considerably less than the 69,498,516 Obama got in 2008, and the 65,915,795 he received in 2012", "Bush was a politician trained in how government works. He surrounded himself with people who understood how government works. He was a mess but he knew how to keep the lid on at least a bit. Trump has no fucking idea how to do this and has surrounded himself largely with people who have no fucking clue what they're doing. This is far, far worse. \n\nThis is the first time in American history that someone has been elected to the presidency with literally zero experience in anything government related. This has literally never happened before. There is no precedent set for this. None of us know this is going to be alright. ", "2 black guys in their 20s beating up an old white man in his 60s but we are supposed to be afraid of Trump supporters....\n\nThe media just can't seem to get with the new program. ", "Both parties do that shit tho tbh", "He's the dog that caught the car. ", "&gt; The media could hardly discuss Sanders' success without mentioning that he was doing well with white males. At first I didn't think anything of it but the frequency of this messaging became obvious.\n\nI'm not even a Democrat but I pointed this out a few times. I was asking friends, \"Why do they keep dividing it up like he *technically* did well here but *not really* because not enough minorities voted for him so it didn't count.\" It was a bizarre narrative to create, especially since the Clintons had invested so much political capital into the minority votes all while completely screwing minorities over in the 90s.", "...however isn't it a fair observation that globalization isn't going to be reversed as dramatically as would be required? We're likely not going to see textile mills come back to support small towns. More jobs are being reduced by automation and consolidation - even those of us in IT see these trends.\n\nTo currently be ~40+ and unemployed is a MUCH steeper hill than many folks consider. Millenials are having issues starting and those who have been in the grinder and spit out just as they're entering the 'too old to retrain effectively' age are not going to transition well... I believe that is where a big portion of the \"We'll retrain you for BETTER jobs!\" fell flat - everyone's getting sick of the \"we'll sell you an education and your life will be infinitely better\" line.", "They don't deserve such a cool name. How about NADs? Not Actually Democrats.", "she got crushed by the working class vote what people have a hard time accepting is that not everyone cares about social problems. the DNC pushed too hard on social issues and didn't focus enough on...... well anything else. The message was trump is a sexist racist homophobic and anyone who supports him is as well. Well guess what im none of those thing and i support him for reason that has nothing to do with bull shit social issues.", "He delivered Virginia.", "The real question is what is gonna stick. Are LGBTQ individuals going to lose rights? Will environmentalism be abandoned? How will he actually conduct himself with other leaders?\n\nHopefully he is there to gunk up the works of those who would like to regress like Pence. ", "\"Atheist\" would have been thrown around like a huge insult.", "Uhh I think their opposition to free trade is where their common ground on economics ends.", "I've hated that woman for years since Bush. She's as fake, plastic, and bought and sold as it gets for the Democratic Party. \n\nShe's been a train wreck for a long time. She was, indeed, a god send to the GOP and Hillary's backing of her only hurt her further. Giving her a position after being taken out of the DNC in disgrace was an abhorrent move and a clear indication that she did not give a damn about the democratic base. She took us for granted. ", "No Hillary is *hated*. I fucking hate her and I voted for her slimeball ass. John Kerry? He's a bit of a wet rag to most, but he's not vilified. He could've won. Pretty much anyone who wasn't Hillary could've.", "He has railed against billionaires his entire career.  \n\nHe was Trump's kryptonite.  Hillary did him a huge favor by putting him away in the primary.", "I find it interesting the GOP supporters claim \"not racist\" yet in this article they link directly to a NC GOP letter praising the low early voting number of African Americans and high white turnout. ", "Yes. The other part of the story is that Clinton couldn't turn out the Democratic base. That's five Presidential elections in a row that were won by the candidate who did a better job turning out their base not the one who appealed to some elusive mushy middle.", "I know it's not required. THATS THE FUCKING POINT. You do it ANYWAYS so the   public (whom your serving) knows you're not a two-bit grafter deep in someone's pocket. \n\nJesus Christ the rubes in this country...\n\n(Not speaking to OP; I mean more the royal rube)", "Idk what is with the obsession some of you guys have with white males. ", "&gt; Dems stayed home because they weren't enthusiastic about her but assumed she would defeat trump big mistake.\n\nDems stayed home because she's an unenthusiastic candidate with a even less enthusiastic running mate.", "During one such interview in September of 2008 ABC’s Charlie Gibson posed this question: “What insight into Russian actions, particularly during the last couple of weeks, does the proximity of this state give you?”\n\nTo which she gave an earnest, but widely ridiculed, response: “They’re our next-door neighbors. And you can actually see Russia, from land, here in Alaska, from an island in Alaska.”", "That happened from 2002-2004. We went to Iraq in that time period but remember there were a lot of blue dog dems that had to vote for it to happen. I think we will see the same obstructionism the GOP gave Obama", "And libs can't figure out why they got their asses handed to them yesterday.\n\nAs another commenter pointed out if this were Trump supporters on a Hillary voter this would be all over the news for days/weeks/months.\n\nAmerica sees who the racists are. The big lie ain't working any more.", "Secret is a strong word", "The description in the video is horrific. Apparently the guy got his car and cell phone stolen and is suffering from brain damage. \n\nEdit: Internal brain damage to brain damage. ", "I'm a small business guy. I don't think I could ever have voted for Sanders for the simple reason that any time he was asked how he would help small businesses he defaulted to talking about how he would make loans more affordable for small businesses. I don't need a fucking loan I just want you to give an answer on how your policies won't absolutely fuck me being that I gross a lot of money every year and net not so much, and unfortunately he never seemed to understand/address the difference between gross income and net income or what ideas he has for people like me.\n\nAll that said, while I disagree with Sanders on a lot, I'm fairly certain in my heart and mind that he is at least genuine. I may consider him misguided in ways, but I have no question that the guy cares. More than you can say for a lot of people interested in getting elected.", "Good luck with getting hc supporters to admit it. They still think she can't do no wrong and its everyone else's fault. hc herself thinks the exact same way too. lol. ", "She has a lot of credentials already I hope she becomes the next progressive candidate. I believe she can become the next President of the United States!", "\"America: A legally recognized geographical area.\"", "is it any worse than Guiliani?", "I pray that trump will reveal his moderate/liberal nature now that he has won.  I pray", "The right is playing dirty because they need to. There are more dems than republicans out there they just maximize their voters while ours need to be courted. I suppose another solution would be ultra aware of all new voting rules for the next cycle and make sure people are registered and ready... Maybe even by voting in 2018. Shocking idea, I know.", "As someone who grew up and who currently lives in rural America (Southern Utah to be exact) it's been fun hearing how there are so many jobs but looking around will tell you they all want a degree, experience in the field, and to start you off at almost minimum wage.", "At least he'll be growing up in a country where if he cheats and schemes to become rich, he'll be able to grab pussy with impunity... so he's got that going for him, which is nice.", "The election was won because Trump talked about jobs.  He won the pocket book vote because peoples income have gone down.  The average Trump supporter use to make $30 an hour before NAFTA and now makes $15.", "Of course she was. The media kept reporting that she was hated because she was so liberal but the truth is she was not trusted by the base because she is a neocon and the proof of the is born out in the policies she adopts and the things she says behind closed doors. I told everyone I knew that this would happen and everyone laughed at me. Literally laughed at me and told me I was crazy and this was impossible. I'm incredibly liberal and I was told I was a Trump supporter just because I didn't believe the bullshit and I thought the party should have gone further left because people were clearly ready for it. So here we are.", "Some Sanders supporters some who say Clinton too corrupt, some who threw their votes away. Maybe even a few of the  15,000 Harambe voters.", "I get now. I totally get it. This was the biggest 4chan prank ever.", "[All 8 thousand of them!](https://www.splcenter.org/fighting-hate/extremist-files/ideology/ku-klux-klan)\n\nBut sure. Be afraid I guess.....", "You are not kidding:\n\n&gt; **Donald Trump Recruits Corporate Lobbyists to Select His Future Administration**\n\n&gt;As Donald Trump finishes his campaign with a promise to break the control of Washington by political insiders his transition team is preparing to **hand his administration over** to a cozy **clique of corporate lobbyists and Republican power brokers**.\n\n&gt;“Our movement is about replacing a failed and corrupt political establishment with a new government controlled by you the American people,” Trump says in his closing campaign advertisement, followed by flashing images of **K Street, Wall Street, and Goldman Sachs Chief Executive Lloyd Blankfein**.\n\n&gt;But the Trump transition team is a who’s who of influence peddlers, including: energy adviser **Michael Catanzaro, a lobbyist for Koch Industries and the Walt Disney Company**; adviser Eric Ueland, a **Senate Republican staffer who previously lobbied for Goldman Sachs**; and Transition General Counsel William Palatucci, an attorney in New Jersey whose **lobbying firm represents Aetna and Verizon**. \n\n&gt;Presidential transition teams **develop policy plans** and come up with a list of more than 4,000 people an incoming president appoints, **including White House jobs, cabinet secretaries, and lower level positions that oversee the military, agriculture, trade**, and beyond.\n\nThe U.S. might just experience lobbyism like never seen before.", "2016 liberals are good at explaining why republicans are monsters but fail to build a positive vision and a reason to vote for them", "It's pretty sickening at times.", "I keep seeing this name today. I like what I see. She's progressive. She's clean. She has the youth and vigor to energize the democratic base. If we're going to run her in the primary we need the party to start investing in her. I think her and Warren would be a solid team. Heck she covers enough bases that they could give Tim Kain another VP shot, or Gary Peters from Michigan to win the rust belt back.", "&gt; well it was quite clear to anyone following the media closely back when bernie still had a chance that they did not want him.\n\nWhat was especially frustrating to me was seeing Jon Stewart and The Daily Show diminish Bernie.  Right from the get go, when he announced in the non-chalant fashion he did, they were making fun of him.  I get that their shtick is the make fun of all politics, but that was really one of the only times where I thought they were over the line.  Just to be that guy that sits in the back of the classroom, making fun of everybody. . . just not a good look.\n", "Our chance at a mass resistance was at the polls. That didnt work. Why on earth would this do anything?", "I don't think Kaine had an impact on the Virginia result. It's shifted a lot in recent years with population growth in the cities and doesn't have the same demographics and issues that appear to be why so many midwestern Obama voters flipped for Trump. Clinton won Virginia by 5% of the vote, it wasn't close.", "They got to put their feet down vote their conscience, and get their worst nightmare elected.", "Yeah now they're starting to tell us that having a college education makes us \"out of touch\"\n\n", "A lot of people believe Tim Kaine had been promised the VP spot in exchange for him stepping down and allowing DWS to take over the DNC. ", "He is the face of the progressive movement in America. If Democrats still want to be the party of that movement they need him. It would be their own hubris that did them in if they did not, and I imagine this election is a cold enough shower that nobody will be able to escape that reality.", "Honestly by losing, Sanders has become the most powerful progressive in the nation. \n\nSomewhat interesting...", "He seems to have selected Tulsi Gabbard as a protege.", "Bernie August 2015: \"In my view, Democrats will not retain the White House, will not regain the Senate, will not gain the House .. unless we run a campaign which generates excitement and momentum and which produces a huge voter turnout.\"\n\n", "Haha no way I think you must have been watching a film or something", "Donald Trump won with less votes than McCain had when he lost in 2008. He also had fewer than Mitt Romney in 2012.\n\nTrump had 59639,462. \n\nMcCain had 59,948,323.\n\nRomney had 60,933,504\n\nThis was not some result of conservatives coming out and voting in higher numbers than they do before. This is absolutely and squarely put on the shoulders on the Democrats failing to replicated Obama's turnout numbers of:\n\n2008: 69,498,516\n\n2012: 65,915,795\n\nAt 59,861,516 votes, Hillary would not have beaten McCain or Romney in the popular vote. If she had been the nominee, and her GOTV efforts reflected this year in 2008, McCain and Palin would have been President.", "Sectary of Milfs or maybe pussy grabbing.", " Hey you're not allowed to point it out. That's not giving them the proper \"respect\" for their crazy batshit views based in debunked image macros.", "Or \"I hate both of them so much I don't care who wins.\"\n\nOr \"I think neither one is so bad the sky will fall.\"", "that's his point though lol", "Earlier when? 2012 the world wasn't ready for anti-establishment sentiment. ", "Yeah it was a very different election for me. In the primaries I was really hoping for Sanders. In the national I was really just voting against Trump.", "This might be a dumb question but why didn't Hilary choose Bernie as her VP? I feel as if that could have helped cover some more ground and that Kaine came out of nowhere.", "That's five Presidential elections in a row won by the candidate who did the best job of turning out their base. \n\nChasing an elusive middle ground (as defined by major donors) does not win Presidential elections. \n\nInsulting a large part of your base by calling them bros telling them they're too dumb and uninformed, and telling them to \"get a life\" was pretty fucking stupid.\n\nAnyone who thought Clinton's record of betrayal of her own base made her more electable needs to seriously rethink politics or just shut right the fuck up for the next decade or two. Democrats can't afford to keep picking candidates based on outdated cold war assumptions about how elections are won. Most of the people who voted against McGovern are dead. Get over it.\n", "so - 6 or 7 million people said \" I hate hillary so much I'm not going to bother voting. It won't matter trump won't win anyways\"\n\n", "I think the most obvious example of Bernie being shafted was when they cut away from him speaking at one of his rallies to look at an empty Trump podium. Fair enough cut away when Trump starts speaking, but if he hasn't even fucking arrived yet it's a pathetic excuse. ", "&gt;  \"we no longer trust your judgement so will not be raising money for your campaign\n\nShe won with 82% so guess she didn't need it :)\n\nhttps://ballotpedia.org/Hawaii%27s_2nd_Congressional_District_election_2016\n\nJust goes to show how petty and corrupt the DNC is though.", "The message was the same - the American middle class is crumbling. Their suggested fixes comes from complete opposite ideologies. Trump believes in trickle down economics and deregulation Bernie suggests government needs to step in and work for the people to force the rich to serve the people.", "An attack on net neutrality is an attack of freedom of speech.  It must be resisted with passion.", "Killer mike phonebanked for Bernie :( ", "According to Morning Joe Democrats lost more elected offices than they did under any other president. It wasn't a sudden wave, it was a tide coming in that we all ignored.", "And the downside to having super delegates is Hillary winning :P", "Everyone is so caught up in the presidential election we tend to ignore the congressional elections even though they hold a massive amount of power.\n\nDouglas Adams understood politics well\n\n&gt;The President is very much a figurehead - he wields no real power whatsoever. He is apparently chosen by the government, but the qualities he is required to display are not those of leadership but those of finely judged outrage. For this reason the President is always a controversial choice, always an infuriating but fascinating character. His job is not to wield power but to draw attention away from it.", "Oh. My fucking. God.\n\nThis is a complete fucking catastrophe.", "Yep. But Sanders has waaaaaaaaay more power as a Senator. He would have never gone for it.", "Here is the DNC response to her for daring to challenge the Clinton machine. From Wikepedia:\n\nAn October 2016 batch of leaks from Wikileaks contained an email from the Clinton campaign to Gabbard reprimanding her for endorsing Bernie Sanders for president. Darnell Strom and Michael Kives remarked that they were \"impressed by your intellect your passion, and commitment to getting things done on behalf of the American people. For you to endorse a man who has spent almost 40 years in public office with very few accomplishments, doesn't fall in line with what we previously thought of you.\" They go on to say, \"to support the sinking Bernie Sanders ship is disrespectful to Hillary Clinton\" and \"we no longer trust your judgement so will not be raising money for your campaign", "It made me angry prior to the primaries when bernie had so much traction. You would hear left leaning news and radio outlets speak about potential primary candidates like it was already decided. Fuckin NPR was spewing all the time about the hypothetical Hillary vs Trump campain as if there was no one else running. Every now and then they would throw out Sanders name with some sort of sarcastic disdain, as if the movement that was standing behind him had no basis in reality. Really annoyed me. Really showed how \"true news sources\" have extreme bias. The dudes polling like 55% her, 45% percent him and they acted like he was some insignificant joke.", "Someone like Trump wins the primary.", "I forgot she was an early Sanders supporter. I was wondering where I'd seen her name before...", "That's true I checked it last night and compared the election map with the Sanders v Clinton map. Most of the key states she needed were heavily in favour of Sanders. ", "http://www.politico.com/story/2016/04/clinton-fundraising-leaves-little-for-state-parties-222670\n\nTLDR: Clinton is selfish and took all the money for herself.  When you nominate a greedy criminal do you really expect her to stop acting like a greedy criminal?\n\n/r/ShouldveBeenBernie", "I'm a very socially liberal voter from the most liberal spot in the country and I've been reflecting on how I could have been this fucking wrong, and your analysis is spot on what I have been thinking all day.\n\nI can't help but think that the people who voted for him voted for a hope to put food on their table, pussy grabbing and racism be damned.  I can only imagine that they looked at us like the elites we actually are, with tons of education and lots of high paying jobs with the luxury to care about things like transgender bathrooms when they're trying to figure out how to find a paycheck.\n\nIt's been a sobering 24 hours.  I can only hope that the wheels of our democracy move damn slow for the country to have another shot before Trump sets civil rights back 100 years.  In the mean time, I hope he actually does succeed in helping those folks in the smaller towns who need it.", "Pence is his VP. Fuck this noise", "After seeing the DNC turn it's back to Bernie and support Clinton for the nomination I'm sure voters felt betrayed by their party. Maybe this should be a learning lesson of not taking sides during the nomination. ", "Unpopular opinion it seems but they're right, based on the headline at least. \n\nThe Tea Party was established with one goal: obstruct Obama as much as humanly possible. And guess what? It fucking worked. The ACA is a shadow of what it was supposed to be because of the absurd degree of resistance by them. Stop with the Stockholm Syndrome. Be energized. Make a counter-jerk to Donald Trump that would make the Tea Party blush, even if there's no representation in Congress. Because that's what the Boston Tea Party was about originally, isn't it? Lack of representation?\n\nAnd for God's sake, stop with the smug assholeishness, the \"holier than thou\" attitude, and the need to check everyone's privilege. That kind of attitude only pisses people off, and what we need is unity against Trump, Pence, Congress and the Senate.", "Nah they voted for the emotions he offered them. No need for consistency.", "In that respect maybe a Trump presidency wouldn't be the worst possible outcome, if it encourages democratic turnout in 2020.", "He already banned newspapers and news outlets from his speeches interviews, and rallies. That violates our freedom of speech and amounts to censorship. No one seemed to care. When newspapers pointed it out and talked about this was a blatant violation of our rights, people just said that they were having their pockets lined by Clinton. ", "It's because President Donald is a big fuck you to the establishment The Donald is furthering that.", "Now they get it! White working class people in Ohio Pennsylvania, Michigan, Wisconsin were a vital part of the 'Obama coalition'.\n\nWhite working class people helped elect a black President for economic reasons, and then Libs spent the last 8 years doing everything possible to piss them off culturally.\n\n&gt;Why aren't I 50 points ahead you might ask?", "He was the only one running to focus on the problems gripping America.  Unfortunate as it is that is a rare trait among candidates.", "This is the real reason Hillary lost. There are a lot of people that smelled through her bullshit and wikileaks only reinforced it. ", "Bernie had a Canary ready this whole time that if he ever told you who to vote for then watch out. \n\nI love the way this worked out as a Bernie supporter. Voted for Jill to support the only progressive on the ballot, but am not upset that Trump won. ", "I got told to \"go home to my own country\" today. I'm Muskogee. This is my country my ancestors have been here for 16,000 years. None of these inbred KKK members can even say their families have been here 100 years and suddenly its all theirs.\n\nIf you're ever on I-75 and not white just don't get off any exits in Florida till you're in Tampa... the KKK exists, its openly known about and not considered something to be ashamed of.", "Highly doubt he'll run. He'll retire with full pensions and hopefully we learn our lesson from this and focus our efforts on regaining control of congress. Trump being the president won't be significant if a progressive congress opposes his every move. ", "I hope she is done and that there will be some massive turnover at the DNC but hope is all I got", "It's delightful to see strong-arm tactics fail.", "What did people expect would happen when Trump was labelled a racist and compared to Hitler? \n\nThe divise rhetoric used against Trump obviously would have an effect like this. That sort of language is bad no matter what side it comes from.\n\nAnd there's also a bit of irony in having those who didnt vote for Trump protest and do things like this. The exact same thing democrats were worried Trump supporters would do if he lost the election.", "Remember when Bush isnt president anymore and Assange leaked documents on Bush and it was the Russians?", "I don't think that we should say most of us are okay with trump. I for one, am not okay with him as the president. I think that most progressive liberals still voted for Hillary but many weren't motivated enough to vote. At the end of the day we have a trump presidency, and this should be a wake up call for the DNC that progressiveness is what democrats want these days. The alternative to that is a regime that will undermine everything we fought for to make a better future, and everything we wanted to expound upon. Instead we have trump who will try to undo what we fought for, and managed to achieve despite pushback from the republicans in every other establishment. \n\nIf the DNC can't learn from this defeat then progressivity has lost, and we'll have to wait for a dismantling of the 2 party system until us progressives will find a suitable candidate to vote into office.\n\n I'm very disappointed in the system but at this point I'd like to draw some positives from the result that we have. Understand and support progressiveness otherwise the Democratic Party will flounder and we will have this president for the next 8 years. ", "\"Boring\" is the least of the knocks on Clinton. She was a terrible candidate in all kinds of ways but especially terrible this year -- she represented exactly the thing voters most want to destroy.\n\nAmericans *do not like the globalist establishment*. The Democrats have been incredibly slow to get that message.", "She's being considered for interior secretary.  Holy shit we're fucked.", "I don't want Obamas hands on the data. ", "The right has it easy. All they need is a God and Guns bumper sticker and 90% of their base is on board. Liberals need a fucking hard on for their candidate just to get them to show up. ", "Jesus christ you literally just saw a video of people beating up, mugging and robbing a guy because he voted the wrong way and then YOU have the fucking audacity to blame HIM for divisiveness? \n\nGet a grip on reality...", "Oh yeah - totally. When those tax breaks roll in your cousin's salary is the first thing they're bumping.", "That article was written before she donated $200 million to downballot candidates.\n\nAnd I think you missed the scheme they were pulling.  By sending it back up to the DNC they could then redistribute it back to the state parties where the money would be most effective.\n\nThis was a turnout problem not a money problem.", "Telling people Hillary Clinton is not a terrible candidate is how we got President Trump.", "We'll see Trump roll back federal laws/regulations and leave as much as possible up to the states so some states will pass terrible laws and make it very clear that certain groups of people are not welcome.\n\nGlad I live in California.  Some states will be defined by their bigotry and hate and be very uncomfortable for certain groups.", "Entertainment is all that matters. Movies + games + sports. Noone cares about science/learning/self-improvement. &lt;/cynical side&gt;", "I had to stop watching Maher for quite a while after his insufferable patronizing chicken analogy.", "Yeah. HRC lost the electoral college by ~108K total votes in three states (68K PA 12K MI, 28K WI).\n\nThat's no more than 0.8% of registered voters in any of those states. (0.78% PA, 0.16% MI, 0.77% WI).\n\nIf only 108K people (~0.05 % of registered voters in the US) who stayed home had voted for HRC, today would be a lot different.\n\nIt's crazy.\n", "Yeah I see the difference.  When Bush uses executive power, you call it overrreach, and when Obama uses executive power, you portray it as Congress' fault for not doing whatever Obama tells them.  ", "Forget it Jake.  It's politics.", "She had the most detailed platform in American history.  \n\nYou heard what you wanted to hear.  ", "He was destroyed in the debates. Hillary made him look like a child and that was without even scratching the surface on policy substance. ", "The claim was that the *message* was similar: you've been left behind Americans. The difference comes in when we consider if either of them has a reasonable plan to back up that message.", "Son the democratic party is dead.\n\nDWS attempted a power move by stonewalling bernie. She did it for clinton, on her demand because of money/power and favors. When the world found out she was full of shit and revealed the dnc to be a shame she resigned in disgrace. Before the ink on her resignation was even dry she went to work with clinton. \n\nI said it at the start of this election when people were starting to get curious about how little coverage bernie was getting. The DNC and clinton will ABSOLUTELY take the chance on potentially shattering the democratic party forever. All because its her turn, Shillary clinton has been on the wrong side of history at EVERY turn of her career. She only adopted her \"progressive\" views after her IT interns scoured the internet for 5 seconds and found out \"oh people want gay people to have the same rights\". Shillary was bought and paid for by big money'd interests and we'll seemingly never know what they were talking about at those 250,000$ speeches. By that extension the entire democratic platform was also bought for. She was never going to elect \"liberal\" SCOTUS seats... she was going to elect whoever her backers told her too and both houses would vet them immediately because its the ESTABLISHMENT!\n\nSo because of all this. The fact that shillary lost with such a huge lead, lost to basically what amounts to an angry orange. The democratic party is done. It will never have the same unity it once had. It will never be able to come together and agree on something in a large enough force to contend with the reinvigorated hard right of the country. And let me tell you, if you thought the right was bad before... you've seen nothing.\n\nThe right has been gridlocking the political process for years, on the excuse of \"well dems do nothing right! so we gotta stop them!\" Now they have full control, you're gonna see a record amount of ground work done in one year. This will feed back into the already demoralized dems and younger progressives. \n\nTL,DR. DNC/DWS/Shillary have completely shattered any party unity the left had and subsequently the left will never hold a house of power for decades. ", "Let's agree to acknowledge the flaws of the DNC without deflecting from the disgusting voter suppression that happened.", "Obama was very clear that Trump would undo entire legacy.\n\nAnd Democratic voters inhaled and said \"Yeah, yeah...I'll do it later.\"", "I did it successfully with a large strata executive committee.\n\nshift your way in become friends with everyone, speak to the right people, vote out the complainers, take over\n\nthe thing was a shit show when i moved in to the building and its running smoothly and easily now.  (plus we've reduced unnecessary spending greatly and lowered our strata levys).\n\ni'm &lt; 30 too.\n\nedit: added commas cause paragraphs werent working.\n\nedit 2: description of how is in the replies here https://www.reddit.com/r/politics/comments/5c45qw/the_blame_game_begins_and_debbie_wasserman/d9uvp9f/", "There was an interview where he literally said that Pence was his assassination/impeachment insurance.", "You just gave a fascist complete control.  He scapegoats minorities he wants to build walls, set up a special police force to round people up, try civilians by military tribunal in Guantanamo. \n\nI'll never understand it.  You picked a man that perfectly embodies all you are angry about,  \n\nYou've been scammed. ", "Climate denier to write your energy policy.\n\nWell done America.\n\nWe just lost the green energy race to China.", "Spend a few moments on The_Donald if you really want a taste for it.", "What are you even talking about. People didn't show up because of 3 reasons:\n\n1. The media spun it like it would be a Clinton landslide lulling people into a false sense of security\n\n2. She was the most uninspiring, boring, establishment politician EVER nominated in a time when people needed inspiration, charisma, and an outsider.\n\n3. The DNC/Wikileaks hacks + Email scandal completely turned off a large portion of Sanders' supporters that otherwise would have begrudgingly voted for her had the party not fucked them in the ass.\n\nShe got 5 Million less votes for a reason: She. Was. A. Shitty. Candidate.", "I can't believe I'm about to use a Trump term but let's \"drain the swamp\". The one thing that this election can do is force the DNC to change because now they know that the people don't want their neo-liberalism. We want real liberal policies, we want progressive policies. And I hope that most of these politicians get booted out in the primaries in the midterms.", "Remember when he didn't set up a private server and that that's the real issue with what thillary did? ", "That's great really,  but healthcare for mothers is also getting repealed.", "Trump offered Kasich the VP saying that he could run everything. I imagine he gave Pence the same offer. Trump ran to win not to govern. He wants the title but not the job.", "She was low energy from the start. Most of her crowds were laughable compared to Sanders or Trump. I said it for months that this was the likely outcome of the election. People just aren't going to get out and vote for an uninspiring candidate. ", "You forgot to mention that thousands had to die in two pointless wars and we had the worse economic collapse since the great depression to get there.\n\nIt wasn't rosy it was horrific.", "is that not what he just said?", "So requiring an ID to vote isn't democracy? Wtf are you guys complaining about this article says that simply requiring an ID is strict voting laws. You guys will literally eat the most stupidest shit up and blame anything but Hillary Clinton for why she lost the election.", "So did i. I hated how they talked down to people. I don't agree with alot of what Trump was saying but I felt the same about Hillary. This election was crazy. ", "Regardless of the house vote Democrats in the Senate could obstruct everything that gets put up by fillibustering it.   Senate allows for unlimited discussion on a legislation.   Only way to make the endless discussion process stop is to call for a cloture vote to end discussion for legislative vote.  That step requires 60 senators.  Republicans only have 51, so Democrats can obstruct everything by staying unified, making sure Trump gets nothing done.  No laws, repeals, admendments or anything would hit Trump's desk.\n\nDemocrats will return the favor for the obstructionist Republicans..\n", "I think we peaked. It was humorous weird, terrifying, diarrhea maelstrom. Hopefully it'll go back in reverse order. Hopefully in four years we'll be laughing at ourselves like we did at him in the beginning thinking, \"Haha, walls. These bipartisan solutions are great! Wouldn't you say, Muhammed, my most dear transgender friend?\"", "Speaking as someone who supported Hillary and was skeptical of Bernie fuck Schumer.  Bernie for minority leader.", "Vote by mail.  This is what we do in Oregon and it works fantastic.  https://www.wyden.senate.gov/vote-by-mail\n\nAll registered voters get a ballot a few weeks before election.  Comes with a big book of information and candidate statements about all races and initiatives. Fill out at your leisure and mail back or put it in a drop box that are placed around town.  You can check online that your ballot was received and processed.\n\nNo lines.  No need to take time off of work.  No voter suppression at the polls.", "I live in north GA and my 14 year old came home and told me about this large group of boys who ran around the school with confederate flags shouting as loud as they could - \"BUILD THAT WALL! BUILD THAT WALL!\" Our school district has a large Hispanic population and she said they just sat there looking terrified and depressed in all of her classes. The school did suspend them all, but this is a bigger problem than any suspension can remedy. \n\nWe talked about it and decided she wants to just be there and be a good friend to all the kids feeling marginalized, to show them that people here DO care about them because they're American citizens just like we ALL are. \n\nI hate that this is happening. Anyone claiming that racism had absolutely nothing to do with this is being very dishonest with themselves. \n\nBut my kid does give me hope that people like her CAN make a better tomorrow, regardless of how many bigoted idiots we have to put up with. ", "He won because Democrats didn't bother showing up not because Trump is good or qualified, or won any of the debates.", "The Republican platform includes more anti-gay language than ever before.\n\nTrump supports the laws that say you can discriminate against gay people if you say it's because you love Jesus.\n\n[Here's the full rundown](http://www.pinknews.co.uk/2016/11/09/here-is-what-president-trump-means-for-lgbt-rights/)  of everything he and Pence could fuck up for LGBT people.\n\nBut uh, sure, nice flag.", "Hillary Clinton was ultimately done in by Hillary Clinton/DNC. She and the DNC gave a big fuck you to the democrats and independents who supported Bernie and they never forgot it. Don't blame this shit on voters. "], "links": ["5c4kir", "5c4kir", "5c4kir", "5c4kir", "5c4kir", "5c4kir", "5c43f3", "5c4kir", "5c43f3", "5c4kir", "5c4e0x", "5c45qw", "5c4kir", "5c43f3", "5c2ig1", "5c4kir", "5c4kir", "5c3jzg", "5c45qw", "5c46b7", "5c3sbs", "5c4e0x", "5c3jzg", "5c4e0x", "5c4kir", "5c43f3", "5c45qw", "5c45qw", "5c43f3", "5c3jzg", "5c2ig1", "5c4kir", "5c4e0x", "5c3jzg", "5c2ig1", "5c4e0x", "5c4e0x", "5c4kir", "5c4kir", "5c43f3", "5c45qw", "5c4a8q", "5c45qw", "5c3jzg", "5c2ig1", "5c43f3", "5c2ig1", "5c4e0x", "5c2ig1", "5c46b7", "5c3c3y", "5c3jzg", "5c3c3y", "5c3jzg", "5c3jzg", "5c43f3", "5c3jzg", "5c3c3y", "5c2ig1", "5c3jzg", "5c4kir", "5c4kir", "5c4kir", "5c45qw", "5c2pyc", "5c4kir", "5c4kir", "5c4e0x", "5c3c3y", "5c2ig1", "5c4a8q", "5c4a8q", "5c2nkm", "5c3jzg", "5c43f3", "5c4a8q", "5c3jzg", "5c4kir", "5c3c3y", "5c3jzg", "5c3jzg", "5c4e0x", "5c4e0x", "5c3sbs", "5c4a8q", "5c4e0x", "5c2ig1", "5c4kir", "5c3jzg", "5c4a8q", "5c46b7", "5c3jzg", "5c2ig1", "5c2ig1", "5c3jzg", "5c2ig1", "5c4e0x", "5c2ig1", "5c4e0x", "5c4kir", "5c4kir", "5c43f3", "5c4kir", "5c43f3", "5c4kir", "5c4kir", "5c4kir", "5c4kir", "5c4kir", "5c4kir", "5c4kir", "5c43f3", "5c43f3", "5c4kir", "5c43f3", "5c45qw", "5c4kir", "5c4kir", "5c4kir", "5c43f3", "5c4kir", "5c4kir", "5c4kir", "5c4kir", "5c43f3", "5c4kir", "5c43f3", "5c45qw", "5c4kir", "5c3c3y", "5c43f3", "5c4kir", "5c4kir", "5c45qw", "5c4e0x", "5c3sbs", "5c43f3", "5c4kir", "5c3jzg", "5c4kir", "5c4kir", "5c2ig1", "5c4kir", "5c4kir", "5c4kir", "5c3jzg", "5c3jzg", "5c4kir", "5c45qw", "5c3jzg", "5c2ig1", "5c3jzg", "5c2ig1", "5c2ig1", "5c43f3", "5c3jzg", "5c4kir", "5c4kir", "5c3jzg", "5c43f3", "5c4kir", "5c4kir", "5c4xm5", "5c4kir", "5c45qw", "5c4kir", "5c2pyc", "5c4kir", "5c4unv", "5c3c3y", "5c4kir", "5c4kir", "5c3jzg", "5c4mxk", "5c3jzg", "5c43f3", "5c46b7", "5c4kir", "5c43f3", "5c4e0x", "5c25tv", "5c39q1", "5c45qw", "5c3jzg", "5c45qw", "5c4kir", "5c43f3", "5c3sbs", "5c3jzg", "5c3sbs", "5c2taz", "5c45qw", "5c2taz", "5c4unv", "5c4e0x", "5c4kir", "5c4e0x", "5c3c3y", "5c3c3y", "5c4kir", "5c4kir", "5c4vgu", "5c574a", "5c4kir", "5c4kir", "5c4kir", "5c43f3", "5c4kir", "5c4kir", "5c4kir", "5c3jzg", "5c51uo", "5c43f3", "5c3jzg", "5c4kir", "5c43f3", "5c43f3", "5c4kir", "5c4vgu", "5c574a", "5c3sbs", "5c46b7", "5c43f3", "5c45qw", "5c4kir", "5c4kir", "5c43f3", "5c4yzn", "5c45qw", "5c43f3", "5c3jzg", "5c51uo", "5c4kir", "5c4vgu", "5c45qw", "5c43f3", "5c4kir", "5c4kir", "5c3jzg", "5c3c3y", "5c51uo", "5c4kir", "5c3jzg", "5c574a", "5c43f3", "5c4yq4", "5c4vgu", "5c43f3", "5c2ig1", "5c52zo", "5c45qw", "5c4vgu", "5c43f3", "5c3c3y", "5c4kir", "5c4unv", "5c4kir", "5c4kir", "5c4kir", "5c3jzg", "5c51uo", "5c3sbs", "5c51uo", "5c43f3", "5c506d", "5c4kir", "5c4yzn", "5c4xm5", "5c43f3", "5c43f3", "5c43f3", "5c4vgu", "5c4kir", "5c4xm5", "5c51uo", "5c52zo", "5c4vgu", "5c39q1", "5c4kir", "5c574a", "5c4kir", "5c51uo", "5c4xm5", "5c45qw", "5c4kir", "5c3jzg", "5c43f3", "5c45qw", "5c51uo", "5c39q1", "5c46b7", "5c574a", "5c51uo", "5c3jzg", "5c3jzg", "5c4kir", "5c5fsn", "5c3sbs", "5c5fsn", "5c43f3", "5c574a", "5c4kir", "5c5fsn", "5c5fsn", "5c5fsn", "5c4kir", "5c4kir", "5c5fsn", "5c4kir", "5c4kir", "5c43f3", "5c3jzg", "5c43f3", "5c5gso", "5c5gso", "5c5fsn", "5c46b7", "5c5fsn", "5c43f3", "5c4kir", "5c43f3", "5c5gso", "5c4kir", "5c4kir", "5c4kir", "5c43f3", "5c3jzg", "5c43f3", "5c43f3", "5c5fsn", "5c4kir", "5c43f3", "5c45qw", "5c4kir", "5c574a", "5c4kir", "5c3c3y", "5c574a", "5c43f3", "5c45qw", "5c43f3", "5c3sbs", "5c5gso", "5c3c3y", "5c574a", "5c4e0x", "5c43f3", "5c5fsn", "5c3jzg", "5c5ceh", "5c4e0x", "5c43f3", "5c4kir", "5c43f3", "5c4kir", "5c4kir", "5c43f3", "5c43f3", "5c43f3", "5c4kir", "5c43f3", "5c43f3", "5c4kir", "5c4kir", "5c43f3", "5c43f3", "5c46b7", "5c574a", "5c4vgu", "5c4kir", "5c5ceh", "5c4kir", "5c45qw", "5c45qw", "5c43f3", "5c46b7", "5c43f3", "5c574a", "5c52zo", "5c4kir", "5c3c3y", "5c43f3", "5c4kir", "5c5ceh", "5c43f3", "5c4e0x", "5c43f3", "5c2pyc", "5c45qw", "5c5fsn", "5c2tgv", "5c4kir", "5c43f3", "5c5gso", "5c45qw", "5c43f3", "5c4kir", "5c5fsn", "5c4kir", "5c4kir", "5c4kir", "5c5fsn", "5c4kir", "5c4kir", "5c5rx8", "5c5l6p", "5c5fsn", "5c5fsn", "5c4kir", "5c4kir", "5c4kir", "5c4kir", "5c4kir", "5c5l6p", "5c5l6p", "5c4kir", "5c5fsn", "5c4kir", "5c4kir", "5c4kir", "5c43f3", "5c5fsn", "5c5fsn", "5c5pvx", "5c5fsn", "5c5l6p", "5c5rx8", "5c4kir", "5c43f3", "5c46b7", "5c4kir", "5c43f3", "5c5rx8", "5c4kir", "5c5l6p", "5c45qw", "5c5fsn", "5c4kir", "5c3sbs", "5c5l6p", "5c5rod", "5c5gso", "5c43f3", "5c4kir", "5c4kir", "5c4kir", "5c5rx8", "5c5fsn", "5c5rod", "5c3sbs", "5c4a8q", "5c4kir", "5c4kir", "5c43f3", "5c4kir", "5c43f3", "5c4a8q", "5c43f3", "5c4kir", "5c4kir", "5c43f3", "5c43f3", "5c46b7", "5c43f3", "5c37os", "5c3c3y", "5c4kir", "5c5fsn", "5c5fsn", "5c5ick", "5c5rx8", "5c5rod", "5c43f3", "5c51uo", "5c43f3", "5c43f3", "5c5fsn", "5c5jt3", "5c46b7", "5c43f3", "5c5fsn", "5c5l6p", "5c5rx8", "5c5fsn", "5c5fsn", "5c5l6p", "5c45qw", "5c2nkm", "5c5fsn", "5c43f3", "5c43f3", "5c5pvx", "5c43f3", "5c574a", "5c5fsn", "5c4kir", "5c4kir", "5c4kir", "5c4kir", "5c4kir", "5c4kir", "5c43f3", "5c5fsn", "5c5fsn", "5c5rx8", "5c3sbs", "5c4kir", "5c4kir", "5c4kir", "5c5rx8", "5c5rx8", "5c4kir", "5c4kir", "5c4kir", "5c574a", "5c4kir", "5c5rx8", "5c45qw", "5c4kir", "5c5fsn", "5c43f3", "5c4kir", "5c4kir", "5c45qw", "5c4kir", "5c4kir", "5c5rx8", "5c4kir", "5c5zu6", "5c5rx8", "5c5pvx", "5c3jzg", "5c46b7", "5c574a", "5c4kir", "5c5rx8", "5c43f3", "5c4e0x", "5c4kir", "5c3c3y", "5c4kir", "5c4kir", "5c4kir", "5c5rod", "5c3sbs", "5c4kir", "5c5rx8", "5c5fsn", "5c3sbs", "5c46b7", "5c5rod", "5c4kir", "5c5rx8", "5c5rx8", "5c4a8q", "5c5fsn", "5c45qw", "5c5rx8", "5c3sbs", "5c45qw", "5c5gso", "5c4vgu", "5c4kir", "5c45qw", "5c46b7", "5c5rx8", "5c45qw", "5c4a8q", "5c5gso", "5c5zri", "5c5fsn", "5c5rx8", "5c45qw", "5c3sbs", "5c3z2u", "5c5zu6", "5c5rx8", "5c5fsn", "5c5rod", "5c46b7", "5c45qw", "5c4vgu", "5c4a8q", "5c4kir", "5c46b7", "5c4yzn", "5c4vgu", "5c5zu6", "5c5rx8"]}