{"comments": ["So far there has been literally no repercussions for Trump's lying so why would he stop?  His supporters follow him no matter what he says or does, and his detractors will never change their minds. Donald Trump would feel like a god right now if he weren't so pathetically insecure.  ", "Latinos are saving our asses from fascism. \n\nETA: my first Reddit gold!!! Thanks so much kind stranger. This 30 y/o white woman is very grateful for all the minorities and PoC saving the rest of us from cheetoh Jesus. ", "He lies constantly sometimes for no reason whatsoever:\n\n\nhttps://www.washingtonpost.com/news/early-lead/wp/2016/07/30/nfl-refutes-trump-claim-that-it-sent-him-a-letter-bashing-debate-schedule/\n\n\nIt's kind of bizarre.", "Jay-Z's not running for President you fucking hack.", "He's offended?\n\nBy non-PC language?", "Is he talking about the same Reagan who granted amnesty to millions of immigrants negotiated with terrorists, expanded the size of federal government, supported gun control, etc. \n\nI think Pence and many other republicans have a very selective memory of what Reagan actually did.", "Goddamn I'm gonna miss President Obama. What a class act he is. ", "Because of his fragile ego and immaturity Trump's path is now 10 electoral votes longer.", "\"Feels over reals\"  \n- uneducated Trump voters ", "https://www.reddit.com/r/EnoughTrumpSpam/comments/5b91ku/obama_pleaded_with_a_crowd_for_2_minutes_to_stop/\n\nYou can watch the actual video of Obama \"yelling\" at the protester. More like admonishing the crowd that supports him.\n\nhttp://www.vox.com/2016/11/5/13533468/trump-obama-protester", "To be fair it was also completely unprecedented for someone in Trump's shoes to ever get nominated by one of the two major political parties when he announced he was running in June 2015 but here he is.", "To trump everything's a disaster.  It's his call to arms. Health care? Disaster.  Economy? Disaster.  Foreign policy? Disaster.  Trade deals? Disaster.  Immigration? Disaster.  Military? Disaster.  Inner cities? Disaster. \n\nAnd on and on and on. \n\nAnd what's incredible is that all of this comes out of the mouth of a man who knows absolutely  nothing about any of these things. ", "Ugh I can't wait. It was the same after 2012.\n\n\"Dur I can draw a line from one side of the country from the other without crossing a county that voted for Obama\"\n\nYeah, well who's fault is it that Conservatives can't stand living in close proximity to one another?", "He flogs this \"94 million people not working\" like it's some tragedy. That is largely full-time high school and college students stay-at-home parents, the disabled and the retired. Eliminating that would mean everyone goes to work at 16 and keeps going until they drop dead.", "Because the Republican candidates keep getting more and more absurd and unhinged. We've gone from the smooth and charismatic Reagan to the more technical-minded Bush 41 to the bland Bob Dole to the amiable-but-vengeful-and-controlled Bush 43 to bomb-bomb-Iran McCain and his VP Sarah \"that bullseye over Gabby Giffords had nothing to do with her shooting we swear\" Palin to stone-cold-corporatist-and-parasitic-investor Mitt Romney to a petty, vengeful, ignorant, sexist, racist, nuke-obsessed egomaniac and psychopath who lives in an alternate reality of his own creation and has pulled some 40% of the population into it and has spent his entire life fucking over everybody he encounters to enrich himself and stroke his own ego. And the way the GOP looks right now the most likely response is for them to double down and produce someone even *worse* for the next cycle.", "Don't get complacent. VOTE ON TUESDAY. ", "I've met people who can't even remember that the recession started under Bush. They're convinced that it started under Obama", "No one gives a shit about the words.\n\nIt's that Trump described comitting serial sexual assault that was offensive. \n\nBut I guess it's no surprise Trump and his supporters can't tell the difference between rapping and raping. ", "And then there's Trump supporters.", "Old white guys seem to be *really* butthurt about not being able to use the N word anymore. ", "He's just standing there... \n\nMENACINGLY! ", "He's so triggered.", "No one gives a shit about the words.\n\nIt's that Trump described comitting serial sexual assault that was offensive. \n\nBut I guess it's no surprise Trump and his supporters can't tell the difference between rapping and raping. ", "Disastrous...for him.", "\"Looks like Trump got his wall after all. A wall of beautiful voters” wrote Yvanna Cancela of the local Culinary Union........\n\nThank you, Yvanna.", "Ugh reading this made me feel nauseous. I know too many liberals that don't plan on voting because of their dislike of HRC. ", "No they've viewed them. Their response to the video was:\n\n* OMG Obama can't even control a crowd, he's like a substitute teacher kek\n\n* The only reason Obama did that is because he knew it would look bad if Hillary supporters punched an old man!", "Donald Trump probably doesn't even realize that optimal unemployment is around 3% and not 0% considering he doesn't seem to understand any other economic concepts.", "For your lips to Jesus's ears man. I hope so. Nothing would make me happier than to see my people make that asshole choke on his words. Call me or my parents drug-pushing rapists again. ", "Gah. Those people annoy me.", "Trump says he doesn't know Miller but he's on his agricultural advisory board. How do you appoint someone you don't know? Fuck. This pisses me off people are voting for this incompetent shitbrain", "Yeah sadly he is not a conventional candidate. He has taken \"say anything to win\" to a level unseen in American politics either *ever* or since WW2. \n\nNot excusing Trump with that qualification, I just don't know how Presidential Candidates campaigned in the Gilded Age and earlier well enough to make the statement.", "Only slightly bonkers:\n\n\nhttps://en.wikipedia.org/wiki/Mike_Pence\n&gt;Pence asserted that \"condoms are a very very poor protection against sexually transmitted diseases\" and that Powell was \"maybe inadvertently misleading millions of young people and endangering lives\"  \n.  \nIn 2001, Pence wrote an op-ed arguing against the tobacco settlement and tobacco regulation, saying that they would create \"new government bureaucracies\" and encroach on private lives. He stated that \"despite the hysteria from the political class and the media, smoking doesn't kill.\"", "That's ok racists call that \"exotic white\".", "&gt;Mike Pence Is Bonkers. \n\nIsn't he the guy that wanted to force women to use a tiny coffin for every tampon(?)", "I like how you guys aren't just satisfied taking a radio ad from 2008 and pretending it's relevant. Instead [you have to lie about what Obama actually said in the ad](http://www.snopes.com/obama-hillary-clinton-isnt-qualified/).\n\nIt's pathetic.", "What's 9/11? No one ever attacked the US before Obama", "Around here they have moved on to savages.  ", "These four words describe trump perfectly.", "Yea attack one of the hiphop GOATs that'll help your black vote", "Didn't CNN show a live video of a podium for thirty minutes hoping Trump would be there soon?", "9/11 was during Obama. He just didn't do anything about it! He wasn't even in the oval office!!", "Like so many of Trump's lies you can trace this one directly back to Fox News.  \n\nEd Henry, Fox News' Chief National Correspondent, [tweeted this ridiculous lie](https://twitter.com/edhenry/status/794623678558433281) about Obama's reaction earlier in the day:\n\n&gt; Turn on @FoxNews -- President says \"sit down and be quiet\" to trump backer and clinton folks trying to shout guy down\n\nSo while it's entirely fair to blame Trump for repeating this lie, the reality is that Trump is a reflection of right wing media disinformation.", "\"Who is Karen McDougal?\"\n\nUh...anyone attracted to women in the '90s knows EXACTLY who Karen McDougal is.\n\n", "Wooooooooooow. \n\nThat's not how knowledge works. ", "So much for anti-PC culture. ", "1828 may be comparable.  Jackson was called a murderer his wife a bigimist and adultress.  Adams was even accused of pimping.", "Oh man looks like Greg Fitzsimmons almost called it.  From December 4, 2015:\n\n&gt;Can we call this campaign what it really is?  Countdown to Trump calling Hillary a cunt. [...] it's not whether he'll do it, he's going to do it. \n\nhttps://www.youtube.com/watch?v=dt9w6G1thMs&amp;feature=youtu.be\n\n", "Watching him attack Obama yesterday really made me go wtf.  I mean I know hes a hypocritical asshole but he was screaming about how all the attacks in him are unfair and then goes on to attack Obama with events that not only never happened, but were the exact opposite of what did.", "Or reels as the case may be", "After the Dallas shooting my social media was filled with blm hate ND black hate. Calling them a terrorist organization  demonizing the whole culture as violent and anti cop,  talking about rap lyrics. Bluelivesmatter idiots were everywhere decrying this violence. I haven't seen ONE news segment on the Iowa shooting and not one bluelivesmatter post! No talking about the racist conservative white shooter,  just silence and emails emails emails. So fucked up", "**Clinton's path to 270 explained in one simple graphic:**\n\n**http://i.imgur.com/CvMszRD.png**\n\n-------------------\n\n/u/jaCASTO:\n\n&gt; Just for reference Trump can take every swing state plus NH and still lose if Clinton has Nevada.\n\nCorrect.\n\n/u/Tokyoto_:\n\n&gt; I thought Hilary only needed Florida to seal the deal?\n\n/u/CouchAlmark:\n\n&gt; She has a lot of different paths to 270: of the competitive races she only needs to win one or two of them. Trump needs to win all of them.\n\nCorrect.", "Kali Ma!", "Runner-up in the primaries was Ted Cruz. That should tell you the same moderate Republicans if any are in short supply. \n\nThe base is certainly not made up of as many moderates as you would like. ", "Thanks for checking that out.  I can't stand to go there.\n\n&gt;OMG Obama can't even control a crowd he's like a substitute teacher kek\n\nBecause under the Fourth Reich, crowd control is not an issue.\n\n&gt;The only reason Obama did that is because he knew it would look bad if Hillary supporters punched an old man!\n\nBecause Obama is a well-known abuser of the elderly.", "Only brown people can be terrorist. Moron. ", "I guess Trump saying he likes Mexicans because he likes the Trump tower taco bowl wasn't enough.", "My uncle didn't speak to me for three years because I voted for Obama. I want a Clinton win because he and his conservative tea party friends are going to fucking explode. ", "I'm still in shock that this did not ruin him. Yet here we are. Amazing. What the fuck is wrong with people?", "I wish more people had this view. Compromise is not the enemy of progress it's the first and most necessary step on the path of progress.", "Disastrous for his gloom and doom narrative.", "Right after we (hopefully) kick the GOP's ass just for scaring the shit out of everybody so badly.", "His theory is that if one swing state goes red it makes it much more likely the rest of them do too - they are not independent operators. However, I agree with the other responders - he has all the incentive in the world to keep the uncertainty coefficient of his algorithm unnaturally high, for clicks, and to hedge his bets in the very unlikely chance Trump wins. \n\nOn Monday night he'll predict a map, probably with HRC 322 electoral votes, after all of this.", "No he doesnt. He just has problems with rich successful black men. According to trump they should all be in the cotton fields like when america was 'great'", "There are a few differences chiefly that Bill Clinton isn't running for office. ", "Well Trump wasn't lying when he said there will be voter fraud", "It's seriously unfathomable how much of this campaign was built upon projection and hypocrisy.\n", "There are like 6 pro-trump circle jerk subs now infecting this site. It'll be unusable for at least a couple months if Trump wins.  ", "Living in Tennessee it's insane some of the shit Republicans will blame Obama for. All the \"thanks, Obama\" memes aren't even exaggeration. It's literally like \"My dog peed on my rug, thanks Obama.\"", "When she hits 50 he will.", "I don't understand 538's chances compared with the others. A 35% chance Trump victory? You're telling me there's a 35% chance that Trump wins literally every swing state and flips a light blue state?", "Trump just canceled his planned rally in wisconsin. he knows he lost there. ", "Yes. IF charges were brought.\n\nCharges haven't been brought.\n\nWe have no indication that charges will be brought. ALL the FBI said in that letter was \"We don't know what is in these emails but we need to see if it's relevant. We don't even have a warrant yet to know if it's relevant though.\"\n\nAnd yet somehow that has blown up (By republican tweets and \"leaks\") into her being CHARGED with something.\n\nAs soon as she's charged with something, you have a fair point. That's not the case though.", "No no no... that's only for minorities and women who get offended. When a white man gets offended then you know it's real.", "Hilarious.\n\nhttps://www.washingtonpost.com/news/fact-checker/wp/2016/03/22/all-of-donald-trumps-four-pinocchio-ratings-in-one-place/\n\nAnd those are just the most egregious. ", "those are thugees. Whole different set of atttributes...", "Please tell us more about how we should \"grow the fuck up\", /r/HillaryForPrison poster.", "Because 538 is putting high weight on some outliers like SurveyUSA +7 in UNC. \n\nHere's top pro-trump polls in UNC from 538: 7, 2, 5. \n\nThe 7 is SurveyUSA, 2 is Remington, and 5 Trafalgar Group.\n\nRemington is a new, unproven Republican aligned group and Trafalgar is significantly less proven than PPP. \n\nIn Florida, 538 is still holding Sienna College and a single day Remington in higher regards. Selzer is +2, but an older poll.\n\nAnd the Sienna college is pre-FBI news.\n\nNV is a crapshoot, but the CNN poll has been lampooned already for under polling Hispanics. \n\nOn top of all that, 538 has more wiggle room for uncertainty. I don't how much that holds, since Clinton has lead the race except for a single day after the GOP convention.\n\n\n\n", "Ding ding ding. You rarely hear about what **new** policy will bring prosperity to our lands. Instead it's about what they'll tear down. Trade agreements. Obamacare. Roe v. Wade. Immigration/refugees. Birth control. Environmental protection. Taxes. Now the goddamned roads (privatization).\n\nThis is about bulldozing liberal policies entirely. There will be little to no compromise. They aren't even willing to compromise from a point of even footing or times when they have the low ground. ", "If we could determine political allegiance by number of minorities then Texas would be solid Blue.", "Isn't he the piece of shit behind \"Stop and frisk\"  aka: \"Harrass anyone you don't like the look of\"?", "More of an olive tan thing going on ", "For the lazy:\n\nRectangle: http://www.loeser.us/flags/images/protest/51_star_flag.png\n\nCircle: http://public.media.smithsonianmag.com/legacy_blog/51-star_1_circle.jpg\n\nPac Man: http://public.media.smithsonianmag.com/legacy_blog/pacman.jpg\n", "A constitutional amendment in this political climate? Can I have some of that weed?", "I still get confused about \"thugs\".  \n\nWhy would an ancient tribe from India have anything to do with American politics?", "TIL \"startlingly different\" = \"lying your face off.\" \n\nSeriously anyone who supports Trump needs a psychological evaluation - as does Trump. ", "This isn't a big shocker for people living in Nevada. Even a significant part of the die hard Republicans I know here are terrified of a Trump presidency. \n\nSure we have our whole sagebrush rebellion redux, our fair share of goofy moralists, and flat out kooks, but even they are turning on Trump here. \n\n", "Anyone know if the statistical models on 538 or RCP are properly adjusted for this guy's Latino friends? ", "&gt; \"The most dangerous thing\" Little bit of hyperbole there I think.\n\nIt isn't. The worst case scenario resulting from domestic islamic terrorism is a series of damaging yet manageable terrorist attacks. It would suck but at the end of the day America wouldn't be materially affected by it in any way. \n\nRacist nativism on the other hand can and has done colossal and sometimes irreversible damage to western countries, America included. When you start buying into the idea that your country is defined only according to a certain ethnicity and/or religion, ethnic cleansing, intimidation and suppression of political rivals and violent expansionism are all perfectly justifiable.", "Uh... you seem to have skipped over the fact that Truman had already served as President of the United States and ended WW2 before he ran for the office (which was the unprecedented part of that election) and that's after a decade spent in the Senate. \n\nSo no, the current Republican candidate doesn't seem very similar to that, other than the fact that they both were/are down in the polls on the eve of the election. But Trump also shares that with almost every person who's ever lost.", "A plurality of white people knew it too...", "I think Clinton has a better chance winning AZ than OH. Trump pissed off the Hispanics and Mormons in that state bigly.", "So what you're saying is... They use the #BlueLivesMatter shit only when they can use it as a dogwhistle against black people. That's preposterous!!!!\n\n/s (obv)", "Dude you are projecting so hard that it is almost hilarious. You literally talking about assigning blame and pigeonholing groups while creating this generic left. ", "I think it's because he scheduled the rally during the Packers game. He is going to the dart board. ", "I think they see him as *mentally ill* because they think a *normal* white person doesn't do stuff like this. Blacks however, it comes natural to them. ", "That's not such a huge commitment. I've had dried and seasoned grasshopppers that were pretty damned good. ", "They'd pick a poisonous bug for sure.  Just like their recipe for America", "I'll say it again:\n\nDon't worry guys. We Latinos will pull America's ass out of the fire like in 08 and 12.\n\n^^sorry ^^about ^^2000 ^^and ^^04 ^^tho", "And \"urban.\" ", "One of things in this that is not getting any traction: one of the question everyone has to answer under oath is if they have ever illegally worked in the USA. If anyone says yes they are not getting the citizenship. \n\n**she lied under oath**", "Well if Trump were to win, those poisonous bugs are going to look pretty appealing.", "&gt; Seconds later a spokesman for Trump's Wisconsin campaign alerted reporters that the event had been canceled, citing a scheduling conflict.\n\nWhat? How do you have a scheduling conflict in the final days before an election? Is the campaign so incompetent that they booked him in two states at the same time? \n\n&gt; Kaine's final Sunday event in Wisconsin will be a Green Bay Packers watch party at a La Crosse brewery. Trump's rally was scheduled to begin 25 minutes before the Packers game, which is almost required viewing in Wisconsin. \n\nOh. So Trump's campaign was just too lazy to think about the local context, and realized hours before that nobody would go to his rally because they scheduled it against a Packers game. A Packers game that the Hillary campaign is *leveraging* to connect with voters.\n\nMaybe expertise in transdimensional water polo just doesn't translate to politics?", "This one is so ridiculous. The contrast between Obama's and Trump's reaction toward protesters is as vast as you can get. \n\n[Trump just can't keep himself from projecting.](https://www.youtube.com/watch?v=gFZ-1EojoFM)", "He said Trump supporters get to pick if Trump wins.", "You want to really mess with a trump supporter say \"I strongly support the people's right to bear arms I wish every black and Hispanic person in this country had a gun\"... ", "Downvote if you'd like. The popularity of Trump is a clear sign of how we have a large number of idiots in this country.", "Reagan also raised taxes 9 times and tripled the debt.", "And Ryans cowardice is going to lose him the seat. It's so fun to watch. ", "You can thank us after:)", "It's no secret he has swindled countless people out of their fair labor. He is unfit for the Office", "THANK YOU.\n\nSigned\nA white guy", "No he's mad that a black is saying rude words when he says it it's locker room talk", "\"Typo\"", "...And then there's Trump supporters who post memes on FB.", "Trump actually thought that Michael Moore's \"Trumpland\" film was made in support of him... All he did was read a headline that included that someone made a film about him.\n\nThink about that.  Michael Moore.  Supporting Donald Trump... \n\n?!??!?!\n\nHe's such a fool!!", "It's either the best thing ever or a disaster. Truly the sign of a small mind. ", "**Trumps Post-Debate Downward Spiral Calendar**\n---\n\nNow online at [TrumpCalendar.com](http://trumpcalendar.com/)  - thanks /u/elleoof!\n\n**see [older post](https://www.reddit.com/r/politics/comments/58501x/people_reveals_6_witnesses_who_corroborate/d8xkgji/)\n  for sources removed due to char limit\n\n Mon |  Tues  |  Wed  |  Thurs  |  Fri  |  Sat  |  Sun \n-----|------|-----|-------|-----|-----|-----\nSept 26: Trump's horrendous performance at 1st debate | 27: Trump continues Alicia Machado attacks at post debate rally brings up Bill Clinton infidelities  | 28: Trump refers to online polls saying he 'won the debate', jokes 'should we keep them? about non-Christians at rally | 29: Trump's cuba dealings revealed, embargo violations uncovered and Forbes downgrades Trump's wealth estimate and USA Today historic dis-endorsement of Trump | 30: Trump's 3am 'sex tape' tweet about Miss Universe winner  | Oct 1: NYT releases Trump's 95 tax returns, shows $1bil loss and Trump mocks Clinton's pneumonia and claims Hillary hasn't been \"loyal to Bill\" | 2: the Fallout from the Tax revelations: Sources estimate that Trump could have paid no taxes for almost 20 years\n3:  NY AG shuts down Trump Foundation, which does not have the proper authorization to solicit charity funds and Revelation that Trump bought Chinese-made steel| 4: Trump Foundation political donations uncovered and Wikileaks \"October surprise' turns out to be a hoax, leaves the alt-right disappointed | 5: The Atlantic disendorses Trump &amp; Endorses Clinton, 3rd endorsement ever in history of paper | 6: Trump on military action: \"Wouldn't it be nice if we attacked first?\" | 7:  Trumps hot mic remarks on groping women are uncovered and Trump still says Central Park Five are guilty, despite DNA evidence | 8: **The Saturday Slaughter**: Paul Ryan dis-invites Trump from Wisc. Rally over 'Trump Tape' comments and *many* unendorsements and denouncements roll in from GOPers, GOP funds pulled from Trump to down-ticket races | 9: Debate #2: Another Disastrous Debate for Trump, and a continued besiege on Trump by the Republicans, this time for his off-color pre-debate panel\n10: Paul Ryan tells House to focus on down-ballot races, says he won't defend or campaign for Trump and Trump's inaccurate Clinton stories directly linked to Russian State media|  11: The Republican 'Civil War' begins: Trump &amp; supporters fight Ryan and the Republican Party and Top Mormons in \"All-Out Revolt\" on Trump, multiple polls show Hillary with a double-digit lead| 12: Four women (Jessica Leeds, Rachel Crooks, Mindy McGillivray, Natasha Stoynoff, Jennifer Murphy) accuse Trump of past sexual assault, and '92 video with [questionable remarks about a 10y.o. girl uncovered. **Fallout-** Liberty U students rebuked Trump and LibU Prez, &amp; Australian NSW legislature officially condemning Trump  | 13: Trump's Total Meltdown (via Time): Trump demands NYT take down sexual assault allegation article, receives blistering response back from NYT, and calls the accusations a distraction brought by a conspiracy with Hillary Clinton and a \"global power structure\" of \"international bankers\" as Michelle Obama gives a powerful rebuke of Trump | 14: Two more assault allegations: Summer Zervos, Kristin Anderson, Trump tries to defend allegations by saying the accusers were too ugly for him. | 15: One more allegation uncovered: Cathy Heller, Trump continues conspiratorial defensive, says Clinton was 'on drugs' at last debate and should take a drug test before the 3rd one and that the election is being \"rigged\" by Clinton and the Media- notion is immediately rejected by Paul Ryan. Trump also picks a fight with swing-state Ohio's Republican Party director | 16: Voters are buying none of Trump's defenses on allegations, but Trump intensifies claims that election is 'rigged' in spite of his VP and Ryan saying otherwise, claims that SNL is rigging the election as a part of the global media cabal\n17: Trump ups the ante on the debunked claim of wide-spread voter fraud as republican allies continue to deny, a GOP feud continues as Trump's crowd chants \"Paul Ryan Sucks\". Melania claims accusers are lying, and Trump was egged on for lewd comments.| 18: Obama tells Trump to \"Stop Whining\" about election fraud, and People releases 6 witnesses to corroborate sexual assault story | 19: Debate #3 : Trump finishes 0/3 on debates, calls Clinton a \"Nasty Woman\" and won't commit to accepting election results | 20: Trump bombs at Al Smith Dinner, is booed and somehow loses a charity dinner to Clinton | 21: Trump takes a swipe at Michelle Obama, attacking one of the most widely favored political figures in the US, while revelation shows James O'Keefe was paid by Trump Foundation before creating Dem./Clinton hit-piece | 22: 11th Trump accuser - pornstar Jessica Drake- comes forward as Trump says he'll sue his accusers in his first 100 days during his \"Gettysburg Address\", Republican fissions grow as Log Cabin Republicans refuse to support Trump| 23: A rare Trump gaffe break, but Kellyanne Conway spends the day on ramping up talk of suing Trump accusers, and admits \"we are behind\" as several Republicans threaten defamation lawsuits for ads associating them w. Trump\n24: NYT covers 2 pages with people Trump has insulted while Trump fires back at pornstar accuser saying \"I'm sure she's never been grabbed before\". Huge new revelations include nobody remembering why Trump took 17mil in hurricane aid, associates of Trump's campaign saying they'd be willing to take illegal 2mil donation from China, and Breitbart coordinating with liberal activist \"disrupting\" GOP events | 25: Trump cuts off fundraising for the Republican party in continued battle with party leaders | 26: Trump spends the day in the final 2-wk stretch advertising his new hotel in non-battleground-state, D.C. as his 12th sexual accuser comes forward- fmr. Miss Finland| 27: Trump continues to say states like republican-controlled Texas are rigging votes, while he mentions \"We should just cancel the election and just give it to Trump.\" Trump's Victory Fund raises a paltry amount in Oct. for RNC races at crucial time. \"Shark Tank\" star Barbara Corcoran accuses Trump of inspecting her breasts. | 28: After continuously bragging about funding his own campaign, Trump only spent $33,000 of own money in first 19 days of Oct- puts $10mil in after Repub. anger. New creepy Miss Universe/Trump tape is revealed and a Des Moines Trump supporter tries to vote twice because \"The Polls are Rigged\" | 29: David Fahrenthold releases comprehensive list of Trump's charitable donations, they don't add up to his claims, no donations in last 8 years: shows Trump sat on stage to one child's HIV event and left giving nothing, Conway calls Trump supporter \"Deplorable\" after video surfaces of him shouting \"Jew-S-A\" at the press  | 30: Trump says Clinton will let \"650 million new immigrants into U.S.\"\n31: Trump spends Halloween campaigning in solidly blue states as report shows Trump's companies destroyed emails in defiance of court orders. Trump refuses to pay pollster $750,000. | Nov 1: Report shows Trump used [legally dubious methods to avoid taxes ](http://www.nytimes.com/2016/11/01/us/politics/donald-trump-tax.html)FBI making inquiry into [ex-Trump campaign manager's Russian ties](http://www.nbcnews.com/news/us-news/fbi-making-inquiry-ex-trump-campaign-manager-s-foreign-ties-n675881), Trump continues to [hammer Clinton email probe as \"absolutely devestating\"](http://abcnews.go.com/Politics/donald-trumps-remarks-renewed-clinton-email-probe-mirror/story?id=43206730) with no evidence or public info released from FBI | 2:Trump, who continues to trail Hillary, [tells supporters to 'pretend we're down'](http://www.politico.com/story/2016/11/clinton-trump-tied-new-poll-230624), as Trump child rape accuser [cancels press conf. due to death threats](http://www.esquire.com/news-politics/news/a50256/trump-child-rape-accuser-cancels-press-conference/) | 3:as Trump continues to push [debunked Clinton Foundation indictment story from Fox](http://www.independent.co.uk/news/world/americas/us-elections/hillary-clinton-emails-fbi-indictment-clinton-foundation-fox-news-us-election-2016-a7397956.html),  Guiliani openly flaunts that the Trump campaign [receiving leaked FBI intel first](http://www.businessinsider.com/rudy-giuliani-fbi-hillary-clinton-emails-2016-11), creates a [small invite-only event for Election Night celebration](http://patch.com/new-york/midtown-nyc/donald-trump-announces-invite-only-victory-party-midtown-election-night) | 4: 100 Days since last Trump Press Conference, Newsweek shows Trump campaign's [deep connection to Russia](http://www.newsweek.com/donald-trump-vladimir-putin-russia-hillary-clinton-united-states-europe-516895), Ohio judge orders Trump campaign to [stop intimidating voters](https://thinkprogress.org/ohio-intimidation-order-82e2ee1fe643#.j6fa0kr6x), and Melania Trump is exposed for [working as an illegal immigrant in the US](https://apnews.com/37dc7aef0ce44077930b7436be7bfd0d)  | 5: Early voting NV polls show [Trump getting trounced](http://www.vox.com/2016/11/5/13533864/nevada-trump-clinton-early-voting-polls). Trump cancels Wisconsin rally [just as Paul Ryan says he'll be there](http://host.madison.com/ct/news/local/govt-and-politics/election-matters/donald-trump-cancels-wisconsin-rally-just-as-paul-ryan-says/article_17bfc60c-e50c-51b6-85b2-994267b3e6f7.html), more details revealed on [Trump affair story that the Nat'l Inquirer paid to keep under wraps](http://nymag.com/daily/intelligencer/2016/11/national-enquirer-paid-to-kill-trump-affair-story-report.html). | 6:\n7: | *8: Election Day* | ??? (Possibly the day Trump black-vans me) |  |  |  | \n", "People like that are never fucked.  They just get hired by a major defense contractor and will get into government again that way. Rinse and repeat. ", "I thought the same thing.  ", "Bernie certainly did not hesitate to use that label during the primaries", "Donald Trump isn't just unfit for presidency he's unfit to run a car wash.", "The only bad thing about minorities being the ones to bring Trump down will be the inevitable surge of open racism from his supporters. I hope it doesn't escalate too much.", "This whole campaign could be an elaborate plan to get his wife deported so he doesn't have to payout on his prenup. Genius!", "I suspect part of the reason he's so confident is because if he's wrong and Trump is elected there's no longer any reason for him to defend his reputation as an election analyst, or to continue his career in Trump's America. Why bother with the country at that point.", "&gt; Two election experts analyze polls in electoral college and congressional races. Sam Wang says \"I'll eat a bug\" if Trump exceeds 240 electoral votes. Source: CNN\n\n&gt; \"...trump was unlikely to break 240 electoral votes. And I think thats pretty much the same honestly this race is the most stable statistically since Eisenhower beat Stevenson in 52\" \n\n", "There has been a decrease in the labor participation rate but I think about 2/3 of the increase is from boomers retiring early and people staying in school longer.  I imagine a fair amount is due to people who lost jobs or graduated during the recession who are no longer looking, but that number doesn't even come close to negating the job gains.\n\nRepublicans always use the total number and not percentage and claim, \"it's higher than ever\".  The biggest reason that's true is because the population is higher than ever.", "What concerns me and whence my discomfort arises, is that he's dumb as a doorknob and a total asshole across the entire spectrum of human existence.  Oh and a shithead.  Liar.  Disgusting petulant pussy-grabbing moron.  Failure in business many times over.  Money-grubbing welcher on contracts and payment thereof.  Has the judgment and emotional constitution of a 12yr old.  And is orange.  That's where my discomfort and concern arises and I highly doubt I'm alone in that.", "of course they don't.  minorities seldom vote republican.  if they did the gop would roll out the red carpet and sprinkle it with rose pedals.  \n\nthe gop cannot provide aid and comfort to the dixiecrats and attract minority voters at the same time.  it's the david dukers or minorities.  ", "So this 46 year old man is going to high school football games, waving a confederate flag, and demanding that black teens be *arrested* for not standing for the NA?  What a loser. ", "&gt; So Trump's campaign was just too lazy to think about the local context\n\nI just heard he is coming to Minnesota tomorrow. The deer hunting firearms season just opened. I don't think he could have picked a worse weekend to campaign here!", "So did Wang.\n\nHe runs: \n\nhttp://election.princeton.edu/", "Welcome to Clinton scandals.\n\n1. Reports on Clintons come in\n2. Republicans blow reports way out of proportion\n3. Media reports Republican reactions for days\n4. Republicans cite media reports as confirmation that scandal is true.\n5. Scandal turns out not to be true media reports story is untrue one time and moves on to other news\n\nWash, rinse, repeat. It's been this way for as long as I've been alive.", "I mean Sam Wang's [research](http://molbiolabs.princeton.edu/wang/research) is in neuroscience, I think he does the election forecasting as basically a hobby. His career as a tenured professor should be pretty safe so he can say what he wants.", "A few hours after he was apprehended the FOXNews website had a story about how he was verbally abused by his mother.", "Oh yeah? I was planning on fucking off on Tuesday but now that you've said something. ", "How insane is this election when Republicans are blaming Hillary Clinton for Iraq?", "Russian Propaganda /r/the_donald.......same thing", "They call him Daddy and God Emeperor. How fucked in the head is that? It sickens me.", "I live in Wisconsin and unfortunately it won't.", "Wonder how many those sites been linked on Reddit. Must be a gold mine ", "I think Trump has kicked the hornet's nest. If this was a bland old Republican like Jeb! or Rubio or Kasich I think you'd see a lot of indifference from the Dem voters but Trump is just so overtly terrifying and repugnant to some groups (Women, minorities, educated folks, \"business\" conservatives) that people are going to come out in large numbers solely to vote against him.\n\nAt least, that's what I hope...", "No you.\n\nNo you.\n\nYou're the you.", "Even if it wasn't Hillary they don't want some guy running the country who doesn't know how to run a casino. ", "They're pretty loud and obnoxious but historically, they don't win shit.", "It's just \"Record Label Talk\"", "How many Trump voters do you want to bet show up on election day and never actually registered? And then will cry it's rigged. I can't wait.", "Does that mean we live in Brave New World now? I'm gonna need some somas. ", "A fucking Typo. Right.", "To be fair god seems pretty insecure as well.", "Desperation like accusing a candidate of actual witchcraft. A former republican presidential aide refusing to endorse a republican presidential candidate because said candidate is woefully inadequate is actual political news. ", "Yea but I feel like you're downplaying the fucked-upness here. Cuz Democrats clearly have their own weak groups but you don't see dems actively trying to prevent those people from voting...", "Speak American! ya rootin tootin holy roller with your strollers clinging god rifle flingin doncha know.", "Yep. Hannity said the same thing last night. Called the president \"unhinged\" and showed footage of Obama shouting at the crowd... Without any explanation of context. \n\nPure propaganda / entertainment. ", "The United States doesn't have an official language. English is just the most common language. The second most common used to be German until 1965 when immigration quotas were altered by the Immigration and Nationality Act of 1965.\n\nAssimilation or the homogenization of culture, doesn't benefit society at large only dominant cultures so they can stay that way.\n\nI appreciate your opinion and I thank you for sharing it.", "What's bad is his supporters believe anything he says.  He is Donald Trump  he has never done anything for anyone but himself.  He tells his supporters he cares about them and they think it's true.  Trump is part of the 1% that is stealing and stifling their wages.  His supporters grease their own asses , bend over and say \"please sir,  fuck me more\". ", "High turnout in general is an issue for Trump. He doesn't have the demographics to win if people vote. He can only hope for Dem apathy and voter suppression. ", "No no, no. You see, if it's a white guy it's mental health. If theyre black they're a lowlife thug.", "I believe that Trump will do the right thing for the American people in spite of never demonstrating that sort of behavior at any point throughout his entire life!", "538 has NV light red and has been ignoring EV from what I can tell. Silver is being overly cautious and most other aggregators have her at 80-90% still. It's better to be nervous than complacent, but try not to lose too much sleep over it. :) Got a good feeling on this one. ", "Dont forget his campaign is basically run by Breitbart.", "Damn. So eloquent that it almost sounds kind. ", "Ronald Reagan wanted to tear walls down.\n\nDonald Trump wants to build one.\n\n'Nuff said.", "Most of it? *All* of it??", "Ditto. Voy a practicar mi espanol porque los latinos son héroes. Estoy muy orgulloso de mis compatriotas latinos. ", "And enough people worship him enough to possibly make him our next President. ", "Get out and vote! This election is historic. Who wants to tell their kids they didn't participate?", "It is TOO fucking probable.  538 has trump at a better than 35% chance.  This is like getting an initial medical test done and finding out that you have a 35% chance of having terminal cancer (cancer is how to view Trump).  I'm very worried.", "I early voted in NV.  Eat shit Trump.  My vote against you is in.", "I don't reckon most people understand the worth of having some [Frictional Unemployment](https://en.m.wikipedia.org/wiki/Frictional_unemployment).", "&gt; Why does Clinton and her supporters hate so many fellow Americans\n\ntop lel why are republicans closing nearly a thousand polling stations in democratic precincts? ", "Just an innocent mistake folks.  /liars", "It all fell apart after the Fairness Doctrine was revoked.  Thanks Reagan.\n\nhttps://en.wikipedia.org/wiki/Fairness_Doctrine", "That's in North Carolina. And the event he canceled was scheduled for tomorrow afternoon in Wisconsin. \n\nDid you think we wouldn't bother to look?", "This.  More than his philandering and his creepy ways, what scares me is his utter ignorance.  That's what could really hurt on Nov 9th if elected.\n\nCan anyone imagine Trump sitting through hours and hours of briefings by advisors while slotting in video calls with world leaders at odd times, and doing this everyday successfully for 4 years?", "Reagan was one of the most vilely anti-gay politicians we have experienced. He completely ignored the AIDS epidemic because of who bore its brunt. Reagan negotiated peace with the Russians by very nearly killing us all in 1983 with his bizarre Alaskan War-Games fuck-up and again as he led us into another arms race which we only won very accidentally because of inner turmoil in the Soviet Union Reagan nor anyone else even knew existed.\n\nTrump is worse than Reagan no doubt but when we glorify him as a moderate, the window moves right and history dies.", "Yeah that's an interesting point. If Trump won, A LOT of statisticians are going to lose their jobs. Eating bugs would be the least of his worries. I think that's why Nate Silvers is being so careful now.", "The conspiracy side of me thinks he is doing this so he can scare us into voting.", "Jay-Z should just tell Trump it was locker room talk", "I'm terrified to think of what would happen if the GOP had somebody with Trump's insanity coupled with Ted Cruz 's intellect.", "Well we all know how [tolerant] (https://i.imgur.com/LRpIuxK.png) Trump supports are now don't we.", "[Someone made a short list not long ago.](https://www.reddit.com/r/politics/comments/5b013v/reddit_users_declare_war_on_hillarys_paid/d9kotxa/)", "&gt; everyone goes to work at 16 and keeps going until they drop dead.\n\nThat's the Republican retirement plan.", "Give it time.", "No and that's why Pence will be doing *all of it*, while Trump \"makes america great again\" - this is the exact scenario pitched to Kasich by one of Trump's sons if Kasich would accept the VP spot. Now it's Pence, and god help us if we're letting Pence actually run the country while Trump continues his pussy-grabfest.\n\n\n", "There was a study that said hostility towards women was the single biggest predictor of Trump support. ", "I was all for the circle.\n\nAnd then I saw Pac Man. ", "Trump supporters getting played everywhere. SAD!", "[\"I think she is going to go down at a minimum as a great senator. I think she is a great wife to a president. And I think Bill Clinton was a great president\" - Donald Trump](http://www.cnn.com/2016/10/19/politics/trump-ny1-clintons/). Yes people change their tune during an election or over time. ", "It's so relevant and telling that he's trying to screw a union that works for him in Vegas while he needs their votes to win POTUS so bad.  ", "If you watch the video not only did Obama not scream at the crowd, he actually *defended* the Trump supporter! He was telling the crowd not to boo the man and to respect his right to free speech. Trump is 100% lying, as usual.", "*No True White Person* fallacy ", "If Donald Trump didn't have a wealthy upbringing he'd be a sleazy used car salesman.", "In case people are not aware: \n\nSam Wang runs: \n\nhttp://election.princeton.edu/\n\nAlong with 538 they were extremely accurate last two elections. Wang was incorrect at 14' midterms however. \n\nNate and Wang are extremely different at the moment. Nate is 65/35 in favor of Hillary. Wang, however, is at 98% chance of Hillary win. Other major aggregators are closer to Wang as well (high 80's low 90's). 538 is trying to factor in polling errors, and in the favor of Trump. So if all of the polls have been wrong, Nate will be right. If not Wang is right. It will be extremely interesting how it turns out. ", "It's called gaslighting. https://en.m.wikipedia.org/wiki/Gaslighting \n  \nAnd now with his wife coming out and railing against bullying. It's calculated. And it really works on people who aren't paying attention. And to the people that are paying attention.... It makes you feel crazy. ", "538 are factoring in polling errors in both directions but when it comes to winning Clinton can't win any more than she already is so the percentage can only go so far in her favor.. But when talking electoral votes for example, 538 predicts a landslide for Clinton as likely as any win for Trump.", "These articles only encourage Clinton's people to stay home on Tuesday.  It isn't over til it's over. Don't stay home!", "I believe the correct term in this case is \"Radical Conservative Terrorist\". \n\nJust check out his prior history and why the cops had a pretty good hunch who the killer was. \n\nhttp://www.nydailynews.com/news/national/suspected-iowa-killer-scott-greene-beat-exploited-mother-article-1.2856737\n\n\"The police slayings came less than three weeks after Greene was removed from a high school football game for unfurling a Confederate flag near black spectators. Video from the incident appears to show Greene arguing with the cops who asked him to leave the game.\"", "\"Inner cities\"", "what's hilarious is how Donald keeps touting Hillary as \"4 more years of obama\" as if that's a bad thing lmfao", "At this point he's pretty much given up on media interviews other than the odd interview here and there. Mainly, because when they had the *audacity* to question the things he said, and afterwards, they're accused of being bias.\n\nThis could've been prevented once they realized Trump bullshits like no candidate before. Simply, stop covering him, don't let his surrogates on air. Leave him campaign to use twitter and his rallies. \n\nBut he brings ratings and eyeballs to the screen and getting a free ride like no candidate  ever", "It's not about balls; it's about modelling. Silver's model allows for a lot more noise and uncertainty in polls as well as some consideration of what he called \"the fundamentals\". When Sam Wang goes wrong it's because his models are overconfident with polling results. That's why, in 2014, Wang was [the absolute least predictive forecaster of the year, according to his own analysis.](http://election.princeton.edu/2014/11/05/midterm-polls-strike-again/) His model put too much stock in the polls and it turns out the polls were unreliable. ", "We'll call that the \"I really don't want to be ordered to commit war crimes\" donation. ", "Just make sure we get our taco trucks in every corner. ", "The right wingers have spent millions of dollars having the Clintons investigated for every crime in the book including murder yet have never gotten a conviction for anything but lying about a blow job.\n\nThe Clintons must be the greatest criminal masterminds the world has ever seen. \n\nIf they are so smart they can commit all those crimes and never leave a shred of evidence --- **I WANT THEM LEADING THE COUNTRY.**", "I saw this last night and it made me so angry. Obama handled that situation with so much maturity. He gave the protestor a tremendous amount of respect even after the crowd was getting angry. He STUCK up and protected an American that probably hates him as a president. He didn't call him names. He didn't incite violence against him. He handled the situation with the manner fitting of a president. \n\nIf there's a single situation that clearly shows why Trump doesn't have the temperament to be president it's this. Just show a side by side comparison of Obama to one of the times Trump insulted and mock a protestor. ", "Seriously how do people not understand this?  He can say pussy all he wants, I'm sure a handful of people were offended by the words, but most were offended by the context.\n\nAlthough I will say, who the fuck says \"grab her by the pussy\"?  Is fucking Borat running for office here?  \"Dez American gurls, you just grab dem by de pussy\".  ", "I think \"White Nationalist Extremism\"  might be more accurate. See also the asshole who shot up the black church in SC last year the 3 guys who planned to blow up an apt complex full of Somali families Kansas, etc. ", "Trump and Reagan may have the Alzheimer's in common tho so Pence wasn't *completely* wrong.", "Trump Conservatives Silent After Voter Fraud Suspect ID'd as a ~~White Woman~~ Trump supporter", "Amazingly enough it's easier to trigger Trump supporters than anyone else.", "\"Riggers\"", "No he wasn't. The last time republicans controlled the presidency, they launched a disastrous war based on lies, resulting in the deaths of tens of thousands, orchestrated the greatest transfer of wealth from the poor and middle class to the rich in modern history, destroyed the world economy, and appointed two regressive, corporate hack Justices leading directly to Citizens United and the gutting of the Voting Rights Act. \n\nTrump being awful doesn't make the corporate neoconservative Republican establishment better.", "To be fair Nate predicted that trump would win the nomination, he just didn't believe in his own numbers. ", "He should be fine. He's always wearing orange.", "Yeah uncertainty favors the one who is trailing not Trump specifically.", "He hasn't forgotten a damn thing! He just knows he can tell a bold-faced lie and get away with it because his followers are just mindless sheep.", "More likely it'll only cost him the Speakership. This *could* come back to haunt him in two years during the primary though but I wouldn't put that much stock in the electorate's collective memory. ", "In North Carlina the GOP was found to be using \"race\" as the only reason to change voting laws.  This was literally a smoking gun for them thinking racism was a legitimate reason to impede people voting:\n\nhttps://twitter.com/nycsouthpaw/status/759095639724683266/photo/1", "[Ronald Reagan’s Son:](http://www.huffingtonpost.com/entry/ronald-reagans-son-trump_us_57560a7ce4b0b60682deb7e5) I’m Not Voting For Trump And Neither Would My Dad", "I think he formerly wouldve been a sleazy used car salesman but now he'd own a sleazy used car lot", "As a mexican your next tacos are on me.", "One of the blacks here.   Bring 'em on. ", "Seriously I think its *perceptual.* \n\nI believe that a long time ago, Trump actually lost the ability to distinguish the dividing line between the sets \"things that are objectively true\" and \"things that I made up\". \n\nThis is probably because since young adulthood, he has surrounded himself with toadies, lickspittles, personal assistants, tv producers and other sycophants who relied on him to put bread on their table. They have consequently been willing, even eager to indulge his growing number of fabulations and waking daydreams. *And* because he has likely fired anybody who ever gave him a reality check that was more than trivial in nature, who put concentrated effort into dragging him out of his self-absorbed fantasies, or who sat him down and firmly demonstrated that he was labouring under an ever-increasing series of self-induced misapprehensions and misperceptions. Those who saluted the boss and did what he wanted, no matter how counterproductive or outright nonsensical it was, thrived. Those who tried too hard to make him see sense, became debris in his wake.\n\nThis is why Trump constantly reverses his positions, then is able to keep a straight face while claiming, \"I never said that\"; he doesn't actually believe he *did*. This is why he honestly believes he has the innate intelligence to school the Joint Chiefs of Staff of the US Armed Forces about battlefield tactics. This is why he actually thinks he has \"one of the world's best memories\", despite having sat down in a witness box on multiple occasions, and in each instance stated, \"I don''t remember\" over, and over, and over. This is why he really, truly thinks he possesses the rhetorical and diplomatic skills to successfully tear up and renegotiate highly complex and abstruse international trade agreements, without bringing serious economic consequence down upon the nation. He's not blowing smoke - he *really thinks* he has these skills and advantages over us mere mortals.\n\nThis is why he has spent so many hours watching cable news and tweeting about what he saw at 3AM, and has spent so little time listening to his policy advisors; the right's media echo chamber supports not only the fantasy world-picture he has created for himself, but steadily reinforces his rightful and central place within it.  Whereas most of his campaign advisors only try to drag him out of his warm, soft, well-lubricated waking daydream, and back into a cold, hard, dry, here-and-now that is much less supportive of his delusions. This is why he insists that attendance at his rallies are a better indication of his support, than are objective polls: the *rallies* support the world-fantasy in which he is now 100% emotionally invested; the *polls* contradict it. And he naturally gravitates to things that confirm his fantasies, and spurns things that demonstrate their insubstantial and ephemeral nature.\n\nFinally, this explains exactly why he has spent more on *hats* than on polling to keep track of his standing. It's easy for him to fabulate and imagine fantasy polls that show him strongly in the lead, and that he doesn't have to worry ... but he hasn't yet submerged himself deeply enough into his self-induced and nearly perpetual imaginings to actually hallucinate *hats* that do not exist in objective, three dimensional reality.", "Imagine if Obama said ONE of the things Trump has.  Or lived an even moderately similar lifestyle (different babies with different mamas).  Hell he couldn't even use the same tones or inflection as Trump lest he sound like an 'angry black man'.  Its bad for Obama.  Its going to be bad for Hillary as a woman.  At this point though, the GOP is pretty hypocrital about near everything.", "If Clinton takes Florida Trump is completely finished. \n\nGet out there and vote, Floridians.", "No one wants Trump's shit smeared on them except the crazies who already wallow in it.", "Does no one realize we've been hurling the same argument at each other for like a while now?\n\n\"If ____ had been ____ then the right/left would be outraged!\"", "In all fairness... rage is his default setting.", "Perhaps that's why their subreddit literally has a rule of \"no dissenters\" -- to not trigger their easily rustled jimmies.", "http://i.imgur.com/Tv3IgIp.jpg", "I have several friends whose parents are career military and former Trump supporters; when he first went against our own country's military months ago all almost all of them quietly turned against him. \n\nAnecdotal for sure but I have long been hoping that military and ex military were going to have a voice against Trump in this election.", "It works on extremely stupid people", "Crooked Hillary a'mirite? \n\nAlso \n\n\nBOMBSHELL! HILLARY WILL BE GOING TO PRISON  FBI AGENT TELLS ALL!", "Where are white fathers?", "They have achieved critical ass.  ", "So she's a criminal? \n\nAnd she wants to be First Lady?\n\nOf course I don't care but if conservatives had ideological integrity they would. ", "And Sam Wang was [out in front in Jan 2016](http://election.princeton.edu/2016/01/05/what-december-polls-can-tell-us-about-the-gop-nomination/) saying Trump was likely.\n\n&gt; The only candidate with all #1 and #2 rankings is Donald Trump. Therefore if 2016 were to follow the pattern of past elections, he would be the most likely nominee.\n\n\n\n", "I'd almost eat a bug if they don't chose a centipede.", "Those few rats who were afraid to jump off the ship earlier are now going to make a desperate leap and hope no one notices. We're noticing.", "Live look in at the_donald: The blacks are destroying America!!!", "that's pretty much his MO.\n\nAnd it's gotten him this close to the Presidency. People simply don't fact check. They don't read or listen to the news because it takes too much effort. They'd rather be told whatever bullshit he spews and get stirred up over nothing", "\"She doesn't need my vote.\"\n\nDo you want to tell our kids you didn't vote AGAINST this psychopath and FOR the first woman president? Or should I tell them?\n\n\"...fine I'll sign it - you mail it.\"\n\nGot my wife to vote :)", "And \"Democrats\".", "No actually. Jon Ralston is well known to have successfully called the last 3 elections in Nevada and is generally looked to as an expert there.", "Can citizenship obtained illegally be revoked in the USA?", "Rap songs are also entertainment works of art. Artists take on personas and tell stories. Trump was just bragging to a douchebag on a bus.", "a.k.a. \"Weaponized Stupid\".", "[deleted]  \n ^^^^^^^^^^^^^^^^0.9397 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/39784)", "Isn't he also the guy who thinks being gay is a disease?", "We can blame the media all we want but the simple fact is that millions are voting for him because his hateful message resonates with them. Not sure who to blame for that but it is what frightens me more than anything else. Even if Trump loses this new reality will never go away. Trump has uncovered an ugly truth about the US. ", "But he has the best temperament. You wouldn't believe how good his temperament.", "Sadly it is a secret to most of his supporters. ", "I don't think you know what hypocrisy is. Trumped bragged in a conversation about having sexually assaulted women. Jay-Z wrote a song. If you think these two things are the same you aren't thinking.", "He recommends treatment at gay-to-straight Christian conversion camps.\n\nFucking wish I was joking how crazy this guy is.", "No no, the list of people I have to laugh at on the 9th is too long. You won't make it on to that list. There's just no room. ", "I'm stealing that. ", "Let's not forget that this will validate and embolden all of the racists mysogynists, homophobes, the whole alt-right, white nationalist movements, even simply ultranationalist movements that have the same view of America than Trump, and the GOP will believe that all the bullshit that Trump spews *works*, and if you guys ever wanted a sane Republican Party, too bad! It's gonna get WORSE.", "No he's talking about the same Reagan who was a movie star and political novice that was easily manipulated into supporting policies that only benefited the super rich.", "Wait this is a joke right ? Bill Clinton Cigar Aficionado extraordinaire said this ?  ", "And I've never heard of you. Neither mean much. ", "Genuinely curious when you ultimately decided to post this comment, did you honestly feel like you contributed something worthwhile and well thought through?", "Trump is done without Nevada.\n\nHillary should have used those fireworks last night.", "Simple. You let your campaign staff and VP do all the hard thinking while you run around \"making america great\"", "Gotta say I have gotten a lot more respect for the mormons after this election. They wouldn't compromise their morals in order to vote for someone like Donald. The evangelicals on the other hand, has shown their true colors.", "Only for terrorist threats and war crimes iirc. \n\nNot saying that marriage to Don is neither, btw...", "Didn't Donald Trump say Hillary would make a great president? Truly the best words right here folks:\nhttps://m.youtube.com/watch?v=N5A02pNcGHs", "trump hates successful black people. No surprise there.", "I periodically visit /r/the_donald - once a month or so - and did so yesterday. The stickied post featured a cartoon image of Huma and Clinton \"scissoring\" each other. It also advertised a new subreddit specifically designed for the dank memes they make. I'd like to think those people aren't old enough to vote but I might be deluding myself.", "well yeah of course.  it's a really big disappointment for them.  they were hoping \"black gay muslim for hillary\" but instead got a run of the mill redneck for trump - with rebel flag + gun.  ", "Yeah well if the people hurling the argument around had been Trump supporters, then the left would be outraged.", "Oh shut up. Not everything is biased and if you don't like the truth about Trump head over to r/the_gropper", "I was working the ground game in Las Vegas yesterday on the last day of early voting. I didn't see a single indication that the republicans were doing the same.", "Nice username you got there!", "Because not everybody is as smart and educated about the etymology of words as you.", "Throw in some Marco Rubio looks and Jeb! cachet and baby you've got a stew going. ", "&gt;How is there no Christian groups going crazy over this?\n\nBecause they're the ones saying how a First Lady Melania Trump will restore the class and dignity that been missing from the White House for the past 8 years.  (Code for Michelle Obama's black so can't have class and dignity. Only white people have that.)\n\nNot kidding, saw that on TV after Melania's plagiarized, cognitive dissonance speech the other day.\n\n", "It's absolutely necessary it's the keystone (how appropriate) to shutting trump out.\n\n Based on today's info about WI NV and PA it's all over but the voting. ", "Because private coversations and art are the same thing", "Floridian Latino here voted last week.", "Radical Islam is not an existential threat to America. They can kill people but they don't have the power to damage the Nation, and never will. They should be fought and eliminated, but let's not exagerate their importance.\n\nTrumpism, on the other hand, IS a threat to the very fabric of the Nation. They can destroy the basic principles of the republic and kill the country from the inside. That's way more dangerous that any foreign terrorist group.\n\nAnd look how fast they have turned to violence. They are talking about murdering Hillary and starting a second civil war right now. This is how terrorist movements start.", "Here's Sam Wang's map showing Trump over performing polls across the board:\n\nhttp://www.270towin.com/maps/princeton-election-consortium-trump-outperforms-polls\n\nClinton has 268 votes on that map. At that point, if she wins any one of NH, NC, FL or NV, she wins. All this talk of her losing PA or WI is silly, the only other state that's been intermittently weak is CO. ", "Neat.  Don't buy Jay Z albums.  I'll vote against Trump and we'll call it square.", "Imagine if breitbart didn't try to sell me a trump hat when I clicked on an article.", "That's because Silver decided to ignore the polls on Trump just like the Bremain people ignored the polls with Brexit ahead. Both were predicted by the polls, but the pundits ignored the polling and now we have people trying to rewrite history to say \"The polls missed Brexit, and they're going to miss Trump on November 8 too!\"", "Well yeah. Here are the options:\n\n1) Clinton gets into the White House, Bernie and supporters can play the \"We helped you get here, now help us get what we want\" card.  \n2) Trump gets into the White House, Bernie and supporters get utterly ignored as the country moves in the exact opposite direction they want.", "Hey! Black people with our 0-2% support for Trump are helping too! (when we are not being deleted from the voting rolls)", "I can't wait for the taco trucks on every corner!", "It's well-known that reality has a built-in liberal bias.", "It's so true. Listening to Pence always makes me feel crazy.\n\n\"How do you feel about Trump saying (fill in the blank)?\n\n\"He never said that.\"\n\n\"But... he did. On tape. We all watched him say it.\"\n\n(Chuckle grandfatherly shake of the head) \"No, that's just ridiculous.\"\n\n", "And if he exceeds 270 we'll all be eating bugs while huddled in the burned out hellscape that used to be our neighborhoods.", "Well if he don't like his lyrics he can press fast forward.", "What? I couldn't hear you over the crunch of this delicious taco. If you want one too there are trucks selling them everywhere now.", "[deleted]  \n ^^^^^^^^^^^^^^^^0.9798 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/81835)", "/pol/ had like ten threads about it mocking Obama for getting triggered by a protestor. I can't even. ", "I don't know how they square that with how Trump deals with protesters.  I guess they like it when he insults and tells the security to remove them.", "I think you actually really onto something there.", "Hell no. Landslide this racist", "holy shit. went to the link about it. They're attacking him for \"attacking\" the crowd's 1st amendment to shout down the trump protester???\n\nwhat kind of mental gymnastics does it take? I know they're trolls but when trolls are trolling each other in a subreddit of trolls how does it make sense????", "Also sometimes forgotten is the white supremacist who, similar to the SC church shootings, walked into a Sikh Temple a few years ago and started randomly murdering the Sikh worshipers https://www.youtube.com/watch?v=HLzM3YtQZuk \n\nIt seems to be a pattern with these folks, but I've never heard the alt-right talk about more screening for radical white domestic terrorists..", "He'd have owned a couple of Japanese lots in the early 90s then lost them in a bankruptcy during the biggest boom in the economy, then come back by leveraging his name to star in a series of commercials and selling his name for a franchise of low-quality lots that specialized in overpriced lemons and predatory loans.", "All of them.", "Gaslighting is a different type of lying. It's so blatant. And it's unprovoked misinformation... \"Hillary started the Birther movement. Obama yelled at a Trump supporter. Etc\" Its purpose is to totally frustrate confuse and overwhelm. It's psychologically abusive. \n  \nLying is a little more of an effort to preserve ones self. It's more defensive. While gaslighting is offensive. ", "I think any decent human being would condemn the things that Donald Dump has said &amp; done. ", "Lara Trump (Eric's wife) said the same thing right before the new FBI release and there hasn't been anything else since...", "Vote and then fuck off.", "It's already great we're going to keep it great and make it greater after we prevent Donald Trump from stepping into the Oval.\n\nEveryone get out and vote! It's not over yet!", "Gracias amigos!", "He was also a proud Confederate who was removed from a HS football game for waving the Confederate Flag in front of a bunch of black people. \n\n", "Guys come on. Silver has explained his methodology. Don't stoop to Trump supporter stupidity. His method is a tad more cautious but is almost definitely still accurate. ", "\"Freedom means you either do what we say agree with us all the time, and elect who we want, or we'll shoot you for treason\" - Republicans ", "Three wives three cases of adultery, endless cases of sexual assault and endless insults to women.\n\nBecause, Jesus and Moses said so dammit!!!", "Thank you!\n\n^^sorry ^^about ^^my ^^racist ^^parents.....they ^^were ^^born ^^in ^^a ^^different ^^era ^^(/s)\n\nsigned a thankful white millennial ", "Rob Ford", "Vote. This would be Trumps America. ", "This is exactly why diversity really is better. Minorities are saving us from driving the country off a cliff.", "From the comment section. \n\n&gt;RIP to the brave officers. Another lefty wingnut agitated by the anti-law enforcement mantra of the corrupt media.\n\nOh boy..", "State polling &gt; national polling?", "she isn't going to listen to them once she is in the white house", "Jay Z isn't running for president. ", "And the two Bush presidents aren't voting for Trump either.", "I took the day off to vote. Myself 2 bad hombres and a nasty women are making an event out of it. ", "That's silly there has been a significant tightening, not just in Silver's model, but also in a pure poll aggregator like Real clear politics. The model evaluates polls, what did you expect it to do when the polls tighten?\n\n I'm not sure how Clinton winning would discredit silver either, considering he has her as the favorite to win and has for months.\n\nClinton voters are mad at 538 right now because their odds make them uncomfortable\n  Trump voters have been mad at the pollsters for months for the same.  Two sides of the same coin on here.", "Gas lighting is a more manipulative tactic in my opionion. It's not trying to hide something from someone, but rather cause them to doubt what they've seen and experienced. It can make people feel crazy, like their perception is off.", "IF MY RACISM AND SHIT BEHAVIOUR ISN'T VALIDATED BY CROWNING KING SHIT I'LL SHOOT SOMEONE\n\nThis argument in a nutshell.", "Which corner will your taco truck be at?", "And make sure to take the Donald with them. Cuz you *dont split the families* ", "Explains why his base is so enthusiastic. ", "It's not racist to say black people like hov. We do", "Yes.  It most certainly could but denaturalization is extremely rare and usually saved for egregious cases but not always.  I have seen immigration denaturatize someone who did not disclose a minor arrest on their naturalization application that would not have affected the naturalization if disclosed, which seems on the minor side.  Melania's unlawful work was not likely disclosed when she obtained her residency (green card).  Then she applied for naturalization and probably lied and said she had never lied or mislead to the US government before.  So immigration could do it, but it's highly unlikely.  ", "&gt; When you’re young you look at television and think, There’s a conspiracy. The networks have conspired to dumb us down. But when you get a little older, you realize that’s not true. The networks are in business to give people exactly what they want. That’s a far more depressing thought. Conspiracy is optimistic! You can shoot the bastards! We can have a revolution! But the networks are really in business to give people what they want. It’s the truth.\n\n-Steve Jobs", "Wait I thought liberals are all effeminate pussies who soil themselves at the mere sight of a gun.  It can't be both.", "Only if Clinton wins. VOTE!", "There are sad days ahead for you. Remember to keep your chin up and be proud. You voted for an orange TV host for President of the United States. That takes... something I am not sure what, but it took something to do that. ", "It's an exaggeration to say Clinton supporters are mad at polls. Most of us are boring centrist that just see them as general data. I think we're all just nervous. ", "I'm going to post Nate Silver's response to this article. For the record while I'm sympathetic to the points Grim is making in this article, I think he's misunderstanding how Silver's model works by presuming that Silver is just arbitrarily \"unskewing\" the polls.\n\nI am, however, upvoting this article, even if I think it's wrong. Nate Silver's model is an outlier compared to other models, and I think it's good to examine why that might be.\n\nhttps://twitter.com/NateSilver538/status/794994593574113282\n\n&gt; This article is so fucking idiotic and irresponsible.\n\nhttps://twitter.com/NateSilver538/status/794994991730933766\n\n&gt; The reason we adjust polls for the national trend is because \\*\\*that's what works best emperically\\*\\*. It's not a subjective assumption.\n\nhttps://twitter.com/NateSilver538/status/794996132946608128\n\n&gt; It's wrong to show Clinton with a 6-point lead (as per HuffPo) when \\*\\*almost no national poll shows that\\*\\*. Doesn't reflect the data.\n\nhttps://twitter.com/NateSilver538/status/794996711315951616\n\n&gt; Every model makes assumptions but we actually test ours based on the evidence. Some of the other models are barley even empirical.\n\nhttps://twitter.com/NateSilver538/status/794999198894751744\n\n&gt; There's a reasonable range of disagreement. But a model showing Clinton at 98% or 99% is not defensible based on the empirical evidence.", "Oh for sure. I already voted so I can fuck off whenever I feel like. ", "*He's just a good ol' boy never meanin' no harm*\n\n**EDIT** Why thank you!! I never thought the \"Dukes of Hazzard\" theme song would bring me so much honor. \n\nThanks again!", "Tacos are the new freedom food this year and are also seasonally delicious.", "it's also why this is a cry on the deathbed. The demographics from 2020 onward will not allow this fuckery any more. Thank god. ", "Seriously. I have never seen a study of \"Oh no we are winning to much I am staying home\". \n\nI have seen the opposite. People like being winners. ", "Well he loves the poorly educated!", "Every Tuesday will become a national holiday.", "The main reason there's so much uncertainty in 538's model is simply because there are a lot more undecided voters at this point in the election than there usually are in most election years. If it weren't for that Clinton's chances in 538's model would look a lot better.", "Silver is also trying to get back his street cred after screwing up the Republican primary so bad. He's playing it as safe as he can so that in the off chance Trump does win he can say that he called it. ", "Trump supporters call themselves centipedes. Symbolically it'd be a defeat. They won't choose centipede. ", "My personal prejudices I'm afraid.", "Plus it's highly demoralizing for the other team. \n\nIt depresses turnout if they know their candidate is toast.", "Clinton has plenty of flaws and is open to a good amount of criticism but I think it's notable that nobody who's actually worked with her thinks about her as evil or dumb like a good number of Americans do. She's a smart woman with good intentions who has made some questionable decisions.", "That and accounting for biases with individual pollsters.", "Vote. \n\nBut this already is trump's America. He didn't have to win to ruin everything. \n\nSo vote. And vote often. Midterms state, local. Vote. ", "You'll hear those at a Trump rally too...but the meaning is way different. ", "&gt; This random piece of shit murderer does not represent him or us.\n\nYes, he does. The rhetoric you support enables him. You don't enjoy the privilege of deciding what the rest of the world sees as representative of you or your movement.\n\nI mean, fuck, your own meager post history includes a defense of Trump bragging about committing sexual assault, and a disgusting attempt at suggesting that his \"and when you're a star, they let you do it,\" line implies that he received consent.", "One side actually pretends to give a shit about the poor and uneducated. The other relies on racism to get a bunch of dumb poor whites to vote against their own economical interests", "He didn't even get to Pence.  *Think about that...*", "&gt;This is the very definition of hypocrisy.\n\nThe fact that Donald is complaining about profanity is hypocrisy. The fact that Trump supporters accuse Liberals of wanting \"safe spaces\" and then complain about song lyrics being too profane for them, is hypocrisy. For you to even bring Lena Dunham into this tells me that you are just parroting the words of other people and have never had an original thought of your own.", "That or they can't satisfy the voter ID requirements..... I can hear it now --- \"But i'm White! Can't you see that?!\"", "Sure thing I'm wondering why someone would post something that, if you examine the reality of the situation, is so completely idiotic, and I presumed any rational person who read your post thought the same thing.  Granted the caliber of your comment is not uncommon on this sub, but nevertheless:\n\nTrump has been using a teleprompter at every speech, rally, or apology for the duration of the campaign, and it's one of the chief reasons for his success.  When he goes off teleprompter, his poll numbers sink.  \"Stay on point, Donald, stay on message, Donald\".  \n\nMeanwhile, Obama in any interview, sans teleprompter, comes across as measured and knowledgeable, and his answers are always reinforced by explanation containing information that is clearly reasoned through.\n\nSo it seems like you either lack such a tremendous amount of knowledge, or you posted it knowing it's completely in conflict with reality, and I wondered if you honestly felt good about that. ", "I'm just hoping that Nevada and Florida both put Trump down. I'm pretty sure Clinton will win but a narrow win won't make me comfortable because not only will the Senate probably look stronger for Republicans than in the case of a Clinton blowout, but him and his ideals absolutely need to be firmly and bluntly ***rejected*** by America, and a narrow Clinton win won't do that.", "Watch Trump cite this and bring like a live scorpion to a rally or something.", "unskewing sounds dumb when the right says it and it sounds dumb when the left says it.\n\nNate's models just accounts for excess uncertainty, and assumes swing states trends in polls reflect the rest of the swing states.  that's why a Louisana poll can then cause Nevada to go red.\n\nIt's good to be grounded with uncertainty, but, there are other forecasts using alternate models.  Look at them all and compare methodology.\n\nhttp://www.nytimes.com/interactive/2016/upshot/presidential-polls-forecast.html\n\nThe important take home message?  She leads in them all as a clear favorite.\n\nIt would be the upset of the century if he won.", "He ignored them because he thought the Republican party establishment would convene around one candidate give them their resources, and pull out all the stops to kill a Trump nomination. He also thought that most of the candidates would be gone after Iowa or so. None of which happened.", "[deleted]  \n ^^^^^^^^^^^^^^^^0.4171 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/82384)", "The Breitbart comment section is great. It's a wonderful example of the worst in this country and a fine batting cage when one needs to let off steam.\n\nIf you have a friend that supports Trump, gently show him the responses to any Breitbart post, and watch his/her reaction.", "Well of course you need a safe space when everything triggers you", "I teared up a little bit watching those videos of people walking down the voting line.\n\nIt truly is beautiful. When many parts of the world are turning to fascist populists we will reject them. \n\nI love you America.", "Made all of heavens and earth so that he'd have beings around to worship him. Can you imagine if an author wrote a book for the sole purpose of having the characters say how great the author is? On the other hand the plot does seem to be getting more interesting lately. Who could have predicted the UK leaving the EU, the South Korean president being controlled by her personal shaman, and the US presidential race coming down to an ex-First Lady and a racist orangutan, all in the same year? If god keeps this up, the next chapter should be insane.", "Of course if you make a similar claim about letting in refugees _then_ it becomes ridiculous to them", "Ok I'm just going to say it.\n\nI think Obama is a pretty A-Okay guy.", "\"Why can't I say the n-word?? Its not fair!\"", "That sub is from another planet. They believe everything they hear absolutely everything, and they're convinced that every fake story is about to hit the front page of every newspaper as a major scandal.", "\n\n&gt;Go ahead an play the victim it's what liberals are best at anyways, but your comment has no basis in reality. \n\nI'm digging this projection Trump supporters have. \n\n", "Funny the \"no, you\" comeback is Trump's best defense!", "How could I have forgotten Rob Ford?!  RIP funnyman.", "I overheard something similar at lunch. \"Look at the map it's all red in the middle and their trying to tell me Clinton is up?\" Guess they're hoping we use the land mass vote.", "Trump supporters won't talk about this one", "Bill seems to forget about his multiple rape accusations as well as adultery while holding the office of presidency..", "I don't give a shit who you support. Stop replying to the bot for visibility. ", "Trump's totally trolling Ryan now surely.  How many times has Ryan held back, only to be forced into an endorsement and the second he does, Trump says/does something stupid (again).\n\nCan't help but think of this, repeatedly, with Trump and Ryans relationship;\n\nhttp://www.blog.mamasturnnow.com/wp-content/uploads/2013/09/lucy2.jpg", "All the self righteousness of the Puritans with none of the conviction", "&gt;\"Bernie supporters are going to march to the polls and defeat Trump\" Malitz says. \"And then we're going to turn around, organize just as ferociously as we did during the primary, and hold her feet to the fire.\"\n\nAs a Bernie supporter turned reluctant Clinton voter I would love to hear some solid details regarding plans to \"hold her feet to the fire.\" \n\nIt's nice to think something like that is possible, but don't see how, once elected, she is at all incentivized to push a liberal agenda or how any organization other than an extremely well-funded lobbying group is going go about influencing her party.", "1a) Clinton gets into the White House Democrats take over the Senate, and the Democratic long-shot House takeover comes through.  Bernie and other progressives are critical constituents in legislation getting through Congress.\n\n1b) Clinton gets into the White House, Democrats take over the Senate, but Democrats miss out on the House, although they narrow the Republican majority.  Bernie and other progressives are key players, although balanced by House Republicans.  Bernie and other progressives in the Senate are critical constituents of Senate-only votes, such as confirming federal judges and Supreme Court justices.\n\n1c) Clinton gets into the White House, but Republicans maintain control of both houses of Congress.  Bernie and other progressives are relatively unimportant.\n\nDear fellow progressives: strongly consider voting for those downballot Democrats—progressive, centrist, or otherwise—in the House and the Senate too.", "And gays and jews, and women, and the college educated!", "And the funny part was **THEY** saved us from a rapist.", "Gracias.", "We'll probably have to make our own well funded lobbying group...with blackjack! And hookers!", "Most it appears, are good people.", "Just a reminder that **you still need to vote**. This is only a projection of the Electoral College map. It doesn't become official until every vote is counted. Let's go out there on Tuesday and make sure Trump doesn't win! For America!", "My wife immigrated to this country. This is the first election she'll be voting in. The anti immigrant tone of the right has basically ensured she'll be voting Dem for the rest of her life. When the old angry white people begin to fade away, I think the GOP will understand what an unmitigated disaster 2016 was.", "They don't square anything away. It is a pure double standard nothing more.", "Do we have to say it out loud?   \n\nOk fine we live in a society where we keep neo-nazi right wing nationalists on a longer leash than we do black people because we gain massive social benefits from it. We get this awesome paramilitary force that's willing to fill our police stations, and when war comes they enlist in very high numbers. All we have to do is pretend it doesn't exist, which is easy.", "Right now Latinos are out saving this nation and democracy from its own people, as half the white population went crazy and decided they want fascism.  I'm so fucking grateful to them right now.  True american heroes.  We all need to follow their lead. Vote!\n\n\n", "If we defeat Trump this country owes a HUGE thank you to African Americans, Gays, Latinos, Muslims, Women, and other minorities for being the sober designated drivers this season.", "There's a reason Sanders endorsed Clinton.\n\n [Bernie and Clinton voted the same in the senate 93.1% of the time](https://www.washingtonpost.com/news/the-fix/wp/2016/02/06/the-rare-times-that-hillary-clinton-and-bernie-sanders-disagreed-in-the-senate/?postshare=451454762357703&amp;tid=ss_tw) \n\n\nIf you really care about policy then you'll understand why Bernie is endorsing Clinton. Because if Trump wins and he has a Republican congress and Republican senate [he promised he will appoint super conservative supreme court judges](http://www.rightwingwatch.org/content/trump-says-his-scotus-nominees-would-be-close-scalia-you-could-find) and this country will go so far right you won't recognize it...and it will stay that way for generations....\n\n**Supreme appointments are for life!** \n\nIf you care about....\n\nThe labor movement (unions)... \n\nWomen's rights...Democratic party.\n\nCivil rights...Democratic party.\n\nClimate Change..Democratic Party.\n\nThe EPA...Democratic Party.\n\nConsumer protection...Democratic Party.\n\nInternet freedom...Democratic party.\n\nSocial Security...Democratic party.\n\nMedicare...Democratic party.\n\nNational Parks service...Democratic party.\n\nOriginal \"minimum wage\"...Democratic party.\n\nFight for $15.00 minimum wage...Democratic party.\n\nFight *against* unlimited money in politics...Democratic party.\n\nThe fight for universal healthcare...Democratic party.\n\nNot all these battles have been won yet but it's the Democrats who are fighting *for* them and it's the Republicans that  they are fighting because the Republicans are *against everyone of these issues or agencies.*  \n\nA super conservative court will end any hope for any of these things for at least a generation, look what the last conservative court did for unlimited money in politics (Citizens United) now it's almost impossible to change because they ruled it was constitutional. \n\n**TL;DR A Clinton win *guarantees* a seat for Bernie at the table!!!!!**", "2016: the year white males finally jumped the shark.", "&gt;And the funny part was **THEY** saved us from a rapist.\n\nu/dkliberator's [comment](https://www.reddit.com/r/politics/comments/5bc2qr/2016_the_year_latinos_saved_america/d9nc0jy/) in another thread.", "&gt;When the old angry white people begin to fade away,\n\nThis is exactly why Trump was saying it's the GOP's last chance. \n\nIt is - until they learn to accept all people and start arguing on economic policies, instead of identity politics with support of the KKK.", "&gt;1) Clinton gets into the White House Bernie and supporters can play the \"We helped you get here, now help us get what we want\" card.\n\nAnd Clinton ignores them because why should she listen?  They voted for her this time around, she can take those votes for granted.  They have no leverage. \n\nThey'll get ignored either way.", "Guess a few Latinos aren't just rapists eh Donald?", "&gt; why should she listen?\n\nCause HRC certainly wouldn't want a *second* term.", "Like how Trump believes that Mike Pence \"gets a pass\" on supporting the Iraq War but that Hillary Clinton \"does not get a pass.\"\n\n(This is leaving aside his own bizarre imaginary relationship with anti-war sentiment, but it is an obvious double-standard.)", "I seriously don't understand who Trump was trying to reach with the \"taco trunks on every corner\" line.  Who doesn't like tacos? Conveniently located tacos even?", "Yes but she isn't going to lower taxes ban abortion, privatize roads and axe the EPA.  Status quo is preferable to moving backwards.", "When latinos come to save america they're not bringing their worst... they're liberal, intelligent, have common sense, and some, i assume, are idiots. ", "Trump supporters are *desperate* to use Bernie as a wedge to pull support away from Hillary.\n\nThe favorite concern troll for Trump supporters is the \"angry Bernie supporter\" that just wants revenge on the DNC.\n\n\"Guys if we just set back progressives back 10-20 years, we get to say \"I told you so\" and everything will be great! That's worth it, right?\"\n\nBut if Trump wins Bernie may as well retire. His career and influence is completely over. His use to Trump as a wedge will be expended and the left will be out of power for the foreseeable future. Bernie knows this.\n\nInstead of Hillary policy vs. Bernie policy. With Bernie being the spiritual leader of the left.\n\nWe will have our national policy debate between the far right conservatives and even further right conservatives. With Trump as the bully in chief, trashing the out of power left and setting progressive policy back a generation with his supreme court picks.\n\nThe people falling for the Bernie concern trolls, hopefully, are just other concern trolls. No rational liberal person who cares about progressive policy would want to destroy it for petty revenge... Hopefully.\n\n", "And some I assume, will prevent me from becoming President.", "You're cute but let adults do the talking please ", "The Tea Party literally fucked shit up from 2009 got elected in 2010 midterm elections, and are now the core of the GOP.\n\nObama had to work with them, somehow.", "It's interesting because I feel like in 2008 Obama was being pulled to the right by a Democratic Congress and Senate.", "His punishment is to lose on Tuesday and i'm not even sure he will accept the result but i couldn't care less so long as the world is spared from 4 years of President Rapey the  Clown.", "Somehow this lie was even more shocking to me than all the others.\n\nObama reacted in the greatest way possible and Trump just turns it around and acts as if Obama did something hideous. Despite doing *that same hideous thing all the time*.\n\nI was always disgusted by Trump, but mostly his blatant lying was just amusing to me. This time he *really* struck my nerve though. This one is one of the most despicable lies I've ever heard.", "No they know it happened. They just think its a sign of smartness.", "de nada", "Don't forget about women. The only women I see voting for Trump are conservatives past child bearing age and some of them will vote for Hillary and lie about it.", "The liberal wing of the Democratic party could actually take some notes from the Tea Party. Those guys feel somebody is not conservative enough? They primary their ass out and replace them. \n\nNow I beg you, don't replace them with actual nutjobs who's only qualification is ideological purity, but the difference between the right wing and left wing fringes is that the right wing fringe actually gets shit done. The left wing has one Bernie Sanders. The right wing has a enough nutters to actually throw a wrench in the works. ", "&gt;[...] Clinton can't win any more than she already is [...]\n\nShe's tired of winning folks! ", "Actually it was [Marco Gutierrez](http://www.huffingtonpost.com/entry/taco-trucks-on-every-corner_us_57c8d112e4b078581f127680) and he was basically trying to scare white nationalists into thinking their culture will be overtaken by the Mexicans.", "Just wait until election day. Latinos for some reason seem to have had issues in past years being motivated into early voting. Hillary will surge even more.", "I like to think of it as the year Americans saved America.  ", "In his editorials I think Silver sticks to it a bit longer because of his mistake with Trump, but his model isn't particularly influenced by that. Silver's mistake with Trump was ignoring polls and ignoring the outcomes of his own models in favor of punditry. This is different. Here, the model is predicting a level of uncertainty and Silver is just talking about what the data says. It's not like Silver makes up the percentages on the fly--he built the model months ago and let it run. And now it's telling him that Trump has a legit chance of winning.", "If he runs for president in 2020 Democrats will definitely paint his wishy washy Trump support as politically craven.", "Bullshit and Lies?", "Except you do Clownface Von Fuckstick. ", "I'd prefer a president who won't put me in a position where I have to consider the legality of an order. I used to think that was a low bar to meet. ", "Let's hope they continue to vote in large numbers in future elections. I'm afraid the muck Trump has dredged up into the light this year isn't going away any time soon...", "This is misdirection. He's mad Beyoncé is hitting the campaign trail for Hilary but knows he won't  do himself any favours by attacking her (because he's already down on women votes). \n\nInstead, he goes after Jay Z, which will likely play better with his core following and cause less damage among undecided voters. ", "Nope. The only way to pressure her is by telling her that she is not entitled to my vote. Voting for her just enables her and tells her she can do whatever the hell she wants but as long as she is one iota better than a demagogue, she gets the vote. The only way I can hold her accountable is by not voting for her. She has 4 years to earn my vote back in 2020. The only way to hold her accountable now is by not voting for her.\n\nHow do you pressure someone once she's in office and knows she essentially has your vote no matter what? That's what voting for her now is saying.\n", "There's no medical proof out there Trump actually has a pathological disorder but reading Mayo Clinic's [DSM-5 criteria for narcissistic personality disorder](http://www.mayoclinic.org/diseases-conditions/narcissistic-personality-disorder/basics/symptoms/con-20025568) is quite uncanny.\n\n&gt;    - Having an exaggerated sense of self-importance    \n&gt;    - Expecting to be recognized as superior even without achievements that warrant it    \n&gt;    - Exaggerating your achievements and talents    \n&gt;    - Being preoccupied with fantasies about success, power, brilliance, beauty or the perfect mate    \n&gt;    - Believing that you are superior and can only be understood by or associate with equally special people    \n&gt;    - Requiring constant admiration    \n&gt;    - Having a sense of entitlement    \n&gt;    - Expecting special favors and unquestioning compliance with your expectations    \n&gt;    - Taking advantage of others to get what you want    \n&gt;    - Having an inability or unwillingness to recognize the needs and feelings of others    \n&gt;    - Being envious of others and believing others envy you    \n&gt;    - Behaving in an arrogant or haughty manner    \n    \nNow for the scary part. Imagine Trump had a slightly more positive personality  --just a person with normal humility and with a bit less arrogance, unwarranted self entitlement, or exaggerated ego-- but with the same policy proposals, he would actually have had a chance of winning, although his actual policy proposals such as [his fiscal plan which includes ridiculously huge tax cuts for the richest](http://www.taxpolicycenter.org/publications/analysis-donald-trumps-tax-plan/full) are still laughed away by tax policy experts.", "She's never been very ambitious...", "It's more than that. I think he fundamentally doesn't *know* much about anything.  He leaps to hyperbole because it gives him the wiggle room of either a)backing off (Just JOKING) or b)doubling down (SEE I knew it!).", "2016 will be my go to rebuttal to racist claims of black intellectual inferiority. ", "And I wish I didn't have to picture an orange 70-year-old shoving his tongue in someone's mouth and grabbing their genitals.  \n\nI wouldn't be comparing Trump campaign to anyone when it comes to filth and corruption. ", "waving the traitor's flag and getting mad about people not standing for the (union's) national anthem? Hahaha the hypocrisy was rife with this one", "She's really just a dabbler in politics", "There's a real stark divide between the northern/western republicans and the southern ones. \n\nPeople like to think of W as a hick from texas but the Bushes are textbook new england republicans (and W even graduated from both Yale and Harvard, he's in deep). ", "From what I understand his model was right but he refused to believe the results when it came to his editorials.", "That's not remotely what he's doing. \n\nHe's saying that there is a lot of uncertainty and it's just as likely that Hillary wins in a landslide as that trump wins at all. He still thinks Hillary is a 2-1 favorite to win. ", "Bless your heart", "/r/wayofthebern is where you go to see the Bernie-&gt;Trump crowd. Many of them seem to be centipedes masquerading as Bernie supporters. Its an ugly place.", "Get a glass of water and lay down. You'll feel better.", "Obviously Clinton is someone we can work with. Trump is literally the antithesis of everything the progressive wing stands for.", "100 is the average IQ of everyone because that's what they set it to. They always set the median IQ to 100. IQ is really only useful at telling you where you stand compared to the average. It is *not* an absolute measure of intelligence and it should never be used as one.", "In my macroeconomics class in college we learned it was 4%.  4% is a \"natural\" state of people entering the workforce after school and changing jobs.  ", "The 11th most liberal Senator?", "Voting record is a terribly flawed method to determine if someone is the \"11th most liberal\" senator.  All bills are virtually always voted on party-lines with damn near every democrat or republican voting the same when the final bill comes to the floor.", "I think what he actually *meant* is \"ISIS\" but they don't really distinguish between ISIS and Islam anymore, 'cause they're nutjobs.", "Evangelicals would vote for the Antichrist if he came out against abortion or gay marriage. \n\nThe christian right arent Christians they are just right. Stuffing their own bullshit into the mouth of God is a roundabout way of worshiping themselves and their own culture. \n\nShow me one other world religion that says \"everything about you and your culture, biases, and political beliefs is perfect, never change\". Not one, that would be a cult. Projection doesnt count as Christianity. \n\n", "I was shocked to hear trump in a debate talking about getting guns off the streets and out of the hands of people by use of stop and frisk. This to me sounded like some kind of conservative hell scape. A government police force with the power to stop anyone on the street and take their guns from them. \n\nThen I realized why the crowd didn't boo and the nra didn't revolt. He was talking about doing hat to brown people. He was talking about doing that in cities like Chicago.  Suddenly repealing all gun laws and limitations sounds reasonable when it is a \"thug\" they're talking about. ", "Oh you mean the garbage monsters over at 4chan are pinching out whatever hot takes they can to nourish their fevered delusions?", "Rudy may have dementia he may have actually forgotten.", "&gt; And Clinton ignores them because why should she listen? They voted for her this time around she can take those votes for granted. They have no leverage.\n\nFirst off, many of the policies Bernie and his supporters want are things she already supported just not as far left as they did.\n\nAlso there sure as shit is leverage. Coming from a purely cynical perspective, she doesn't want to be a one term president who didn't do much with her presidency. She knows she's going to need Bernie and his supporters in four years as well as all the kids who are 14 to 17 now who are probably going to be more progressive. She's also going to have a harder fight in four years against a Kasich, Rubio or Ryan who will be a harder fight than Trump.\n\nShe's going to need to have something to show for her four years to get those to come out and vote. Also to get Bernie to go out there and excite his supporters to vote for her again.\n\nEdit: Also forgot to mention, she's also going to want a democratic congress in two years (I know there's a very, very slight possibility it comes this year but I highly doubt it) so showing how much was done with a democratic presidency and senate to ignite those progressive, younger democrat voters in two years would be fantastic for that.", "I know it's almost like they're too busy doing unimportant stuff like .. well... the many boring tasks of actually administering a nation's finances, making horrendously boring revisions to things like air traffic control systems to keep them up to date, looking at data to see what kind of highway signage or intersection markings results in fewer or more accidents and publishing the results in 600-page PDF files that are destined to be read by very unglamorous highway department engineers.\n\nIt's almost like the difference between Real Housewives(tm) and real housewives. ", "There is no wrong day for tacos friend. ", "The thumbnail has an emoji in it. That tells you it's a reputable source.", "It's basically an offshoot of the_donald masquerading as a sub of former Sanders supporters who are anti-Clinton.", "If Obama was a Republican he would be a national hero for all he has done these past 8 years", "They're both unacceptable.  Trump more so sure but Clinton on her own merits is unacceptable.  I will not vote for either of them.", "Exactly The Trump supporters are just pissed that their concern trolling is being rejected.\n\nThere's no reason to demotivate the left when Trump is the alternative. Once the election is over this sub, and other left wing forums will turn on Hillary almost overnight.\n\nIf Hillary wins she's going to have a very loud left wing coming down on her for very legitimate reasons.\n\nBeing surprised that this sub isn't sowing dissent against Hillary, when Trump is the alternative, is just ridiculous.\n\nPatience, Hillary hating liberals, patience. This sub will become increasingly anti-Hillary starting Nov.10th, i guarantee it.\n\n", "There was this song called centipede that ran behind some kind of Trump vid that went viral IIRC. Some kinda eurodance shit that is supposed to be educational. Actually not that bad tbh but it has lines like \"Despite it's girth, it's quite the nimble navigator\" which are pronounced so narmtastically that it just became a thing ", "Or he gets triggered when minorities and women don't agree with him.", "Well he did say that he condemned them.  But pussied out and voted for Trump anyway.  So not only is he not a decent human but has no personal courage or integrity.", "At least option one is for the people. It's better than Ted Cruz only supporting Trump to improve his odds at getting re-elected to the senate in 2018. Trumpsters are blind to the fact that these clowns like Cruz Newt Gingrich, Rudy Giuliani, etc. aren't in it for the people. Nothing is going to get done unless it benefits them individually, and their agenda does not align with middle class America - the bulk of the population.\n\nThe biggest issue is Bernie supporters flipping their vote to Trump to bring down the establishment. It's not going to happen, and a vote for Trump is a vote for these GOP leaders that are riding the coat tails of Trump because nobody wanted them in the first place and they couldn't pick up enough steam to get anything done themselves.", "No we're not. \n\n/r/wayofthebern", "No he's not. This election is highly uncertain and his model matches the polls. If you have issues with the model, that's fine, but nate silver is just working with the polls and stats that he has ", "This is like dating someone that has some red flags and hoping you can change them along the way.", "https://twitter.com/realdonaldtrump/status/791648893725450240\n\nhttp://fortune.com/2016/10/26/michael-moore-trumpland-review-conservatives/\n\n", "Ari Fleischer is Jewish.   Even though he has always been a fervent republican operative. It probably scares the hell out of him that Trump and his antisemitic supporters would have so much power.", "Trump isn't really upset that Jay Z used it. He's upset that he can't.", "Projecting all of his own problems/shortcomings onto others? Is that it?", "And if she does all that I'll consider voting for her in 4 years.\n\nUp until now though, I don't believe a single word she says.  She's been a 1980s republican her whole life.  She's corrupt to the core with her connections to Teneo, appointments to regulatory boards to large donors, and personally becoming wealthy by the very people who destroyed the economy.  I don't see that changing.", "Yeah it's a common thing in abusive relationships. It's a bit insulting to say it only happens to stupid people", "You forgot hate!", "Screening may not be the best term for it but conservatives have been very quick to say that it's the job of American Muslims to figure out who's becoming radicalized and report them, and the job of black people to stop all black people from committing crimes. I've never had anybody tell me that I'm responsible for white dudes who shoot people because they're mad that society would like them to treat minorities like human beings. I don't see Trump getting up and telling his supporters that they have to be vigilant and report anyone who's becoming radicalized.", "Obama could personally cure cancer and all Republicans would talk about are jobless oncologists.", "People always think Minnesota might someday be a swing state. We're not. We are bluer than fucking oompa loompas.\n\nEdit: I think I meant Smurfs. I'm keeping this though, so my shame will be known throughout the land.", "Most of my Bernie buddies have already voted Trump; Hillary doesn't support represent their views. (you know how she's being bought and paid for by Wall Street)\n\nVoting for her in hopes of changing her mind is like getting in a relationship with someone with hopes of changing them as a person; doesn't work.", "So you'd rather have trump and go in the complete opposite direction to what Sanders stands for?", "I'm curious how 2nd Amendment loving conservatives would react to armed Black Panthers doing the same in the 'burbs.", "Voter intimidation pure and simple.", "They lost their shit over two guys standing around without guns.", "Look at the amount of Trumpist apologists blaming the woman he stalked and blocked from leaving and interrogated for feeling threatened. ", "When i served we had a few sacred cows. POWs were simply not something you dismissed belittled, or insulted.\n\nEvery galley, dining facility and cafeteria would have a table sitting out for the POWs. Plates, utensils, cups, etc. It was a nice show of respect.\n\nhttps://en.wikipedia.org/wiki/Missing_man_table\n\nAnd when Trump insulted POWs i was blown away. I honestly thought active duty members, vets, POWs, military families would all come out and defend our POWs and stand up for them. And yet nothing really happened. The backlash was minimal. I'm still confused why he got away with that. What kind of pile of shit disrespects POWs the way he did, and then just shrug it off without ever realizing what a terrible thing it was to say.\n\nAnd then he comes out and insults our generals, saying their dumb, and that he knows more about military strategy than our fucking generals...\n\nI just can't believe he's a real candidate... What an insult.", "If I was undecided and saw that version of reality on my way in to the polling station Trump would absofuckinglutely not get my vote. ", "&gt; \"I hope all of you know that change never comes from the top on down” Sanders told millennial voters on the call. “Any important change in America comes from the bottom on up.\" ", "It turns out military members may not like a guy who says we should commit war crimes be loose with nukes, and thinks he unilaterally knows more than the men and women who have spent decades studying and practicing military strategy. ", "Or the amount sending death threats.", "It really is amazing isn't it? The amount of things that would have absolutely doomed candidates in just about every other election is insane, yet 40% of the electorate is just willing to ignore. ", "The NRA was a lot less gun-ho when the Black Panthers were around. ", "I was promised something about a taco truck on every corner if that happened? Is there a referendum on this I can participate in?", "Whatever is on those tapes (and I suspect we'll eventually see them when it's too late to make a difference), I doubt it would make a difference to his supporters.", "No need for specifics. Black men at polling stations period is adequate enough to scare them hence why Trump got to this point.", "Man with little penis passes out literature at polling station. Film at 11.", "It has finally dawned on me that it has nothing to do with Trump it literally has everything to do with anti Hillary. (Hillary for prison tshirts seem more popylar than trump 2016 tshirts)\n\nThey are promoting heavily a video of \"Bernie\" supporter who dissed Trump FIRST, then Hillary and saying look an anti Hillary. They literally do not see Trump in the picture at all. \n\nTo them Trump is just a vessel that they all got onboard to get to their goal and they know the ship is old, cranky and can blow up any min, but \"just stop pointing out the defects of the ship, we need to get to our destination to defet Hillary\"\n\nThis is actually more bad news than Id like to admit, because sooner or later they will find a nice shiny military ship that will ge them to their destination. Their racisim is not going to die with Trumps defeat, just like herpes it will just hide back and wait for another weakning in the system to attack ", "Doing this at the mall - not voter intimidation.\n\nDoing this outside of a polling place - absolutely voter intimidation.", "Whatever helps you sleep at night.", "More latinos will be voting Tuesday as well.  It will be the largest turn out of Latinos ever.  What we saw in Nevada yesterday we're seeing elsewhere like in Florida and Arizona.  Trump is toast.  He and the Republicans have pretty much pissed on everyone and anyone that thinks this would get people to vote for Trump is delusional.  The polls by the way are borked - Trump will be crushed.  ", "They're some good hombres ", "NO. NO. I WANT MY GOD-DAMN TACO TRUCKS.\n\nI was fucking promised a taco truck on every corner and I will _raise fucking hell_ until I get my damn taco trucks everywhere.\n\nEdit: On a more serious note, I still cannot fathom the mind of someone who says this like it's a bad thing. Have they never had tacos? Did a taco truck run over their parents? What's going on that someone things taco trucks are bad?\n", "De nada ;)", "No we aren't.  I hate her more now than ever before. Most of my other friends who supported Bernie are abstaining going for Jill, or going for Trump. I know very, very few Sanders supporters who hopped onto the Clinton wagon.\n\n\n\nYou're going to downvote me, I get it. Just remember, I'm speaking truth, you're only suppressing it.", "And then he's declared the winner of the debate. ", "I'm not from U.S. but it's a duty not a right, as a citizen to vote no matter what you vote for. I don't see how anyone can call themselves a citizen if they can't even be bothered to care about what their country should be doing.\n\nIf you don't care about it you're just a person living in the country, not part of the nation.", "How was \"taco trucks on every corner\" supposed to be a bad thing? In my experience trucks and shitty-looking restaurants that are just houses crammed full of tables make some of the best tacos. ", "It'll happen the same way Obama took away your guns declared martial law/shariah law, and forced gay marriages. Just wait for it.", "They probably prefer not working for a boss who would send them all over the world to \"bomb the shit out of\" women and children.", "“The story of this election may be the mobilization of the Hispanic vote” said Senator Lindsey Graham of South Carolina, an anti-Trump Republican who has pleaded with his party to do more to win over Latinos. “And they didn’t come out for anybody as much as they came out against what they saw as racism. So Trump deserves the award for Hispanic turnout. He did more to get them out than any Democrat has ever done.”\n", "Honestly I was mainly voting against Trump.", "I don't even want to hear about them. I'm completely burned out on all of this. If I could go a full day without learning something new about that clown I'd be much more mentally healthy. \n\nIs it Tuesday yet\n\nEdit: actually Wednesday is better. Is it Wednesday yet", "Hopefully they get rid of Jill Stein and find someone actually competent. ", "It's not \"Late\" momentum.  They just didn't poll these ppl.  They don't fall into the likely voter model.  ", "It is their last chance.  Census expects that by 2020 white children will be the minority, and demographics will shift where minority groups will start to become the majority.  This seems to scare all the old racist white people, and lot of that I imagine is what is driving the fear around immigration.  They feel like they are losing their white majority country.  But, as Jon Stewart eloquently stated, it was never \"their\" country to begin with. We know what they mean when they say \"make america great again\".\n", "If he can't win Nevada and Florida he's got 0 chance.  ", "Wow what a baby an angry white dude with a gun shouldn't be intimidating to anyone! It's those blacks you need to worry about! ", "Not in anymore but I was never a fan of some draft dodging wuss telling me I'm not professional enough to do my job without resorting to war crimes.", "What happened is very simple.  Donald Trump managed to terrify the Latino population in this country into getting politically involved.\n\nPeople don't get involved in politics unless they feel like they have something to lose.  And until Trump came along, the Latino population was mostly annoyed at the GOP's dismissal of them, but didn't feel really threatened by the Republican party.  That's no longer the case.\n\nHe's infuriated them and terrified them and nothing will motivate someone to get into politics quite like fear and rage.  Hell, fear and rage pretty much define the GOP's base motivation.  ", "In early U.S. history being overrun by the \"primitive German immigrants\" was a commonly feared thing. Then the Papist Irish. And the Jews. And the Poles. And the Italians. Despite all this, our country endured and ultimately became more badass because of it. ", "If this holds this might well be a landslide election.\n\nAnd the very best part? It will be the demographics Trump has spent the past 18 months - and, in some cases, the past 70 years - denigrating handing the election to Clinton.  Women and Hispanics are about to exact their revenge, and man, will it be sweet.", "Bruh as a white male, I did my part as well.", "Now please explain to me the context of the hundreds of other indefensible things Trump has said.  Like these gems:  \n\n&gt;\"when you're a star they let you do it. You can do anything.  Grab them by the pussy. You can do anything.\"\n\nor \n\n&gt;“(John McCain is) not a war hero…. He’s a war hero because he was captured. \"\n\nor \n\n&gt;\"I watched when the World Trade Center came tumbling down. And I watched in Jersey City New Jersey, where thousands and thousands of people were cheering as that building was coming down. Thousands of people were cheering.\"\n\nor\n\n&gt;\"(Obama) doesn't have a birth certificate. He may have one, but there's something on that, maybe religion, maybe it says he is a Muslim. I don't know. Maybe he doesn't want that.\"\n\nor \n\n&gt;“An 'extremely credible source' has called my office and told me that @BarackObama's birth certificate is a fraud.”\n\nor \n\n&gt;“Look at that face! Would anyone vote for that? Can you imagine that, the face of our next president?! I mean, (Carly Fiorina’s) a woman, and I'm not supposed to say bad things, but really, folks, come on. Are we serious?\"\n\nor \n\n&gt;“You know, it really doesn’t matter what they write as long as you’ve got a young and beautiful piece of ass.”\n\nor\n\n&gt;\"If Ivanka weren’t my daughter, perhaps I’d be dating her\"\n\nor\n\n&gt;\"If Hillary Clinton can't satisfy her husband what makes her think she can satisfy America?\" \n\nor \n\n&gt;“I would bring back waterboarding and I'd bring back a hell of a lot worse than waterboarding.\"  \n\n", "I'll take one more day of hearing bad things about that clown if it decreases the chances we hear about him every day for 4 years. ", "Freedom means not voting if you don't care to vote. Not saying that it's the smart thing to do but the right to not give a fuck is pretty inalienable. ", "Hopefully all of these headlines about record Latino early votes will spur even more of them to vote on Tuesday.", "Actually Hillary voters are voting *for* her. Trump voters are voting *against* Hillary.\n\nhttp://fivethirtyeight.com/features/clinton-voters-arent-just-voting-against-trump/", "Mm no he was declared the winner, and then they debated. And then he was re-declare the winner.", "Dems need the Senate too or the GOP will do a soft coup' like Temer in Brazil.", "I already voted early but I'm driving some friends to the polls on Tuesday to vote for Clinton.", "Silver also hasn't tweaked his model. It's the same model that showed Clinton at almost a 90-10 chance of winning in early-mid October. It's the same model that showed Trump winning the primaries. It's the same model that showed Bernie getting crushed.\n\nWang pointed out on his own twitter that his comment was before Comey's October Surprise. He still seemed confident in it but I'm not sure he would have qualified it if he was still 100% sure.", "I'm assuming this is sarcasm. It's so hard to tell these days ", "\"Here we'll play it for you right now.\"\n\n*Tape of Donald Trump saying horrible thing*\n\n\"He never said that.\"", "Stay scared. This shit is scary. Some good news feels good but stay scared.", "Trump learning why the term is called \"politically\" correct.\n\nIf you piss off two people for each guy you pick up in your mono-chromatic primary you're going to get beat.", "Can confirm :D", "If Clinton wins there won't be a way to distinguish who was right. Nate's model also thinks Clinton will win, but with low certainty. So it won't be \"wrong\".\n\nBut if Trump wins, Sam's model will look much worse, because it's almost certain Clinton wins.", "God forbid we hold rappers and presidents to different standards.", "There are no words. This is beautiful. In a presidential campaign this person is talking about drinking blood and cum as an attack on a candidate. We have officially entered uncharted territory people this is not a drill. We have actually sunk this low ", "Musk speaks the truth on this matter. Thankfully he and several of the other entrepreneurs pushing us towards post-scarcity economics and widespread automation understand this reality. I suspect that political will is going to materialize around this idea in the next 15 years or so as this class of tech billionaire donates to politicians who speak in favor of policies that support automation from a regulatory and social-welfare perspective.", "Voting day will forever be known as \"Taco Tuesday\"", "Interesting article that shows it's not at tight a race as I thought earlier. I'd say a Clinton win is looking more likely based on their findings but the Trump supporters on this thread do make me concerned. They seem so smug and self assured that I get the feeling they won't just be disappointed come Tuesday, they'll be shocked and then outraged (\"The vote was rigged!!\" etc)\n\nI feel kinda sorry for them. Yes it looks narrow, but my money's on Clinton for solid polling reasons, and not just #NeverTrump. Meanwhile they're so arrogantly confident of a win, it's pretty sad. ", "Obama has always been good with hecklers and protesters. Going to miss Obama ", "Trump undoubtedly believed and still believes that white people are enough to win the election.  So get them riled up and angry and terrified and the election would be an easy win.  I mean, it worked for the GOP primary, right?\n\nThe mistake he made was thinking that white people all vote GOP.  We don't.  ", "Some people get really triggered by black people getting oppositional even when it's calmly oppositional.", "He will simply build Trump State the most luxurious and bigly state, with the most tremendous electoral college vote.", "Still too close. ", "\n&gt;.  She's been a 1980s republican her whole life.  \n\nI love how Clinton spent the 90s being decided as some feminist hippie but now you fifteen year olds think she's the second coming of Reagan. Unreal.\n\n", "&gt;On a more serious note I still cannot fathom the mind of someone who says this like it's a bad thing.\n\nHe was a liberal plant trying to swing votes by dog whistling to taco lovers. ", "Why the fuck can't they say \"lies?\"", "It's not momentum it's the polls underrepresenting a more motivated Latino population. But gaining momentum sounds better I guess. ", "Don't believe the hype get out and vote!", "Seriously you guys live in a fantasy world. Point to a non-right wing media source that anything there is anything to legitimately say Clinton is guilty of anything from her emails. Nothing from the primary i fully acknowledge she cheated Bernie out of the nomination. Something, anything about national security. The fbi didn't have enough to indict what makes you think there's some huge bombshell?\n\nNo breitbart, no alex jones, wikileaks(they are working with the Trump campaign to spite clinton),fox, national enquirer, no drudge. A source that has actual credibility. Find anything that is real. I dare you. Anything that will actually stick. You can't because it doesn't exist. You guys live in your own echo chamber.\n\nI'm seriously going to laugh my ass off if you link to anything related to spirit cooking or your imagined child sex ring\n\nEdit:I'm still waiting.....", "I kind of appreciate you saying it out loud.", "And what gets me is that they're the type of people who would have gotten shafted ", "You can tell that this is Russian-sourced due to how they try and make LGBT stuff into a negative.  ", "Weasel Dick Motherfuckers", "That's why we need a Bullshit-O-Tron robot that follows Trump and Pence. Every time they lie like that the robot's siren go off and it plays video, audio, or text showing the very thing they claimed was never said.\n\nOf course, after 24 hours the robot might overload from doing so much work and cease working.", "&gt; It has finally dawned on me that it has nothing to do with Trump it literally has everything to do with anti Hillary.\n\nIt's called being a Republican.\n", "I didn't say it that's what he called me", "I have consistently said that people should respect the irony posed by Al Jazeera.  They are consistently the only credible and professional news agency and with our huge problems with Islamophobia, isn't it ironic that our only source of clean news comes from the Islamic world?  ", "It's an odd thing I've noticed about well, not-so-smart people.  If someone pulls something over on them, they get angry - but oddly enough they often develop an admiration for the person who screwed them over.  They want to become that person, so they themselves can do the same to other people.  Trick is, they're neither smart enough nor have the the resources to do so.\n\nIn this case, they see Trump as a way to change that.  They see his presidency as a way to create an official sub-class that they can treat poorly with no recourse.  They think that they'll magically become rich and powerful on the backs of this sub-class with a Trump presidency.", "They're obviously sending their best", "[Knife Party - Centipede](https://www.youtube.com/watch?v=GKzsktuqwyU)\n\nConsidering they just recently worked on a single with Tom Morello (of RATM fame) I'd guess they're not all that flattered by the association.", "Pretty sure there's a \"gun-free\" mandate near polling places also.", "I'm working for a Dem Senate race and I am terrified right now. Not about our race we have it pretty locked up, but our overall chances of taking majority. ", "Because the argument has been made for months and anyone left in your camp is either incapable or unwilling to listen to reason. Act like the village idiot and you'll be treated like it. ", "Refreshing... a bit of levity in the midst of such a sour time in recent US history.\nShe's actually quite likable here when she goes off script... I wish she was able to feel more comfortable enough in her own skin to do it more often.", "We'll likely get the Senate especially if Trump continues to drag down the down-ballot.  ", "It's their lives on the line.  I imagine this is very important to them.", "I'm not a 15 year old buddy.  This isn't my first election or 2nd or 3rd.  I have student loans, a mortgage, a family.  \n\nShe was vicious in crucifying those pushing for gay equality in the 1990's.  Do *you* remember the commercials being aired then supported by her and Bill?  I do.  She's no progressive.  She's morally bankrupt and will do whatever it takes to acquire power.", "1) Jay-Z is not running for President. Trump is.\n\n2) Why shouldn't a Presidential candidate be held to a higher standard than a random celebrity?\n\n3) Jay-Z's \"language\" was in the context of a song. Trump's was off the cuff banter. They're not the same.", "Every time a conservative tries to cite rap lyrics as a point of contention they fall flat on their face every fucking time.\n\nJay Z is a rapper Trump is trying to earn the highest political position in the country. There's no comparison.", "I think unspecified bad things about you based on presumably ridiculous generalizations too!", "538 has me worried about the senate.", "This guy just checks so many boxes.\n\n* Waves a Confederate flag in front of several African-Americans\n* Is offended by the black people sitting during the national anthem\n* Says it's an offense to white people who fought and died for the freedom of black people\n* Says it's an offense to the armed forces\n* Says black people sitting during the anthem are cop haters\n\nIt's a laundry list of talking points going from conservative to alt-right."], "links": ["5balae", "5ba9zi", "5balae", "5batrm", "5batrm", "5baxt1", "5balae", "5bb5gi", "5balae", "5balae", "5ba9zi", "5bayys", "5bahyc", "5bayys", "5bahif", "5ba9zi", "5bayys", "5bat3u", "5balae", "5batrm", "5ba1vt", "5batrm", "5batrm", "5bayys", "5ba9zi", "5bahif", "5balae", "5bayys", "5bahyc", "5ba1vt", "5baly5", "5ba9zi", "5baxt1", "5ba430", "5baxt1", "5balae", "5b9k8l", "5ba1vt", "5ba1vt", "5batrm", "5bat3l", "5b9k8l", "5balae", "5b9rs6", "5ba1vt", "5bat3u", "5ba9zi", "5baly5", "5ba9zi", "5balae", "5ba1vt", "5ba9zi", "5ba1vt", "5b9xs9", "5balae", "5ba1vt", "5ba9zi", "5b9s7l", "5bat3u", "5bahif", "5bayys", "5bahif", "5bahif", "5batrm", "5b9rs6", "5bavgz", "5ba430", "5bahif", "5bayys", "5ba430", "5bahif", "5ba9zi", "5b9k8l", "5bat3u", "5balae", "5ba1vt", "5ba1vt", "5bahif", "5bafjz", "5ba9zi", "5b9k8l", "5ba430", "5b9iud", "5b9iud", "5ba1vt", "5bb0dg", "5ba9zi", "5ba9zi", "5ba1vt", "5ba9zi", "5b9yh4", "5ba9zi", "5ba1vt", "5ba1vt", "5ba9zi", "5ba1vt", "5bbd3a", "5bbd3a", "5bahif", "5ba1vt", "5ba430", "5bbd3a", "5bb5gi", "5balae", "5bbd3a", "5ba1vt", "5balae", "5baxt1", "5bb5gi", "5ba9zi", "5bbbcw", "5bahif", "5batrm", "5bb839", "5balae", "5balae", "5bayys", "5bb5gi", "5b9k8l", "5ba1vt", "5balae", "5bbbcw", "5ba9zi", "5ba430", "5bbd3a", "5bbd3a", "5bayys", "5ba9zi", "5bbc1o", "5ba1vt", "5bb5gi", "5bbd3a", "5b9s7l", "5bbd3a", "5ba1vt", "5ba9zi", "5b9s7l", "5balae", "5ba1vt", "5bb5gi", "5bb70t", "5ba9zi", "5balae", "5ba9zi", "5ba9zi", "5batrm", "5bahyc", "5ba1vt", "5bb839", "5balae", "5bb54w", "5bbc1o", "5bamg2", "5balae", "5bamg2", "5balae", "5bb8qy", "5ba1vt", "5bb7dm", "5ba9zi", "5balae", "5ba9zi", "5baxt1", "5ba430", "5bahif", "5ba1vt", "5bahyc", "5ba9zi", "5bahyc", "5bayys", "5baly5", "5bb839", "5bat3l", "5bb5gi", "5ba9zi", "5b9yh4", "5bbd3a", "5bahif", "5batrm", "5b9yh4", "5bbc1o", "5bb70t", "5bayys", "5ba9zi", "5ba9zi", "5baly5", "5b9iud", "5bb70t", "5balae", "5ba9zi", "5balae", "5ba1vt", "5bbbcw", "5bbd3a", "5balae", "5bbd3a", "5bbmjh", "5ba1vt", "5ba1vt", "5balae", "5balae", "5bbd3a", "5bbo5k", "5ba9zi", "5balae", "5balae", "5batrm", "5ba1vt", "5baxt1", "5ba1vt", "5ba1vt", "5ba1vt", "5bbkvw", "5bbd3a", "5bb5gi", "5bbd3a", "5bayys", "5bb5gi", "5bbc1o", "5baxt1", "5bbbcw", "5bahyc", "5ba9zi", "5balae", "5bbp3e", "5bblzh", "5bb54w", "5ba1vt", "5bbjkk", "5ba1vt", "5batrm", "5bbo5k", "5balae", "5balae", "5ba1vt", "5baly5", "5bbkgo", "5bbd3a", "5bbd3a", "5bb54w", "5bbs56", "5balae", "5bahyc", "5ba1vt", "5bbmjh", "5ba430", "5batrm", "5balae", "5bboky", "5baxt1", "5bat3l", "5bbjkk", "5bbbcw", "5batrm", "5baxt1", "5bbmjh", "5bahyc", "5bahif", "5baxt1", "5bahmv", "5bbmjh", "5bbp3e", "5bbmjh", "5baly5", "5ba9zi", "5ba430", "5bb54w", "5bbjkk", "5ba1vt", "5bbpre", "5ba1vt", "5balae", "5ba9zi", "5bbmjh", "5ba1vt", "5b9yh4", "5ba430", "5bbfxv", "5batrm", "5bahyc", "5ba1vt", "5ba9zi", "5batrm", "5bbp3e", "5bbd3a", "5bc25u", "5bc2qr", "5bc2qr", "5balae", "5balae", "5bbd3a", "5batrm", "5ba9zi", "5bc25u", "5balae", "5balae", "5ba1vt", "5bbmjh", "5balae", "5ba1vt", "5bbbcw", "5bahyc", "5balae", "5bb5gi", "5bbza3", "5ba9zi", "5bblzh", "5bc2qr", "5bbwmz", "5bbvuq", "5bbv1u", "5bbw01", "5bahif", "5balae", "5bbs56", "5ba9zi", "5bbpre", "5bbd3a", "5bc25u", "5bbthl", "5baxt1", "5bahyc", "5bbd3a", "5balae", "5bbv1u", "5bahyc", "5ba430", "5balae", "5batrm", "5ba430", "5bat3l", "5bbv1u", "5bahyc", "5bc2qr", "5bbd3a", "5bbvuq", "5ba9zi", "5bbwmz", "5ba9zi", "5ba9zi", "5bbmjh", "5balae", "5bc2qr", "5bbd3a", "5bbd3a", "5bbd3a", "5bbo5k", "5bbmjh", "5bbwfh", "5bbd3a", "5bbs56", "5batrm", "5bbs56", "5balae", "5bahif", "5batrm", "5bahyc", "5bbp3e", "5bbd3a", "5bbd3a", "5bbvuq", "5bbd3a", "5bbs56", "5bbpre", "5ba1vt", "5ba9zi", "5balae", "5ba1vt", "5balae", "5bbthl", "5ba1vt", "5bbv1u", "5bafjz", "5balae", "5bahyc", "5bbs56", "5bahmv", "5ba1vt", "5bb5gi", "5bbw01", "5bc25u", "5bc25u", "5bc2qr", "5bc2qr", "5bcc1h", "5bc25u", "5bc2qr", "5bcd83", "5bc2qr", "5balae", "5ba1vt", "5bahif", "5bc2qr", "5bc25u", "5bc2qr", "5bcc1h", "5bc2qr", "5bc25u", "5bcc1h", "5bc25u", "5balae", "5ba9zi", "5bc25u", "5bc2qr", "5bc25u", "5bc2qr", "5bbza3", "5bc25u", "5bc25u", "5balae", "5balae", "5bbbcw", "5bc2qr", "5bahif", "5bc25u", "5bbd3a", "5ba9zi", "5bcc1h", "5bc2qr", "5bbd3a", "5bb5gi", "5bcba3", "5bceto", "5bbo5k", "5bc2qr", "5batrm", "5bc25u", "5balae", "5bc25u", "5bayys", "5bc2qr", "5bbza3", "5ba1vt", "5bc25u", "5baxt1", "5bbd3a", "5bbd3a", "5bbza3", "5bc25u", "5bbza3", "5bc25u", "5balae", "5bayys", "5bc25u", "5bc25u", "5ba1vt", "5bbw01", "5ba1vt", "5balae", "5bayys", "5bc25u", "5bbc1o", "5ba9zi", "5bc8g3", "5bc25u", "5bayys", "5bc25u", "5bc25u", "5bbd3a", "5batrm", "5bb5gi", "5bc25u", "5bc25u", "5bbd3a", "5bc25u", "5balae", "5bb54w", "5batrm", "5bcba3", "5bc25u", "5balae", "5bcba3", "5ba1vt", "5bayys", "5bahif", "5bc25u", "5bc25u", "5bchyj", "5bchyj", "5bchyj", "5bchyj", "5bcg11", "5bchyj", "5bcffe", "5bcg11", "5bchyj", "5bcg11", "5bchyj", "5bcc1h", "5bcej0", "5bchyj", "5bchyj", "5bcej0", "5bchyj", "5bc25u", "5bcjgr", "5bc2qr", "5bcc1h", "5bcc1h", "5bc25u", "5balae", "5bcffe", "5bc2qr", "5bcc1h", "5bcg11", "5bcc1h", "5bcej0", "5bcej0", "5bcffe", "5bcc1h", "5bc2qr", "5bcjgr", "5bchyj", "5bcg11", "5bcjgr", "5bc2qr", "5bcc1h", "5bc2qr", "5bcc1h", "5bcej0", "5bcffe", "5bcjgr", "5bcej0", "5balae", "5bcjgr", "5bcffe", "5bbd3a", "5bchyj", "5balae", "5bcd83", "5bcjgr", "5bc2qr", "5bbd3a", "5batrm", "5bbza3", "5bcf1j", "5bc2qr", "5bcd83", "5bcioc", "5bcjgr", "5balae", "5bcd83", "5bcd83", "5bc25u", "5bcc1h", "5bcioc", "5bcc1h", "5bcjgr", "5bbza3", "5ba1vt", "5bbbcw", "5bcjsu", "5bchyj", "5balae", "5bcej0", "5bbc1o", "5bbbcw", "5bbbcw", "5bc2qr", "5bbd3a", "5bchyj", "5bcjgr", "5bbza3", "5bcfhe", "5bcjgr", "5bcg11", "5bc25u", "5batrm", "5batrm", "5bcd83", "5bcjgr", "5ba1vt"]}