{"comments": ["Apparently going to college makes you a brainwashed elitist. Fuck me for trying to improve myself and work in a fulfilling job I guess.", "I think Bernie [can keep running](http://i.imgur.com/gALcUKb.gifv).", "Has he or has Reddit? I know I see it talked about on here a lot but I don't think I have seen anything that shows him teaming up with her on anything.\n\nMind you, big Bernie fan and was really impressed with Gabbard when she stepped down from the DNC. Personally I'm a big fan of hers.", "If you strike me down I will become more powerful than you can possibly imagine", "Oh my god I was on /r/the_donald out of curiosity and people there were actually believing that...\nDon't forget how apparently we call every male sexist and every white person racist...no", "It was nice having national parks. Now they're probably going to be sold and branded and raided. \"Yellowstone presented by PEPSI!\". ", "yes but I don't know who submitted this as a write in candidate. Prolly wasn't Bernie. I'm surprised the ticket wasn't:\n\nPresident: Bernard \"Bernie\" Sanders\n\nVice-President: We did it Reddit!\n", "T_T I loved everything about that man.", "We voted in a Orange egomaniacal reality tv star. Voting in a 79 yr old isn't so crazy an idea after that. Especially if he has a VP like Tulsi. ", "America is living two separate realities.", "You might like [this](https://www.youtube.com/watch?v=XAqgIs3P80Q) short video styled as if it's the title sequence to a 1970s tv show", "It feeds right into what they need. Undereducated underpaid voters who will continue to ignorantly yell that all this is the liberals fault because Fox news told them so. ", "In california when I went to vote Bernie Sanders was a possible write in option and Tulsi Gabbard was his VP. ", "I believe it was on the Daily Show where Killer Mike said that Bernie was a once in a lifetime type of candidate and I agree with that 100%.", "It was a crazy film. Not suitable for families I think. \n\nAlso keep in mind: the character in the previews is not like the character in the film, and the character in the sequel is supposed be completely different. Same actor, though. \n\nEdit: for racism, see https://www.reddit.com/r/politics/comments/5c4kir/comment/d9tz3zp?st=IVCGIT85&amp;sh=f347bdc0", "Yep. This is apparently all our fault for being condescending to people who vote based on hurt feelings. ", "&gt; Gore lost to a buffoon because he was less charismatic\n\nGore lost because he was arrogant and definitely came off that way.\n\n&gt;Kerry lost to a buffoon because he was less charismatic\n\nThat and Bush had a better campaign.\n\n&gt; Clinton lost to a buffoon because she was less charismatic.\n\nLike Gore, Clinton lost because she was arrogant. Charisma matters, but arrogance will kill a campaign. ", "This has to be the biggest political con job of all time. \n\n\"Its time to drain the swamp in Washington what with all its rich elitists and bankers and power brokers.\"\n\n\"I know, I'll vote for the billionaire elitist who will then appoint rich elitists and bankers and power brokers to the highest levels of government! What could go wrong?\"", "It is blowing my mind the disconnect I've been watching on CNN all day. Just the constant \"what happened?!\" All their explanation is \"minorities didn't come out for her.\" They talk about learning from it but any time Bernie gets mentioned they immediately pivot to something else. Don Lemon just went from moderating to full throated lecture. He just stared right into the camera and said, basically, \"you should always vote. What's wrong with you?\"\n\nIt's the classic, \"Am I out of touch? No..it's the children that are wrong.\"", "Well to be fair had he *won* he would have also been the most powerful progressive. And *slightly* more powerful at that.", "I completely agree. He picked this cycle the same reason Trump did the country was finally ready for the message in largest enough numbers to get a movement started.", "Trumps criteria is solely based on \"were you on my side and loyal to me?\" I mean he appointed Chris Christie as the head of his transition team. ", "first time ill be excited to watch in a while.", "I had the same realization after reading some comments on TiA. The whole \"anti-SJW\" thing was just another way to rally support for Trump. It was all a game and it didn't matter who they hurt.", "That guy also worked for a firm Soros was a majority stakeholder for.\n\nI'm sure his supporters will find some way to rationalize it. ", "The problem with Hillary's strategy and the electoral votes is that she added votes from the wrong places.   She added votes in California and New York but those were foregone conclusions. If you win a state with 51% or 71% you still get 100% of that state's electoral votes.\n\nTrump was able to capitalize on the anti establishment disdain in the Midwest and Rust Belt enough to matter. \n\nI believe Bernie would have done at least as well as Trump there.   Hopefully the DNC will clean itself up or risk making the same mistakes again. ", "Oh good I love such a highly qualified candidate who couldn't even make it through a full term as Governor of a state half the size of many California counties. Maybe make her Secretary of the Interior so she can privatize our National Park System. That will bring all the jobs back to the rust belt.", "His supporters have proven facts mean nothing so they won't care.  ", "&gt;They dont care about destroying themselves so long as they can \"lol fuck sjws\"\n\nOh totally. I mean, fuck it. I'm done. Call me a SJW. I don't care about the extremists or the crybabies. Anything is better than this fucking sociopathic bullshit. \"Oh lol look at how sad these SJWs are because they're of a marginalized group who may seriously face real-life repercussions because of our memes.\"", "Republicans have a long history of harming republican states who then re elect them.\n\nThey dont care about destroying themselves so long as they can \"lol fuck sjws\"", "That's why Colorado voted for suicide and weed as a substitute.", "The ravenous Hillary supporters calling everyone who didn't support the queen sexist sure didn't help either.", "If only the DNC would have let him try to beat the hair guy.", "Basically looks like all the news of Trump being a down-ballot disaster ended up motivating the GOP turnout while causing complacency in the Dem turn-out... Damn, that is 3D chess.", "I mean... did anyone think Trump was going to make wise decisions? This is just the beginning of many terrible ideas and decisions. ", "Exactly and now the \"next Hitler\" Trump has the ability to exploit all the things Democrats exploited. Maybe the constitution was written in a certain way for a reason?", "First time I'll watch in a while.", "THIS. I'm so tired of the dems claiming Russia hacked them and that's why they lost.\n\nNo. You lost because EVERYONE SAW YOUR SHIT.\n\nNo matter who hacked or leaked.\n\nI won't be going to jail for my basement child torture chamber, BECAUSE I DON'T HAVE ONE.\n\nHillary didn't lose because she got hacked, she lost because there was damning evidence her and the DNC were completely ok with lying, cheating, breaking the law, and circumventing the will of the American people for personal gain.\n\nIf they got hacked and had thousands of emails discussing how to best help the country released... this would have been a different situation entirely.", "Kill that sub and leave its body to burn in a fiery pit.", "She was worthless candidate who cheated Bernie in the primaries and decided to run a campaign that was purely focus on her not being Donald Trump.\n The idiot didn't make one fucking ad where she talked about what she was going to do for America. Not one \n talking about college debt fixing Healthcare, adding jobs, FUCKING NOTHING! The end of the day the reason Donald Trump is President is because she's worthless and the people who supported her in the primaries are idiots. \n\nEdit: wording", "\"Now that the US has elected its most LGBT friendly republican president in history I am afraid for my life because I completely bought the rhetoric from the Clinton campaign.\"", "&gt;I'm done with half of this dumb fucking country.\n\nI was seconds away from responding with a snarky remark about \"half\" not even coming close. But then I did a quick search and discovered that Hillary won the popular vote 59.8m vs Trump's 59.6. I guess that's close enough to half so you won't get an argument from me on that subject.\n\nMy dearest fellow Americans, when oh when will we get rid of this idiotic electoral college?\n", "I think he would have.  I think he would have realized that his draw as the VP would bring out more democratic voters who would likely just vote straight ticket.  The Senate race was pretty close if they would have drawn out just 5 million more voters they could have flipped the senate.\n\nWhile he wouldn't have the same power as the VP, he could still be the voice the presidency to congress.", "I was thinking the same thing. If Trump is smart and cares about more than a 25% approval by popular vote he should consider this.", "Compared to some of the things trump has said this is downright illuminating.", "I'd bet half the people that cast a vote for Trump don't even know what the fuck net neutrality is.", "I think had the DNC been smarter about it they could have still had their way and not got so much anger for it.  To our benefit they were very stupid about it.  They were just so blatantly against Bernie that his loss to Hillary felt... wrong.  They wanted the superdelegates to make a point, but that point ended up being \"the DNC does not represent its members.\"\n\nOn one hand, I'm unhappy that they cheated the primaries and probably cost us a good president.  On the other hand, I'm happy they were so bad at it that lay-Democrats are now looking at their party and saying \"something is wrong.\"", "Aaaaand I'm bummed out", "Without tens of millions of dollars of paid support it's a different landscape. \n\nNot surprising people fell for their own echo chamber. \n\nYou smell your own farts long enough...", "The entire Dem primary felt like a big set up like they were simply setting the stage for the general election.\n\nTrying to rig a primary is one of the most counter-intuitive things I've ever heard of. It actively attempts to put a less competitive nominee in place.", "They both identified the same problem even if their proposed solutions were radically different.\n\nThe voters didn't care about the proposed solution, though. They just cared that a political candidate had actually acknowledged their suffering for the first time in decades.", "There's still a few million votes to count. Also you're disregarding the fact that 6% of the population voted 3rd party (it's usually &lt;2%). And the fact that the media totally shamelessly kept running negative stories about both candidates that eventually suppressed turnout from their own bases. ", "This is probably the case for most of Hillary's votes tbh", "I think it's because Trump's branding was better. He used slogans and sound bytes to his advantage much like Obama did. He sold hope to a lot of his voters, Clinton was realistic and told them the truth, some of their jobs aren't coming back.\n\nThanks partly to America buying anything marketed to them, his message is simplistic and his voters didn't care to push further for details. It was very obvious from the beginning, he just had the message people could rally behind. Like a used car salesman. \nAmerica went for the flash and drama candidate, as always.\n\nI just hoped America changed in the ten years since I moved abroad. Nope.", "Step 1: learn what fascism is. ", "Fuckin right.  My grandparents are in their 80s and still kicking it.  \n\nHell I don't even care if the man starts having to wear a diaper.  He would still be one of the greatest presidents in history.", "DO A PROPER POST MORTEM!\n\nThe Democratic party won't recover unless the systemic issues within the party are addressed and resolved.", "I'm definitely trying to see a silver lining but I agree. If the country is the absolute wreck I think it's going to be in four years, this should provide the real galvanization of support democrats need to turn this back around. \n\nTo the DNC: And this time, fucking listen to the grassroots movement. Bernie had the exact same populist appeal as Trump had but with an inclusive and reasonable message, and you told him to fuck off. You ran a shit candidate. This is a hard lesson. It just really sucks that we all have to pay for it.\n\n", "&gt; The population is swinging hard left right now.\n\nI wish this were the case but outside of cities things are moving in a nativist and hard-right direction.", "Right? I want no ones hands on the data. Just having it in the first place is disgusting.", "&gt; Democrats are smarter\n\nWhich is why every one of their policy goals will be shat on over the next four years. Smarter or more self-important?", "But Chief Justice John Roberts said their was no more need for parts of the Voting Rights Act and I guess he was right as long as disenfranchising minorities is your winning strategy. ", "Most other countries require ID to vote. It helps stop fraud and voter manipulation. I'm with you voter ID is great and if you saw /r/all after the election, it was just filled with excuse after excuse and no one was blaming Hillary.", "Wait are we actually uniting? At /r/politics?", "Trump isn't the biggest issue here-- if some of these independents who opposed Hilary had still voted for democrats in the house and senate we might've been ok.  Just having a republican president wouldn't have been enough by itself; we had to screw up *everything* for this to happen.", "It's the *caucus* that elects its leader not the *Party*. He and Angus King caucus with the Democrats for committee assignment and leadership.", "Authoritarianism in a nutshell.  ", "&gt; She lost the election because seven million people who voted for \"global establishment\" candidate Obama\n\nYeah I still got my Obama \"Global Establisment '08\" poster on my wall.\n\nYou're being too clever. Obama campaigned on hope and change not as the establishment candidate. After 8 years of Obama's Wall Street 'hope and change', people decided they wanted the real thing.\n\nHillary was an incremental change candidate for an election that had enough of 8, 30 years of incremental change.\n\nThat's why even the DNC had a rebellion on its hands that they had to crush to get Hillary nominated.", "Yes that Howard \"byaaaaahhhhh\" Dean, whose 50-state plan as DNC Chair was massively successful and won a lot of seats for the Dems in both houses of Congress, in States that Dems haven't contested for years. Obama literally owes his political career to Dean and his original grassroots coalition built during the 2004 primary and cultivated throughout his tenure as Chair. \n\nBut let's not remember him by his tremendous success leading the party for 4 years. Let's remember him by a cheer that was isolated away from crowd noise by directional microphones and turned into a stupid internet meme.", "But so many upvotes and beer-drinking image posts.  Could those all be lies?!????!   ", "Oh. Not that she's a Princeton and Harvard Law School graduate that has held public sector positions in the Chicago city government as an Assistant Commissioner of Planning and Development as an Executive Director for the Chicago office of Public Allies, as the Associate Dean of Student Services at the University of Chicago, as the Vice President for Community and External Affairs for the University of Chicago Hospitals?\n\nNo, of course not. She's just a black women. Nothing more.\n\nShe's more qualified than Trump. The sad thing is that she will never run for president.", "Did you miss the part where he already picked a climate change denier to lead his EPA transition team?", "First time I'll watch.", "Buy a gun.", "Lifelong liberal from Texas here. First sorry that you gave an honest assessment of your opinions and were given shit in return. Second, I'm glad to hear that you appreciated the positives of Bernie Sanders. I'm very disappointed that he wasn't our nominee. Last, I'm sorry Trump will be our next president, but I hope you're right that he accomplishes *some* good.", "Well in places like North Carolina, they researched which types of photo IDs non-white people had compared to white people, and banned the ones non white people had. Pretty fucked.", "Trump can do no wrong as far as his supporters are concerned. They will hail it as a great step towards draining the swamp. Or something. #MAGA", "It's not baseless speculation that he's considering Gingrich and Giuliani for the cabinet. He hired fucking Steve Bannon for the campaign. Why would he balk at Palin?", "We got rid of him before he served a full term and if the US has any sense they'll do the same", "This is hilarious.\n\nThe guy wants to overturn gay marriage and his VP is rabidly anti-gay rights.\n\nI have never seen people get duped as hard as Trump's base did in my life.", "So you have no problem with Trump appointing a climate denier to lead the EPA?  ", "That's fucking hilarious. I hope she runs for President some day as the ultimate fuck you to these people. ", "I was a HC supporter I admit it.  Maybe thats just because like so many I was never passionate about HC, just wanted her over Trump.\n\n  I hope the DNC can see it, they've got a few promising seeds in the garden that are young, don't carry a fuck-ton of baggage, and can tap into the current populist sentiment especially the struggling under-educated white voters that turned against Clinton so heavily.  Lets hope they are good gardeners.\n\nTrump is still extremely unlikable, he didn't even win the popular vote, he'll probably be vulnerable in 2020.", "We've been dealing with CTR for months. It's gonna take people awhile to adjust their sarcasm meter.", "That's the exact point.\n\nThe dems and Repub establishment are the same. Fuck how about Hill Camp's emails discussing how to politicize fucking Alzhiemers research.\n\nEverything is just a potential way to get votes and stick it to the other team. Has nothing to do with what's the best for the country.", "Remember when r/politics was full of people smugly mocking the idea that Trump supporters weren't going to accept the election results? I do.", "Just to be clear he changed this position actually long ago (around July?) to \"ban immigration from countries with high levels of terrorism\". Which achieves the spirit of his original intention, anyway. He's trying to stop terror attacks.", "Who the fuck is Tim Kaine?", "This is the reverse of McGovern they force the American people to back a person who had literally no momentum! But now I'm going to start kicking the teeth and of the DNC all the superdelegates. Calling them day-in day-out asking them who is getting fired for this! ", "That is damn wrong. The Democrats who gave up the SC are the ones who foisted a candidate MORE UNLIKABLE THAN DONALD TRUMP on the country. The Democratic base tried to nominate someone who could energize the base and win but HRC and the DNC stopped it. Common sense said Hillary Clinton was unelectable, and that's because she is. She cannot motivate people the way she needs to.", "&gt;The population is swinging hard left right now. Not liberal but left.\n\nIt's fine to spend a few more days in delusional denial, but eventually you're going to have to face reality. I'm scared and anxious and embarrassed too, but we literally had a nation-wide election yesterday that proved we aren't swinging anywhere but disinterested. 10% less voted than last time. ", "This isn't how Democrat politics work. Donna Brazile's corruption bias, and self-dealing will be overlooked because she is, like Hillary Clinton herself, \"so qualified and experienced!\"\n\nI'm not even a Trump fan, but \"drain the swamp\" sounds extremely appropriate for the DNC right now.", "He said from the beginning he wouldn't", "They aren't protesting the legitimacy of his victory in the Electoral College they're protesting the fact that millions upon millions of voters chose to elect a racist narcissist with no regard for the welfare of the oppressed. ", "This issue should be taken all the way to the Supreme Co- oh wait. Shit.", " Yes absolutely after the conservative filled Supreme Court swings back liberal.   Sometime in 2035 or so if we are lucky. ", "Thats where I'm at.  I didn't want Clinton to win so much as I wanted Trump not to win.  \n\nCLinton was a shit candidate Bernie supporters knew it, but the assholes like DWS shoved Clinton down our throats.", "A Clinton asked a Sanders to carry her across an election. The Sanders hesitates: \"Won't you just abandon your progressive agenda once you get into office?\" The Clinton says \"if I did that then neither of us will get elected\". The Sanders thinks for a moment and nods, letting the Clinton onto his back.\n\nHalfway across the campaign, the Sanders felt a knife in its back. He asks the Clinton: why did you sting me? Now we'll lose control of the entire government? The Clinton replied: \"I couldn't help it. It's in my nature.\"", "Prepare your anus all you \"both candidates are just as bad\".", "Want to help me actually remove their leadership??\n\nWho's with me in calling and contacting people every day until they clean house and replace all of their officers? I am trying to spread this idea. We NEED to get them to clean house.\n\nPhone: 202-863-8000\n\nContributions Phone: 877-336-7200 (probably more likely to answer)\n\nContact Site: http://my.democrats.org/page/s/contact-the-democrats", "People on the_deplorables seriously think that this election was about people rising up against the \"femanzi SJW's\" who want to eliminate white men. They're a bunch of out of touch teenagers who think that their stupid internet culture wars are what motivate middle aged voters in Ohio to vote for Trump.", "The amount of times I've seen colleges referred to as \"liberal brainwashing machines\" is pretty troubling.", "Stephen Colbert fell in line with Hillary during some precarious moments that could have help Bernie and then after Hillary all but won the nomination Colbert suddenly found his edge.  It was probably the decision of his producers, but c'mon Colbert don't be a shill.  Bernie was marginalized again and again and again and again during the primaries, it was so damned frustrating when your favorite comedian doesn't seem to notice.\n\nAs for John Oliver, spending 22 minutes attacking Trump's ancestry and calling him \"Drumpf\" **only empowered Trump**.  John Oliver makes a lot of good points but he just seems to miss the mark.\n\n2016 really needed Jon Stewart.", "America might be dead. \n\nThere was an old Russian espionage plan dug up and posted here a few months ago detailing a plot to weaken America by widening the growing schism between left and right. But that's just crazy talk, right?", "Any former Sanders voters who are happy about Trump were in it for the wrong reasons. They didn't care about policy just wanted to make a statement. Hell, I voted for Sanders in the primaries, but that's because I liked his ideas. I don't like Trump's. He's a frightening person who has brought out so much xenophobia and racism. ", "A VERY large portion of the population fears intellect and praises \"gut\" over \"brain\". \n\nMy in-laws tell us not to call our kids smart and to discourage them from university. ", "Bernie Wan Kenobi?", "Why is no one talking about 2018? Yes gerrymandering is up in 2020 but people can begin flipping those seats in 2018.  There are midterms and Democrats forgetting midterms it is exactly why we are in the mess we are at right now.", "Help us Obi Wan Sanders, you're our last hope...", "I've lost a lot of respect for Stephen Colbert (and especially John Oliver) in the past year.  Maybe John Stewart should make a return to late night", "Names can be changed back I'm worried they do something that can't be reversed ", "I'm super sorry for pointing out that your candidate was completely fucking unacceptable. I'm sorry I made it personal...you're not the jerk Trump is. \n\nOK, can we re-run this now as Sanders vs. Jeb!?", "If racism was the deciding factor in an election Obama wouldn't have been elected, twice.\n\nThis is just more attacking of people for not choosing the \"correct\" candidate, it's lazy journalism at best and a disrespectful insult to the American public at worst.\nPathetic.", "Many countries also give you an ID for free. Many countries also don't shut down voter precincts in overwhelmingly minority areas that coincidentally vote Democrat", "Here's some more if you really want to throw up in your mouth:\n\nhttp://www.politico.com/story/2016/11/who-is-in-president-trump-cabinet-231071\n\nDraining the swamp my fucking ass. ", "Why? Be happy Bernie exists and not all our leaders are Clinton esque shitty", "I'm seeing posts from some minority voters (mostly Asian) on my friends list who support him because \"he tells it like it is\" and they are \"fed up of PC culture\". Congratulations your kids are going to have an enjoyable, politically incorrect experience in school and live through climate change, hope you're proud of yourself.", "Im really pissed at southern \"black leaders\" who came out during the primaries saying they had never heard of sanders despite his record on civil rights.   Essentially (mis)leading the sheep to the slaughter, and can only laugh at the irony that the DNC essentially fucked over the black community by alienating those white swing state votes", "You have no idea how hard it is to explain to a Trump supporter that he is a bigot and the media can put all words that came out of his mouth. Also all the people who voted for Trump as a joke or fuck you didn't realize that they validated all his xenophobia. ", "Actually come to find out within the last few hours that the democratic turnout was low. Republican was average. Bernie was right again. When Democrats don't vote - Republicans win. ", "Oh the cognitive dissonance Alex Jones is going to need to pull for next 4 years I can't wait!", "Can't wait", "Sorry buddy. Majority of people in US are scared about this. We didn't vote for this shit. ", "I have a fucking problem but what am I gonna do about it, as a Californian? It's not my fault that Hillary totally lost the Rust Belt and Florida. It's not my fault she ran an ineffective \"I'm not Trump campaign.\" And it's not my fault I didn't vote for her. Millions did in the states that mattered. And we all will reap the price, God fuck us all. ", "Not glad that Hillary lost no...mad that she was the candidate to begin with. Bernie was clearly the better candidate and the DNC chose Clinton before the primaries even began. Trust me, very few Bernie supporters are \"glad\" this happened. ", "Obama’s precedent of overreaching executive powers surely won't be abused by Trump", "This is what pissed me off the most. \"I dont like the president oh im just gonna stay home\" THERES LIKE 20 OTHER MARKS ON YOUR BALLOT", "I'd say rise in national debt from tax cut for the rich nothing being done about climate change, and maybe cutting regulations in areas such as the FDA.", "Less democrats showed up to vote for Clinton. A lot of those people would generally vote straight-ticket. Fucking up with Clinton fucked up the down-ballot.", "If he's alive and running in 2020 I'll vote for him. I don't care if he's in a wheelchair and wearing a respirator. Whoever he would pick as VP would surely be fit to pick up where he left off if he died in office anyway.", "&gt; My dearest fellow Americans when oh when will we get rid of this idiotic electoral college?\n\nhttps://en.wikipedia.org/wiki/National_Popular_Vote_Interstate_Compact\n\nWe are 165 out of 270 EV of the way there. If your state hasn't passed it, start lobbying today.", "So the only people who haven't represented a billion dollar+ company or spent years as a politician are:\n\nEbell for the EPA and is a climate denyer\n\nClarke, a Milwaukee county sheriff for DHS which is woefully under-qualified\n\nCarson for education, a man who thinks the pyramids were used to store grain\n\nLipnic for Labor, actually a viable choice but many have said he wants a CEO\n\nThat's 4 cabinet seats that haven't directly represented major corporations or government, all but one are terrible decisions, and even that one he's looking to replace.  Fucking bullshit.", "I'm hearing word (from some bigly smart people just saying) that Republicans are already shocked about the Muslim ban disappearing from his website, Reince Prebus going on morning shows saying there will be no mass deportation, and Trump considering a George Soros-affiliated aide as Treasury Secretary. ", "Democrats fall in love. Republicans fall in line.", "Yeah let's replace a family accused of 40 years of sex. lies and scandals with a president having a similar track record. Added bonus is you have a climate change denier homophobic, vice president complimenting a racist, misogynistic and xenophobic president. Well done America.", "Republicans voted the exact same number basically for McCain and Romney.  They just go out and vote.  Obama got 10 million more votes than Hillary in 08.  Democrats need to be catered to or they let Republicans cause yet another recession.  Basically Trump can do whatever he wants and Republicans will still vote in the exact same numbers.  There isn't a single Republican policy you can point to since Nixon that has been successful.  Literally not one.", "We'll have hunting in Yellowstone! \n\nKids shoot your own Bison! Darn tootin'!\n\n*Note - I live three hours from Yellowstone, and this is really not funny.*", "I lost quite a bit of respect for Warren when she had the chance to endorse Bernie in the primary but didn't. She played politics and look at where we are currently. She is no better than Harry Reid or Nancy. ", "Not like this", "&gt; Sanders is...the most powerful liberal in the world \n\nIn the world or in the US? ", "Whichever party isn't in power is the one complaining about big government. That's kind of the running joke among Libertarians. When Republicans say \"Keep the government out of our personal lives!\", Libertarians are like, \"Lol, ok\".", "republicans ain't about to impeach a republican president.   no way no how.", "Republican politicians are hypocrites of the highest magnitude.\n\nI wouldn't hold my breath", "What's ironic is that Trump criticized Hillary for ties to a Goldman Sachs executive.  Maybe his supporters will come to realize that the anti-establishment political outsider schtick was just another lie from ol' Donnie but I'm sure they'll find a line of thought to save their fragile egos from being hurt.   ", "More like Chevron National Park\n\nDrill baby drill!\n", "Why'd you lose respect?", "that would not be disregarding it would just further illustrate that she brought in that much less support than normal.", "make her secretary of State. She can practically work from home!", "Maybe this is the pivoting that Trump supporters keep going on about.   The misogyny insults to veterans and calling Mexicans rapists was all just talk to get votes /s", "Oh great here we go again. Trump didn't win because Hillary Clinton was a liar and a cheater and an unlikable untrustworthy Wall Street stooge, he won because of racist white ppl!!! Give me a break. Hillary Clinton will be remembered as perhaps the weakest presidential candidate of all time: she had the entire support of the DNC, the establishment in Washington and the media, and she still lost to a candidate who has never held a public office in his life. It's because she's just so darn shady and nobody likes her. Let this be a lesson to the DNC: people want REAL change, not establishment hacks like we've been getting for decades.", "Shut. The. Fuck. Up.\n\nClinton lost because she's a bribe-taking warmongering, media-manipulating, campaign-sabotaging sociopath. If the Party had nominated Sanders, he would be basking in his glory right now. Unfortunately, the Party nominated Clinton and has earned its failure several times over.", "To be fair I don't think there was anything that any late night comedian could have said to shift the vote any more than it did. By the end Trump was being torn apart on all sides. ", "A tiny part of me was hoping he would get on stage and be like \"are you fucking serious america? Wow...wowowowow...fuck you.\"", "Right like at least it's technically a fact...", "Sanders is above all a patriot. If Barack asked him for the good of the nation, run as VP to Clinton so she has a chance of winning. I think he would have done it. ", "&gt; I can't help but think that the people who voted for him voted for a hope to put food on their table pussy grabbing and racism be damned. I can only imagine that they looked at us like the elites we actually are, with tons of education and lots of high paying jobs with the luxury to care about things like transgender bathrooms when they're trying to figure out how to find a paycheck.\n\nYes, this is exactly it. It also doesn't help that they are constantly referred to as idiots or racist or sexist because it is the issue that they care about.\n\nAs someone living in a red stronghold, what you may also find interesting is that a very large percentage of these people were absolutely willing to vote for Sanders. They didn't agree with him on lots of things, but they thought he was honest and he cared about trade. That was enough for them. \n\n\n\n", "I *literally* had one of my coworkers tell me to GTFO of America for opposing the wa rin Iraq. I said \"No, I'm going to stay here and vote and make my country a better place.\" Fortunately, a few years later that same guy realized what a clusterfuck Iraq was and while he didn't apologize to me for what he said, he at least admitted the war was a huge mistake.", "The market miraculously went up today!  Can't wait for when the sale finally hits.", "Comcast and the Republicans told me it was about the government controlling my internets is that not true!?", "Lol. Blm has gunned down ten cops in cold blood and has extemely violent riots where they attack people based in race. Muslims slaughtered fifty gays and tried to bomb hundreds. \nGuess all that blood is on your hands since you voted for crooked hillary. \n\nTell me again how 8000 dumb rednecks are the real problem. ", "Vox &amp; Huffpo should be banned. These aren't stories.", "during the debates he seemed most outraged by Hilary's crushing of the bernie campaign.  It could be awesome.  The internet would collectively implode.", "I don't think Bernie likes Trump one bit. They're both anti establishment and that's where their similarities end.", "Do you think they'll even find out? \n\nAs Americans we tend to get our news from our echo chambers and if the places you go for news decide something isn't worth mentioning, would you really ever know?\n\nMeanwhile the echo chambers of the other side will hoot and holler and we will continue to talk past each other, unable to believe what the other side is saying.", "Well some of the things Trump wants to do are clearly at odds with the constitution...most of what he wants to do actually. Republicans may be forced to remove him from power if he abuses it. Things like \"opening up libel laws\" or repealing the 14th amendment which iirc makes you a citizen if born in the US or deporting millions of Americans. That would be a human rights crisis and I gotta hope the right would do the right thing although, who knows these days.. ", "Yeah if making fun of trump remains legal after the inauguration ", "This person disagrees with me? Huh must be a shill!", "Like getting rid of them entirely selling them to logging companies... ", "Congratulations dudebros.  You just killed the internet.", "Californian here. These CalExit people are few and far between and not being taken seriously. No one in their right mind actually thinks secession is even a remotely reasonable idea.", "One of the judges who struck down the law stated that the voter ID laws in NC \"target African Americans with almost surgical precision.\"\n\nhttp://www.pbs.org/wgbh/frontline/article/court-north-carolina-voter-id-law-targeted-black-voters/\n\nhttps://www.washingtonpost.com/news/wonk/wp/2016/07/29/the-smoking-gun-proving-north-carolina-republicans-tried-to-disenfranchise-black-voters/\n\nhttp://www.nytimes.com/2016/07/30/us/federal-appeals-court-strikes-down-north-carolina-voter-id-provision.html?_r=0\n\nEDIT: decided to add another quote from the NY Times article.\n\n\"The judges noted that Republican leaders had drafted their restrictions on voting only after receiving data indicating that African-Americans would be the voters most significantly affected by them.\"", "Considering he said multiple times throughout the campaign that he would consider Palin for a cabinet position it really shouldn't surprise anyone.", "This is correct. Clinton had a firewall of southern states that gave her the nomination over Bernie. Southern states that had no real shot of ever going blue anyway.\nBernie performed really well in the Midwest which is the same area that swung the election to Trump", "If nobody shows up for the big name a lot less people are gonna show up for the other races.\n\nThe lack of enthusiasm she created, along with her \"inevitability\" made everyone believe that she would win handily and that they could stay home guilt free. \n\nThey all wanted to save themselves from being forced to vote for the lesser evil since they were sure it would win anyway.", "&gt; Voted for Trump as a joke\n\nHe's like, Candidate McCandidatey-face or something.\n\nPresident McPresidenty-face now, I guess.", "Media: STOP\n\nStop playing to the basest worst impulses of everyone. Stop creating panic and fear. We had an ugly, vitriolic election and the media stoked the flames the whole time instead of working to make people feel included and hopeful...and we all lost a little because of it. There is no incredible, unbeatable power of racism, so don't say there is and make people feel more hopeless. There is nothing we can't accomplish if we work together as human beings. This is divisive and ugly...why is Vox fanning the flames instead of bringing buckets of water? ", "Ok if you want to get pedantic about it.  \n\nrepeal of the outcome of Roe vs Wade or overturn Roe vs Wade\n\nThe gist is still there", "If you took a poll today very few Americans believe that they were ever for the war.", "Why not? They will get pence. Sounds like a wet dream for the gop", "This is what lack of enthusiasm does to a party. Run a crap candidate and people stay home. ", "The west coast should form their own country. ", "Wikileaks has documented quite a bit of the rot for anyone willing to dig in.", "They didn't protest vote.  They didn't vote.   Both Hillary and Trump had remarkably low popular vote totals lower than McCain or Romney.  \n\nThe Bernie people warned that the Democrats needed a leader that would get people excited.  They were right.  The Democrats don't win with Kerry or Hillary or Dukakis.  They win with Kennedy, Bill, and Obama.  Competent, boring politicians do not bring souls to the polls and will always be losers for the Democrats.  \n\nKerry, Dukakis, and Hillary all have another thing in common.  They were pushed by the establishment (Dukakis less so) as elder statesmen/women whose time had come.  Obama and Bill were both \"natural\" in their ascent, not the party loyalty choice.  \n\nIn other words, the question is excitement.  Boring doesn't win, the far left warned that Hillary was boring and would depress voter turnout and they were right.\n\n ", "No I didn't say it's their fault. I'm saying that a lot of them are happy she lost. Just look around this site. They're glad, she was corrupt, she was a problem, they just loved telling us \"I told you so\" and how victimized they were by us. \n\nClinton lost because she did not drive out the votes she needed. She failed to make an economic case in the rust belt where she sorely needed to. And they took her out with that. ", "Because the shit those people were paid to know was that Hillary was going to be president. \n\nThey weren't paid to think about it just puppet the response. \n\nIf nothing else this election should have highlighted the necessity of independant media. That point seems to be ignored a lot.", "Let's not assume he will actually spend any time studying it either.  People elected this guy because he was open and unapologetic about not doing his homework.  Anti-intellectualism is such a cancer on America.  We voted him in because he's a dumbass like (slightly less than but enough to win the electoral college) half of us and now we are looking forward to the dumbass presidency.", "It's been said over and over in this election: over 300 million Americans and it came down to these two?\n\nSame thing applies. There are over 300 million Americans. We do not need Michelle Obama running for President.", "Just because I want to suck his cock doesn't mean I'm gay for him.", "&gt;Almost like theres no point commenting on baseless speculation about cabinet positions\n\nI'm confused how this is baseless speculation?  He said throughout his campaign that he would consider Palin for a cabinet position.  Multiple sources from his campaign have said today they are considering tapping her for a cabinet position.  This isn't some left wing conspiracy he's literally doing what he told you he would do multiple times over, don't act surprised.", "It's true and it happened in the real world. That alone is a step up", "&gt; According to BBC he's considering a guy from Goldman Sachs for his Administration.\n\nAnyone who's been actually listening to Trump is not surprised. The devil is in the (non) details. He was just waiting for the rubes to put the billionaire in place to stop the billionaires.\n\nIt's basically just like Matt Damon in The Departed. ", "\"journalism\"", "If his track record is to be any indication he will do something impeachment worthy within a year or two I'm sure. ", "All it takes is a Supreme Court majority ruling that goes contrary to the original ruling.  Nothing else ", "&gt;most of us said fuck you.\n\nHardly. Clinton got more of the popular vote and Trump's decisive victories in Michigan, Wisconsin and Pennsylvania were all by a margin.\n\nThere was no inevitable momentum powering Trump's victory. People *chose* him, and they're very much responsible for what happens next.\n\n&gt;You fucks killed that\n\nWhat did we do, exactly? \n", "Conned his way right into the WH. Unbelievable! Time will tell however and I have a feeling it'll be pretty soon. I give him 8 months at most. ", "I think we will see obstructionism on any large issues yes but the Republicans will probably be able to pass all kinds of crazy deregulation, repeal ACA (literally killing Americans), huge tax decreases for the super rich...honestly that is the scary stuff for me. That and Scotus as a gay man. ", "\"No time for arthritis I can hear some working class being oppressed in that general direction!\"", "Colbert is on my list of celebrities/personalities who made Bernie supporters out to be a bunch of ridiculous childish fools. They promoted Hillary in the general election and never would take a second to seriously address people's concerns, that would just be written off as sexism and \"oh some people just aren't ready for a female president\". \n\nHim, Bill Maher and Trevor Noah are a few names on that list. Fuck them for insulting our intelligence and actually helping Trump win. People aren't fucking stupid enough to fall for these bullshit lies and they pushed this agenda so hard that many started suspecting foul play and it supported the narrative that the media is heavily bias against Trump. \n\nPeople aren't stupid and these guys really treated the population like a bunch of fucking idiots. Trevor Noah really made a fool of himself when he went off on a long rant against Trump. It was ridiculous. \n\nEdit:\n\nTo be clear, I'm not pissed off at Maber for his treatment of Bernie, he was gracious to him and I honestly believe that he preferred Bernie to Clinton. \n\nI am pissed off at the fact that he was one of the people who tried to make Clinton out to be a saint and Trump the devil. This helped Trump win because people wondered why the hell the media was so bias. We all know how corrupt Clinton is. \n\nIn the general He referred to Bernie supporters who wouldn't vote for Clinton as being childish which is another reason why he pissed me off. \n\nEdit 2: Thank you so much for the gold &lt;3", "This is absolutely what happened make no mistake about it. \n\nKaine was sitting in his position as Chairman of the DNC until exactly the moment that HRC learned she would not get the 2012 nomination. That was the moment she started pushing for her 2016 nomination. Kaine stepped down in 2011, letting DWS into the position. That way DWS could take the heat for all the corruption Kaine set in place to try and \"fast lane\" Hillary. \n\nThey set up the \"Hillary for Victory Fund\" which was an agreement to donate unethical amounts of money directly from state DNC offices to Hillary's campaign fund. Once those deals were in place, Kaine stepped down and DWS went in. Then when the DNC had to oust someone for their obvious corruption, they pin it on DWS who gets a cozy seat as Hillary's new campaign manager, and the promise of a cabinet position when Hillary wins. Kaine gets the VP pick, DWS gets a comfy job. Hillary avoids jail despite the grossly dismissive attempt to circumvent the will of the American people she claims to represent.\n\n\nMaybe next time the DNC will actually let the voters pick who should be the candidate. ", "Someone should tell them Trump got fewer votes than Romney in 2012.\n\nThis was less a popular uprising or a rejection of Washington than it was a rejection of Clinton specifically. ", "Read that in Bernie's voice. He will shout arthritis away and I believe that. ", "This.  Really don't get people thinking he's going to nice to everyone.  They played for keeps.  And they will ram through the Republican's wet dream of an agenda.", "Scorpion and the Frog correct?", "Grab Russia by the peninsula", "&gt; HRC learned she would not get the 2012 nomination. \n\nYou mean 2008? Because Obama and Hillary met hours before she conceded in June 2008 and it's speculated that's where Hillary agreed to not take the fight to the convention, in exchange for Secretary of State and support as the next president. Obama agreed.\n\nAnd now he gets to see everything he worked so hard for get turned back. It's sad for all of us, but poetic justice for them. ", "Exactly. \n\nIf the VP is chosen for their qualifications and policy positions that align with the president and not just to balance the ticket, it's not a huge deal if they need to replace the president at any point. \n\nA somewhat larger issue is declining abilities. However, FDR fought WWII from a wheelchair and died in the office in April 1945, before the war was over. Age is not all that important, as long as their cognitive abilities are not in decline. \n\nI'd have no problems voting for a 80 year-old Bernie, though in a country of 320 million people, I'm sure we could find other equally suitable younger people to run if we try (and Bernie himself probably wouldn't be opposed to that). ", "If only there were a candidate that excited democrats...", "Who pulled record crowds and ignited the youth like nobody else before him. \n\nIf only....", "You own this shit Trump voters. ", "I think it's better if we all acknowledge now that permanent things will happen.  The strategy for anyone interested in these things will be to be very strategic with battles so as to cut losses.", "No he is pandering to fear.", "Was it Kerry that said \"if you don't do well in school you end up in Iraq\"? I was in the military and remember that being a big deal.", "Exactly.  Let's reclaim the DNC first then we can get some real change going.", "Me too then as it turned out everything we did there was a waste and anyone who decided not to go was honesty making the best decision. ", "So let's sum this up.\n\n- Massive sweeping tax cuts.\n\n- The deregulation of wall street and the banking industry.\n\n- Anti-free trade and talking about tariffs.\n\nWe had a good run boys, enjoy the worst 4 years in this country since the great depression. I hope to god the ryan wing of the party blocks his agenda.", "&gt; Hillary adopted a lot of Bernie's platform making her one of the most progressive major presidential candidates.\n\nAnd would never have done a thing with it. The word of a known liar - a woman willing to blatantly lie about her own party members to win - is worth nothing.\n\n&gt; How do you show the people who voted for Trump democratic social and economic policies are ultimately better for them, rather than republican bullshit?\n\nBy not trying to feed them bullshit like that Clinton is a progressive. Voters can smell bullshit from both sides, and Clinton's lizard-person-style calculating lies smell a lot worse than Trump's \"the fish was thiiiiiis big!\" lies.", "They made that giant Trump head in one day? Impressive.", "It's suggested by the \"Mindset\" theory that praising kids for their effort rather than intelligence, leads to a better outcome, because they feel intelligence isn't under their control but effort is.\n\nDon't think that's the case if they also discouraged further education, but thought I'd mention it.", "Increase spending and cut taxes on the wealthy. He is going to murder the middle class.", "Just as unacceptable as when Trump supporters ran around with Hillary effigies in cages or had its neck in a noose.", "I occasionally called Obama out on his love of overreaching executive orders. I warned of the new precedent he was setting of the damage that would be wrought once someone of a different ideology got the chance to step into the White House and use that new power. I was called a conspiracy theorist, among other things. \n\nAdditionally, several people seemed to imply that they had nothing to worry about because, obviously, we would never again have a republican president.\n\nYeah.\n\nDefenders of Obama's iron pen, pay attention to the next four years. It's on your heads.", "This makes me so fucking happy. Go to town republicans!  Pass everything and show all those bumfuck farmers and all those \"both parties are the same\" what they voted for. Go house to house sic dogs and round up all those illegals and their children. \n\nOh and didn't Trump promise crack on Cyber and internet annonymity? Go ahead!\n\nWe deserve this, reddit told me, liberals said too many mean words. Calling someone racist for saying racist things is really mean, next time I will be more politically correct. How about more equal americans?", "He at the age of 74 with an incredibly stressful job, can run at roughly the same pace I can jog. That is impressive.", "Dude I'm mixed and I am fucking livid about it. And Hillary Clinton fucking lost white women.... like just fucking think about that she spent the entire election talking about how her being a woman was this huge important thing and she failed at getting the largest demographic of women to support her! Literally have no idea how she could have failed more. ", "I really fucking wish this wasn't true. Some of my fellow Democrats are special little snowflakes that need all their warm and fuzzies served to them or they don't give a shit.\n\nGrow up people. You don't always get what you want, and this time some of you may have just elected Donald God Damn Trump because you apparently had better things to do.", "I believe he got in a subtle diss about billionnaires not paying income tax.", "It's fucking absurd and terrifying that the best argument that can be mustered for Trump is \"maybe he was just lying about everything the entire time.\"", "I think the DNC should do the one thing they would never do in a hundred years.\n\nApologize to Bernie and to every Democrat they failed this election.\n\nThey were so desperate to maintain the status quo that they chose someone Trump could actually defeat. Would hackers be able to dig up that much dirt on Bernie if he was the one who ran? Would Trump and the Republicans be able to run ads and proclaim that Bernie works for the devil Wall Street, Saudi Arabia, etc.?\n\nTheir own hubris caused their own downfall and maybe that's for the best. The best time to learn a lesson in humility was before they chose a candidate, the second best time is when they failed. Politics is drowning in the money of private citizens and corporations that they fail to realize that they are *PUBLIC SERVANTS*. They serve the common man, to enact laws and provisions that could alleviate poverty and suffering in the populace. \n\nYou shouldn't serve your party's interests, you should serve the country's interests. There are people out there that want to get into the government to help people, not to make money. This atmosphere that breeds hatred and drains hope and idealism from possible future lawmakers is whats killing the political scene.\n\nLet this be a lesson to those who wants to live in a better country. Don't look down from your parapet and assume what the people want. Put your feet on the ground and talk to the people and listen to their concerns. Don't be a politician, be a human being. Let it run its natural course to politics. Humble yourself and go against the establishment that keeps progress from continuing. \n\nThe DNC must rebuild itself from the ashes to actually be the party that delivers on its promises, promises that they did not make on their own, but by listening to what the people need. They need to overcome the anger and disappointment of their constituents and to do whatever they can to make American lives better. \n\nBernie and Obama have this chance to mentor upcoming politicians, to learn from from their victories and defeats. You need a combination of their greatest abilities to be the public servant that ought to be. A person with Obama's charisma and Bernie's ideals. A natural leader that whenever they speak, you listen and you feel that energy, that drive to follow them. Someone who does not resort to name-calling,but extends a hand of bipartisanship and friendship to their opponent, sometimes even an offer to help them when they have problems. The aisle that divides Republicans and Democrats shouldn't even be there. How can the country move forward if petty arguments and disputes keep blocking necessary actions and laws because one party wants to assert its authority over the other?\n\nSo, DNC, humble yourself, apologize and actually listen to the people and not screw with those that actually wants to help the people.", "Apparently you guys invented a reality in which Hillary Clinton was electable.", "Yeah isn't it grand they voted for him to stick it to the elites?\n\nBy deregulating them and cutting their taxes. How did people fall for this shit? I seriously can't grasp how anyone could vote for Trump based on economic reasons.\n\nIf they're middle class at least.", "The shitty VHS tape quality makes this.", "&gt; you're upset because you lost\n\nI don't think you really understand why people are out there.", "The DNC was probably expecting Trump's campaign would implode after they release some scandals about him (I.e. the pussy grabbing incident)\n\nWell it looks like they were not watching the Republican primaries because Trump thrives on Bad Press. ", "This. In Germany we have to have ID, are automatically registered to vote and all my voting places so far have been reachable in less than ten minutes by foot, with a line consistently under 5 minutes. ", "Isn't that just SOP for fermenting revolution?  Get a divide big enough and you start seeing the other side fellow country people, as a threat so existential that you need an uprising to defend the country from them.", "Youre totally missing the point. Colleges are not vocational schools. A good education isnt supposed to be practical. The more you know about more things the better you get at connecting dots and thinking critically. You build a foundation under which you can funnel future learning. You learn how to communicate complex ideas. Employers originally started preferring candidates with degrees not because they were being trained for the work ahead of time, but because they were better prepared to excel. My generation was advised to go to college. Its not our fault that the economy isnt what it used to be. That doesnt mean our educations were worthless though. Knowledge will never be a bad thing.", "I am an American citizen of Mexican descent and I have experienced more hate and vitriol in person since this man announced his candidacy than I have my entire life. The closer it got to election night the worse it's gotten. I feel so sad and disappointed. I had more faith in this country and it's people. It doesn't help that I live in East Texas. The hate is real and the racists are feeling truly empowered by this horrible man. I don't know how much worse it's gonna get once he's actually in office.", "Climate change is pretty concerning.  It alone has the potential to make the others irrelevant if things go badly enough.  Honestly I don't even know if Bernie or Hillary were ambitious *enough* on this front or if it was ever going to be possible to really tackle it the way everyone needed to.", "These people are the reason Trump is the next president. ", "&gt; You're making assumptions with no proof.\n\n&gt; Many Trump voters wouldn't have voted Bernie regardless\n\nThe proof is in the vote counts. You didn't lose because people voted Trump. You lost because people like me didn't vote for Clinton because we saw her play dirty to screw the only person who seemed to be both (a) sane and (b) remotely give a damn about our problems. Trump won with fewer votes than Romney lost with, because the Democrats gave a collective middle finger to half their party.\n\n&gt; Look, I want a rational discussion on this. \n\nSo did I, but people were too busy calling me a sexist, racist Bernie Bro (for the record, I'm an openly trans woman who teaches predominantly immigrants for a living) for the last six months for having misgiving about Clinton.", "&gt;“For decades Americans have experienced a populist uprising that only benefits the people it is supposed to be targeting.... The angry workers, mighty in their numbers, are marching irresistibly against the arrogant. They are shaking their fists at the sons of privilege. They are laughing at the dainty affectations of the Leawoof toffs. They are massing at the gates of Mission Hills, hoisting the black flag, and while the millionaires tremble in their mansions, they are bellowing out their terrifying demands. 'We are here,' they scream, 'to cut your taxes.”\n\n― Thomas Frank: What's the Matter with Kansas? How Conservatives Won the Heart of America", "In 2012 Donald Trump advocated for this exact course of action and bashed the Electoral College: http://abcnews.go.com/Politics/donald-trumps-2012-election-tweetstorm-resurfaces-popular-electoral/story?id=43431536", "Some democrats even applauded Obama's use of executive orders as a great way to get things done by bypassing congress.", "Exactly...supporting Donald Trump is a fad that will go out of style real fucking fast.  As petty as it is to say I can't wait to shove it in their faces when he turns out to be exactly what they hated most in this election; a corrupt, money driven politician who based his whole campaign on broken promises and complete bullshit.  Lets see how long it will take them to wake up and smell the roses.  ", "&gt; All their explanation is \"minorities didn't come out for her.\"\n\nWHAT? These were the same people who smugly claimed Sanders \"couldn't connect with minorities\" and Clinton had them on lock. Now they're trying to act like she couldn't get minorities? They're just throwing shit on the wall to see what sticks at this point.", "Yeah I lost to Bush twice and it didn't make me this mad. Trump made enemies to win and here it is.", "Yep. This isn't helping anybody. Violence or implied violence doesn't help the cause in any way. Protest peacefully. Essentially [Sanders statement](http://www.sanders.senate.gov/newsroom/press-releases/sanders-statement-on-trump) in rally form (if that makes sense) is the best way to fight for your interests.", "&gt;  the \"holier than thou\" attitude, and the need to check everyone's privilege. That kind of attitude only pisses people off\n\nI'd argue it is responsible in part for these election results.", "&gt; the necessary qualifications to be a serious candidate.\n\nI have to keep saying this...Donald Trump just won the Presidency. Donald Trump had the necessary qualifications to be a serious candidate. I'm confident in saying that the pool of people that have a shot at being President at this point, includes Vermin Supreme ffs. ", "Fair but so many are engaging in the exact condescending rhetoric that thy have been accusing Hillary supporters of doing. There were just as many Hillary supporters that voted for her in the primaries (let's say it's even given the whole \"rigged\" accusation) as Bernie supporters voting for their candidate. The progressive wing is smaller than moderate wing (that's not to say it's not growing) of the democrats. You can't just choose one thing to blame as if that one factor would have fixed everything. People that voted for trump are to blame. People that didn't vote are to blame. People that voted third party are to vote. The DNC is to blame. Clinton is to blame. We all have to share in that responsibility. That's how we move forward. That's how we unite liberals, by acknowledging not just what went wrong but accepting that responsibility moving forward is on all of us. We need to do better next election. And hopefully we will.", "Notice the protestors have those characteristic pre-made signs in black and yellow?\n\nAnd those signs not only are in all the protests in different cities but are very similar to ones in previous anti-Trump protests throughout the year? \n\nYah, these are not organic protests. These are bird-doggers.", "You know I just realized something. \n\nThis started 25 years ago.  It started with the first big steps towards globalization.  NAFTA was proposed and passed in the 90's. Ross Perot (a very popular 3rd party presidential candidate that I voted FOR in 1992) said that passing NAFTA would produce \"A giant sucking sound of jobs fleeing the country!\"  \n\n\"A giant sucking sound\" became a mantra of 1992 politics.\n\nTragically, he dropped out of the race, and then re-entered the race, and managed to garner 19% of the vote, anyways.  \n\nFlash forward about 25 years after the passage of NAFTA, much of the midwest has been decimated by the loss of manufacturing jobs.  Primarily, the states of Wisconsin, Michigan, Ohio, and Pensylvania. \n\nA whole generation of people (25 years) has grown up under these stark economic conditions.  Escape from these conditions is quite difficult.  Consequentially, many people who can't leave, or won't leave, become addicted to some substance in order to cope, or start peddling in crime to pay to be alive.\n\nThere is a real travesty that has befallen this nation.  We have elected a man who is into glitz and glamor and pompousness, because of a very real, and profound outcry of the new underclass - the blue collar, under-employed worker of the midwest.\n\n", "We are truly and massively fucked. And the people who get the worst of it are the same fucking people from the rust belt who voted for this. Deregulation of financial institutions at a time when the housing markets are already overheated is going to lead to another gigantic bubble burst. And it is going to be the middle class that is going to take it all straight up the ass... again. They might as well start handing over the keys to their houses to Wells Fargo now.\n\nI'd be laughing if it wasn't going to be so incredibly horrible for everyone.", "Come on... if this was a Clinton supporter being beaten in the middle of the street in broad daylight it would dominate the news cycle for several days", "That's the thing they're honestly not understanding.  There's actual *hatred* invoking *fear* the president-elect has directly inspired.  Any other election people would shake their heads and know that while they might disagree, life would be okay.  All bets are off for a significant portion of the populace this time.", "&gt; Trump has made clear the Education Department would play a reduced role in his administration — if it exists at all. **He has suggested he may try to do away with it altogether.**\n\n&gt;The GOP nominee has also offered a few hints about who he would pick to lead the department while it’s still around. Among those who may be on the shortlist is Carson the retired neurosurgeon who ran against Trump in the primary but later endorsed the Republican presidential candidate. \n\nCarson as the fucking head of Education?\n\nGod dammit. ", "&gt;15-20 minutes because they didn't understand half the terms.\n\nThey probably just nodded their heads so your condescending ass would walk away. You guys still just don't get it.", "Agreed. This attitude of \"if it doesn't directly help you make more money it's meaningless\" is ridiculous. Sure, making more money is one upside to having a college education, but that's not all it's about. That's not all life is. Money isn't everything, for the love of christ.", "Nope. Not happening. Whiny democrats couldn't stomach Hilary so now we catapulted all these fucks to the mainstream. ", "mte. Trump hasn't given any indication he gives a crap about protecting first amendment rights.", "http://www.snopes.com/2016/11/09/kkk-of-north-carolina-announces-donald-trump-victory-parade/\nIt will happen in December", "But maybe if we act more like children, people will trust us with power.\n\nWe need more tantrums.... er, protest.", "Vice-Presidenty McVicePresidentFace", "I never understand what this solves. We get it you're upset because you lost. People lose in every election. Nobody cares. Especially not the hundreds of people you're holding up on the highways. ", "There are a lot of idiots in this country that wear red and blue. Both sides have idiots. I've found it very hard to not pop people in the teeth that said they didn't vote last night but are sad at the results.\n\nYou don't get to bitch about the score if you didn't participate in the game.", "I'm asian. I see the reverse. Affirmative action is a drop in the bucket of problems when we are literally afraid for our physical well being or our livelyhoods. Seeing a rise of bigots scares me as I like so many others have experienced racism from redneck types or frat boy types.", "Sanders will take the leadership if he thinks it will help advance his causes", "You can back and forth over this but DNC made the choice.\nIt was obviously unwise, and the voter blaming only reinforces the impression of arrogance coming from Clinton and her base.\n\nHell, not only did the DNC choose to collude with the Clinton campaign and the media to keep Bernie coverage buried, but the email leaks show them discussing primary strategy with the intention of empowering Trump to increase his legitimacy and force the other GOP candidates to become more extreme to compete. \n\nThey propped him up and even called him a \"pied piper\" not realizing that he was going to play his flute and bring a wave of racist idiots to wash over us.\n\nBernie won all those midwest states during the primary that Hillary floundered in during the general. He had the potential to defeat Trump, even after the DNC turned him into an unstoppable monster, but they continued to ignore the one candidate who could bring stadiums full of enthusiasm in favor of their insider candidate who had to struggle to fill a school gym. She won the primary by relying on the south; a place she was never going to win in the general.", "Sorry but we need to make the Democratic party apart of you the actual liberal and Progressive values. Anybody who doesn't agree or get behind such an agenda needs to be taken out of the conversation. Right now we need to destroy the DNC internal structure and that starts by getting rid of any support for corporate candidates. At the end of the day the truth is there was one right side and all the others were wrong. So they either join us or they get out of the way. We don't have fucking time to hand hold all the Hillary Clinton supporters into comprehending the absolute Corruption of these corporate candidates and their corruption. We need to clean house now(!) and right now the corporate candidates don't have any support. ", "The current President-Elect has spent 6 years questioning the legitimacy of America's first black President and demonizing his supporters.\n\nThe moral high ground does not win elections. \"When they go low...\" they win. \"When we go high...\" we lose and get to feel morally superior.\n\nNo more of this pansy shit. It's time for liberals to get mad and crazy. When they go low let's go lower. As has been clearly demonstrated, it wins elections.", "Lots of poor people in urban areas don't have licenses or cars. They just use public transport. This includes a disproportionate amount of black people.", "The top post in r/seattle is about [cascadia](https://en.wikipedia.org/wiki/Cascadia_(independence_movement))", "Because the deck got stacked and because people bought the lie that she was electable.", "I REALLY want to see a pissed off vengeful Obama.", "Nah man. We're fucked for a long ass time. Might as well start laughing at how fucked we are to ease the pain.", "In hindsight everything seems so obvious. Trump claiming that the system was rigged was not to only lay the groundwork for his potential loss but it doubled as a reminder to all the disenfranchised democrats that the entire process was never a choice.", "Do you think it might be possible that the person who gave that quote and the person who threw the bottle aren't the same person and it's irresponsible of you to equate the two?", "I don' mean to harp on this but there is one major thing that not nearly enough people seem to be worried about. Climate Change. We just elected a moron who doesn't even recognize it as a thing. We can't afford to waste the next four years as Trump plans to. As a country we're finally starting to make some headway into tackling this, but by electing Trump, we've essentially halted that progress. ", "While also promising to cut taxes heavily (especially for the rich) build a very expensive wall, get infrastructure projects going and subsidize coal further. \n\nEdit: Sorry, I forgot Mexico is definitely 100% paying for the ~~money pit~~ wall. We can write that one off.", "I like all these outlets who are admitting that Hillary Clinton was a horrible candidate and the election was unfairly rigged at the primary level for her benefit NOW.  \n\nThe entire fucking election I had to listen to all these sources calling such stuff 'conspiracy theories' and how we should ignore it all because the information may have came from Russia, and how Hillary Clinton was the most qualified candidate ever to run for any office ever. \n\nThey didn't fucking discover all this on November 9th.  They knew it the whole time, and just lied their asses off because getting a Dem in the Oval Office was more important to them than any sort of integrity. \n\nIf Hillary would have won, they would have all gone to their graves denying what they're all admitting tonight.   That alone makes it worth it. ", "Carson the guy who thinks homosexuality is a choice? In charge of our education system?  \n\nAnd Ebell is a lobbyist for coal, prime canidate for EPA IEHO", "[myNBC5](https://www.google.ca/amp/s/wptz.relaymedia.com/amp/article/bernie-sanders-don-t-waste-write-in-votes-on-me/8071700?client=safari)\n\nNever mind the article is misleading and puts words in Bernie's mouth that he never said.  It's merely inferred from other times he has told his supporters to vote for Clinton.\n\nFeel free to downvote", "That was as heart-warming as I'd hoped it would be. Thank-you.", "Amazing. And these are the same ones complaining that they can't find a job I'm sure. A degree probably wouldn't hurt.", "You know if the DNC and HRC hadn't deliberately tanked Bernie used their resources to 100% guarantee that he would lose the nomination to Hillary, there's an extremely high chance we'd have a President Sanders right now.\n\nThis is what people mean when they talk about \"establishment politics\" and it needs to stop. The in-fighting and dirty backroom dealing needs to stop.", "Fascists never come out and say they're fascists. ", "Given that Trump has previously announced decisions to gut the EPA  is considering appointing a climate change denier to head the EPA, and one of his 100 days points is withdrawing all money from UN climate change programs we should all be concerned about climate change.", "I supported Bernie because he had a chance to win HRC had historically high unfavorable numbers. I was pretty pissed when they started the \"bernie can't win--that's pie in the sky.\" ", "*filthy leftist studies* 😂\n\nGet a load of this guy.. He think academics are conspiring against him 😁😁\n\nI suppose you think climate change is a *filthy leftist* plot too since presumably it disagrees with your biases", "No one at these protests are upset because they lost. They're upset because the person who won is openly unfit to run for office and actively represents racist and sexist culture. ", "Even Harambe got 3000 more write in votes than they have supporters. ", "https://www.reddit.com/r/EnoughTrumpSpam/comments/4teoxl/a_final_response_to_the_tell_me_why_trump_is_a/", "Secret billionaire masterminds have been preparing it as Plan B in case of a Trump victory. \\#staywoke", "Yea it's all the Clinton's. They held held everyone else at gun point and forced corruption on innocent democrats.\n/S", "Trevor was the worst. I watched the Daily Show all the time when Jon was on. Trevor lost me during this primary season. ", "They deserve this. Fuck 'em. ", "Someone should tell them Clinton actually got more votes\n\nIm not saying the election should be solely popular vote but like, electoral college does not work", "I want to see what happens to that subreddit in 2 years when they realize that Trump can't do much of any of his economic proposals to bring jobs back to the uneducated. \n\nTrump has so wildly over promised and is faced with a Republican Congress that simply does not share his economic views outside of tax reductions.\n\nAs for those getting insurance from the ACA...god help you. ", "so Bernie is Pepe? ", "Wow Trump supporters suddenly accept \"biased\" Politifact as a reliable news source? It's a miracle. ", "Im so glad people will literally die along with our planet, all because a few whiny assholes couldn't do some fucking research and realize Trump is awful", "There was one bit they had just after the first Dem debate, that made me livid. Basically ended off saying \"But none of it matters anyway, we're all going to support Hillary in the end, hahaha\".", "These are the people who demand high paying jobs that require almost no skills\n\nEdit:guys i think you misunderstand. I mean conservatives who want jobs like manufacturing plants back. No real skills. I do support an minimum wage increase. ", "I listen to am talk radio to and from work. No one is talking about how great the cou try will be they are all talking about how they are going to punish the left. About how they are going to throw Hillary Clinton in jail. About how they are doing to destroy universities. But how they are going to punish voters but implementing strict voting ID laws. About punishing Obama by undoing everything he's done and replacing it with nothing. \n\nIt's terrifying to see how gleeful these people are to hurt people on the left. ", "He's been proven to be a liar for a year on a weekly basis they don't really care about facts so much as kneeling down and slobbering on his dick like a bunch of... Well, classic fascists really. ", "Hillary destabilized sound leaders and then a strong man worse than her original opponent comes to power.\n\nShows she is using what she learned as Secretary of State.", "He also got fewer votes than Clinton in 2016. He won the election but Republicans lost the popular vote and lost seats in both houses of Congress. This was a good election for Republicans but it's about as far away from a national display of approval for their policies an election can be while still giving them full control over everything. ", "Stewart came across as passionate Noah is just another smug liberal.", "https://www.youtube.com/watch?v=HfUXUqxJctk\n\nColbert was one of the most outspoken anti Bernie and pro Hillary voices on the Left.", "Well that explains why we don't see intelligent interstellar life.\n\nEventually, every intelligent race installs someone like Trump and life ends.", "Everything was better when people worked on assembly lines that required no skills for 16 hours a day and died of stress at fifty. Those pesky mexicans stole it. ", "47% of people didn't even vote. Clearly they're not scared of shit.", "That's naive. You want the world to be a fantasy book. The world is the world. Choosing to make it more hellish out of fear that you can't always get exactly what you want is the mentality of an idiot child. \n\nAmericans by default have it better than billions of other humans and you want to throw a temper tantrum to bring us to the brink of fascism? Get a fucking grip you pansies. ", "I think it's important to drive home that manufactured candidates will not work in the future. So that when they recognize it in elections to come they know they're dealing with a losing candidate.", "Umberto Eco wrote an essay in 1995 called \"Eternal Fascism\" where he lists 14 properties of fascist ideology. Tell me who this reminds you of...  \n\n* \"The Cult of Tradition\" characterized by cultural syncretism, even at the risk of internal contradiction. When all truth has already been revealed by Tradition, no new learning can occur, only further interpretation and refinement.  \n\n* \"The Rejection of modernism\", which views the rationalistic development of Western culture since the Enlightenment as a descent into depravity. Eco distinguishes this from a rejection of superficial technological advancement, as many fascist regimes cite their industrial potency as proof of the vitality of their system.  \n\n* \"The Cult of Action for Action's Sake\", which dictates that action is of value in itself, and should be taken without intellectual reflection. This, says Eco, is connected with anti-intellectualism and irrationalism, and often manifests in attacks on modern culture and science.  \n\n* \"Disagreement Is Treason\" – Fascism devalues intellectual discourse and critical reasoning as barriers to action, as well as out of fear that such analysis will expose the contradictions embodied in a syncretistic faith.  \n\n* \"Fear of Difference\", which fascism seeks to exploit and exacerbate, often in the form of racism or an appeal against foreigners and immigrants.  \n\n* \"Appeal to a Frustrated Middle Class\", fearing economic pressure from the demands and aspirations of lower social groups.  \n\n* \"Obsession with a Plot\" and the hyping-up of an enemy threat. This often combines an appeal to xenophobia with a fear of disloyalty and sabotage from marginalized groups living within the society (such as the German elite's 'fear' of the 1930s Jewish populace's businesses and well-doings; see also anti-Semitism). Eco also cites Pat Robertson's book The New World Order as a prominent example of a plot obsession.  \n\n* Fascist societies rhetorically cast their enemies as \"at the same time too strong and too weak.\" On the one hand, fascists play up the power of certain disfavored elites to encourage in their followers a sense of grievance and humiliation. On the other hand, fascist leaders point to the decadence of those elites as proof of their ultimate feebleness in the face of an overwhelming popular will.  \n\n* \"Pacifism is Trafficking with the Enemy\" because \"Life is Permanent Warfare\" – there must always be an enemy to fight. Both fascist Germany under Hitler and Italy under Mussolini worked first to organize and clean up their respective countries and then build the war machines that they later intended to and did use, despite Germany being under restrictions of the Versailles treaty to NOT build a military force. This principle leads to a fundamental contradiction within fascism: the incompatibility of ultimate triumph with perpetual war.  \n\n* \"Contempt for the Weak\", which is uncomfortably married to a chauvinistic popular elitism, in which every member of society is superior to outsiders by virtue of belonging to the in-group. Eco sees in these attitudes the root of a deep tension in the fundamentally hierarchical structure of fascist polities, as they encourage leaders to despise their underlings, up to the ultimate Leader who holds the whole country in contempt for having allowed him to overtake it by force.  \n\n\n* \"Everybody is Educated to Become a Hero\", which leads to the embrace of a cult of death. As Eco observes, \"[t]he Ur-Fascist hero is impatient to die. In his impatience, he more frequently sends other people to death.\"  \n\n* \"Machismo\", which sublimates the difficult work of permanent war and heroism into the sexual sphere. Fascists thus hold \"both disdain for women and intolerance and condemnation of nonstandard sexual habits, from chastity to homosexuality.\"  \n\n* \"Selective Populism\" – The People, conceived monolithically, have a Common Will, distinct from and superior to the viewpoint of any individual. As no mass of people can ever be truly unanimous, the Leader holds himself out as the interpreter of the popular will (though truly he dictates it). Fascists use this concept to delegitimize democratic institutions they accuse of \"no longer represent[ing] the Voice of the People.\"  \n\n* \"Newspeak\" – Fascism employs and promotes an impoverished vocabulary in order to limit critical reasoning.", "Spot on. I'm still struck by the gall of some Trump supporters lecturing worried Americans to be \"respectful\" and \"cordial losers\" when they elected one of the foulest rudest, most openly disrespectful candidates we've ever seen. Why should people be 'sportsmanlike' about the results of a government restructure that will likely have severe negative impact on their lives? It's insane.", "&gt; She was the one trying to stop him.\n\nWrong.  She was the one trying to become President starting clear back in 2000 when she ran for Senate in a state she had never lived in.\n\nShe was the one who polls showed could lose to Trump way back in the primaries, yet she and her machine rigged the system to tear down the one candidate who beat Trump handily in every single poll.\n\nShe was the one who clearly and remarkably failed to communicate with middle America and allowed the least qualified and most disgusting candidate ever to beat her handily, with fewer votes than both McCain and Romney got when they lost.", "Nah this was a middle finger to the establishment. The GOP just successfully made her the face of it.\n\nRemember Hillary wasn't the first victim of this. Jeb was. \n\nThe DNC royally fucked up by not taking Jebs loss as a harbinger. A lot of people are pissed at Washington.", "And the current system squelches the voices of Americans in larger more populated states. A vote in Wyoming is worth 4 votes in California.", "A fucking Supreme Court Justice seat didn't encourage Democratic votes.  Instead *protest* votes were made.", "She also could have stood up against foreign drone campaigns (the access to which Trump will now inherit) the Libyan no-fly zone, and foreign entanglements but she didn't. She could have opposed Obama on how he treated whistle-blowers, his massive expansion of the surveillance state (which Trump will now inherit), and opposed how he massively stepped up the war on Marijuana but she didn't. She could have stood strongly with the Dakota pipeline protestors but she didn't.  But hey, I guess we're gonna get the new \"Bernie and Warren\" narrative instead of the \"Berni and Gabbard\" narrative shoved down our throats for the next 4 years because Warren played it safe with the establishment.", "&gt; Actually America under Obama was doing quite well\n\nTemporarily, immediately after a recession, with historically weak growth and no sign of fixing the foundational problems that are only going to get worse as technological progress continues.\n\n&gt; However, people were led to believe America was doing terrible, because Fox and the GOP have been saying so for years.\n\nYeah, you're right, my generation was just tricked into *thinking* we're lucky to find part-time work, will never own homes, are under five-digit student debt - let me just call my loan provider and tell them it's okay, I don't have to pay them because it's just Republican propaganda.\n\n&gt; and promised fantasies that would ALWAYS look better than any realistic Democratic promise, because there was no need to ground them in reality.\n\nAnd that would be (part of) why I didn't vote for him. But the level of fury and spite I have toward the establishment is immense, and had I not been following the election all along I would have. I planned to, for about six weeks back in May.\n\n&gt; But if those voters had been exposed to facts (which the media should have done), they might not have voted for him.\n\nAnd if the DNC had left their ivory tower for a moment to appreciate the fact that life out here is fucking absurd and *we cannot wait for moderate slow reform*, they might not have wanted to.\n\nMy roommate works a full-time job, with significant overtime. She brings home the local minimum wage, which is well above the federal one. She barely, barely makes rent each month, puts nothing away, and falls behind every time she has any problem at all. Her wages aren't rising, but our rent is, by 10% last year alone. Another of those increases, and she'll be barely able to eat.\n\nI had a life-threatening medical issue earlier this year. I was *lucky enough* to be *poor enough* to qualify for medicaid - if I hadn't (which would've been only about $100 more a month), I'd have been economically ruined with no opportunity to ever recover, or else I'd have died. I'm terrified to increase my income, because there's a chance of a follow-up problem for which I'd need emergency care - but if I increase my income at all, I'll lose my ability to get treatment.\n\nBut please, tell me more about how I've been taken in by the Republicans. Tell me more about how everything is fine and we shouldn't push aggressively for actual fixes.", "The thing is that he WASN'T a very good con artist. It's easy enough to read up on his background and inconsistencies and get an idea of how outrageously damaging he could be as a President. He didn't do much to hide his incompetence. A lot of people just bought into that shit hook line, and sinker. It's a cultural problem - this isn't a country that values education, and it shows. ", "She failed more in 2008 when she didn't even get the nomination. That's why she learned her lesson and spent 8 years buying DNC members with promises of positions and threatening to cut them off from funding. This let her go on and lose the election because she can't buy off the voters, or at least would rather sell out to the rich.", "There's actually a movement with potential to abolish it being led by 170 electoral votes worth of states right now. On mobile but a Google search should give you hits because it's gaining more traction on news now. ", "Just like Sidney Blumenthal started the birther movement and David Brock started questioning Bernie's health during the primaries.\n\nI will be so happy when the Democrats purge the Clintons from all political influence, my fucking God their hypocrisy gives me a headache", "If she and the rest of the DNC continue with this sort of hubris and denial no amount of fuckups by a Trump administrations would help them win back the trust of the voters", "Drain the swamp and sticking it to the elites right?", "Studies here have shown that the fraud that voter ID's are meant to combat is [virtually non-existent anyway.](https://www.washingtonpost.com/news/wonk/wp/2014/08/06/a-comprehensive-investigation-of-voter-impersonation-finds-31-credible-incidents-out-of-one-billion-ballots-cast/)    \n    \nVoting ID laws are pushed for the sole purpose of suppression. There's no other reason to do it when the problem they're meant to fix doesn't exist in the first place. It's why it's a partisan issue and not something both sides are looking at.", "Don't blame trump blame all the fucking clinton supporters for fear mongering.", "Sweet jesus it's a disaster. It's also not a \"drain the swamp\" situation. He's putting neocons and literal corporate lobbyists (and Koch too) in his cabinet.\n\nKek. Business as usual in Washington. Trump is no different.", "No one will learn man.  \n\nIf we didn't learn from Bush, then we won't learn from anything.", "She says she was just doing her job and still denies it despite the email posted online for everyone to see. Pretty well demonstrates how out of touch the DNC is these days.", "The emails are quite real.\n\nHillary played with fire and burnt down the DNC.\n\nThe presstitutes are only now reporting the truth and dropping the Russian spy angle because their pimp Hillary lost.", "Glass-Steagall was repealed by the Gramm-Leach-Bliley Act a Republican bill that only had the support of one Democratic Senator. https://www.govtrack.us/congress/votes/106-1999/s105  ", "Did people really think that was real? What's next Nazis marching down Times Square?", "Voted in the same fucking Congress while chanting drain the swamp.", "And yet American citizens who happen to be of Hispanic heritage get this racist crap thrown at them too. A US passport doesn't save you from getting \"go home\" shouted at you.", "I thought her platform was \"more of the same\". Which wasn't a bad platform riding Obama's coattails, but they are polar opposites of charisma and apparently people didn't buy it.", "California doesn't vote as a block. One third of them voted for Trump but all the votes went to Clinton.", "More like 2055. They will be appointing people to go 30 40 years.", "7999 since Hillary's mentor and KKK member Robert Byrd died.", "Drain the swamp by electing the same Republicans. lol I guess the swamp to them just means Democrats. Fine let them suffer the consequences of their votes. Let's turn America into Kansas. ", "Thank you for confirming that it was never about the economy or policy. It was only lashing out because you got your feelings hurt. ", "My one take-away from this is that I should feel satisfied that Trump literally betrayed his voters' supposed anti-establishment ideals within **a day**. I don't because we've got some dark bullshit looming ahead, but... well, it's there, if you've got a better sense of humor and less existential dread than me.", "Enough of that please. He still had to get past the primaries. The people picked their poison.", "Who fucking cares about their morality? If people truly cared about that they wouldn't have voted for a man who bragged about committing sexual assault and who refused to rent to black people in the 70s. \n\nAll I care about is how laughably unqualified he is to be POTUS in literally every respect. At least you all will have to own everything that happens to this country over the next four years. It will almost be worth it just to see the GOP fail in front of the entire world. ", "I agree that Trump's election is one of the darkest days in American history and will probably lead to disaster on multiple fronts, but to be clear: even the very worst at-all-plausible case for climate change is not REMOTELY near an extinction level event.  Yes, when I think about wars that will extinguish millions of lives as coastlines drown and forests vanish, \"Well at least the human race won't go extinct!\" is a weak consolation prize, but humanity will go on...\n\nUnless there's global thermonuclear warfare.  THAT could stamp us out.  Thank god Trump's so disciplined!", "I was thinking the same thing. Its extremely well made for being thrown together quickly for the protests.", "&gt; So why did the people believe Trump's lies about him and believe we need an entire overhaul?\n\nBecause you tried to run a campaign telling them everything was fine when it *isn't fine*. They're struggling or more likely watching their kids struggle. I've got a good education, excellent capability, and come from a very upper-middle-class home and I'm currently on medicaid and was homeless for a while last year. Things are not okay, and if you don't give us a chance for positive change - well, a lot of us will take the change we can get.", "Lol Trump is a god damn moron compared to Reagan. Or any other president, really. The man can't even formulate coherent sentences. He doesn't even understand how the government actually functions. He doesn't understand that you cant \"sneak attack\" the last urban stronghold of ISIS in Iraq with 100,000 soldiers from multiple groups and with civillians present in the city. \n\nAs I said though, enjoy owning everything that happens. This time there will be literally no one else to scape goat. The GOP accomplished  nothing positive over the last eight years, and I don't see them suddenly becoming competent. ", "There it is.  He's going to be so frustrated at being unable to just yell at people and have it happen.  Plus anytime he tries to do anything really draconian there will be massive civil disobedience in the cities.  God please let it be so massive that dealing with the demonstrations becomes a pain in the ass all its own.", "He's appealing to logic. If one country has a lot of high risk people you consider importing less of them.\n\nSounds like common sense to me.", "It's ok.  I'm a sexist because I supported Stein instead of Yaasss Queen.", "Wow you're right. He actually said what the DNC did to Bernie has been shitty and disgraceful (in other words), I forgot about that. And one of the times he said this was definitely in a debate. It is definitely wishful thinking but it isn't the most unlikely thing in the world. He totally could see what happened to Bernie and wasn't afraid to talk about it.", "https://www.aclu.org/search/%20?f%5B0%5D=field_issues%3A143\n", "Its true after she deliberately elevated him as a serious candidate, she tried to stop the monster she helped unleash.  And now we're about to make America  great again.  Thanks Hilldawgs!", "You think NAFTA is the reason why we can't find good jobs anymore? We can't find good jobs anymore because of globalism technology, and capitalism. There's no changing that unless you want to make 2 dollars an hour working 14 hour days making Nikes.", "He lost. He told his followers to vote for the best of the two options Hillary. ", "This has been said a thousand times but it's ironic how much everyone freaked out about the possibility of riots &amp; civil unrest if Hillary won. A few days later, and the \"Love and kindness\" side seems to have forgot their core message! ", "Its true we were personally my opinion has changed a lot since then after seeing how it all turned out and taking the time to do some introspection.  Not everyone feels the same though, its actually interesting how disinterested so many in the military are about the worthiness of the wars they fight in.  People just go about their deployments with a total apathy, like just some chore they have to do then get home. That was my experience anyway", "Yes we must stand up against democracy.", "I watched CNN interview a rust belt former factory worker today. His logic was:\n\n\"My social security check only increased by  0.3℅ last year. That's not fair. I paid into social security my whole life. So I decided to try something different and vote for trump.\"", "I voted for Hillary reluctantly and am disappointed that Trump won but I'm glad Bernie gets it. I was talking with my fiance, trying to console her, let her know I've seen classmates crying when GWB was elected, then re-elected, the right predict doom and gloom when Obama was elected and re-elected but 99% of it never comes to pass because all the fears are hyped during the election and the other party nearly always has the votes to obstruct.\n\nBut to her, this election wasn't about issues as much as it was about how vile of a human being Trump was, and she took that to mean everyone who voted was as sexist, racist, and uneducated as Trump was. That every vote was a vote for the sexism that she has experienced. She wouldn't even consider that (excluding Hillary's issues) there are so many angry people out there who feel left behind, that nobody has done anything for. She at one point told me it was just a bunch of racist whites who are too stupid to realize their jobs aren't coming back, and if they are losing jobs to immigrants it's their own fault. She worked hard to get thru college and post grad, all these other people are just lazy.\n\nAnd that right there is why Hillary lost. Remember what she said about coal? Even if there is a good argument for that being true in a number of industries, that isn't a plan for our nation. A tough shit. Figure it out. It's your fault. \n\nNot new jobs, better jobs, more education, more training. Nope, tough shit, it's your fault someone in china, a H1B visa worker or an illegal will do your job for half your salary. You should have bettered yourself more. If everyone in the nation had PhD's I guess we'd have no problems.\n\nImagine for a second if the republican party went to an inner city and told under and unemployed blacks angry about their job prospects that, the jobs aren't coming back, stop blaming china, mexico etc, it's your own fucking fault, you should have gone to college, and to get off your ass and off government assistance. Oh and more jobs are about to shut down because of new regulations.\n\nThere'd be riots in the streets, but that was pretty much Hillary's economic plan for every state without a coastline. You can't just write off half the country, while the coasts and the wealthy benefit like never before from global trade. You need a plan better than: sucks to be you.\n\nThe country needs to start putting workers BEFORE consumers. And the Democratic Party needs a vision that unites the country, and gives it hope, not just tries to scare it, shame it and lampoon it. There were so many posts from out of touch college grads on facebook today, who dont, and hopefully won't ever know what it's like to be told they have no future job prospects, and a family to raise. No they just have the sick memes, the snarky headlines, the witty jokes, and labels for anyone who disagrees on anything with them.", "The Republican party is a fucking dumpster fire that just got railroaded by a guy with a hilarious comb-over and meme magic. Sure they're in office, but they've got the tiger by the fucking tail now, and I'm really not convinced they're not going to get mauled to death. At the very least the Evangelicals, the usual heart, and soul for them, is savaged. And the Democrats should keep trying to be MORE like them? Maybe instead of being more like Republicans, the Democratic Party could try to be a little more like Democrats. The Third-Way is dead. Good riddance.", "This should be everywhere right now. You can't just believe in the system when it favors you.\n\nI fear we are in for 4 years of Bush-like propaganda and spin like when they tried to classify fast food workers as being in the \"manufacturing\" sector to boost W's job numbers.", "When his campaign began with a speech calling Mexicans rapists it was not exactly subtle.", "These are my favourite comments on reddit. It's kinda sad how much it warms my heart to see people voluntarily admit they're wrong on the Internet. ", "I talked big when I said I was in the military. I was in the coast guard. I never went. I just remember all the guys were really pissed.", "Yeah don't vote for Hillary, she's controlled by the (((global banking conspiracy)))!\n\nThat last ad. The irony.", "Political control in House Senate, and White House by the party that opposes it the most, as well as a free Supreme Court nomination of someone close to their ideological position.", "I'd love to watch the Trumplings spin to explain this one. Turns out getting rid of Washington corruption ultimately manifests as going with big establishment names? You sure about that?", "And now we'll likely see a bunch of judges appointed to support all these voter suppression laws. Expect even more next time around.", "Gingrich is literally *literally* the worst part of the Republican establishment outside of people from George W Bush's administration like Rove and Rumsfeld.", "I have a feeling our dollar will be doing better compared to the USD soon", "&gt;Why you\n\nSays the outlet that literally had Clinton at &gt;99% before 5pm yesterday.", "Of course they will. I'm just not sure how much more they can do. To be honest Bill Clinton looks REALLY bad. His voice seems messed up now and he just doesn't seem all there sadly. You'd think he'd be a regular front page person for this election but he was rarely ever on it. I find this odd.", "The fact that you think Donald Trump shows up to court for every lawsuit shows how little you understand the situation.", "By electing the most corrupt and establishment republicans in the party to the white house? ", "I can't stop laughing not the oh this is funny laugh the this is Fucking pathetic laugh.\n\nit's like these idiotic people in the Rust belt just do not understand all of the republican policy hurts them. like what the Fuck is wrong with you people? everything the democrats push for helps them out. it's the complete oppiste of what's best for them.\n\nalso the crash from this is going to propels the democrats into super majority zone. they have at most 2 years before the bubble collapses. if that. republicans cannot do national policy anymore, thier policys do not work. this is shown throught history.\n\nand like always the democrats are going to have to clean up the mess from them.", "He's technically on my side because he's a lefty but *God,* Bill Maher is a fucking twat.", "I think that is a pretty fair assessment. People underestimate the sway that man had. I can't help but imagine that he feels some sort of regret in this moment.", "I gotta hand it to you this much cool-aid would have killed a lesser man. ", "yeah people lost their jobs over fabricated shit lmao", "I hate to depress you but there's more:\n\nThe republicans have made it clear they want to abolish the EPA. I don't think I even need to explain how bad that will be. Gonna be a lot more of what happened in Flint, MI if that happens.\n\nTrump's position on tech issues is murky, but what we do know isn't great. He's likely to be influenced heavily by the entertainment industry, who're copyright maximalists, and a tweet from 2014 has him comparing net neutrality to the Fairness Doctrine - which are about as similar as car and carpet. Net neutrality has no political angle like the Fairness Doctrine did, it's  about keeping the Internet an open playing field by keeping ISPs from fucking with it. Trump has called for backdoors to be built into hardware (admittedly, Clinton was just as bad on this one), and I'm terrified of him having access to the NSA's spying network.\n\nGiven that Trump seems to take a dim view of science in general, I wouldn't be surprised to see science funding heavily cut too.", "&gt;just tweeting a statistic hardly gloating \n\n*Obama Coalition Crumbling. African American early voting is down 8.5 from this time in 2012* \n\n&gt;just tweeting a statistic\n\n&gt;coalition crumbling\n\n&gt;African American early voting is down\n\n&gt;hardly gloating \n\n&gt;just statistic\n\n&gt;crumbling\n\n&gt;early voting is down\n\n&gt;hardly gloating\n\n&gt;Obama coalition is crumbling\n\n&gt;the writer of the article tells you what to think\n\n&gt;coalition crumbling \n\nNeed I go on? \n\nBut how about some quotes?\n\n*“Look, if African Americans voted overwhelmingly Republican, they would have kept early voting right where it was,” Wrenn said. “It wasn’t about discriminating against African Americans. They just ended up in the middle of it because they vote Democrat.”*", "By a minority of the country. Not that that changes the results obviously but it says much about how the country feels about him. ", "Yeah just wait until you've had 4 years of Trump consolidating power, disenfranchising large segments of the populace and ramming through new extreme voting restrictions on a national level.", "True journalists have been in a very precarious position for a while when it comes to covering politics.  Conservative politicians have been treating journalists with increasing hostility then convincing their constituents that legitimate news stories are just liberal biased lies.  Like Trump said, he could shoot someone on 5th Ave and not lose any support because his supporters have replaced facts with the sentence \"I believe...\" ", "I feel like I'm taking crazy pills. I have yet to find the charge that's been filed against her but she's a \"criminal\". \n\nNo, she was fucking negligent. Not the same thing. ", "Doesn't have the same ring to it as \"Thanks Obama\" we need something different.", "Suppose drain the swamp means get rid of anyone left of center.", "We are all Pepe today.", "This is what is so puzzling to me about the people I know who supported Trump. They literally have everything going for them middle class, steady jobs, nice house, the majority of them have more than one car, food on the table, many of them have a house in a nice neighborhood or better yet their own plot of land in the country and yet they still proclaimed that the U.S.A is the worst it has ever been in it's entire history.   ", "\"It's mine and I earned it and I'd rather see it all burn than share it with anyone.\" Whether the realize or admit it or not this is the mindset of many people that voted for Trump. Using tax dollars to better the lives of others in almost any format is theft and betrayal in their eyes. ", "I wouldn't get my hopes up high. This is The Late Show. It will all be about Trump and not the DNC.", "Uhhh Colbert knew very well his viewers loved Bernie. He asked his crowd often if they felt the bern and once put on noise canceling headphones when he announced Bernie won Wisconsin cause he knew the crowd would cheer loudly", "Bernie Sanders is absolutely correct. Populist waves have been rising in both parties. The difference is the GOP nominated their populist candidate while the DNC undercut theirs and stacked the system against him. This election is the result of the DNC's failure and insistence on shoving their unpopular Wall Street stooge down their base's throats", "Hi hello. Swedish here.\n\nWe generally like socialism over here in Scandinavia but those we have now are pretty terrible and not honest at all.\n\nI thought for sure Bernie would win, he is brilliant and honest. You have no idea how lucky you were to have him.\n\nSo now that you Americans are done with Bernie, c-could we please have him? ", "Noah comes across as more easily influenced... much more puppet like. \n\nJon Stewart has my respect now and forever because he thought independently he was neither democrat nor republican and he stood for what he believes in, he didn't fall into the \"so the media is following this narrative now\" trap. ", "Yup. I get this all the time. \n\nI am an independent economist who gives zero fucks about political ideology. A core tenet of my beliefs is literally that centralism is most conductive to economic growth. Yet without fail I get called a brainwashed liberal because I use generally accepted unemployment figures not numbers I pull out of my ass.", "After one day while reading through r/politics, it has become so much more cordial. Facts aren't dismissed as opinions, agreeability is high, click-bait titles have decreased, actual conversation, and mass downvotes are virtually nonexistent. It's refreshing. A brand new Reddit. ", "&gt;You have no idea how lucky you were to have him.\n\nTrust me we know. \n\n*groan*", "She denies climate change. That underpins any outdoorsy policy. ", "Did you consider that places with high risk and danger might have more innocent people trying to escape that place and seek refuge here?", "Oh they know. I've seen plenty of people laughing over how inept Clinton is because she rigged the popular vote but not the Electoral College.", "America is *not* a business and it is terrifying to imagine what a businessman will do with it.", "In the 2018 senate races democrats have 25 seats to defend and 8 seats to attack.  It will be hard to make inroads then.   This year was their chance to do big pickups but the republicans defended 22 out of 24 seats.", "Tell me about it it's like \"gee sorry I was taught to check my sources and do actual research on topics such as politics before jumping to conclusions.\" ", "Yup.  They're willing to douse themselves in gasoline to scratch an itch with a match.", "I lost a lot of respect for (former hero) Colbert thanks to his outright Clinton bias. He constantly discredited Bernie right up until he was out and only then would he make jokes about Hillary (who 'couldn't lose' remember)", "&gt; Secretary of the Interior\n\nPrior Experience: picked out drapes and carpeting for the basement den.", "Trump is the great filter?", "Within a year these fucking idiots will have the biggest buyers remorse. A large number of them I imagine are currently on Obamacare. The republicans have made very clear they intend to repeal it. These people will be left destitute wishing they could afford their medical bills. Pre-existing conditions are going to be a thing again. People under 26 will no longer be able to stay under their parents plans.'The EPA is going to be helmed by a guy who doesn't think the environment needs protecting. Trump plans to make all roads and infrastructure privatized, meaning tolls for everything. Trump plans to put a 30% import tariff on everything coming into the US.. The economy will be devastated world wide. These idiots have no idea what's about to hit them. I can't explain to you just how scared I am. I've been following his campaign very closely since day one. This is going to be horrible for everyone, including the chucklefucks that voted for him. \n\nThis is in large part due to the republican efforts to defund education in republican controlled states. For instance, There is specific language in a bill that was passed in Texas, to prohibit the teaching of higher order thinking skills. Direct language from the bill.  ", "Removing other people from power destabilizing communities, and putting others that she deems weak into power that end up being super strong/radical...\n\nAm I talking about the US or the Middle East? ", "&gt; Democrats forgetting midterms\n\nWell that PLUS gerrymandering. You need to win by overwhelming margins to get represented unless you're a Republican. Having more votes than the other side is never enough. The only fair elections for Federal office is for Senate, that's only rigged by the fact that uninhabited wasteland GOP states get more overall representation due to the large number of them.", "Is this what we're doing now?  America is ABSOLUTELY a mythological creature.  It's also woven of the finest wool.", "Around half the reason Kerry lost is because the swiftboat lies worked. ", "Make Kamchatka MILFy again.", "Hillary copied Bernie's homework making her one of the best students ever at the school.", "There is a reason why at 73 he decided he needed to run for President. He saw the writing on the wall and knew that the left had no populist answer to this anger. If it wasn't Trump it very likely would have been Cruz. Bernie did everything he could.", "The fact that you chose that interpretation out of many shows how pedantic you are.", "Well that failed miserably. She failed miserably to convince voters. She had no vision. Just platitudes.", "I find it very odd that this is the only site that's covering his loss. He's been in the news quite a bit. Also he's more than just a white nationalist David Duke is the former Imperial Grand Wizard of the KKK, literally the leader. He lost with only 3% (58,000+) of the vote. Though it's still shocking to hear that over 58,000 people voted for the former leader of the KKK.", "I'm 100% behind a leave referendum in wa even if it comes to nothing (see Texas v White). It's about sending a clear statement of a) discontent and b) a desire for formalized autonomy and insulation from the other Washington. \n\nIt's a complicated issue of course, but this would send a loud and clear message to the other Washington. Personally I would rather leave and be allies with Canada and the us by way of trade partnerships, nato, the un, and various international treaties. It would be a huge mess but there it is that's my opinion. ", "The DNC and the Clinton campaign will try to paint this loss as \"sexism\" or \"Russian/FBI meddling\" but don't allow them to do it.\n\nThis loss is 100% the fault of Clinton and the DNC. Their arrogance, cheating, and disdain for their own voters cost them the election.\n\nSanders supporters and independents tried to warn them. We tried to tell them that Clinton was a deeply flawed and disliked candidate, but we were dismissed as \"Bernie Bros\" and told to \"fall in line\" for the sake of party unity. Why? Why would someone support a party that clearly **CHEATED** in order to ordain their preferred candidate?\n\nLiterally any other Democrat could have beaten Trump. Clinton was the **only** candidate who could lose to him. We all saw it, and we tried in vain to warn the Democratic establishment, but they insisted that it was \"her turn\", even though she'd done nothing to **EARN** that turn.\n\nShe lost to a black freshman Senator and she lost a 60-point lead to some kooky Socialist Jew for many of the same reasons she lost to Trump. She is a *terrible* campaigner. I mean, she is profoundly bad at it. The only way she could beat Sanders was by cheating. The DNC funneled campaign donations to her through state parties, they gave her debate questions ahead of time, they suppress the vote in Arizona, New York and elsewhere, and they conspired to undermine the Sanders campaign at every step. She raised a BILLION DOLLARS in donations from Wall Street and yet she just barely beat Sanders and couldn't manage to pull away from a racist misogynistic sociopath running the most incompetent campaign in decades. Even when she was \"winning\" it would come out that she was cheating, and so when Trump ranted on Twitter about \"Crooked Hillary\" it actually stuck! Because it's true!\n\nHow could the DNC be so monumentally STUPID?!?!\n\nSo whatever you do, don't allow them to make excuses for their stupidity. Don't allow them to blame it on third party votes, Russian hackers, FBI coup d'etats or sexism. Bernie Sanders, Elizabeth Warren, Joe Biden, Tulsi Gabbard, or heck even Martin O'Malley. None of them carried as much baggage or generated so much distrust and negativity. That is on Clinton, and her alone!\n\nThe Trump campaign was deeply incompetent and inept, and yet Clinton could never manage to put him away. Why? Because she's just as bad!!", "There is a surprising number of people who think voting is an act of self-expression. It's like they think the President has no effect on their lives or something.\n\nNote that Republican turnout was down as well. If they'd really turned out then Clinton wouldn't have won the popular vote.", "God damn it I'm pissed this isn't our president-elect.  The grace the form, the old guy from the east coast jewishness. Fuck the DNC", "He called it in 2015. He knew what was going to happen and the rest of the party was too stubborn to realize that this election was an anti-establishment referendum.", "Strong man in the fascist eastern European wrestler type way is how I read it.  So yeah bully.", "The arrogance and hubris of her and her campaign is staggering. I know it's all very sad they won't get to work in the West Wing but they are largely responsible for Trump.", "He could barely string together sentences in all the debates it kind of disgusts me how much credit people give him for those. He's practically handicapped when it comes to public speech, I'm somewhat terrified how few people recognize this. ", "Not an extinction level event in the sense of \"scouring the earth of all life\" but we are already well within a geological significant mass extinction event. And if you look at the worst case scenarios, there is the possibility of a Canfield ocean event triggered by climate change. And THAT, too, could stamp us out.", "Who the fuck cares what **state** a voter comes from?  This is for the president of the **United** States so yes, all of us should get an equal say.  What fucking difference does it make if more people live in the same spot?  How does that justify their voice being worth less?", "No more familial dynasties.  This is a nation of 324 million; not some obscure republic with a \"ruling family\" or two.", "Bernie basically saying Trump used the same approach he did. \n\nI don't think many of the Bernie supporters were in love with all of his ideas they wanted a govt that wasn't corrupt. Govt corruption was probably the single biggest issue for the voters. From campaign finance, to pay for play, to rigging the elections... ", "Oh man I can't wait till the bring stop and frisk to seattle. If there's anything we like more railing against authoritarianism with furious rancor I can't think of it. Oh cycling hiking, and smoking legal weed. But besides those.", "I had this exact conversation this very evening with my own mother. We discussed the topic on how non-degree holding white voters were overwhelming swinging over to the GOP. She now believes the universities are teaching immoral liberal values against the Bible and bringing down the country. Shouldn't send our future kids etc... \n\nI'm saying, \"Mom, you literally helped pay for my tuition. I have multiple degrees. My starting salary out college was higher than yours, which was a 20+ year career on a gov't payscale. You saw your own kid do better in life?\"  \"Oh... well that's different. You went to a good school... mumble mumble\"\n\nNeedless to say we don't often agree on political views at Thanksgiving, and Fox News propaganda is alive and well.", "Don't worry. The DNC establishment is already talking about Tim Kaine being the future of the DNC... So all is well!!", "Within 24 hours Trump was stacking his transition team with k street lobbyists and DC insiders. How Trump supporters fell for the whole anti-establishment thing hook line and sinker is astonishing. I guess there really is a sucker born every minute.", "\"There is no such thing as bad publicity\" is pretty much what happened.", "Trump was elected because people didn't vote for Clinton. She got ~10 million fewer votes than Obama in 2012 while Trump got a few thousand fewer than Romney.", "&gt; Those people have been turning red for years dissatisfied with the Obama government.\n\nThose states voted for Obama. Obama won Michigan by 10 points in 2012, Wisconsin by 8, Pennsylvania by 5, New Hampshire by 6. That's his *second* win, after four years in office.\n\n&gt; They see that jobs are lost to globalism and immigrants and believe that foreigners are the problem.\n\nThese people see that there's a problem and they'll take any answer that gives them something to do about it. As Sorkin prophetically put it 15 years ago: [\"People want leadership, and in the absence of genuine leadership, they'll listen to anyone who steps up to the microphone...they're so thirsty for it they'll crawl through the desert towards a mirage and when they discover there's no water, they'll drink the sand.\"](https://youtu.be/HKTqS4bXugg?t=2m40s)\n\nClinton was at the mic, maybe, but it wasn't on the issues people cared about. I'm a member of - an activist for - the LGBT community, but my concerns about gay rights are way below my concerns about the survival and well-being of the working class. My sentiments are far from unique.\n\n&gt;This is how successful Trump's message was. Anything anti-establishment. \n\nThe mistake is in thinking that Trump sold that message. Trump didn't sell anyone a thing - he said what everyone *already* thought, and that gave him credibility despite the man he is.\n\nOur lives have been stolen from us - or at least that's what we think. We're pissed off, because we think the establishment doesn't give a shit about us, and they don't. When we have no way to cooperate with them - when there is no leadership that remembers it represents the public and not their own interests! - what else is left but setting everything on fire and hoping to build something new from the ashes?\n\n&gt; Trump voters don't think about the underlying policies or facts needed for improvement, this candidate is the best!\n\nDismissals like this are why he won. You make no effort to understand, no effort to see their perspective, no effort to offer a better alternative. It's just \"well you better wait it out\". Fuck that. Our generation is drowning in a sea of economic misery with no way out and you scold us for screaming that we can't breathe.\n\n&gt; You think Democrats could've won the election if the DNC had gone full progressive. But here's a fact: Colorado's single-payer system failed this year (80% against), even though Hillary won the state. Progressivism is too extreme.\n\nIt wasn't a policy election! The electorate had something to say and they would do anything at all to say it. They tried \"help us\", and got \"no\". So they tried \"fuck you\".\n\nSanders would have won, despite his relatively extreme ideology, because he has credibility. People believe him - Democrats believe him, even a lot of Republicans believe him. When he says he'll help, we *know* he's telling the truth - or at least he thinks he is, at a minimum. *That* is what would have won this election, because when we cry out \"help us!\", his answer is \"I'll do my best\". Trump's is \"no, but she doesn't even notice you're drowning\" - and given the choice, some people prefer that.", "Not just that... But she's claiming it's fake done by the Russians... But it's DKIM has been verified by Google. If that email is fake, then the Russians just broke 2048-bit encryption... And we should all be very concerned. Not only just because they broke the encryption, but the Russians decide to show it to us via some lame email. ", "Too late. The GOP owns this government now. The Trump and 3rd party edgelords won. ", "It's almost like he was lying the whole time just to get elected or something.", "Yeah people always make the cities will be too powerful argument when even if you campaigned in the top 100 most populous cities you would reach 16% of the population. It also would mean your vote actually matters rather than for 80% of voters not having their vote matter", "Yeah those damn out of touch college kids. That's why I voted for a tinpot billionaire with his name in gold lettering on the side of his skyscraper. He really understands my life as a middle class American. ", "Sounds about right. This is what you get for electing a businessman folks he thinks that everything is a commodity to be sold and if you aren't charging for it you are a fool.", "We are done being tolerant of republicans. They have showed by example that if you want to win you have to cast your values and morals to the wind.", "&gt; And one of the times he said this was definitely in a debate.\n\nHe said it at a debate and a good chunk of his rallies.\n\nThe people were out for blood from the political establishment this election and that was one concrete example where he could point to it being true. ", "&gt;stopping immigrants from countries with a large proportion of dogmatic and extremist\n\nso he's stopping immigration from France and Belgium. Stop your bulshit. This is the worst spin I've ever heard", "It's worse than that. After 2 terms you can actually blame the other side for shit you did and people will believe it. Voting Republican to save us from fighting wars, voting Republican to bring back high paying blue collar jobs, voting Republican to legalise weed. Insanity.", "Not sure it would. He wants to privatize road and bridge repairs possibly convert to private toll roads.  Australia's done that for a while and they dont seem that happy. Hmm.", "Oh god after Hillary got the nomination, NPR was completely boggled that dems wouldn't vote for Hillary after what happened to Bernie. The condescending attitudes were and have been all over NPR about that. Biggest peeve about NPR last six months.", "Hillary was a weak candidate from the beginning. It's always embarrassing for a Democracy to elect a close relative of a former leader even if there isn't a history of unresolved scandal. The DNC cleared the lanes for her, convinced all other moderate democrats to step aside. Bernie Sanders was an abberation, a weird protest candidate who would have come to almost nothing under normal circumstances, but Democrat voters were so desperate for anyone but Hillary that she had difficulty beating him.\n\nAnd then you take the political climate, the desire for change, the fact that even the Republicans couldn't float an establishment candidate... Jeb's demise was another huge red flag that 90s-era politics wouldn't win this one.\n\nAnd then there was the entirely avoidable email scandal, the failure the engage with the press, the condescending attitudes taken toward 3rd party and Sanders supporters, the DNC and Podesta emails, that the Clinton Campaign gave Wasserman-Schultz a job right after she was forced to resign as DNC chair... virtually every step was wrong, yet the Clinton Campaign and Clinton's representatives everywhere insisted that there wasn't a problem. A week ago it wouldn't have been possible to have this conversation, because anything even slightly critical of any of the Clintons was downvoted to oblivion.\n\nThis is happening because Clinton and the DNC failed to engage with their supporters, and because it was more important to the party elite to get Clinton into office than it was to actually represent the voters.\n\nLots of people tried to stop Trump, and Clinton's people fought every one of them that they thought might hurt her chances. Unfortunately, Democrats are historically better at fighting each other than they are at fighting Republicans.", "This will certainly stop Trump from becoming president /s", "WHO GIVES A FUCK. They had their chance and they voted Trump. California running the show would actually make America great again.", "Dogs want to be pet.  More than anything they want to hear \"Who's a good boy?  Who's a good boy?  Who's gonna MAGA?  You are! Yes you are!  Go fetch and fuck off.\"", "So you know how I can type out \"/r/funny\" and it links to the subreddit? /r/the_donald is literally not even allowed to type out \"/r/politics\" under threat of getting shut down by reddit admins. ", "They were angry at the establishment and the elites so they elected a guy thats going to stack his government with establishment republicans and also deregulate wall street and slash their taxes.\n\nYou sure showed them America, you showed those elites. They won't know what to do now that they've been deregulated and have lower taxes.\n\nThey were angry at the establishment, so they elected the establishment again and also gifted the rich billions of dollars.\n\nReality is basically the onion now.\n\nMAGA!", "&gt; And the Democrats should keep trying to be MORE like them?\r\rBy regularly turning up to vote? Yes. Fuck yes. You don't show up you get nothing. Something the GOP figured out a long time ago, is that it's far easier to move the conversation in your direction when you have some power to begin with. You don't get power without voting.", "Not that I agree with what the other poster said but potentially several SCOTUS seats are at stake. Gay marriage abortion, and other issues. These next four years have huge implications on American life for the rest of my lifetime.\n\nIf a person can stomach those implications to make a political statement for a candidate that doesn't even represent them - that's fine. But ultimately presidents are figureheads. You are voting for an administration and an ideology. Moving forward it appears that the country is going to change in a major way.\n\n", "&gt;It wasn't a policy election! The electorate had something to say and they would do anything at all to say it. They tried \"help us\" and got \"no\". So they tried \"fuck you\".\n\nHoly shit, that's nail on the head. ", "The DNC learnt there lesson. Either Bernie or a Bernie like person ", "Well Republicans never seem to be punished or held accountable for perpetual obstructionism because their constituencies eat it up, so where do the Democrats get holding themselves to a higher standard? The GOP just elected a dangerously incompetent reality TV moron. A left wing tea party equivalent is not an inappropriate response with how much the GOP just fucked us.", "Here is some more light for you: http://thegavoice.com/sam-park-makes-history-first-gay-man-elected-georgia-legislature/", "Deportation isn't unconstitutional. Deportation without due process is.", "Or he is going to sell all your public roads to his mates and make you pay again for something you own.  like what happened in Australia. ", "All bets are off was supposed to imply that a decent amount of the population wasn't just going to stand by and silently feel sad in their homes as he was explaining compared to any other election that isn't this one.", "Because everything was focused on the presidential run and people came out to vote for the president. Most just circled down-ballot names of the same party that their president vote was for.", "so... she openly admits she would cheat and rig the debates again ? the fuck?", "Trump supporters have planned terrorist attacks on Somali-Americans and punch and threaten to kill people at his rallies.\n\nhttp://www.insideedition.com/headlines/15177-trump-supporter-who-punched-protester-next-time-we-might-have-to-kill-him\n\nDo you just pretend like that stuff doesn't exist? This is exactly why you guys are frightening. ", "I've seen nothing of Tim Kaine except for the VP debate and he did astonishingly poorly in that. ", "Redditors are sneaking back into r/politics like the munchkins sneaking out after Dorothy's house killed the Wicked Witch of the East.", "Dear Wolves: I'll be standing with them. Come and fucking get us.  ", "&gt; The Republicans use to be the party of fear and now the Left has taken that from them. \n\nThe Left always had their own fear tactics.", "I will never forget the day that mainstream media like washington post smeared Sanders as being appealing only to white voters and does not care about black rights etc.\n\nAssholes he marched with Martin Luther King and against aparthied. While you sat on your cushioned ass typing away at how Hillary was the only candidate who cared about diversity.", "&gt; I will ask. I will submit things. I will circulate things. And guess what? I also enjoy the exchange that I have with my colleagues.\n\nAnd guess what else? I will deny it and I will lie about it being a Russian forgery. Because that's just the kind of straight-shooter I am.\n\n.\n     \n     \n\n\n^^Sent ^^from ^^Donna's ^^I ^^Pad.", "Almost as embarrassing as the candidates.", "&gt; That violates our freedom of speech and amounts to censorship.\n\nNo it doesn't.  He wasn't in the government then.  The 1st Amendment is for government censorship not private.", "There will always be a little light in the darkness ", "This is well documented", "That's a little backwards the current understanding is that parents either portray intelligence as something inherent, or something that you have to work for. Children generally share the same view as their parents.\n\nThe latter having better outcomes.", "It absolutely matters. Despite everything we still have some say in this, but we can't be complacent or defeatist for the next 4 years. The moment we see Trump and his cronies start to act in such a way that it endangers us, we have to be ready to protest and do everything we can to show them that this is unacceptable.", "Then what?\n\nImporting them to you country is the only and the best solution?\n\n\n", "The era of the late night elitist comedian trying to dictate the American electorate is done.", "The swamp needs draining and she's one of the biggest toads in it. ", "So should your President first deport his wife?", "This is amazing! \n\n... And also makes me really sad that this man is not the president. :(", "Why the fuck would we want a relationship with one of the most vile people on the planet.\n\nWtf?\n\nYou'll attack Clinton for not hating Saudi Arabia but when Trump tries to get close to a bat-shit crazy Hitler wanna be that's MAGA?\n\nI honestly am going to really enjoy these next 4 years. I'm going to enjoy watching Trump go down as the worst president in US history.\n\n", "Respect to Micheal Moore for being the only one who's pinpointing what happened while at the same time not suggesting the Left emasculate itself like everyone else is intent on doing.", "A fair amount of that was on-point. The “She won the popular vote” was a little shaky because...\n\n&gt;Ms Clinton had collected 59.4 million votes giving her a 47.7 per cent share, while Mr Trump had 59.2 million votes and a 47.5 per cent share.\n\nIn a country of 320million, that’s not any kind of overwhelming popularity. So really, Moore is just doing the same shit the media did that he chastised them for...", "100% legit post and I usually don't line up with him at all.", "They do. We don't. I have no idea how many times I had to try and explain that lesser of the two evils is real and sucking it up is the grown up thing to do. Like who the hell couldn't see this shit coming? I am furious that we might literally see the end of America as a world power because people treated the elections like a reality show.", "their feelings were hurt they'd rather burn the house down than make an adult choice. too bad the rest of you suffer for it.", "&gt;He is both a creature and a creation of the media and the media will never own that.\n\ngod damn the lamestream media to hell. all the way to hell.\n\nturn off the tv. get off youtube.  connect with people. broadcast your experiences. get out of your comfort zone. BE the media.", "I disagree with his fifth point because the defeat in the \"arcane\" electoral college is a symptom of the bullshit polling, echo chamber, bubble and disconnect from reality (points 1, 2 &amp; 4).  It was a well earned, well deserved loss and his fifth point undercuts that dramatically.\n\nYou lost the EC cause you fucked off the concerns of the middle class.  A popular vote win would allow you to go on ignoring it.  I hope the loss of the two \"lock\" states changes Democratic approach to engaging and listening to voters in a fundamental way.", "Colbert never hesitated to give Bernie a platform though. \n\nI think Bernie was on that show like three times. \n\nIs he somewhat dismissive? Yeaaah but not *nearly* as bad as others and I give him a pass for that due to having Bernie on the show multiple times. ", "Maybe don't call them Flyover country.\n\nMaybe thats why you lost. ", "Yet he allowed Bernie a platform. The Bern was on The Late Show about three times during the primaries alone. It's a mutually beneficial relationship and that's more Bernie got elsewhere. Colbert was sometimes scathing but not vicious.\n\nTo me it seems Colbert was better by far than most. ", "Bless him he's adorable ", "well clearly it's not a majority, otherwise we wouldn't be having this conversation. his point is trump did not win by a landslide. he BARELY won and clinton BARELY lost.\n\nit just happens that for this particular election, that is a HUGE difference, as in life-changing, generation-altering, world-fucking difference.", "This is /r/politics lol. It's not like the_donald has this on their page.", "This just shows the political baggage Hillary was already coming into office with. Forget her baggage from when Bill Clinton was in office or from when she was state secretary she had political baggage going into the election.\n\nHer VP selection wasn't because he was the best choice, or because he was representative of a certain voter demographic, it was because that's the deal she cut to setup how the DNC was going to rig the nomination for her. An obvious choice after she got the nomination might have been Bernie Sanders, because he had the grass roots movement and popularity. But because of the baggage she was carrying and the deals she had cut the VP was equally as uninspiring and unenthusiastic as her.\n\nThere is roughly a 5-6 million vote shortage on the Democrat side in 2016 when compared to the voters that turned out for Obama in 2012. Republican numbers stayed about the same, rather a bit less.\n\nThere was and is nothing inspiring about Hillary Clinton, especially not when she was seen as colluding with the DNC and DWS in crushing Bernie Sanders wildly popular grass roots movement.\n\nThe first female president angle/hype/excitement gets crossed out by the fact that Hillary can literally be the face of political corruption, foreign donations, corporation donations and back room deals. Like the one made with DWS and Tim Kaine.\n\nFor some reason the Clinton campaign and the DNC were stupid enough to think that after insulting Bernie Sanders voters and pulling every dirty trick they could think of, they could still expect them to come out and vote for her, that they could just expect them to fall in line behind Hillary Clinton. That is not how it works! They were just too arrogant enough to believe otherwise.\n\nThe DNC, DWS and the Clinton campaign are responsible for not only handing Trump the election (Republican voters numbers didn't change from 2012 or 2008), but they are also responsible for crippling grass roots movement at the state level so the Republicans still control the Senate and Congress. \n\nThere is virtually no check and balance left and once that Supreme court position is filled, there goes another check and balance. I don't care which party you support, you should always support a system of checks and balances, so no one party has complete control.\n\nAs long as the current establishment is still in power, no Democrat will ever be President.", "But they fucking are. Listen a ton of these states are budget black holes that earn little revenue and keep the lights on with tax dollars from states that actually produce things. Not only are they the US's welfare queens, but they have more power in elections than people in the states that pay their bills.\n\nThe worst part is these people bitch nonstop about the direction of the country and talk shit on California and New York for being crazy. They are unequivocally the most catered to population in the US and that's not enough.", "I agree that Clinton deserved to lose but she wouldn't have fucking lost if we didn't have the EC. It has a 7% failure rate now, where it selects the wrong president by design.\n\nVotes from people in flyover country are substantially more valuable than anyone else's, so what the fuck do they have to complain about? They're the ones deciding elections.", "Fuck the DNC party. Start a new party an honest one.", "This is from their statement. Sounds pretty solid if he does go ahead with those ideas he floated during the campaign.\n\nTrump ideas switched so often it's hard to know what he'll do. Yet we know lot of these things the politicians surrounding him might try. So it's going to be interesting next four years. \n\n&gt;President-elect Trump as you assume the nation’s highest office, we urge you to reconsider and change course on certain campaign promises you have made. These include your plan to amass a deportation force to remove 11 million undocumented immigrants; ban the entry of Muslims into our country and aggressively surveil them; punish women for accessing abortion; reauthorize waterboarding and other forms of torture; and change our nation’s libel laws and restrict freedom of expression.\n\n&gt;These proposals are not simply un-American and wrong-headed, they are unlawful and unconstitutional. They violate the First, Fourth, Fifth, Eighth, and 14th Amendments. If you do not reverse course and instead endeavor to make these campaign promises a reality, you will have to contend with the full firepower of the ACLU at every step. Our staff of litigators and activists in every state, thousands of volunteers and millions of card-carrying members and supporters are ready to fight against any encroachment on our cherished freedoms and rights.", "This is what people mean when they call this \" idiocracy\"", "They are most definitely the party of greed. They rather see a woman unable to feed her child than have one dime of their paycheck go to a strangers food stamps. I can't tell you how many times I've heard good old boy construction workers talk about drawing unemployment between jobs but dammit, everyone else that uses any type of social welfare is a leech on society.  ", "No it wouldnt. IF all Jill Stein voters had just magically decided to vote for clinton instead of staying home she still would have lost. It would have also taken half of Gary Johnson voters voting for Clinton (none going to Trump or home) to win which is a ridiculous premise anyway because the whole reason most people vote 3rd party is because of how pissed off they are at their main party. And what about the extra 100 million people who didnt vote. Man if Clinton had inspired even 1% of those she would have won but you'll never hear that statement.", "The DNC has failed the american people by being biased and stacking the scales against senator sanders in the primary but by selecting the worst candidate with the highest unfavorable in history. How do we go about firing everyone at the DNC and putting true progressives in so we can win back seats and have a presidential nominee in 4 years like senator warren who will work for the american people and will actually be a viable first female president. Anyone know how we go about this? We MUST get rid of everyone currently running the DNC.", "And it stings like a motherfucker. ", "I feel like Colbert was pretty even handed with the jokes.  He definitely toed the party line with pro-Clinton stuff but he had Sanders on his show and the jokes he'd make at Sanders expense were generally light hearted and never mean spirited or dismissive.  He was pretty firmly pro-Clinton in the general election but before that he didn't seem inappropriately partisan.\n\nTrevor Noah has been the opposite, extremely heavy-handed, with even worse correspondents.  He doesn't understand his audience which is why his ratings are in trouble.\n\nBill Maher was always an asshole so I didn't have any expectations to betray.", "Bill Maher also had Bernie on multiple times.", "Stewart also did a lot towards making socialism less of a dirty word which people tend to miss.\n\nEdit: plus Stewart did actual political engagement with the 9/11 first responder bill", "The constant gender and race baiting by a vocal portion of the left is at least partially responsible for these extremely one sided election results. It's become unbearable to anyone with real problems in their life. ", "It's hard to feel anything for people who don't take part in democracy because they dont like making hard choices. ", "American only sort of did this. The popular vote went to HRC so it's more like rural America and our messed up electoral system did this.", "Win back Congress in mid elections and play the same game republicans played with Obama by being obstructionist. ", "I have and always will oppose the EC regardless of who is in office. When you can win 22% of the popular vote and still win the presidency that isnt a democratic system. Not to mention FPTP voting instead of range/approval voting which basically forces people to always vote lesser 2 evils. Theres a reason our voting system is  ranked last among first world countries.", "Fewest number of votes cast for the two major party candidates since 2000. Kerry and McCain would have tied them and Romney would have beaten both. And the third party vote in every crucial state that Trump flipped would have been enough to hold each for Clinton. Or just across the board 2012 level turnout would have easily won her the election.\n\nInstead everyone now gets to enjoy four years of Trump.", "and the biggest supporters of the EC as of 48 hours ago were liberals totally convinced of their impending victory. No-one is going to look well on people who only protest when they don't get what they want", "Democrats defend and keep 23 out of 25 and flip 5 out of 8 they get the Senate. It's not an easy task, but not a hard task either if Trump sucks as bad as you want to think he is.", "but it's about voter turnout. he would've easily gotten more than Hillary. she had a lot of people voting just cause they didn't like trump. add that to the actual motivated potential voters Bernie had and you'd probably see a win. it would be enough in several of those red states to have probably tipped some blue.", "Tell that to 43.1% of democratic primary voters and even more if it hadn't been rigged against him.", "Don't be afraid to can people Bernie ", "Had a coworker tell me she should have tried harder to win his vote. Bitch you work in IT are middle class as fuck and college educated. I can get not trusting her but this idea that a candidate needs to move you on a personal level instead of you being willing to do your civic duty of picking the person you find most capable of running the country for the nest 4 years is petty as shit.", "&gt;I agree that Clinton deserved to lose but she wouldn't have fucking lost if we didn't have the EC.\n\nIsn't that contradictory?  What lesson would be learned from a close victory?  None at all.\n\n&gt;It has a 7% failure rate now, where it selects the wrong president by design.\n\nSurely this depends on how you define \"failure\" and whether you think it's acceptable or even intended for a presidential victory without winning the popular vote.\n\n", "&gt; Voters can smell bullshit from both sides\n\nAs proven by voting for a guy who promise to cut taxes for the rich while expanding spending and who has been lying all his campaign dodging, taxes, paying attorney generals to not be prosecuted, stiffling his contractors throughout his career and even banktipted casinos... \n\nYeah real gut at smelling bullshit also real good at swallowing it whole apparently    ", "That's right. Trump was elected because 10 million democratic-leaning voters didn't see enough of a difference between the two candidates to show up. They're gonna see the difference eventually. Far loo late, so.", "She was done in by WHITE WOMEN: 53%(!!) voted for the pussy-grabber.", "Not just trump voters. All the \"protest\" third party voters as well.  This was probably the most important election of our lifetimes and we failed it. The question was could you accept a candidate that you didn't pick or like but would keep the country relatively stable or would you throw everything aside just to be petty.  People picked petty.", "You can argue about his bias on the political bits. \n\nBut the rest of the show is pretty far from Rush Limbaugh. ", "Sorry Michael, but even as a Clinton supporter, we must face the fact that she lost in the electoral college, so she loses the presidency. Doesn't matter whether she wins the popular vote, that's now how the system works.", "&gt; Many Trump voters wouldn't have voted Bernie regardless\n\nOnly specific Trump voters flipped the election though and they were previous Obama voters in the rust belt.  Who else pulled off a similarly shocking victory there?  Sanders.  He also won in Wisconsin by running as an unapologetic pro-union leftist.  But that's in the past, not worth arguing over alternative histories.\n\nThis wasn't a normal election with a normal left vs. right divide.  Usually you'd be right.  But this wasn't a normal election.  It wasn't about the failures of Obama because these people voted for Obama in the past.  This was a realignment, with people looking for narratives, for explanations, and even if Trump is a vile human he had a story he sold people.  Clinton had empty sloganeering.  And in the rust belt it backfired.  She had a lot of support (thus the popular vote), but failed to resonate with segments of her own base, that gave Trump a path to electoral victory.\n\nListen, I hate right wing talk radio too, but its reach is overstated, especially in presidential elections.  Trump's rural white base only really delivered him Florida, he won the election off of Obama voters in the north.", "Yep exactly.  Those things are a wash.  But what it would change is the people in deep blue or deep red states thinking their votes don't matter (I  mean, aren't they kinda right?)\n\nIf *every* vote counted, I believe turnout would increase on both sides.", "&gt; Well that PLUS gerrymandering.\n\nGerrymandering is a direct result of ignoring midterm elections. Gerrymandering is implemented by state legislatures.", "They're not going to change voluntarily.  We need to make them change.  3rd parties don't have a shot.  It's just how our FPTP election system is.  What we can do is steal a page from the conservative playbook and create a party within a party.  Just like the diseffected rank-and-file of the Republican party created the Tea Party we need to create a progressive party.  \nWe can incubate withing the democrate party and take it over from the inside.  Muahahahaha!\n  \nhttp://imgur.com/a/wRtYM", "Exactly. If you're going to blame anyone look at the people in battleground states that didn't vote", "No he's factually an Independent. He changed party affiliations to run in our primary. \n\nI voted for the guy. But he went back to being an independent after. I'm hoping he'll come back. ", "How could it be worse than what it is now where they only campaign in swing states?", "Taking an argument to its absurd extreme is not a good rebuttal. ", "The runner-up for the party's nomination and [the most popular politician in the country?](https://www.washingtonpost.com/news/the-fix/wp/2016/09/19/the-most-popular-politician-in-america-might-just-be-a-socialist/) I'd make an exception for him.", "This is the same guy that hired Ellen Pao to make drastic changes to the site then let her be the fallguy. ", "As a foreigner I am amazed that people bought into the Fox/GOP narrative that Clinton is an embarrassing candidate. Especially in contrast with Trump.\n\nIt makes no sense to me if Democrats didn't think she was left enough voting far right out of spite is baffling. \n\nIf you are centrist she has been doing amazing job as an an activist and elected official for decades...\n\nEven as a republican she is closer to normal politics than Trump.\n\nI don't believe that the people who voted are anti system those people don't vote they stay home. How could they claim to be anti establishment and vote for a guy born into wealth that never accomplish anything by himself and surrounded himself by the most blatant corporate team of sleazebags for all his campaign??\n\n How anti establishment will the Trump Cabinet be with Chris Christie Rudy Giulanni, taht Goldman Sachs dude and Sarah Palin? \n\n\nIt is baffling ... \n\n ", "I am all Pepe today.", "I sympathize entirely. There cannot be unity. He is a misogynist he is a bigot, and a racist. Lost in outrage we failed to make an economic argument to the rest belt states, who seem to be okay with him because he will bring back jobs. Of course we had a better economic plan. Clinton specifically had a manufacturing plan. Whereas Trump just boasted he'll bring back jobs, he has all the answers. We actually had two nobel prize winning economists help us. \n\nThis was a colossal fuck up on the Democratic side. We must make sure it doesn't happen again. ", "Time to start donating to the ACLU.", "I've opposed the EC for years thank you very much.", "That behavior helped Trump a ton patronizing self-righteous Dems on their high horse, treating people like they were the common dirty plebians while they sat atop their ivory tower, having completely lost touch with the the heart of America. They pissed them off and made them feel like shit and they showed them exactly what they thought about that.", "Can we skip all this and get to the fucking architect?   ", "Democracy gave us these laws this system. If you don't like how this system works, that's not democracy's fault. If you want to fix it, you can either work within it's confines or you can break it down and start from scratch. \n\nI don't like it when I hear people I don't agree with say that, but it's reality. ", "You say she got most of Bernie's supporters but that is 13 million Primaries voters. It's small change in a general election. She was unable to add to that because she brought in no new voters. \n\nAfter record breaking numbers in the Dem Primary, Hillary attracted 10 MILLION less votes than Obama did in 2008. Tells you all, you need to know.", "Alaska republicans absolutely hate public lands in Alaska.  Yes it absolutely fucking would be a bad idea.", "With no Majority in anything....I wish you luck ", "\"Real change is too hard\"\n\nYeah thanks a bunch for nothing Clinton. ", "*yuge", "Look at the bright side: now we get the opportunity to pay back and do unto them whatever they have done to obstruct and undermine Obama for the past eight years.", "Every bad economic turn while bush was in office was blamed on clinton and every good economic turn during obama was accreddited to bush. I hear far two much Republican talk radio in my day to day life.", "Funny that's the same rhetoric that went against him in the primaries.\n\nThen his opponent lost the general to an inexperienced reality TV star.", "George Soros", "Understanding it does not entail embracing it.", "Yeah I mean, he's 70 years old, but man he's looks in really bad shape. I know he had some problems in the past with his health, but he's having a hard time doing anything.", "Biden was never going to go against Clinton. Even Warren backed down. Bernie's the only one with the spine that took it all the way. ", "\"Millennials need to do their research\"\n\nFuck off Clinton", "CNN is now projecting Trump will win the popular vote when the votes have all been counted so his fifth point is very misleading.", "To be fair He was elected as an independent (and as far as I understand, remained an independent during the primary). It would be kind of unfair to his constituency to officially switch parties in the middle of his term.", "The rust belt states voted for him because they want their manufacturing and mining back - and Trump decidedly won because of those states.", "I don't know many white rust belt grandpas who would have voted for an establishment socialist ((liberal)). He would have been savaged by the right too. But who knows maybe. ", "&gt;Isn't that contradictory? What lesson would be learned from a close victory? None at all.\n\nIt's a close race anyway so this won't prove anything to the majority of either side. Personally, I'd rather deal with the DNC being garbage for a little longer and not have Trump.\n\n&gt;Surely this depends on how you define \"failure\" and whether you think it's acceptable or even intended for a presidential victory without winning the popular vote.\n\nIt's a failure in the sense that it intentionally picks the loser. It is the function of the college to ensure that populous states don't dominate the federal government, it tries to make sure everyone is represented. Understanding why it is this way does not reduce my frustration.", "Sanders is an Independent not a Democrat. ", "Just wait. 4/8 years of Trump and the DNC will force feed the US Chelsea Clinton.", "Wait a second the voter turnout for this election was the lowest?? \n\nThe running narrative in the media seemed to suggest that the voter turnout this year was the largest, but apparently, after doing a little more googling, it was only the early voting records that were shattered?! There seem to be 5-10 million voters who didn't turn up at all this election, and Donald actually won with the least number of votes out of all Republican candidates in the past 3 elections. How did this happen? Where did these millions of voters go? Looking at these bar-charts, it doesn't look like Hilary lost because Donald convinced DNC supporters to vote for him, but instead, a large population of voters didn't even show up. Why?", "Wait did people actually kill themselves because Trump won.", "&gt;you are a straight white man and a textbook bigot\n\nHis story checks out this guy is definitely a Hillary supporter. They wouldn't be caught dead making a statement that didn't have at least one insult in there.", "I think they might make an exception After last night ", "I'm a bot *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/circlebroke2] [The real winner of this election? Bernie Sanders](https://np.reddit.com/r/circlebroke2/comments/5c7v01/the_real_winner_of_this_election_bernie_sanders/)\n\n- [/r/shitamericanssay] [Sanders is, right now, effectively the most powerful liberal in the world besides Obama.](https://np.reddit.com/r/ShitAmericansSay/comments/5c76se/sanders_is_right_now_effectively_the_most/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)", "Some people learned from bush -- those who lost family/savings/jobs/homes.  But those who didn't lose anything didn't learn anything.  Burning it all down so it effects everyone is our only choice now....unless the republicans can succeed or trump can work magic.", "The clear correct answer is to properly represent the cities. The economic output of New York City is about 15x greater than the GDP of the entire state of Iowa. Just NYC is about three times larger than the entire state of Ohio. The economic productivity of major metropolitan areas already subsidizes rural areas and now urban dwellers are particularly underrepresented. It really sucks that some of the rust belt areas have been left behind by increased urbanization and the changing economy, but the answer isn't to drag metropolitan areas down with them, and that's what they're doing electing economically irresponsible people like Trump and Ryan. ", "Despite many of them claiming to be Christian they really hate the concept of charity. These \"I got mine\" Heartland Voters are quite unChristlike.", "It's not her though it's the people who surround her.  They fundamentally missed the positive message of Obama's whole appeal - change, hope.  Instead they offer \"Its her turn\".  Those campaign advisers need to go before the leach onto Corey Booker or whoever they try to anoint in 2020.  They failed to plan a single stop in Wisconsin.\n\nIf there is one things Podestas emails prove, its how out of touch that inner circle is.  I almost feel bad for Clinton herself, she was insulated by these kiss-asses and careerists.", "No actually. Especially with such an extreme wing of the party.", "He went back to Independent because that's how he was elected for his Senate-seat. He stated that if he'd go for reelection, he would likely switch to Democrat.", "Yes play with your puppet Putin. We are in a new era of American politics where the Republicans are now quite cozy with a geopolitical foe that may well indeed go after its former satellite states. \n\nThank God some of them have already militarized their borders to stop this lunatic. So many of those states are EU and NATO members. I cannot imagine what kind of effect being taken out of the union against their will, will have on the global markets. ", "&gt; this should be a wake up call for the DNC that progressiveness is what democrats want these days.\n\nYou're learning the wrong lesson here.\n\nPeople want **CHANGE** and they want it so badly they'll vote in a wildcard republican just for the **change** of getting it.\n\nThis isn't about progressive/conservative, dividing that down party lines is a fucking mistake.", "Doesn't have to be one the 2020 ticket to lead the party. As an elder statesman figure he could lay the foundation for a progressive to run in 2020. ", "So true. I talked to a Hispanic lady that works at my gym. She's a citizen. She said one of the gym members asked her if she's ready to go back. She was confused  and asked \"go back where?\"...to which she responded \"are you ready to go back to Mexico?\" Disgusting. "], "links": ["5c5fsn", "5c4kir", "5c4kir", "5c4kir", "5c5fsn", "5c5fsn", "5c4kir", "5c4kir", "5c4kir", "5c5fsn", "5c4kir", "5c5fsn", "5c4kir", "5c4kir", "5c4kir", "5c5fsn", "5c5rx8", "5c5fsn", "5c4kir", "5c4kir", "5c4kir", "5c5fsn", "5c694x", "5c5fsn", "5c5fsn", "5c43f3", "5c5fsn", "5c5fsn", "5c5fsn", "5c5fsn", "5c5fsn", "5c5rx8", "5c4kir", "5c5rx8", "5c5fsn", "5c3sbs", "5c694x", "5c4e0x", "5c5fsn", "5c5rx8", "5c63qg", "5c574a", "5c43f3", "5c4kir", "5c5fsn", "5c574a", "5c4kir", "5c4kir", "5c5l6p", "5c4kir", "5c4kir", "5c43f3", "5c4kir", "5c5rx8", "5c5gso", "5c4kir", "5c6bcb", "5c46b7", "5c5fsn", "5c3sbs", "5c5rx8", "5c46b7", "5c46b7", "5c5l6p", "5c574a", "5c4vgu", "5c5fsn", "5c5rx8", "5c4vgu", "5c3sbs", "5c4kir", "5c574a", "5c694x", "5c63qg", "5c45qw", "5c46b7", "5c5fsn", "5c5fsn", "5c5fsn", "5c63qg", "5c4kir", "5c4kir", "5c51uo", "5c4e0x", "5c3sbs", "5c5ozg", "5c4a8q", "5c43f3", "5c5rx8", "5c5rx8", "5c5fsn", "5c45qw", "5c43f3", "5c60ff", "5c574a", "5c574a", "5c4kir", "5c694x", "5c5fsn", "5c4kir", "5c5fsn", "5c5fsn", "5c694x", "5c5fsn", "5c5fsn", "5c5fsn", "5c4kir", "5c46b7", "5c4kir", "5c694x", "5c5fsn", "5c5fsn", "5c6bcb", "5c46b7", "5c5fsn", "5c4kir", "5c5fsn", "5c5rx8", "5c5fsn", "5c5rx8", "5c5fsn", "5c694x", "5c5fsn", "5c4kir", "5c5fsn", "5c3sbs", "5c574a", "5c4vgu", "5c5rx8", "5c4kir", "5c574a", "5c5fsn", "5c5fsn", "5c574a", "5c6c81", "5c574a", "5c5fsn", "5c45qw", "5c5fsn", "5c4kir", "5c3sbs", "5c5fsn", "5c5fsn", "5c5fsn", "5c5fsn", "5c694x", "5c43f3", "5c5fsn", "5c5fsn", "5c6bcb", "5c6bcb", "5c694x", "5c5fsn", "5c5fsn", "5c43f3", "5c4kir", "5c5fsn", "5c3c3y", "5c574a", "5c5l6p", "5c6bcb", "5c4kir", "5c4kir", "5c5fsn", "5c5fsn", "5c4a8q", "5c5fsn", "5c5fsn", "5c574a", "5c6i10", "5c46b7", "5c5fsn", "5c4kir", "5c5rx8", "5c5fsn", "5c6bcb", "5c4a8q", "5c5fsn", "5c5fsn", "5c43f3", "5c6i10", "5c4e0x", "5c574a", "5c5fsn", "5c4kir", "5c574a", "5c4kir", "5c4a8q", "5c5fsn", "5c5fsn", "5c5fsn", "5c6bcb", "5c5fsn", "5c4a8q", "5c574a", "5c5fsn", "5c5fsn", "5c4kir", "5c694x", "5c4kir", "5c5fsn", "5c4kir", "5c5fsn", "5c694x", "5c5fsn", "5c4kir", "5c4kir", "5c5rx8", "5c5rx8", "5c5fsn", "5c5fsn", "5c4a8q", "5c5rx8", "5c4kir", "5c5rx8", "5c6n7y", "5c694x", "5c6jt1", "5c5fsn", "5c6n7y", "5c6jt1", "5c3sbs", "5c574a", "5c4kir", "5c5rx8", "5c574a", "5c4kir", "5c52zo", "5c4kir", "5c694x", "5c6n7y", "5c4kir", "5c6jt1", "5c4kir", "5c46b7", "5c5fsn", "5c5fsn", "5c4yzn", "5c4vgu", "5c6jt1", "5c694x", "5c6n7y", "5c6jt1", "5c3sbs", "5c5fsn", "5c4kir", "5c6jt1", "5c6jt1", "5c5pvx", "5c4kir", "5c5fsn", "5c6jt1", "5c5fsn", "5c6n7y", "5c5l6p", "5c6jt1", "5c5fsn", "5c4kir", "5c5fsn", "5c5fsn", "5c574a", "5c5l6p", "5c6jt1", "5c4kir", "5c6jt1", "5c574a", "5c5fsn", "5c4vgu", "5c5rx8", "5c5rx8", "5c6iv3", "5c46b7", "5c5fsn", "5c694x", "5c4vgu", "5c6n7y", "5c4kir", "5c6iv3", "5c4vgu", "5c6n7y", "5c45qw", "5c5fsn", "5c4kir", "5c4kir", "5c5fsn", "5c4kir", "5c5gso", "5c4vgu", "5c43f3", "5c6n7y", "5c6jt1", "5c5l6p", "5c5gso", "5c6jt1", "5c45qw", "5c694x", "5c5fsn", "5c5fsn", "5c5fsn", "5c694x", "5c5l6p", "5c5fsn", "5c694x", "5c5fsn", "5c5fsn", "5c5fsn", "5c6spo", "5c5fsn", "5c694x", "5c694x", "5c5fsn", "5c5fsn", "5c5fsn", "5c5fsn", "5c6spo", "5c5gso", "5c5fsn", "5c6spo", "5c5fsn", "5c574a", "5c46b7", "5c45qw", "5c694x", "5c5fsn", "5c5rx8", "5c5fsn", "5c6spo", "5c6sjm", "5c6tfk", "5c46b7", "5c5l6p", "5c6tfk", "5c574a", "5c6sjm", "5c6spo", "5c4a8q", "5c5l6p", "5c6tfk", "5c4yzn", "5c43f3", "5c574a", "5c574a", "5c5l6p", "5c6tfk", "5c574a", "5c6tfk", "5c5fsn", "5c52zo", "5c5fsn", "5c6jt1", "5c694x", "5c52zo", "5c5fsn", "5c4a8q", "5c5rx8", "5c4kir", "5c5gso", "5c6spo", "5c5l6p", "5c4kir", "5c6jt1", "5c5rx8", "5c5gso", "5c6n7y", "5c4kir", "5c574a", "5c6jt1", "5c5fsn", "5c4kir", "5c5rx8", "5c6tfk", "5c3z2u", "5c6tfk", "5c46b7", "5c4kir", "5c4kir", "5c6s4m", "5c45qw", "5c5gso", "5c5fsn", "5c6n7y", "5c45qw", "5c694x", "5c6tfk", "5c6spo", "5c4vgu", "5c46b7", "5c5fsn", "5c46b7", "5c3jzg", "5c5rx8", "5c5l6p", "5c6tfk", "5c694x", "5c5fsn", "5c5fsn", "5c694x", "5c694x", "5c6z2m", "5c694x", "5c694x", "5c5fsn", "5c5l6p", "5c694x", "5c5fsn", "5c4a8q", "5c5fsn", "5c5fsn", "5c46b7", "5c5fsn", "5c5fsn", "5c694x", "5c5fsn", "5c5fsn", "5c5fsn", "5c6spo", "5c46b7", "5c5fsn", "5c5rx8", "5c5fsn", "5c694x", "5c6z2m", "5c5gso", "5c694x", "5c70gv", "5c5fsn", "5c4kir", "5c5rx8", "5c4kir", "5c6z2m", "5c6spo", "5c6spo", "5c4vgu", "5c5fsn", "5c574a", "5c719q", "5c6z2m", "5c5fsn", "5c5fsn", "5c6z2m", "5c6tfk", "5c4kir", "5c5fsn", "5c694x", "5c6sjm", "5c574a", "5c6tfk", "5c574a", "5c5fsn", "5c574a", "5c574a", "5c4kir", "5c4a8q", "5c574a", "5c6wxz", "5c4kir", "5c6spo", "5c6jt1", "5c574a", "5c5fsn", "5c1rql", "5c6z2m", "5c574a", "5c5fsn", "5c694x", "5c719q", "5c5pvx", "5c70gv", "5c5gso", "5c6wxz", "5c6jt1", "5c6z2m", "5c6sjm", "5c4a8q", "5c6z2m", "5c4e0x", "5c4yzn", "5c5l6p", "5c4kir", "5c6sjm", "5c4unv", "5c574a", "5c70gv", "5c4kir", "5c5fsn", "5c4vgu", "5c4a8q", "5c694x", "5c6sjm", "5c4yzn", "5c4kir", "5c6ybq", "5c727d", "5c727d", "5c727d", "5c5fsn", "5c5fsn", "5c727d", "5c727d", "5c694x", "5c727d", "5c694x", "5c4kir", "5c727d", "5c5l6p", "5c4kir", "5c727d", "5c727d", "5c739p", "5c5gso", "5c5fsn", "5c5fsn", "5c727d", "5c694x", "5c694x", "5c694x", "5c694x", "5c694x", "5c5rx8", "5c5pvx", "5c5fsn", "5c727d", "5c727d", "5c727d", "5c727d", "5c46b7", "5c43f3", "5c739p", "5c739p", "5c5fsn", "5c727d", "5c694x", "5c5fsn", "5c5rx8", "5c5fsn", "5c694x", "5c727d", "5c694x", "5c727d", "5c46b7", "5c6z2m", "5c727d", "5c739p", "5c727d", "5c45qw", "5c739p", "5c76fm", "5c4unv", "5c694x", "5c726a", "5c5gso", "5c727d", "5c45qw", "5c5fsn", "5c5gso", "5c694x", "5c5fsn", "5c78np", "5c5rx8", "5c4kir", "5c727d", "5c4a8q", "5c739p", "5c6jt1", "5c5fsn", "5c45qw", "5c51uo", "5c51uo", "5c727d", "5c739p", "5c5l6p", "5c43f3", "5c727d", "5c739p", "5c4kir", "5c4kir", "5c5l6p", "5c5l6p", "5c739p", "5c4kir", "5c574a", "5c574a", "5c5fsn", "5c694x", "5c3z2u", "5c739p", "5c74a6", "5c4kir", "5c739p", "5c4yzn"]}