{"comments": ["Wait.   Wasn't it WaPo that put out (literally) 16 negative stories about Bernie in one day?     Fucking press is broken.", "Wow. /r/politics turned into the Bernie Channel pretty quick. I don't mind though I love Bernie. He would have won.", "He said trump would win a month ago. He saw this shit for what it is. America the stupid. \n\nEdit - I should clarify. Michael Moore saw this shit for what it was. \nI'm saying \"America the stupid\" as my own exasperated fuck you to my nation. I'm so ducking devastated our fed went red. ", "Voter turnout would also completely change if popular vote mattered...", "Washington Post runs 16 headlines against Bernie in 16 hours.... \n\nhttp://fair.org/home/washington-post-ran-16-negative-stories-on-bernie-sanders-in-16-hours/\n\nSeems like they are trying to salvage some credibility they can use to sell out again next time. \n", "This? From the Washington Post?! You motherfuckers. ", "don't worry!  Life is gonna be great once we get all of our coal-mining jobs back!!!!", "he has the establishment panicking by appointing the establishment into power. rudy guiliani chris christie, goldman sachs employees and so on... if those are not the establishment then i don't know what is.\n\nin my opinion his voters got duped.", "Yeah they should just shut up and lick your fucking boots shouldn't they? Let the elites like you just tell them everything. They don't need to do anything, you know whats best for them.\n\nAfter all, they don't matter.\n\nThey're flyover country.\n\nSurely this will not backfire on you in any way whatsoever. I can't possibly see a reality where that happens.\n\nOh wait.", "Nice try WashPost. You still suck, though.", "Now imagine how Republicans feel watching these shows and it's clear why Trump won and why they're turning to Infowars among others.\n\nIf only the left could lose its smug it would be accepted so much more widely.", "Trump has lied through his teeth to get in the white house. He's not draining a swamp. He's taking every establishment crony Republican that stroked his ego and lining the white house with them. ", "He is the perfect representation of the average American. \n\nSexist  arrogant,  xenophobic,  lying,  narcissistic,  Islamophobic,   isolationist,  with little to no understanding of science,  international relations or the economy. ", "As upset as I was to see the outcome of the election (I was Berner but voted for Hillary), I've been checking out a bunch of conservative forums and discussion sites...and these people are already shitting the bed with infighting and incompetence. They've just been handed ALL the keys and it looks like they have no fucking clue what to do. It's hilarious. They're backtracking on many of Trump's campaign threats (the wall, deportations, muslim ban, etc.). They're squabbling over the \"drain the swamp\" thing that now appears to be turning into a shitshow of appointing career politicians.\n\nI'm really starting to believe this Trump experiment is going to be such an epic fail that 4 years from now we can replace ALL these goons with Dems/progressives fairly easily. It's been one day and a lot of his audience is already in chaos.\n\nHopefully nothing drastic happens in the meantime.", "There's a damn good one and its so that cities alone cannot wield political influence over the entire nation.", "The irony is recent information from wikileaks indicate the DNC and Hillary colluded in helping create the monster that is Trump.\n\nThat group testing for Hillary's weaknesses showed that voters considered her a slimy corrupt politician whose tenure as Secretary of State was marked by a vacuum of any noticeable accomplishment. That her apparent hawkish foreign policy and her visit to Goldman Sachs and decrying the 'bashing of bankers' made her appear out of touch with the common voter.\n\nSo her campaign's solution to these problems? Do everything in their power to get the most unelectable Republican candidate to win the primary. Because Hillary's campaign suspected she would lose against anyone else.\n\nThe emails even detailed how her campaign set out to demand the media treat these 'pied piper' candidates as the real deal and serious threats. Giving Trump all the free air time he wanted.\n\nThe DNC and Hillary are responsible for getting Trump elected in more ways than one.", "The main message I was going for is people especially democrats need to be inspired to vote. Check this out the last 4 elections republicans have averaged about 60M voters. Doesn't matter whose running. Democrats need to be inspired.\n\n2008 69.4 million votes peak obama. \n\n2012 65.9 million votes Obama significantly less inspirational but still good enough to beat Mitt \n\n2016 59.6 million Hillary Clinton probably the most disliked and least inspirational democrat in recent memory has a massive drop of 7 million votes.\n\nThe lesson to takeaway here isnt to blame people who don't vote the way you want them to. Those people voted their interests. Nor is it to blame people that didn't  show up. The lesson is you have to give people a vision to rally around and someone who people trust. Simply saying im better than the other guy just doesnt works with democrats. Whether you think thats smart strategically or not is irrelevant. You can see this same pattern with bill clinton and then again with al gore losing", "That's not true though. Watch CGP Grey's video on the subject the idea of big cities creating a tyranny of the majority is a total myth, populations aren't that centralized in the US.\n\nEdit: oy https://youtu.be/7wC42HgLA4k", "CGP Grey is wrong. And they are quite centralized.\n\nHere's a map of the 2012 by county to help you visualize this a bit more. http://i.imgur.com/fYXEIKy.jpg\n\nIts not surprising you feel that way it would be politically expedient for you at the moment, but remove the electoral college and suddenly campaigns are all fighting over the cities, and everyone else gets hung out to dry\n\nYou may go 'But thats whats happening right now except with swing states', but the campaigning being done in those swing-states is a battle between the cities and the rural areas in those states. No one is being left hung out to dry, if the dems win, California gets what its population wants, and what the populations of most cities want. \n\nImagine a pure popular vote, and a candidate says 'I'll just cut your taxes to zero if you live in x y and z cities, and give you free healthcare to boot' \n\nOh yeah. Thats gonna be a much healthier system.", "I firmly believe the mainstream media telling everybody the election was in the bag and that Hillary had a 98%+ chance of winning (hah!) caused a feeling of complacency that ultimately led to a lot of Democrats staying home. Why would you want to wait in line for two hours to vote when everyone in the media is telling you your candidate is virtually certain to win anyway?  ", "don't forget FAT!", "They're promising to obstruct unconstitutional policies while the Republicans just didn't want anything remotely liberal. There is a difference.", "The next four years all we're going to hear is \"Muh Bernie Sanders\" \"Muh corrupt DNC!\", and \"Muh conscience vote!\" as the people who let Donald Trump waltz into the presidency try and justify to themselves and the world that they shouldn't be blamed and mocked for being the exact reason the world will go to shit.\n\nOn the far right you had ~~economical anxiety~~ racism, on the far left you had ~~conscience voters~~ whiny crybabies that can't get over that their cult leader lost months ago.\n\nThis is why we got Bush and this is now why we got Trump. Until people finally realize that, asshats like Trump will keep winning elections.", "God I hated that Drumpf business. Can you imagine if someone on the right lambasted a Muslim immigrant for changing their name to sound more American?\n\nImmigrants change their names all the time to fit in. There's nothing wrong with that. There are *so many* other things to attack Trump for.", "Never said that. We're talking about a system that let's that flyover reign supreme in national elections. That's the issue here. There is no reason a vote from someone in South Dakota should be more important than someone in Texas.", "Gotta agree. If you're surprised about the result you haven't been paying attention.\n\nThe media spent so much time on these dishonest caricatures of Trump. They made him out to be Hitler incarnate. There's a lot of bad things about him, but he's not the evil monster that Huffpo wants you to think he is.\n\nI think the characterizations only served to fuel Trump and more importantly, his supporters. Progressives would be wise to take a lesson from this and to not laugh off the frustrations expressed by the people that voted for Trump.", "Republicans control the house and senate it's going to be the Donald Vs the Republican Party now. He's going to threaten them to get his policies through. ", "Yeah thanks for that, WaPo.", "completely agree it pisses me off. \n\nWhere's the \"political revolution\" in all of this? \n\nAre we supposed to wait for thirty years until we finally can have a perfect nominee? \n\nI though progress was making the best choice that's available to help the country, not saying \"fuck it\" and fucking yourself over. ", "Letting a walking Liability like Hillary Clinton run as  candidate for president was one of the worst ideas since Lincoln decided to take in a show. Madness she was still under investigation at that time, it could have gone any way. It is OK saying innocent until proven guilty but the voting public don't seem to see things that way.\nShe got beaten by a candidate who seemed to be constantly sabotaging his own campaign, but he still won.\nI wonder if the Democrats will learn by their mistakes?\nIf not it is going to be four more years of Trump after this, you know I am right.", "Same can be said for Texas though. Latin turnout ticks up and it turns purple easily. Bunch if states on both sides that come into play because everyone's vote matters.\n\nOverall this change would cause more competition and yield better candidates as a result.", "I agree. This is a moot point but I think Moore ends with it as a morale boost to remind people who are scared about what is coming to be hopeful and focused. The fact is, Trump's points of view and policies truly do not reflect to vast majority of America.", "Limbaugh thinks it's a problem that people are focusing on the _consent_ aspect of sex.\n\nThere is no equivalent on the left. That kind of despicable transcends left or right politics regardless.", "Democrats need to be careful what they wish for.\n\nThere are a lot more New York and California Republicans who don't bother voting now but would in a popular vote than there are liberals in red states. A straight popular vote would have probably been an even more decisive Trump victory.\n\nDemocrats would seriously rather fundamentally alter the foundations of our political system than own up to the fact that they ran a shitty candidate that nobody likes.", "should have pulled for him when it mattered. now it just sounds like sour grapes.", "I think your attitude in the second paragraph is extremely typical of the Democrats  and exemplary of why HRC lost. \n\nShe failed to give ~130 million people a reason to vote for her, including ~10 million who voted for Obama.  \n\nYou assume they owed you this because they should care about the things you do. The truth is people can only really care about 2 or maybe three things.  Yours are clearly environment and health care.  \n\nShe had 130 million chances to make people care more about the environment. 130 million chances to link environment to things they cared about like jobs and safety.  These connections are obvious,  but they were never made.  She had 130 million chances to make people care about health care but that doesn't matter for people who still can't afford it. \n\nThis narrative of fuck those people who didn't do what I want doesn't help anything. You don't learn,  and they don't become any less alienated. \n\nI'm not happy with what happened,  but I understand it and it's not because everyone is lazy or a moron or a racist.  I think if you took an emotional step back you will  understand,  too. ", "Lol what?\n\nThe Democratic establishment, the elite of the elite, just lost to an authoritarian fucking reality TV star. The Clintons and the DNC were planning this for six fucking years, and they failed our country and the planet miserably.\n\nWe're looking down the barrel of a Republican House, a Republican Senate, a Republican president, and a fucking Republican Supreme Court.\n\nThe DNC has fucking failed us. They failed humanity. Let the establishment keep the party. Fuck 'em. The party is shit, and damaged goods anyhow.\n\nWhat we need is a Progressive Populist movement. We need to be done squabbling with the Clintons, the Wasserman Schultz's, the Braziles of the world. We trusted them to lead is through the desert, and they failed us.\n\nLet's not waste time restructuring a party that doesn't even work for us. Let them keep it. It's their money machine, not ours.", "Democrats have a chance to reevaluate themselves and clean up over the next 4 years. Trump recieved fewer votes than Romney. The only reason he won was because of how horrible Clinton is. These leaks and anymore that come out can't change the past but they can help the Democrats with their future.", "You have fun and plan your new party while the real progressives fight to keep your rights. If something breaks in your house do you just get rid of it and buy a new one? Did you not just see a third rate car salesman take complete and utter control of the Republican party? Do you not think we as progressives are not strong enough to rewrite the entire narrative of the Democratic party after this loss? ", "Russ Feingold ran on Bernie's message. That worked out well for him.\nI agree with the message btw. But Wisconsin voted for Trump who promised to help the white working class. Then voted Johnson over Feingold who basically ran on Bernie's platform. Fact is people hated Hillary and Bernie had a strong cult of personality just like Trump did.\n\nFeingold lost on Bernie's ideas though because he wasnt Bernie.", "If a biased news source is reporting something positive about those it is biased against surely it should be considered trustworthy?", "The MSM elevated Trump and then found it impossible to suppress him. Fucking hacks you're one of the reasons for this disaster. \n\nFUCK the DNC, FUCK Hillary, FUCK the MSM. ", "This isn't going to happen. Huge reform is an option and be encouraged.\n\nIt's OK to be angry but saying there is no option but the complete removal of the DNC is overly stubborn to the point of being childish.", "\"Trump is hitler\"\n\"Racists take power\"\n\nIt is how it was lost.", "That didn't make Clinton lose. If it was just low black and Latino turnout she would still have won. It was Rust Belt suburbans and working class blue-collars that lost it. A group that Sanders does *very* well in.", "Colbert wasn't particularly anti-Bernie. But he was anti-anyone who had (legitimate) concerns about Clinton which basically meant he was anti-Bernie voters.", "My point is we should kill the system that says a vote in one state matters proportionally less than a vote in another. All votes for president should be equal then no one gets special treatment.", "And like real chemotherapy it can kill you instead of the cancer.", "She literally said she'd only do it after striking a deal with Russia.\n\nThere was never going to be a world war. Putin is just a master at this game.\n\nHe won our election so did China. Putin is saying shit like this to troll America.", "In the primaries Michigan polled Clinton but ended up voting Sanders. In the general, Michigan polled Clinton but ended up voting for Trump.", "&gt; their feelings were hurt\n\nThis is why Clinton lost. You still don't realize that there are a lot of people for whom the recession never ended. This isn't about feelings its about their livelihoods. Income inequality has only grown under Obama. They were promised change in '08 and since they didn't get it there, they're getting it from the guy that has the establishment panicking.", "and some Clinton Supporters litterally stone women to death and fly commercial aircraft straight into skyscrapers killing thousands of Americans.. Crazy world eh?", "How on earth is losing within the federal &amp; state voting rules that have allowed Democrats to win the presidency and seats in Congress, \"caving\"?  This is the type of stupid secessionist sentiment that Texans were spitting out when Obama was elected in 2008.  \n\nIf you think how this election turned out is unfair, mobilize Democrats to propose a Constitutional amendment to dissolve the electoral college.  Second to that, mobilize Democrats within the state to end gerrymandering with state amendments.", "I first heard of Sanders through The Daily Show probably in 2008 or 2009.", "Nailin' Palin was not a documentary", "Those of you saying \"See? Liberals!\" are idiots. Those of you who are liberals and pretend not to understand what's happening in the video - black guys assaulting a white presumable Trump supporter - are also idiots.    \n\nThis isn't \"Black people are intolerant\" or \"liberals are intolerant\". Call things for what they are and maybe that way it's easier to find a solution? This is a result of racial tensions - of course can always be an isolated act of stupidity. \n\nIn sum, don't use it as an excuse for racism (righties), but also don't pretend it didn't happen (lefties). ", "I guess Michael Moore forgot we are a republic and the popular vote kinda undermines the whole point of states having representation in the election. Also, if you go by popular vote, which would have changed voter metrics, it doesn't at all say that Hillary would have won the election. A majority of people didn't vote so he can't claim to know what a majority of American's really want. If anything he should be pushing for a ranked system. What a whiny moron. ", "I bet most Americans would consider LA Raza and BLM to be racist organizations. But why look inside the DNC when it's so much easier to name call other people?", "If the DNC has anything to say about it he wont. They haven't learned shit. ", "Oh Trump isn't playing chess anymore he's trapped us in a 5D time travel bookshelf that allows us to see the errors of our way and how we ultimately put ourselves in said shelf. ", "Because independents couldn't vote conveniently. There was also the media rigging/blackout on Sanders &amp; voter purges.  \n  \nIn the general where these independents(most of America) could vote easily, Clinton got her ass handed to her.", "Do you have any evidence for this? If Sanders lost everyone would shout \"But Hillary would've won!\".\n\nThis is why US politics is an absolute shitshow, clickbaits, buzzfeed titles that cater to a certain crowd and confirms their bias, worst part: everyone is eating it up like candy.\n\nTbh, the USA deserves Donald Trump.", "There's nothing new about executive orders. George Washington used them and many including Republicans, have used them more than Obama. He was more vocal about it because of congress gridlock, but he didn't use them as often as Dubya did. That iron pen has been there since our founding fathers and will remain. ", "They can complain but they can also be summarily dismissed. Your right to run your mouth doesn't entitle you to be heard, or to other people's time.  \nIf you wanted to be heard, you should have voted.", "No thanks. I can't imagine she'd be any less a part of the establishment than Obama or Clinton.", "The people who voted for Trump don't watch Last Week Tonight and certainly pays no mind whatsoever to what an immigrant Englishman says or thinks about the US. Trump was elected by the masses of people who are tired of being called out as backwards, racist, sexist and homophobic. Not that they aren't, they just miss the time when being those things wasn't a problem.\n\nProgressives can never afford to be complacent. They thought the cities and biggest, bluest states had this locked down. Meanwhile, Trump appealed to all those people who don't like Washington, don't like politicians, and certainly don't like progressives and liberals. Trump found the base that even the GOP had no idea was still there. That's how he won the primary, and that's how he won the election.\n\nJohn Oliver is a comedian first. It's not his job to turn the election, or educate those who have no wish whatsoever to be educated. He has an opinion show based on _his opinion_ that he wants people to be entertained and informed, in that order. Again, the people that voted for Trump probably have no idea who John Oliver even is.", "&gt; America has spoken.\n\nWell a part of America has spoken. ", "Its already very much been torn down and CNN had a huge hand in it. ", "Damn I mean I saw a few parallels but reading the list and checking almost all of them is kind of scary.", "it's a brand new day! ooooh oh oh oohohh ooohohoooooo", "If anyone can preform the mental gymnastics required to justify the insane it's Alex Jones. Cognitive dissonance isnt even a factor. \n\n", "The tolerant left right here guys", "I hope Bernie tells Colbert his smugness and the circlejerk around that smugness helped Trump get elected.", "The DNC is full of crooks and fucking liars. \n\nThey. Aren't. Progressives.\n\nThey are greedy power hungry sociopaths. They're liars. They are not us.\n\nAnd how will progressives fight to keep my rights? Legislation? Well, that won't work, certainly not in the next four years. Protests? Yeah, I was part of the Occupy movement in 2011, they're all phonies that are more interested in partying than getting actual work done, and they failed.\n\nWe need to take a step back and clean fucking house. And I personally don't think it's even feasible given the number of career politicians that make up the democratic ranks.\n\nYou stick with the DNC, and in four years, Wasserman-Schultz will still be there, Donna Brazile will still be there, Howard Dean will still be there, all of Clintons' little clinger-ons will still be there.\n\nThey don't fight for us. We need to leave them in the dust, because THEY just left US in the dust, and they'll do it again if they think there's a chance for them to grab more for themselves.", "No I'm not crying. I accept the results of the election. I'm just reporting on what I'm seeing happening right now. You guys are in charge and it's looking like an epic fuck-up is imminent. Whatever happens it's all on you now. Good luck.", "Bernie had a genuine connection with the working class which resonated not to mention a raft of policies to help them.\n\nNumerous polls had him winning over Trump.  \n\nYou have to provide people with a hopeful, inspiring option to overcome their fears &amp; negativity biases, he was that option.  \n\nMany people 'held their nose' &amp; voted Trump because the DNC boomer cabal decided to run a deeply flawed candidate. \n", "THIS! This is what fucking pissed me off so much. People wouldn't vote for her because they didn't trust her... \n\nAsk Why? \nAnswer: \"emails\" (bangs head against a wall) ", "&gt; most powerful liberal in the world\n\nIn the US*", "Just say no to dynasties.  New blood.  New ideas.", "We kind of are and have been for the last 90+ years.", "What the left can't defend they deny.", "what context would justify this behavior? you see an old man getting ganged up on and girls filming yelling \"yeaaaa he voted Trump!!\"\n\nplease tell me what more do you need?", "and thanks to the MSM and pollsters many of them did not know they were in battleground states.", "Pay to play at its finest. ", "considering only 55% of the people voted that's not very popular.", "it wouldn't. it would actually do what the electoral collage was designed to do. it's entire purpose is to make sure those unqualified to get elected to POTUS are not able to. manly thanks to gears of popular vote and the mob mentality.\n\nin all honestly it would be completely justified in denying trump the presidency.  he fights the bill exactly as someone who the electoral collage was supposed to stop from becoming the president.", "No shit we ceded the planet to them.\n\nThey win.\n\nThese people don't take Trump seriously, they know he's a moron. They're going to destroy him.\n\nThis was an important election geopolitically. We were either going to get a competent person that knows what they're doing or Donald Trump. We got Trump, now China/Russia are going to run circles around him.", "yeah next time we will need a lot more support and structure. hopefully the DNC won't attack and prevent a more popular candidate from taking the spot due to promises made to satisfy another potential candidate in a previous race. if the DNC saw the bigger picture, that someone like trump could even have support because this nation is sick of the same \"political bullshit\" as someone put it earlier, they would've seen Sanders was their only chance for a potential win. I believe a lot of trump supporters would've backed the more established and well thought out version of the anti-status quo(Sanders) over the crazy, scandal ridden, xenophobic, bigot(I won't name names haha) that was chosen.", "Yep you have fun with that kids... at least I have options. I feel bad for those that don't. ", "Republicans always come out to vote. Dems are the ones that fluctuate especially for congressional and senate seats. ", "Thanks for proving my point. Try pulling your head from your ass. \nEdit: after looking at your comment history it's apparent that your head in your ass is terminal. You do nothing but call people \"leftist\" you're a lost cause of dumbness. ", "You do realize that half of fucking America wont just fucking leave? Right? You have to work with them you can't just fucking ignore them and pretend they don't deserve representation. \n\nThis is why we are reluctant to work with you, you refuse to even fucking acknowledge that a slim majority of Americans voted AGAINST your guy. We will not just stand by and let you ignore us, we outnumber you and will continue to do so as you boomers die off. \n\n25.6% voted Clinton 25.5% voted Trump 46.9% didn't vote &lt;-- Does that look like a fucking mandate to you? ", "to be fair she wouldn't fuck over citigroup executives or arabian royalty.", "Very good point but I suspect the voter suppression activities of the right helped. NC was having issues with this on election day itself.", "Actually if you care about the last three, they consider you an intellectual elitist and part of what's wrong with America.\n\n", "I as a liberal, would LOVE Trey Gowdy. Hes at least a man of principle.", "maybe you need to stop pandering to Russia like the Orange dumbass ", "2 years they have 2 years to fix their mess. Midterm elections will be critical.", "Prominent Democrats and liberal America need to wake up and realize that the right has been demonizing them since Obama got elected. It's not just policy differences. I mean they've literally called them enemies of America for a decade now. Socialists. Communists. Traitors. The war on Christians. Muslims from Kenya. Destroyers of traditional values.\n\nThey played nice. Tried to reach across the isle. They got shit on and the GOP unleashed Trump on the world.\n\nThey need to stop being fucking pussies and start getting angry. Old politics is dead and they need a new strategy. Some of us have been saying the left needs a tea party movement since 2010 and they just thought they could throw in Clinton and everyone would fall in line. Liberals don't fall in line. They fall in love. That needs to change. I don't know how but it does. ", "Most Bernie supporters said Trump would win right after the primaries.", "DNC: Let's rig the primary so that we can push Hillary to be our candidate.\n\nVoters: Wouldn't that defeat the purpose of holding primaries?  Isn't the point of the primaries to select the strongest candidate that can win the general election?\n\nDNC: Fuck you!", "Yes don't whitewash history. Bernie was robbed. Hillary was the wrong choice. \n\n\"I mean think of the absolute insanity of this: The whole point of the primaries is to ask the American people who they like best all so the party can have the best chance possible at winning the general election. Everything that Hillary and DWS and by extension the DNC did went against that. They set up an absolute delusion from the start and now they're surprised about the outcome? They crafted the narrative for the media, they relied on super delegates to present a false notion of \"she already won\" from the get-go, they spent millions of dollars influencing grass roots discussions online, they siphoned money from races that democrats ended losing last night, and they continually attacked and degraded the guy who closed a 60 point gap in less than a year and had proven to appeal to the independents needed for a general election. They have fucked the democratic party, they have fucked America, and they have fucked the entire world with regard to the inaction on climate change that we will now see. \"  -guy on Reddit\n\nEdit: just want to make sure nobody is trying to give me credit for this quote. It really was another guy, I just couldn't find his username.", "Obama was a great president but unfortunately everything he accomplished is about to be completely undone.\n\nSame sex marriage? gone.\n\nObamacare? gone.\n\nEnvironment? gone.\n\nAnd with pub's having the trifecta senate presidency and supreme court might as well add abortion too but that was long before obibble.", "HAHAHAH OMFG I can't believe I'm reading this. They were the ones working against him the hardest. Buyers remorse much? I swear to God I hate that Hillary lost, but I feel so fucking vindicated. Yes, Bernie would have won, he would have crushed it. All his demos and enthuisiasm shows this. It would have been a blood bath. Instead they tried to prop up a badly broken candidate by covering her in makeup, insisting she wasn't awful. Then when the GE's vetting process came, WTF did they think would happen?", "This is what this sub looked like before Clinton spent millions of dollars and shills to AstroTurf Reddit.", "November 8 marks the end of Hillary Clinton's political life. She screwed up the most important election of our lifetime. I admire Clinton but we shouldn't have put up someone who couldn't effectively convince the electorate of this truth. You still have to win if you want to rule, and we knew the risks by trying her.", "And campaigning would be a different story", "&gt;**Bigot: One who is strongly partial to one's own** group religion, race, or **politics and is intolerant of those who differ.**\n\ni.e. most of the left.", "Trump needed to win. It's about time people with your cancerous and cultish ideology gained some perspective. Your egos needed to be destroyed beyond repair.\n\nLet it sink in. Take a deep breath and repeat after me. \"America would rather have fucking Donald Trump than put up with my bullshit holier-than-thou, pseudo-intellectual, entitled attitude\"\n\nI hope you spend the next 4 years reflecting long and hard. ", "Reminder: She was Hillary Clinton when the DNC worked with her to rig the primaries. ", "&gt;What has happened in America should not be seen as a victory for hatefulness over decency. It is more accurately understood as a repudiation of the American power structure.\n\nI hope some of the cronies at The Washington Post are reading Reich's article or lurking here today. You screwed this up for us. And now you're going to pay for it.", "\"ANYBODY WILLING TO NOT ACCEPT THE RESULTS OF AN ELECTION IS A DANGER TO DEMOCRACY\" - Every Major Media Outlet just last week.", "OpEd rather than editorial, but nonetheless quite ironic coming from WaPo now.\n\nWaPo Editorial board member Johnathan Capehart had some of the most memorable hits including ['Why Are You Still In The Race, Bernie?'](https://www.washingtonpost.com/blogs/post-partisan/wp/2016/05/04/why-are-you-still-in-the-race-bernie/) as well as this classic ['Stop Sending Around This Picture of 'Bernie Sanders''](https://www.washingtonpost.com/blogs/post-partisan/wp/2016/02/11/stop-sending-around-this-photo-of-bernie-sanders/), where he claims the now famous image of Bernie protesting against racial segregation in Chicago is doctored or simply not him. \n\nCapehart's partner at the time of writing was Nicholas Schmit IV a former Clinton aide at State Department.\n", "The lazy stale, moribund creatures parasitically hanging onto control of the DNC barely care about outcomes at this point. They just want an easy life.", "Screwing Bernie from the start didn't earn her any enthusiastic voters either. Corruption and shady deals follow her wherever she goes", "&gt;I can’t make it make sense because it doesn’t. I must sit with the absurdity of it.\n\nYet another example of the sort of tone deafness the media has shown the entire election.  Perhaps voters rejected the identity politics this article is predicated upon and upon which HRC's campaign was based.  Maybe people don't give a shit about Trump's personal life and supported him to prevent Clinton from taking office, or because they preferred his positions to hers.  Its odd that NYT would publish this [alongside an article](http://www.nytimes.com/2016/11/10/public-editor/want-to-know-what-americas-thinking-try-asking.html) discussing how they failed to give conservative leaning voters proper attention, to their own peril:\n\n&gt;Another letter, from Nick Crawford of Plymouth, Mich., made a similar point. “Perhaps the election result would not be such a surprise if your reporting had acknowledged what ordinary Americans care about, rather than pushing the limited agenda of your editors,” he wrote. “Please come down from your New York City skyscraper and join the rest of us.”", "we got 60 million people converted overnight to bigots too according to the internet!", "&gt; If only the left could lose its smug it would be accepted so much more widely.\n\nWe definitely have some smugness to us, but the republican party promotes anti-intellectualism. Denying climate change. Bashing academia. Ignoring scientists. Why?\n\nIf the right could only loses its dumb, it would be accepted so much more widely. \n\n", "That's literally not what he said. He said that there are a few elements of anti-intellectualism ingrained in the republican party namely denial of climate change, and that if those elements of anti-intellectualism ceased to exist in the party, leftists wouldn't feel smug, since they wouldn't literally, objectively be right about certain topics, e.g., climate change.", "I'm not disputing the results at all. Trump won...the electoral college. Not the majority vote. But he still won. He's President. I have ZERO issue with that. \n\nBut I will do everything I can to vote him and his people out. The election wasn't rigged. It was fucked up by the Democratic Party. And now we must reform and unite and take down the shit stirrer they should have been able to. ", "It is biased -- they're owned by Tampa Bay Times which endorsed Clinton. \n\nSo Trump supporters like me think, \"Oh, if even pro-Clinton Politifact is reporting something positive for the right, it must be true.\"", "It didn't cost them their jobs.  The Bush administration did that.  It's that recovery was taking a long time.  Now we're back to Bush years but worse.\n\n  They voted in the exact establishment they feared so much.  Trump is so very unknowledgable on politics that they are going to use him like a puppet.  He will do as they say.\n\n  Unless something slights him or something.  Then who the fuck knows what this idiot is going to do.\n\n  I'm done playing nice.  I shit posted online like anyone else, but irl I was respectful, and kind in my political discussion.  Not anymore.  I will point a finger at all his fuck ups and proclaim this is what his supporters wanted.  Not online.  In their faces.\n \n  The left will always be painted as the boogeyman no matter what, so why not actually start being assholes for once.", "Wow. After the convention he favored a candidate that was actually running for president? He dismissed Bernie when he wasn't running for president? How callous of him. Do you hear yourself? ", "I mean Reich endorsed Sanders to begin with, and no one paid him any mind because he's no \"Nobel Prize\"-winning economist like based Paul Krugman.", "That argument assumes that the election would go the exact same way with popular vote which isn't remotely accurate. Different win conditions means different campaign strategies means the current results don't represent the results you'd get if elections were actually decided by popular vote.\n\nI'm not trying to endorse the EC or FPTP btw, I'm merely pointing out that the whole \"but she won the popular vote\"-argument is dumb.", "How was Colbert anti-Bernie?  \nHe seems pretty supportive of him and let him on his show multiple times.\n\nSure he made some jokes. But he did that towards any candidate, Colbert seemed more supportive than Bernie than most. (That includes liberal shows like the Daily Show)", "Common sense time. Hillary lost because of the Email scandal. Republicans have always hated her and liberal voters never particularly liked her. So when she was actually guilty of something and it carried on like grinding a metal hook on a chalkboard....well it's now in the history books", "Hes not saying that results should be changed or anything just that we need to remember that there are a shit load of people who voted for her", "In the end she got what she deserved which was not becoming president it's simply bad timing for us that we got President-elect Donald Trump as a result", "&gt; It is more accurately understood as a repudiation of the American power structure.\n\nSo the same 'MSM' that did a terrible job of understanding modern America is now supposed to be able to do a fantastic job of analysing what happened...\n\nThe majority of American *people* voted for Clinton. The irony is that she lost the political game by losing states in the electoral college. \n\nShe also won the majority of American people earning less than $50k a year. Problem is that a working class vote in California isn't as powerful as a working class vote in Alaska. The media is now going to focus on the later and forget that the former exists in greater numbers. \n\nMeanwhile, we'll also forget that the free-market policies that so many working class people are so annoyed about started with Reagan, that NAFTA was proposed and set in motion by Reagan, and that trickle-down-economics gained momentum under Bush. As for being anti-Establishment -  interesting that the majority of incumbent Republicans were returned to power. ", "&gt; Him Bill Maher and Trevor Noah are a few names on that list. Fuck them for insulting our intelligence and actually helping Trump win. \n\nEhm, Bill Maher endorsed Bernie Sanders. ", "Trump ran on deregulating wall street and the banks.\n\nIn what universe does this help income inequality or the middle class.", "Could would should fuck DNC", "Democratic strategy in the general was to court Republicans. We can see how that went.\n\nhttps://youtu.be/gyBMhmK79tg?t=1m35s\n(TYT's Jimmy Dore discusses Democratic strategy in Pennsylvania)\n\nSeems like ignoring your own base is not a good idea.\n", "Yeah I want an easy life. Unlike you guys who want to have Trump as president, all social freedoms reversed, and the possibility of an even more progressive platform eliminated overnight. \n\nNow the GOP can secure it that there are no progressive justices in state or federal courts and the only party of power or establishment will be the GOP. \n\nOh, and the guys on the left protesting. \n\n*But she's an establishment crook!*\n\nFirst, campaign BS. But want to believe that? Fine. But we would still have judicial control and social freedoms. \n\n*But she would have lied*\n\nAgain, no, but if she had at least the courts wouldn't have crippled us and we could stage an organized revolt under Bernie ", "I was downvoted in this sub for three weeks because I said to watch the jump in Trump's numbers once the curtains close.", "Except he already fucked up by putting climate skeptics in with the EPA and Oil Tycoons as his energy experts. He has already failed the world let alone America.\n", "I've had people try to tell me already how backwards the Democrats were and how Trump's overwhelming victory proved that. So yeah I think bringing up he point that Hillary won the popular vote, even by the slimmest of margins has a point. The point being that this was not a \"mandate\" election in the way Obama's victory in '08 was. ", "SC: so Senator Sanders are we doomed?\nBS: Yup!\nSC: goodnight everybody!", "Man watching democrats, pundits, and other media sources act pissed at Nate Silver and his model all because his only gave Hillary between a 60-70% chance of winning was infuriating. It's such a bad understanding of probability. Polling errors were always in the cards and 538 explained that time and time again. Based on numbers alone, she looked like an overwhelming favorite, but no one even wanted to think that the polls could be wrong. The fact that a lot of people in the media are criticizing data journalism and 538 now is just a way to ignore the fact that they themselves simply didn't understand and communicate probability effectively. Hell, the Cubs just won and people acted like low chance events never happen.", "Could've would've, and should've.", "From what I've seen after the election [Hillary supporters are the real bigots]( https://twitter.com/kmscodi/status/796554667748716545?s=09)", "This is fucking rich coming from the paper that wrote 16 negative headlines in 16 hours against him. Sorry WaPo you are still a garbage newspaper. ", "Apparently arrogance will kill a *democratic* campaign. You can't sit there with a straight face and say Trump's campaign wasn't arrogant; maybe the most arrogant *ever*.", "There will be no unity. We must oppose. ", "The shills have all been laid off. Real people are posting again.", "The really scary thing is that the DNC actually manipulated the outcome of *both* the democratic *AND* republican primaries; according to [a memo attached to an email published by Wikileaks](https://wikileaks.org/podesta-emails//fileid/1120/251) the DNC thought that Trump Cruz and Ben Carson, who they saw as the three most extreme candidates, would therefore be the weakest three candidates in the general election so they used the press and other tools to help them out in the primaries giving them tons of free publicity which would eventually give Trump an insurmountable lead.  Then, they used these same media connections in the general election to attempt to bury him in negative coverage", "Everyone blaming the DNC needs to stop setting up the narrative for trump supporters.  When trump screws up it will be on him to answer for it and not put the blame on Wasserman Schultz for not giving Sanders a chance.\n\nFor the record, no matter if your left or right, every president screws up. It's just a matter of how much or how badly.", "I am also a straight white male -- in fact I happen to be tall, blonde and broad shouldered, I'm quite sure Hitler would have been proud of my stock -- and yet I have not been called a racist in my memory.  \n\nI want to propose the possibility that people aren't calling you racist simply because you are a straight white male.", "\"I only cheated Bernie was proved to be corrupt, have hundreds of millions in questionable \"donations\", have the personality of a Brussels sprout.\"", "Progressives Democrats, should show the new GOP unity the same kind they and their supporters showed President Obama for 8 years. We must elect them out as soon as possible. But the DNC must be reformed first. ", "Except they won't understand that it is a response to their own actions over the past 8 years and they will start saying things like \"Obstructionism is unamerican\" and \"they just don't want to work.\" and will act like 8 years of republican obstructionism never happened. Then if a Dem wins 2020 they will be 100x worse than they were under Obama.", "Take a look at Krugman's twitter the night of the election. I shouldn't but I feel a little sorry for him. All his lying and bias was for nothing.", "I believe there aren't enough seats up in 2018 for a takeback. But definitely push hard to get as close as possible.", "Clinton was by all stretches an impressive candidate and I fully agree with you. It was still *her* campaign, and she was the leader of it. Her decisions in running her campaign, ignoring Wisconsin and Michigan, and hoping that the working class love her by default is sheer hubris on her part.", "&gt;Yes it's total fear-mongering to be afraid of the guy who is irrationally hateful of nonwhite immigrants\n\nTrump has never said anything bad about immigrants. He's said bad things about **illegal** immigrants. \n\nYou do realize that this sort of blatant lying and attempt to deliberately confuse legal and illegal immigration is one of the main reasons the Democrats lost last night, right? People were able to see if the lies were true and when they found out the Democrats were being manipulative pieces of shit it didn't make them vote against Trump.\n\n&gt;Muslims, and Muslim refugees,\n\nSorry, there's legitimate reason for this. Denying the threat of Islam in the face of a spate of deadly attacks was also profoundly stupid.", "of course they did.\n\nthey convinced trump to run to give Clinton a soft target knowing how badly people viewed her.\n\nit was Clinton who decided the tactic would be to go after his character rather than promote hers or her policy.  \n\npeople still hated her more.", "&gt; She screwed up the most important election of our lifetime.\n\nPeople say that every election.  And then in response to my saying \"people say that every election\" the response is always \"but this time it really was!\"", "Colbert and others were very anti-Trump so to push that narrative they supported Trump's opponent Clinton. To say he was pro-Clinton, while true to a degree, ignores that he was mostly anti-Trump. As was Seth Meyers, Bill Maher, Trevor Noah, and Samantha Bee. ", "Duly noted.\n\nAnd Trump won because he made a million promises that are impossible to keep.", "Her negative press was well deserved. She broke the law and was criminally negligent with national security information.", "NY Times pitches a classic left fit.", "Everything he said was spot on. Clearly nobody commenting here read what he said though.", "There it is again ...\n\nYou dismiss every Trump voter without knowing their motivations and call them dumb yet are smug that you're the tolerant one? Even though being leftist on 4 out of 5 issues myself, I still find it hard to call myself that because of identification with people like you.\n\nReally sickening, dumb and divisive mentality that's not one bit better than what you proclaim the other side to be.", "illegitimate supreme court corrupt FBI as their attack dogs,  house and senate for at least 4 years and probably 8.  Political rivals facing criminal charges. \n\nThis is the end of legitimacy in America democracy and the beginning of White Supremacist Murca. ", "I don't know if its real or trolling yet but i heard 8 trans people committed suicide last night. Considering how Trump actually is completely fine with trans rights. Lettings trans into Miss universe and let trans choose which bathrooms they like in trump tower. SJWs are responsible for the deaths of these people by making out trump is literally going to genocide these people.", "Well... the definition of racism certainly isn't 'privilege plus power' so yes, Black lives matter is inherently racist according the actual definition of racism. ", "&gt;She probably got more negative press than Trump.\n\nComeon man. Your job is over now. Go to sleep.", "1. She is leading in the popular vote not the majority vote.\n2. The electoral college is a feature, not a bug.\n3. There are still millions of votes to cast. Even CNN has Trump as the projected winner of the popular vote. [Source](http://www.cnn.com/election/results/president)\n4. You are free to do everything you can to vote him out, voting is a critical component of our democracy.", "Colbert even had Killer Mike on just to endorse Bernie. ", "And the key thing is 108k people *in the right states*. 108k more people in California or Washington is utterly meaningless and just pads the popular vote total. Gotta have that high turnout in states that end up being 'swing'. The issue this year I think, is that the Clinton campaign never bothered to spend much time in Wisconsin or Michigan, and failed to gain traction in Pennsylvania. Meanwhile, all the time and resources spent in Florida, Ohio, North Carolina, Arizona, etc were all for naught, as she lost all of them. About the only way she could've fucked up more would've been to lose Nevada and then maybe states like Maine, Oregon, etc. She came close to losing both Minnesota and Colorado, they were within 2 and 4 points respectively.\n\nTrump won by edging Clinton out just enough in enough states. That's all you have to do to win in the electoral college system, you can have a significant deficit of popular votes, but if all your votes are spread out evenly amongst the 'right states', you can win while only getting 35-45% of the vote. We're just fortunate that hasn't happened yet, because political demographics rarely line up that nicely.", "You should always work to move the country in a better direction no matter how incremental the change. That's how we got civil rights, workers rights, labor laws and better financial regulations. You always take a victory, no matter how small.\n\nThen you work for another small victory. Then another. \n\nWhat you've done is hand the nation over to the worst people for the next 25 years because of the SCOTUS. And you are directly responsible for that if you voted for a third party instead of incremental change. You won't see any of the change you stand for for a long, long time, if ever. No climate change reform. No financial reform. No civil rights reform. War mongering, low wages and political oppression are now out in the open and you did it.\n\nI told people this when they voted for Nader over Gore, and they didn't believe me then. You won't believe me now. But you will, several years from now. Because you're clearly smart enough to know what's right. I just wish people would understand that you cannot just walk away from the process because you don't get everything you want, right away. The country is full of people who are racist, homophobic, lazy and uninformed and they will lash out at the ideas you believe in with all of their might. People who believe that all it will take for them to get their cushy 'manufacturing jobs for life' jobs back is blocking free trade. They will suffer the most, but they won't learn.  You will never get what you want from them by trying to bash them with 100% compliance. You have to court them over time. \n", "Trump won because whitey showed up in droves to vote for their white supremacy dream. This wasn't a party line election it was straight white Christians vs. everyone else.\n\nPeople like you are the reason why there's going to be bloodshed on the horizon.", "The media was absolutely horrible. First they created Trump and built him up so he'd win the primary and then after he won they tried to crush him, except they misunderstood the populace because they lived in their little bubble.\n\nI know some people who voted for Trump just to spite the media. It was getting so old turning on the radio hearing 'Trump, Trump, Trump'. Nothing on Clinton, just crickets. \n\nAnd then NPR, don't even get me started. Here you have a guy getting 50k rallies (which is huge, martin o malley was lucky to pull a few people to hear him talk) and there's just nothing on him. Every morning going to work, I'd hear the pundits, and whenever they'd mention a democratic nominee, it was just Clinton, as if there's only 1 person running. ohh, but then when it came to the republican field  all of a sudden there's an actual contest.", "Dude no offense but your whole country IS a reality show. Everything everything from food to leisure to sports to buildings has been stripped of its essence, rebranded, remade poorly and marketed to make as much bucks as possible. ", "and the media they are very much responsible.", "Right now I almost wish she was as corrupt as people said she was and she HAD rigged this...:(", "Don't deflect this conversation is about bad cabinet appointments like Palin.\n\nWhat's your opinion on that? ", "I fear that people that voted Trump are the types of people to ignore reality. When things are getting really shitty I can see them blaming Obama and saying it is just side effects of fixing his problems, strengthening their agenda. This isn't a country defined by reason and logic. \n\nEdit: fixed misspelled their", "Cause you know, ordinary Americans only voted for Trump.", "Agreed. Suddenly Republicans have do campaign in California and New York, and Democrats have to campaign in Texas and Idaho. At the very least, it'd be interesting to see how deep red and blue states change if every vote mattered in the general. ", "Sanders would have carried the Rust Belt. \n\nWhy? He wanted free trade to be fair trade too. The Washington Post forced the Democratic hand, and you know it. Now they reap what they sow after making it clear that Millennials don't have a voice in the party. And platform promises are only promises. Though I eventually found that I liked Hillary Clinton, the damage by the press was already done. So thank all of the major newspapers for the abject childish way they behaved for the *mess* we have now.", "^ This attitude is why he won. People get tired of being told they're sexist arrogant, xenophobic, lying, narcissistic, Islamophobic, isolationist, with little to no understanding of science, international relations or the economy.", "That just fit into the swift boat narrative of him being anti-military.\n\nThe guy was a god damn war hero and the Republicans turned him into a soldier hating fraud. ", "I resubscribed yesterday after a 3month period of staying away. Don't need people to agree with me just don't want blatant shilling and lying. Glad it's getting better. ", "Technically America chose Clinton.\n\nThe system may be designed such that what the plurality of Americans actually chose isn't reflected in the outcome of the election but you don't understand democracy if you think one's civic duty begins and ends on election day.\n\nYou think the way this works is that one party wins an election and everyone who didn't vote for that party gets left out of the political process for 4 years? Seriously? What the fuck has happened to America? This partisan nonsense is out of control.\n\nThere's plenty to do.", "The political revolution has arrived it's just not coming from where you think it might.", "Orange County and LA county have consistently decided California's direction for years simply because they have such a high population compared to the rest of the state.", "\"BUT. AT LEAST WE TRIGGERED THE SJWs RIGHT?\"", "That wasn't the point. The point was that he was being hypocritical for making fun of Jon Stewart's name change. ", "&gt; well clearly it's not a majority, otherwise we wouldn't be having this conversation.\n\nIf the argument is that nobody was over 50%, then that's just silly when there are multiple parties running.", "Well CNN can't predict shit", "Well you have around 3 years to see how it goes first.", "That's the part people are glossing over. A lot of people on BOTH sides didn't vote it's just there were more Dems than Reps that stayed home. ", "I was at a hoity toity Ohio Democrats dinner where both Hillary and Bernie were speaking days before the Ohio primary. I was Bernie supporter and was offered a Hillary button as I entered. A biology professor from a highly esteemed college condescendingly dismissed my support for Sanders -- her  main focus was ending wars. Her support for Hillary was interesting to say the least. To her, Sanders supporters were just idealistic young people, Hillary was the qualified, experienced safe choice.\n\nThere were cheaper non-dinner seats that were filled with excited and cheering Bernie supporters. Later, a bus load of young Hillary supporters arrived and were being actively coached when to applaud and yell to drown out the Bernie supporters.\n\nHillary lost because her support was never genuine in the same say that Trump's was, the same way Bernie's was. It wasn't authentic and people could see that. It's getting played out, blaming the DNC. But they picked their candidate early and desperately tried to match the organic support that Trump and Bernie received. That never materialized and in hindsight, it was very apparent.", "&gt;MOSCOW — Russian government officials had contacts with members of Donald Trump’s campaign team a senior Russian diplomat said Thursday, in a report that could reopen scrutiny over the Kremlin’s role in the president-elect’s bitter race against Hillary Clinton.\n\n&gt;Facing questions about his ties to Moscow because of his statements in favor of Russian President Vladi­mir Putin, Trump repeatedly denied having any contact with the Russian government.  \n\n&gt;But Russia’s Deputy Foreign Minister Sergei Ryabkov, in an interview with the state-run Interfax news agency, said that \"there were contacts\" with the Trump team.\n\n&gt;\"Obviously, we know most of the people from his entourage,” Rybakov said. “Those people have always been in the limelight in the United States and have occupied high-ranking positions. I cannot say that all of them but quite a few have been staying in touch with Russian representatives.” \n\nHow the GOP got infiltrated by Russian assets and how Trump supporters got duped by Donald's lies. \n\nEDIT:\n\nFortunately, for what it's worth, the FBI will investigate Trump advisers joining the admin.\n\n&gt; [Trump advisors joining the admin will be required to detail these contacts on background check forms, &amp; FBI will have to investigate them.](https://twitter.com/matthewamiller/status/796702260181012482)\n", "One of the more interesting countries to watch over the next 4 years is Russia.\n\nThey just got a green light from Washington D.C. that the U.S. will no longer stand in their way.\n\nIt's hard to predict the outcome. I think a far more aggressive Russia is obvious. But what they plan on doing with their upcoming impunity isn't clear.", "Seeing conservative friends start posting positive things about Putin and Russia is probably one of the most surreal things I've ever seen. This is some twilight zone shit", "Oh fucking wonderful, Russia's just flat admitting it now.\n\nGreat.", "Nice job the FBI did when they said they didn't find any evidence of communication.\n\nWell done fellas.", "Because Donnie Trumpster's supporters worship his every move.", "How is this not setting off alarms? ", "Anyone thinks that the number of Trump scandals will easily exceed the number of Clinton scandals in one short year of governing? it's looks like he is choosing his campaign based strictly on whether they supported him during the race which is never a good sign for meritocratic positions. ", "Yep. In a nutshell it's easier to buy a primary than to buy the general. Does anyone really think she'd have been the nominee if she hadn't been anointed literally *years* in advance by the cream of the Beltway? The DNC was confident in their ability to \"shape the narrative\", or whatever they're calling it these days, but it turns out that doesn't work so well out in the political wilds. The narrative shapes itself. I find that strangely comforting.", "She's a terrible politician. She's always been a terrible politician. It has nothing to do with being a woman. Margaret Thatcher could have crushed her with one hand.\n\nClinton lost the two most important races of her career spectacularly and humiliatingly. She will go down in history as a loser, and not even an honorable, Adlai Stevenson loser. She cheated relentlessly and she *still lost*.\n\nI voted for her in the end, because Trump was just too egregious, but I sure as hell wasn't happy about it, and I can't imagine many people were. Nor can I be too sad about seeing her depart in ignominy.", "Baltic states can't be feeling too good right now.", "&gt; Russia’s Deputy Foreign Minister Sergei Ryabkov in an interview with the state-run Interfax news agency, said that \"there were contacts\" with the Trump team.\n\n\"**Obviously, we know most of the people from his entourage**,” Rybakov said. “Those people have always been in the limelight in the United States and have occupied high-ranking positions. I cannot say that all of them **but quite a few** have been staying in touch with Russian representatives.” \n\nJesus Christ\n\n&gt; \"We have just begun to consider ways of **building dialogue with the future Donald Trump administration** and channels we will be using for those purposes,\" Ryabkov said.\n\nSo they explicitly talked about what they would do for the Russains if they win. If they find evidence that Russia gave something in return, Trump will be dead before he hits the floor.\n\n", "Estonia's government just disintegrated and there are pro-Russian elements in there already- I'd put even money on Putin entering a NATO state in a year.", "It's going to be hilarious in the worst possible way. His conflicts of interest are off the freaking chart, yet he ran on a \"anti-corruption\"  platform with feel-good policies like  making sure someone like Bernie Sanders could not serve Vermont well for as long as he has.\n\n It will all depend on how successful he is at suppressing the \"corrupt, lying\" media.", "But Hillarys emails with the nothingburger recipes in them. Also LOCK HIM UP.", "Sad thing is all he had to do was make fairy tale promises about bringing back factories jobs. The DNC was really fucking dumb. The mood of the country has been anti-establishment for years now with lots of anger at our party systems. This is the absolute wrong time to run an entrenched party leader that is the epitome of old school Washington politics. But no it was her turn so everyone else got out of the way with only crazy old Bernie willing to say fuck it and give us another option. It should have never been those two in the first place. If the DNC could operate without their heads up their asses for a minute they would have gone with someone like Warren. Instead every other real candidate saw the very obvious and set coronation for Hillary so they didn't even bother trying. Good thing the democrats have also absolutely fucked themselves on the state gov level too. We are in for a ride in GOP land and will be for the next decade. Hope you get yours cause there sure as hell won't be a lot to go around in a few years if you're not at the top!", "It does. If Trump promised any kind of deal it's a violation of the Logan Act and he could be impeached. \n\nEDIT: Logan Act, not the Hatch Act", "Pray it's not nuclear.", "He won because he had a message. It's that simple. \n\n\"Your jobs have gone I can bring them back.\"\n\nClinton's message -- even if she was the infinitely more qualified candidate -- was \"I'm not Donald Trump\". \n\n", "Scandals yes. Investigations? Nope. The Republicans will be writing the story by controlling both House and Senate.", "Finish the fucking books.", "Oh it is much worse than that prepare for the national parks to be privatized and turned into open pit mines.  ", "&gt; It will all depend on how successful he is at suppressing the \"corrupt lying\" media.\n\nThis is something that's been concerning me. He's openly admitted to wanting to loosen libel laws, which is 100% because of his thin skin. He's trying to go down a slippery slope of censorship and suppression.", "Pretty much. Someone from CNN posted this on Twitter and almost all the responses from Trump supporters were \"Big deal. What about HRC's e-mails?\"", " If they don't keep the mandate requiring coverage not be denied to patients for pre-existing conditions and do something to help subsidize healthcare for lower income Americans there will be hell to pay on both sides of the aisle and riots in the streets.\n\n You're literally playing with people's lives here. Mine included due to my pre-existing condition. \n\n Tread carefully.", "I can't say I'm surprised. It doesn't say in the article in what capacity they were in with the Russian government but at this point, I guess it doesn't matter..", "&gt; If we on the left want to piece this thing together we have to actually put ourselves in their shoes. They're broke. They're pissed. Politicians keep lying to them.\n\n Yeah. And people keep characterizing them as yokels \"spitting chew into a slowly filling, repurposed Mountain Dew bottle\" who make \"low brow\" comments, too!\n\n", "Well I suppose Ryan is better than Trump or Pence.\n\nWhat has the world come to when Paul Ryan is now viewed as the sane rational, better choice?", "If the ACA goes my daughter will die or we will go bankrupt. People dont seem to realize that the pre existing condition part of the ACA is vital. We are now terrified.\nEDIT:\nBefore the ACA about 70% of all bankruptcies were health related. ", "I mean duh? Trump's America is Putin's wet dream, and he made it happen. There will be no US checks of any type on Russian goals for the next four years.\n\nOver and over again, we've been accused of fearmongering when we warned about this. Now we get to find out exactly what Russia will do when the American commander in chief is firmly in the Kremlin's corner (you know, as long as they keep \"saying nice things\" about him.)\n\nWe will see. We warned; we were told we were fearmongering and we were ignored. Now we will see.", "Mr. Trump is this country’s 45th president. For me it is a truly shocking fact, a bitter pill to swallow. I remain convinced that this is one of the worst possible people who could be elected president. I remain convinced that Trump has a fundamentally flawed character and is literally dangerous for world stability and injurious to America’s standing in that world.\n\nThere is so much that I can’t fully comprehend.\n\nIt is hard to know specifically how to position yourself in a country that can elect a man with such staggering ineptitude and open animus. It makes you doubt whatever faith you had in the country itself.\n\nAlso, let me be clear: Businessman Donald Trump was a bigot. Candidate Donald Trump was a bigot. Republican nominee Donald Trump was a bigot. And I can only assume that President Donald Trump will be a bigot.", "~ Bernie Sanders August 28th 2015\n\n&gt;\"Let me be very clear. In my view, Democrats will not retain the White House, will not regain the Senate, will not gain the House and will not be successful in dozens of governor’s races unless we run a campaign which generates excitement and momentum and which produces a huge voter turnout.\n\n&gt;With all due respect, and I do not mean to insult anyone here, that will not happen with politics as usual. The same old, same old will not be successful.\nThe people of our country understand that — given the collapse of the American middle class and the grotesque level of income and wealth inequality we are experiencing — we do not need more establishment politics or establishment economics.\n\n&gt;We need a political movement which is prepared to take on the billionaire class and create a government which represents all Americans, and not just corporate America and wealthy campaign donors.\nIn other words, we need a movement which takes on the economic and political establishment, not one which is part of it.\"", "She had a message and it was a damn good one.  Problem is that it wasn't a single one sentence soundbite; it was a well thought out and realistic plan.   Apparently the American electorate wants you to dumb yourself down or they won't even listen to you. ", "Bernie this is your moment where you can write history. Many people will form their opinion based on the things you will say in the following days.\n\nI'm happy that I don't need to carry this weight on my shoulders.", "I for one, am ready to be involved in a Berniecrat teaparty movement.\n\nI am at a loss for future elections. I've been an independent out of my dislike for the DNC for years, but since I'm classically liberal, and also a fan of evidence-driven policy, the GOP is even farther from my views than the DNC. So I usually end up pulling the lever for the D (hah, hah), because they are the lesser-evil candidate.\n\nWell, thanks to DWS and Bernie Sanders, I think we have the ire for an actual movement here. Let's primary the fuck out of these assholes.", "amazing how quickly they left once the money stopped.", "Yeah. We know. Paul Manafort thanks you for the contributions.", "I'm currently wondering about what Hillary has left to go back to.\n\nShe lost to the biggest joke of a candidate. Would anyone still want her to give speeches?\n\nHillary: Hey it's me. The woman who lost to Donald Trump. I'll give a speech for 250k.\n\nGoldman Sachs: HAHAHAHAHAHAHAHAHAHHA. \n", "Ah I had optimism once too. ", "&gt;There is so much that I can’t fully comprehend.\n\nIndeed. The more hyperbole Blow offers up the more steeped in irony it becomes. The group of Trump supporters that decided this election aren't reading fucking NYT Op Eds. They couldn't give less of a shit how flawed Charles M. Blow thinks Trump's character is, and if anything they'd probably have some unfunny, low brow comments to make about his last name in between spitting chew into a slowly filling, repurposed Mountain Dew bottle. That would be about it.\n\nIf we on the left want to piece this thing together, we have to actually put ourselves in their shoes. They're broke. They're pissed. Politicians keep lying to them. Call me crazy, but most of my fellow liberals seem to think the same thing. Why is our default response to Trump to belittle his message and explain it away as nothing but an excuse to be bigoted?\n\nThe bigotry and xenophobia and racism are real, and it's ugly and reprehensible, *but that's not the whole story*. It's a side-effect of our common problems: wealth inequality, and lack of access to basic needs like affordable, adequate healthcare and education, etc. That why this was a populist election cycle, as the pundits like to snarkily phrase it, and that's why we need to do more humanizing and relating, and less urban, liberal, NYT Op Ed circle jerkery.\n\nShit is fucked up on both sides. If we work together to fix shit, we will blame each other less, and be more inclined to blame the assholes that actually fuck shit up, *ie* corporate media, the leadership of the two major parties, *et al.*\n\n", "He wasn't the only one though. A lot of progressives said it, including people from The Young Turks, Secular Talk, etc.\n\nHeck, even Bernie Sanders said it in 2015 that Democrats would lose the Senate and the presidency if they do what they did.", "The world would be a better place without Facebook.", "The fact that the racist sumbitch that was king of the birther movement is following our first black president makes me ill. \n\nHistory will look back on this as an embarrassment. ", "Scares the hell out of me too, because his supporters 100% buy into the idea that all negative news can be dismissed because the media is \"corrupt.\"  So they'd absolutely love it he started throwing journalists in jail for not reporting the \"truth.\"\n\nCombine that with the crumbling financial situation of the journalism industry,  and the polarization of opinion-based news in confirmation-bias confirming safe spaces -- and how Trump will probably treat the White House press corps -- and we could be looking at an era of disinformation and ignorance like we've never seen before.", "\"America first.\"", "We had one and we pissed it away in favor of Clinton.\n\n", "She had a chance at being the first woman president and she blew it on the worst candidate in history. You don't recover publicly after screwing up this unique election. The major newspapers all got behind her. The pollsters screamed victory for months. And she still lost.\n\nYou have to be popular to win elections.", "They did this precisely because it will cause further doubt and instability. Let's face it Republicans have never exactly been big fans of Russia. Releasing this information now creates doubt and suspicion among the surviving old guard Republicans in Congress and makes it far less likely that they will go along with Trump's foreign policy proposals, especially in a crisis. It serves to create a further divide in the Republican party, inhibiting effective government even though they control both Congress and the Presidency.", "If that's the case Pence could of known as well, and could be impeached as vice president. Then Ryan becomes the president, which isn't the worst thing possible.", "This could never be proven.  It's not written anywhere and it would just be denied.  If anything some low level staffer would take the fall (see Iran-Contra Affair).  \n\nBut the above is just pie-in-the-sky thinking, when all 3 branches of the government are Republican controlled, there will be no investigation.  Remember, Congress controls the budgets of all government agencies.  ", "Valar morghulis.", "We need to get /r/SandersForPresident back up and running. I think the mods are getting back together to get organize again before moving forward to make sure they dont screw anything up. They need to hurry up and get it back up while everyone is pissed off and ready to do something about it. \n\nWe have 4 (more like 2.5) years to push certain candidates into the spotlight using Reddit and Twitter we can do just that.\n\nSubscribe to /r/Tulsi /r/Political_Revolution and /r/SandersForPresident  I think we can do this.\n\nEdit: Remember we need to push the next candidate to the Spotlight. WE CANNOT LET THE MEDIA AND DNC DECIDE WHO TO THRUST INTO THE SPOTLIGHT AND DOWN OUR THROATS FOR 2020. We need to be the ones to do it. Reddit is big enough for us to pull it off.", "But how to impeach Pence.  We're well and truly fucked.", "~~If~~ *When* Le Pen gets elected in France and they decide to blow up the EU the Baltic states are all but gone.", "a... real life... Clinton supporter?  what an honor!", "Because Hillary was supposed to be the corrupt one not Trump. Besides, he already won. /pol/ and the rest of the \"alt right\" don't give a fuck what he does now.", "The wikileaks helping might not have been bad but this is just outrageous. He's not even President yet and there is already more scandals.", "People don't seem to understand that. You don't campaign to win the the popular vote if you did Trump would have spent time in Cali and other deep blue states and Clinton would have spent time in deep red states.", "The press got what they wanted hillary.  They then were handed a loss.  \n\nToo bad they couldn't learn from that and not try to manipulate people in the future.  Something tells me they won't ever learn.", "I feel like Clinton/3rd party candidate supporters knew this and Trump supporters don't care.  In fact this is probably one of the driving factors behind flipping the rust belt states.\n\nFor fucks  sake, coal is just not going to play a large part in the energy economy of the 21st century no matter how much they want it to. ", "\"I'm a Christian a conservative, and a Russian operativ -- err, a Republican in that order\"\n\n- Mike Pence", "She was also Hillary Clinton when received leaked questions from Donna Brazile and forgot to tell anyone about it. Too bad cheating didn't get her the White House.", "Oh it's gonna be ugly. Not enough people here remember what it was like during the Bush/Cheney years. I do. And what's about to happen to us is going to make that look like baby town frolics. \n\nGreat job America. ", "Yes! I agree! Time for an angry adamant leftist party. There's a huge vacuum and lots of opportunity to get some messages and policies out there.", "Definitely. It's going to be scandal after scandal. And on top of everything else don't forget when he said he will put his company in a blind trust his kids...\n\n&gt;[Confronted with the recent Newsweek cover story detailing numerous potential conflicts of interest between his foreign business dealings and American national security should he be elected, Trump and his children responded with a litany of nonsensical claims. There would be no conflicts, he said, because he would put his company, the Trump Organization, into a blind trust. Then he said he would sever his connections with the business. With both answers, though, he said his children would run the company. Then his daughter, Ivanka Trump, a fashion designer and former model, jumped in with her goofy explanation, saying she and her siblings would figure out how to avoid deals that might raise conflicts of interest for their father.](http://www.newsweek.com/2016/09/30/donald-trump-blind-trust-foreign-business-deals-500398.html)", "Breaking news: diplomat is diplomatic and talks to people like literally every diplomat ever. /r/politics goes full /r/conspiracy.", "I'd rather take my chances in Westeros than deal with this orange fuck for four years.", "The left echo-chambered themselves into a defeat.\n\nNow they are angry at reality.", "&gt; will easily exceed\n\nTrump's scandals exceeded Clinton's **last year**. Emails? Sigh... \n\nThe constant flow of Trump's insanity since made the two not even comparable. ", "Trump loves China and Russia and is a literal Manchurian candidate. Time to get out the popcorn and watch this country implode.", " Copy pasta from one of my replies in another thread about a DNC cleanup...\n\n *At this point they'll either do it or we'll do it for them.*\n\n *There's a model for this and it's called the Tea Party. Say what you will about those crazy shitbirds but they laid the foundation for how to get shit done on a grassroots level and that movement didn't have a tenth of the organizational skill or enthusiasm that a populist progressive movement with strong appeal to the working and lower classes would have.*\n\n *I know it's a different audience and a different election, but look at some of the results from states like Michigan and Wisconsin in the Democratic primaries vs. the results from the Presidential election. They clearly indicate that there's a groundswell of support for a populist progressive message like Bernie's in even the most rural of areas.*\n\n *Sanders' movement raised more money than Clinton's and it did it on the backs of individual contributions from people that supported it.*\n\n *If the DNC doesn't want to clean house and fix this fucking mess they've created then we have all the tools and blueprints we need to clean it for them.*", "Oh my fucking god what did we elect president.", "It's strange in a way. Usually people post on the internet because they can achieve some degree of anonymity. Facebook takes that away but I still see things there from friends that they'd never say directly to me. Facebook certainly seems a great way to pick your tribe (and cutest cat pictures).", "President Obama’s environmental legacy went up in smoke the minute Donald Trump won. Obama has spent the past four years pursuing an aggressive regulatory agenda aimed at lowering the nation’s reliance on fossil fuels boosting green energy, and giving the U.S. a leading role in the global fight against climate change. His hope was to hand off this regulatory framework to Hillary Clinton, who would then spend much of her term following through on it.", "This is the best time for them to reveal this honestly. Just show the world how shit democracy is, and embrace its wayward children back into the Soviet sphere.", "Think about it. President Ryan. Basically a Tom Clancy novel", "May I rephrase good sir?\n\n&gt; Clinton asks Democrats to carry her through an election. Democrats hesitate: \"Won't you just abandon your progressive agenda once you get into office?\" Clinton answers: \"I'd still be better than Trump\".  Democrats think about the alternatives for for a moment and nod, taking Clinton into their arms and proclaiming **I'mWithHer**.\n\n&gt; Halfway through election night, Democrats feel a sharp pain in the rust belt. They ask Clinton: \"Why did you ignore these states? Now we'll lose control of all three branches of government.  How could you display such arrogance and hubris?\"  To which Clinton replies: \"I couldn't help it. It's in my nature.\"\n\nI'm finding my choice of screen name on reddit super relevant these days.", "I mean she had a message about jobs she was poor at expressing it and very poor at responding to all the donald craziness. She spent so much time on the crazy shit he's said when the much more powerful line of attack would have been what he's done over the past 30 years.  Yah we got a little about that with the taxes, but the dude is a major fucking crook and it's the world's worst kept secret in New York/New Jersey.  She ran a really bad campaign, and the DNC has lost the country to the GOP for the next 10 years.  They fucked up to the point where the party needs to be torn down and rebuilt as they have lost it at every level of government.", "Not America the stupid.  He pointed out how the Clinton camp failed to address the voters specifically in the rust belt.  Sanders did, Trump certainly did, Clinton forgot about them.  Clinton played politics.  Trump, even in lies, addressed the people.  ", "Gimme a break. I've been pro-Clinton since day 1. We're all just bummed.", "I'm still waiting for Hannity to quit acting like a pussy and do what he said he would and experience firsthand what waterboarding feels like. ", "What Trump wants to do in his first day:\n\nRepeal Obamacare\n\nWithdraw from the paris accords\n\nWithdraw from the Iran deal\n\nAppoint a new supreme court justice\n\nRemember he wants to do all this in just the first day. We get 4 years of this shit. ", "The WaPo rigged the Democratic primary just like the reddit admins allowed r/politics to be rigged during the entire general election. The WaPo deserves to go bankrupt and out of business.", "I'm tired of this narrative that Hillary was the nominee because of the DNC.  She was the nominee because of the millions more votes she got than Bernie Sanders.  Hillary Clinton pretty much ran the table with black voters.  That's not the DNC's fault; that's Bernie Sanders' fault for not appealing to enough people to win.   Believe it or not the democratic voting base extends beyond white college-aged males.  \n\nAnd if we're talking about dumb, it's not the DNC for preferring the most qualified and probably objectively best person for the job.  It's the electorate who chose an ignorant know-nothing reality TV show host over her because \"muh anti establishment\" and probably a pinch of sexism ", "That kind of smugness and condescension (anyone who didn't vote Hillary is an ignorant bigot) is what elected him.\n\n", "So maybe the Russians aren't really so thrilled with trump? Why on earth would they announce this otherwise? Instability is likely their real goal trump isn't useful to them on any international level. Even if he sides with them in Syria it's not going to sway anyone else...", "His legacy doesn't go away unless we let it go away. It's no time to just give up on the environment  it's just time to fight harder. ", "It's Republicans all the way down.", "well if she won then the DNC would just keep doing the same thing. The silver lining here is maybe they'll learn from this.", "&gt; Every blunder (and there will be many) is going to be prime viewing on 24/7 news.\n\nI don't know man. He gave a victory speech and I watched it in full.\n\nSomehow he went from loudmouthed insane blowhard on the campaign trail, to a somewhat actually decent and humble man. Nothing in his speech reminded me of \"Campaign Trump\".", "The GOP has been calling the democrats \"crazy libruls\" for years now. :v Time to show them the real crazy. No more playing nice.  ", "This.  \n\nHe talked to the diplomat from Israel too. And some of the ones from the Asian region.  And oh the one from Britian too. \n\nBut I forgot, they aren't big bad Russia.  OHHHHHHHHHH \n\nI wonder if this sub would be freaking out so hard if Hillary got elected and she was talking to those middle east diplomats.  Would you be worried about the war started by the no fly zone idea then?", "I was doubtful and then Sergei Lavrov came  out and said [\"we kinda had a little to do with wikileaks.\"](https://www.theguardian.com/us-news/2016/nov/09/putin-applauds-trump-win-and-hails-new-era-of-positive-ties-with-us?CMP=share_btn_tw)", "I wonder if Donald's being blackmailed by Russia. ", "Thanks for keeping that quiet Comey.", "Out of curiosity what happens if something illegal were discovered at this point?\n\nWould it be (legally) disqualifying? Would Pence rise to the top, or would he be implicated too as he was part of the campaign?", "Yeah this 'heal the divide' shit is bullshit.  It's on motherfuckers.", "I agree about his speech. One important detail to note: he was very magnanimous towards Hillary. A good thing. But his base wants her locked up so he's already causing discord within his crowd. Oops.", "Coal is not coming back not even if a coal miner wins the presidency.", "No WaPo you are not allowed to flip flop positions after the fact. From the very start, your writers and the highest members of your institution vehemently worked to [smear](http://nypost.com/2016/10/12/how-the-washington-post-killed-bernie-sanders-candidacy/) Bernie without pause. By publishing sensationalist op-ed pieces like, \"NOMINATING SANDERS WOULD BE INSANE\", you and your editors were complicit in perpetuating the notion that Bernie was never a viable candidate and that only HRC could ever hope to thwart a Trump presidency. No amount of backtracking  will negate the damage you've done. To do so now is yet but another disgusting display of your newspaper's lack of journalistic integrity.\n\nBut then again, this is to be expected from a paper that actively engages in shady journalistic practices.\n\nFor those unaware, The Washington Post made history this year by being the **[First ever Paper to Call for Prosecution of Its Own Source \\(After Accepting Pulitzer\\)](https://theintercept.com/2016/09/18/washpost-makes-history-first-paper-to-call-for-prosecution-of-its-own-source-after-accepting-pulitzer/)**.\n\nSummary: In 2016 WaPo became \"the first-ever paper to explicitly editorialize for the criminal prosecution of its own source (Snowden)— one on whose back the paper won and eagerly accepted a Pulitzer Prize for Public Service.\"\nSo first WaPo uses the information leaked to them by Snowden to publish articles exposing the metadata collection program PRISM. In so doing, WaPo journalists congratulate themselves and request that their paper be awarded the Pulitzer Prize for Public Service; which they win. Once Snowden was no longer an expedient tool for pushing their papers, the editorial board of the Post takes out a page stating in no uncertain terms that \"no public interest was served in exposing any of the programs\" that Snowden leaked, that he should be refused a pardon, and that he should stand trial on espionage charges. Note that no other paper who obtained leaked info from Snowden (i.e NYT, guardian) has called for his arrest.\nWhether Snowden is guilty is debatable, but for the Washington post to explicitly demand his arrest after he won them the Pulitzer (for public service no less) is disgusting. The hypocrisy of the Washington Post is mind boggling.", "Defense contractors' stocks saw a big hike right after the election if that tells you anything.\n\nhttps://theintercept.com/2016/11/09/defense-industry-stocks-surge-following-donald-trump-victory/", "The most ironic part is that the same people who elected Trump were the ones calling Obama a pussy for not starting a war when Russia invaded Ukraine. Now they will praise Trump for \"dealing\" with the Russians by letting them do whatever they want while our allies sweat it out.", "I'm sure the FBI will look into it /s", "It was so weird seeing extremely Christian family members post about how \"They prayed to God that the right choice would be made and then it was!\". \n\nLike what? ", "The Hunt for Red October\n\nAdm. Painter - (Fred Thompson): What's his plan?\n\nJack Ryan (Alec Baldwin): His plan?\n\nAdm. Painter - (Fred Thompson): Russians don't take a dump son, without a plan.", "I think it's hilarious how many honest Hillary supporters got accused of being paid shills but we have far more evidence that people paid by the Russian government were posting all over to try and sway opinions.", "I wonder how long it will take them to realise that Hillary is no longer relevant and that Trump must now be defended without reference to her. ", "Reddit still doesn't get why Trump won.\n\nThe sheer level of insufferable arrogance from upper-middle class liberals that dominate Reddit discussion is a massive reason why.\n\nA huge part of why nationalism (whether it's Trump or Brexit or populist parties Swedish Democrats in Sweden Front Nationale in France, and others throughout Europe) is seeing such a surge in support is in opposition to the CONSTANT liberal circlejerking in the media and refusal to even consider that the working class isn't a bunch of idiotic, evil racists, but bases it's vote on real world experiences that they go through and rational self interest. They are sick and tired of sneering upper middle class liberals scaremongering about anybody who isn't part of the political establishment and being called racists for wanting to maintain a national sovereignty and set of values. They are sick and tired of being told they don't know whats best for them by young people who have never experienced Britain before the EU. People are sick and tired of ad hominems being the dominant form of discourse from the left whenever issues relating to protecting our national borders and culture come up. They are sick and tired of their acquaintances screaming on Facebook UNFRIEND ME IF YOU SUPPORT TRUMP YOU RACIST BIGOT. The entire mendacious edifice built around shaming people who dissent against the PC orthodoxy of cultural relativism and globalism is doing nothing but backfiring on the left all over the world, and will continue to do so.\n\nThe upper class journalism/media types who tend to lean left, and liberals in New York who don't see a problem with globalism are the types of people who aren't affected by it like the native working class. They get to live in gated communities and in expensive apartments surrounded by other upper-middle class liberals, and don't have to interact with those Muslim migrants who are completely unwilling to assimilate into Western culture like the working class who lives around them. They also aren't as affected by the complete gutting of industrial jobs, the massive increases in real estate prices completely pricing average Americans out of their home ownership or the huge pressure on the labor market and welfare system by lax immigration policies. It's easy to pat yourself on the back and circlejerk how cosmopolitan and tolerant you are for supporting virtue signalling policies when they don't directly affect you, and call everyone who dissents a bigot.\n\nThe multicultural utopian worldview would quickly collapse when faced with the reality that working class people deal with, and perhaps maybe then they wouldn't just dismiss their perfectly valid concerns. And maybe the left may start seeing the votes not constantly slip away into the arms of populists who at least listen to these concerns, instead of demonizing them. \n\nAnd until all of the professional class elitists get their head out of their little bubble and get in touch with what matters to the common man, [we will continue coming out to the voting booth and burning your entire globalist establishment to the fucking ground.](https://streamable.com/q3s2)\n\ncredits: /u/rationalcomment", "As a liberal who hates trump I am tired of seeing democrats act shocked about this. Don't be shocked, learn from our mistakes so that we can correct it within 4 years. There is nothing we can do to stop trump from being president, but we CAN try to stop him from his second term. ", "Probably my favorite part about all this. I can now criticize Trump without hearing \"B-B-But Hillary.\" Nope. It's just Trump now. We get to keep digging up his demons and there's no more deflection. ", "I can't wait to see how everything it still liberals' fault at the end of this.", "Wait woah woah woah Trump supporters told me yesterday that Russia was never involved with his campaign and that was a liberal scare tactic!", "But do you know why people don't listen to Micheal Moore?\n\nHe's been the victim of a nonstop media blitz aimed at discrediting him for decades. Even Reddit talks about his work as \"out there\" as a result of this false narrative. Watch any piece by Fox News about him. It's always childish monikers in front of his name like loony cooky, and yes even \"crooked.\" \n\nSound familiar?\n\nEdit*** did not expect to gather so many Fox News anti Moore talking points.  Some interesting ones below.", "Don't forget Net Neutrality. ", "Until they find out they got conned by a con man and revolt again in four more years. \n\nHillary had plans. It's not my fault \"middle class\" America is too lazy and illiterate to read a policy platform. \n\nThe backlash against modernization and globalism by the uneducated working class is what caused World War 2. \n\nLuckily for me I'm not going to be the one that suffers from this election. ", "I can't think of a better way to make a third party candidate viable. This seems like a solid idea.", "No no, they are just scared and misunderstood. Haven't you heard?", "Wait why does the headline single out black Americans specifically?\n\nIsn't it everyone living in NY, CA and TX, no matter what their color?", "This won't make any difference. Donald could shit on the American flag while kissing the Russian one and he'd still be worshipped.", "&gt; She's a terrible politician. She's always been a terrible politician. It has nothing to do with being a woman. Margaret Thatcher could have crushed her with one hand.\n\nAnd more than being a terrible politician she's a terrible person.\n\nAnd the woman thing? She got fewer votes from women than Obama got - both in absolute and percentage terms.\n\nI bet the majority of people were like you. Very begrudgingly voting for one of them not as a vote FOR them, but as a vote AGAINST the other. The numbers that genuinely supported either party in this vote is probably surprisingly small.", "Wait for \"the problems are due to how bad Obamacare was it'll take another 4 years.\"", "The definition of bigot is \"a person who is intolerant toward those holding different opinions.\"\n\nThat sounds eerily familiar to the attitude of this sub.", "How can the electoral college and the Republicans accept this blatant manipulation. Sergei Lavrov pretty much brazenly admitted they were behind the Wikileaks leaks. This is absolutely a scandal and I want to hear what ever Republican has to say about it.\n\nSince people don't believe the Segei Lavrov quote.\n\nhttps://www.theguardian.com/us-news/2016/nov/09/putin-applauds-trump-win-and-hails-new-era-of-positive-ties-with-us?CMP=share_btn_tw", "I was going to disagree about Putin entering a NATO state within a year... There are still member states like France Italy, Germany and the UK who have military teeth. Russia would want to test things out, taking chunks of several non-NATO countries and check how everyone responds. \n\nBut then I noticed that Turkey is a NATO member, and with what's going on in there, it's  possible that Turkey could *\"invite\"* the Russian military inside. ", "Unfortunately I see your bet as safe. And if he does enter a NATO state and article 5 is not activated to push Russia out by military means NATO is dead the next day. Why would anyone keep being a member, when it no longer guarantees their security. And so ends the transatlantic era.", "Because they didn't wanna see it and were willfully ignorant. They were all too busy trying to find ways to incriminate Hillary because of Clinton Cash. ", "Republicans control all branches of the government and the FBI.  They will do whatever the fuck they want with impunity.  We are beyond law now.", "Turns out Trump inspired him to finally finish TWOW", "&gt;He denied allegations of Russian interference in the election but said “maybe we helped a bit with WikiLeaks.”\n\n&gt;The Obama administration accused Russian authorities of hacking Democratic party emails that were leaked to WikiLeaks. Putin has previously dismissed as “nonsense” claims of Russian interference.\n\nFuck literally all of the useful idiot liberals claiming it was just a neo-McCarthyist red scare.", "This happened after Brexit too. Lots of racists feeling very empowered right about now.", "They can say it all they want but now that Trump is president, his actions stand on their own. Hillary is at home taking a nap. It's Trump time now, and his supporters get to answer for him and everything he does. ", "&gt;Asked for clarification about the meetings Foreign Ministry spokeswoman Maria Zakharova countered: “Are you paranoid?”\n\n“It seems to me that you’re not far from having your own 1937,” she wrote in an electronic message, in a reference to the height of Soviet leader Joseph Stalin’s purges.\n\nNot to mention this statement. ", "Shit man he said it in July, and explained exactly how: http://michaelmoore.com/trumpwillwin/", "&gt;I can now criticize Trump without hearing \"B-B-But Hillary.\"\n\nThey're still gonna \"B-B-But Hillary\" you.", "they are hailing it as trump avoiding ww3.", "I only remember The_Donalds supporters saying it was a Neo-McCarthyist red scare. \n", "I rarely agree with him either and he imo, is right on #1-4. \n\n.#5 is kinda bullshit because if the election were popular vote, many different people would have voted from states that are red/blue locks before the election. It's just as legit to say only 25.70% of eligible voters voted for clinton compared to 25.61% for Trump or that she only won 18 states compared to Trumps 31/32 - just a made-up metric that is meaningless in the context. She doesn't have some kind of popular following, neither does he, but ...\n\n", "They weren't even Hillary's! They were Podesta's.", "Race baiting gotta stir the pot to get those clicks!", "Nice job America. If you listen closely enough, you can hear Putin laughing his ass off. ", "The last twist of Putin's knife here will be in to the back of our new President. Come Jan 20th after our President is sworn in to office the slow leak we saw on Hillary Clinton, will happen to our President. It will start with emails, high placed sources, and damning materials being leaked - maybe through WikiLeaks, maybe elsewhere. \n\nWe only found out about the Billy Bush tape at the end of this campaign. Our President-elect never had oppo research done on himself, he did not want it. Imagine what a truly world-class intelligence apparatus with malicious intent has in their possession at this point against someone who was never really vetted.\nOur President-Elect has the lowest vote total in two decades. More Americans voted for his opponent then they did him creating a true grievance. We are already seeing the anger build and the calls to reverse this election due to a historically fluky apparatus. \n\nIf you wanted to sow the seeds of the destruction of the US this is how you do it, make the US turn on itself. Pit one side against the other.\n\nI hope and pray for our country and God I pray I'm wrong, but that's the move I would make if I were Putin.", "Of course it will.  There's never been any doubt as to the Obamacare replacement that Republicans have in mind:\n\n1.  Be rich.\n\n2.  If you aren't rich don't get sick.\n\n3.  If you aren't rich and you get sick die quickly.", "How unlikeable was she? Look no further than Trump... \n\nIt's not because she's a women here are legit reasons: she didn't run on policy, she made all her opponents out to be enemies (both Conservatives and Progressives, hiding behind sexism and racism), she remained silent on key issues (North Dakota Pipeline, Keystone Pipeline, BML movement), Wikileaks proved she colluded with the media and DNC against Sanders, she hired Debbie Wasserman as a fuck you to Progressives after she was found out, she refused to stop taking money from Super Pacs many of which represented contradictory promises, **multiple whistle blowers who were going to testify against the DNC mysteriously died**, she wouldn't release her Goldmann Sachs speeches, and she noted for Iraq. \n\nIt's still shocking Trump won, but the writing was on the walls since the primaries ended. ", "Paint everything blue!! Start shouting leftist ideals at your animals ", "I'm sure it'll be something nonsensical. When we have people blaming Obama for his Hurricane Katrina response all bets are off.", "Please no more electoral college, as a new york state republican, I would love my vote to actually count for president for once... ", "It's not misleading. There's a reason why Carter Page and Paul Manafort is under investigation for their dealings with Russia while working for Trump. Also if it wasn't an issue why did the Trump campaign try to distance themselves after all this broke out?\n\n&gt; [Intelligence officials in the United States are investigating whether Carter Page](http://foreignpolicy.com/2016/09/23/trump-advisor-under-investigation-for-russia-ties-report/) a businessman described by Donald Trump as a foreign policy advisor, has been making backroom promises to Moscow to lift some sanctions against top Kremlin officials if Trump is elected.\n&gt; \n&gt; In recent briefings with senior members of Congress about apparent attempts by Moscow to influence the presidential contest between Trump and Democratic nominee Hillary Clinton, intelligence officials have raised concerns about Page’s travels to Moscow, according to a Yahoo News report on Friday afternoon. Intelligence officials believe Page has had meetings with Russian officials currently sanctioned by the Treasury Department for involvement in Russia’s “illegitimate and unlawful actions in the Ukraine.” Many top Kremlin officials and business associates of President Vladimir Putin are in U.S. sanctions crosshairs.\n\n&gt;[But U.S. officials have since received intelligence reports that during that same three-day trip](https://www.yahoo.com/news/u-s-intel-officials-probe-ties-between-trump-adviser-and-kremlin-175046002.html), Page met with Igor Sechin, a longtime Putin associate and former Russian deputy prime minister who is now the executive chairman of Rosneft, Russian’s leading oil company, a well-placed Western intelligence source tells Yahoo News. That meeting, if confirmed, is viewed as especially problematic by U.S. officials because the Treasury Department in August 2014 named Sechin to a list of Russian officials and businessmen sanctioned over Russia’s “illegitimate and unlawful actions in the Ukraine.” (The Treasury announcement described Sechin as “utterly loyal to Vladimir Putin — a key component to his current standing.” At their alleged meeting, Sechin raised the issue of the lifting of sanctions with Page, the Western intelligence source said.\n\n&gt;U.S. intelligence agencies have also received reports that Page met with another top Putin aide while in Moscow — Igor Diveykin. A former Russian security official, Diveykin now serves as deputy chief for internal policy and is believed by U.S. officials to have responsibility for intelligence collected by Russian agencies about the U.S. election, the Western intelligence source said.\n\nAnd there's plenty of more people on Trump's team that also have suspicious ties with Russia. ", "I hope they fucking do their job this time. They kept pushing the emails so hard and made into something much bigger than it was while they barely talked about Trump's failures of paying taxes how he ran his companies into bankruptcies and conned so many people. ", "Clinton had a message alright its just that what she said and what she did were two different things. Talking about tax reform, then arranging private meetings with Wall St. execs. Talking about criminal justice reform, then being given special treatment by the FBI.", "The alarms were going off months ago. Everyone knew Manafort was working for Putin in some capacity Republicans and the media couldn't have given less of a shit about it.", "Sure this is undoubtedly true but that very fact illuminates what a joke the electoral college is in today's context. Tons of people voted third party or did write-in votes because they believed that the result in their state was preordained and I suspect that that is not a phenomena that was isolated to California and New York but rather took hold in Wisconsin and Michigan as well. If we didn't have this asinine system we wouldn't be able to decide that our vote didn't matter simply because we happen to live in New York rather than Ohio and I would wager that a lot more people would have voted for Clinton this time around if they couldn't rationalize that their vote was meaningless.", "Definitely when. The USA did it which means any country who has a similar candidate now has a green light to do it too. ", "Not only did he give Sanders a platform whenever he had a celebrity on his show who was a Bernie supporter, he routinely gave them a platform to plug Bernie Sanders. \n\nSeveral times, in the primaries, he'd have a celebrity on, say something like \"so are you feeling the bern?\" or something to that, effect, celebrity says yes, audience cheers, and the celebrity talks about how awesome bernie is for a few minutes.\n\nHe made jokes about Bernie because he made jokes about *everyone*, including Hillary. The idea that he was some pro Clinton Anti Bernie guy baffles me.\n\nI say this as someone who likes Bernie and watches Colbert's show regularly", "For a lot of poor working class people in areas like the rust belt no one has cared about their concerns for decades. Neither Democrats or Republicans bothered to do anything. If anything a lot of coastal elites smugly mocked what they were going through. Trump is one of the few candidates willing to address their concerns (granted so did Sanders, but the DNC screwed him). I'm rather skeptical about what he'll accomplish, but I get why he appealed to them. But I'm sure if you continue to insult them, you'll win them over any day now.", "I'm from Michigan. Basically we had one guy who is probably lying but said he would help us Vs. Another party who openly mocks us and tells us we're idiots who need to shut up because we don't know what our own problems are.\n\nShocking they voted for the guy making likely empty promises.", "They come out with this now like a big-fuck you to America and all the idiots that voted for this conman.\n\nI can hear it in a Ruski accent \"haha, stupid Americans, we got you to do it!\" \n\nGorbachev: \"Oi Vlad, I can't believe we got them to fall for it! Hahahahaha...\"", "Coal country was filled with high school dropouts that were making $80k plus in the mines.  They can't make that living any other way.\n\nThey won't accept that life is over.", "And the Bloomberg story \n\nhttp://www.bloomberg.com/news/articles/2016-11-10/russia-says-it-was-in-contact-with-trump-s-team-during-campaign\n\nSaid they talked with both Clinton and Trump campaigns. ", "&gt;denied interference\n\n&gt;\"Maybe we helped a bit\"\n\nJust fuck my election up fam", "[Rich words from the same Washington Post that ran 16 negative stories against Bernie in 16 hours](http://fair.org/home/washington-post-ran-16-negative-stories-on-bernie-sanders-in-16-hours/)\n\nFredrik DeBoer is consistent in his dismissal of Clinton so I'll give them that. Fuck Washington Post.", "[I said it back in April look at the first comment reply to me.](https://www.reddit.com/r/SandersForPresident/comments/4glq4y/ri_pa_md_de_ct_results_mega_thread/d2iwrd5/)", "Yeah its easy to get millions of votes when you rig the system and spin a narrative that makes people think they have no choice. If all this and colluding with the dnc for the debates isn't stealing the election from Bernie I don't know what is. If Clinton would have played fair and square Bernie would be your country's president. If hillary didn't waste down ticket money on her self the republicans would have less seats. She fucked all of you for personal gain giving her a pass will lead to history repeating it's self.", "Yes the same spineless GOP that let the tea party do whatever the fuck they wanted. ", "But have you heard about *Hillary's emails*?", "She lost to a black man in one election and a racist in another. ", "&gt; She had a chance at being the first woman president and she blew it on the worst candidate in history. \n\nHonestly I'm not sure she ever really had a chance. She had a lot of problems, whether they are real or cooked up for partisan reasons - The Clinton Foundation, emails, 1990s stuff *(super predator, crime bill, basically all of bill's legacy for some reason),* Wall St. speeches. I don't understand why she would do these speeches, or run the CF, or have a private email server if she knew she was going to run again. I thought she was supposed to be super cautious.\n\nAlmost any one of those would have tanked a candidate, and Hillary already had character perception issues. They all served to paint her as corrupt, elite, etc. On top of that, what she was perceived to represent was just wrong for this this particular election.\n\nPoint is, she never should have ran. I don't have anything against her personally but she brought *too much* baggage to the table and it helped ruin her candidacy, even against Trump.", "He's not a Bible-thumper nor a white nationalist, has political experience, and he's not a conspiracy theorist. This is pretty rare from the GOP these days.", "This is literally. Exactly. What was said about Bernie Sanders in the primary. \n\nI don't know who you support but no, Bernie Sanders needs to tell the fucking truth, and that starts with throwing some motherfucking shade at the DNC\n\nOne of the reasons we have a president-elect Trump right now is \"Bernie needs to unify liberals, it doesn't matter what the truth is he just needs to cheerlead for Democrats better\"", "Remember he's responsible for deaths that occurred when W was president.", "It would be pretty funny if Wikileaks suddenly started dropping proof about shady shit the Trump campaign did.", "If /r/sandersforpresident ever starts back up it needs to be under new management.\n\nAt the very end the mods went fucking nuts and started making insane decisions like censoring their own subreddit and shilling for Clinton (before Sanders' campaign was even close to over).", "Yeah seriously she was the only one actually talking policy in the debate. ", "Absolutely. We have entered an age where intellectualism intelligence, and education are being looked down upon. ", "As a Canadian the voter suppression tactics from state to state is almost incomprehensible. It's a *Federal* election. You need *Federal* election rules and laws that apply across the country. Until that happens, expect the same voter apathy and disenfranchisement. \n\nI'm not saying that the Canadian system is superior or that we don't also have flaws; we absolutely do and voter turnout is also embarrassing here sometimes. But, we have any number of ways to vote, all federally mandated and identical across the country. You can request a ballot by mail, you can vote early and there are plenty of polling stations. The most I think I've ever waited to vote is half an hour. ID requirements are also the same across the country and there are so many different acceptable types that literally **anyone** who wants to vote can. \n\nIt saddens me that so much time and effort is put into keeping people from voting. \n\nEDIT: Also, what the fuck is with your \"voter registration?\" Can someone explain why this is necessary? In Canada you don't need to do anything in advance to cast your vote on election day (or early voting). \n\nIf you are over the age of 18 you show up at the poll for your area. If you have the same address as the last time you voted, they will have you listed in a huge book of voters. They will check your ID and cross off your name in the book. If you've recently moved to that area (or are a first time voter) you bring your ID or if your ID's haven't been changed yet, a bill with your address on it. They write your name down and you vote.\n", "Yeah this sub has been a fine example of hate propaganda. Perfect illustration of the tolerance the left has shown this last decade.", "Because Americans are the dumbest people on the planet. ", "&gt; 3. Any Democratic member of Congress who didn’t wake up this morning ready to fight resist and obstruct in the way Republicans did against President Obama every day for eight full years must step out of the way and let those of us who know the score lead the way in stopping the meanness and the madness that's about to begin.\n\nThis a thousand times. Republicans may have written the book on obstruction, but Democrats will perfect it.", "This is important to remember. A lot of people are now saying that Obama's legacy will be squat once the Republicans repeal everything. But repeal or not the country *will* eventually have universal health care and a lot of other things Obama fought for. \n\nEverything of Obama's they undo will only last until the Baby Boomers die off, and it'll be under the cloud of \"done by the birther who followed him into office\".", "Yeah The Pentagon and CIA will be purged and replaced by GOP/Trump Yes men.", "I mean he's still an unhinged anti-abortion extremist and his economic plan would be a complete catastrophe. \n\n\nHis economic plan that we're probably getting regardless of which one of these three people is president. ", "I thought so too but apparently a lot of America (and not just average old white working class Joe I'm talking these goddamn media pundits too) can listen to Trump say \"NAFTA IS HORRIBLE I'M GOING TO REPLACE IT WITH A NONDESCRIPT THING WHICH IS SO MUCH BETTER\" and actually delude themselves into thinking he was making a substantive argument on trade", "\"Cost of living too high? Let's send your 8 year old to work instead of school.\"", "And a bunch of poor people will support their plan. Unbelievable. ", "I had no idea they were real!", "Did the WaPo cover the video of that white man getting beaten up by black people for voting Trump?", "As much as I disagree with trump and his supports this is NOT the way to treat them. Treat them with respect. They are humans with family too. Just because you think they made a mistake doesn't mean you can physically harm. You are protected under the constitution to protest and demonstrate peacefully. You are not protected under the Constitution to hurt them.  ", "And get president pence? Absolutely.", "&gt; basically all of bill's legacy for some reason\n\nThe thing is if you put yourself up as the most experienced candidate because you supported your husband and his policies, you have to take the bad with the good. If your questionable history can be so easily used against you, perhaps don't use it as one of your selling points.", "The FBI wanted Trump to win so of course they would hide any communication.\n\n", "&gt; America the stupid. \n\nYou realize attitudes like this helped Trump win.", "Oh no someone called me stupid! ;_;\n\nBetter prove them right! That'll show 'em!", "What?  You have Black Lung?  oh shit that's a pre-existing condition.  Sorry.", "Putting on my Machiavellian hat\n\nIf you are Putin you don't want Trump ousted, you want him wounded. It does him no good to have Trump impeached and resign, he does do him good to see him completely bogged down in internal fights and facing constant backlash. Nothing illegal will come out, at least from the Russian side.", "No shit New York Times.\n\nBlow it out your ass.", "His pre-election speech about why people will vote Trump was spot on as is this.\n\nAnd of course the media was already busy on election night blaming everyone **except** the people who deserve it: Hillary, the DNC, and themselves.", "A lot of people will be SOL when they repeal obamacare but insurance companies will never reduce their prices.  In 2 or 4 years when prices remain high or increase, all those people who think obamacare caused it might be ready for single player or universal healthcare.\n\nThen again, they elected Trump, so who knows what new lies they'll believe.", "Russia imprisons protesters and homosexuals and stifles free speech. It's only natural that conservatives idolize them.", "&gt; I find that strangely comforting.\n\nSame here. While I'm not excited by a Trump presidency I am comforted by the fact that one of the largest machines in terms of collusion, GOTV operations, media influence, celebrity influence, name recognition, financial spending, and more was defeated by populism. Clinton outspent Trump and had a much better organization and she was beaten.\n\nWhile it's not the results a lot of us wanted, it should at least bring comfort that elections can't be bought.", "I bet Trump is an atheist. ", "Trump's clearly a monotheist and he's his own God.", "She lost Pennsylvania Wisconsin, Michigan, and only very narrowly won New Hampshire. She lost to a guy who's middle name is Hussein and Donald Trump. I never want to hear about Hillary Clinton (or Tim Kaine) ever again.", "As did the the hope for global environment and energy reform. The Paris Agreement was a glimmer of hope in the darkness and Hillary's energy platform while weaker than I'd hoped, would have been a major step forward. Now we have a climate change denier in the White House who will not only stall for another 4 years, but set us back by additional *decades.* We needed to act 30 years ago. Now the next Democratic administration will be forced to take drastic and expensive measures just to prevent our environment and energy security from utterly collapsing, but not prevent a steep decline, just like Obama had to do with the economy and financial sector.\n\nClinton Derangement Syndrome is literally a natural disaster.", "Don't forget poisoning journalists with radioactive isotopes. ", "But trump was the peace cannidate!", "But not now because the timing could effect the election and the FBI would never do that", "Yup we lost this election because we called them mean names. But at the same time we are the hypersensitive SJW whose attack on white America caused such a giant Trump surge. ", "We had a guy get more individual campaign contributions than any other candidate in history run a wildly popular campaign and they shit all over it. No fucking shit fellas.", "Mainer here who voted Yes on 5 (and got all of his family and friends to do so.) We also passed (likely) pot legalization a raise on the wealthy to pay for our school systems, and a raise to minimum wage to $12 over the next 3 years. \n\nI am proud that we passed these things and can be a part of leading the country forward in our own small way. :)\n", "That's right. Because that thrice-married blasphemer said that he would go out and nominate conservative judges. They don't care about who he is as long as he serves their interests. And so they went out and voted Trump.  ", "Nominating Clinton was like coming to a restaurant and the chef tries to convince you to order the Lasagna that you did not want to have the night before, just because you did not give it a fair chance the first time. \n\nPeople did not want her in 2008. That should have been the end of it. ", "He's also said he wants to build 400 destroyers and completly retrofit airforce. ", "And shooting opposition voices dead in the street.", "Hillary's astroturfing was a sight to behold. That's another story.\n\nBut as for someone holding up Hillary as the anti-war candidate is ridiculous. She rarely saw a war she didn't like.", "He said that he doesn't ask forgiveness from God which is an essential part of Christianity. I never hear him talk about his personal beliefs in any way. I suspect he is either atheist or agnostic, but speaks *to* Christians, which they appreciate. ", "I think the fact that Putin came out immediately after the election trying to \"mend fences\" was about as forward as they needed to be on the subject.\n\nWe elected a fucking puppet because of some god damn emails", "She's part of a family that has been using insider trading and positions of powers to enrich themselves for decades, starting with that magical $1,000 investment she made in the 80's that made her $100,000 by \"studying the market\".  Chelsea is now worth $15,000,000 for doing jack shit, and people are tired of the corruption and the bullshit politicians we have been seeing for forever.\n\nAll that leads to the US now having Trump as our future president.  That is how much people hated Clinton, Trump is our future president...\n\nBoth parties have to drastically change to catch up to the times.", "The House has already announced that it has formed a investigative committee.  Haha j/k", "The fact that people really think I or most other people voted for Hillary because of anything other than stability is insane. The woman had a plan. A very detailed plan for everything. She tried explaining her plans nobody listened. ", "Oh don't be so harsh, OP.\n\nWorking class voters just elected an employee-abusing billionaire who doesn't pay income taxes.", "Not to mention that the disgusting reptile in charge of that operation David Brock, went down with the ship. I only wish I could have seen the look on his face.", "Avoiding ww3 by letting Russia bull doze over eastern europe", "Not so simple. Moore discredited himself with really misleading pieces edited to spin a narrative out of thin air. For example there are several egregious errors in Bowling for Columbine that are nothing but downright dishonest. ", "\"But I say unto you That ye resist not evil: but whosoever shall smite thee on thy right cheek, you have to take out their families, don't kid yourself. You have to take out their families\"-Jesus during his sermon on the mount", "I can't help but feel they started the \"Hillary will start a war with Russia\" meme among Trump supporters. This is something I saw only on Reddit and not in the media.", "Allowing foreign aid to nations that have abortions (this was against the rules under bush). \n\nNuclear weapons treaties.... Which trump says he'll rip up on day 1. \n\nScientific Research. \n\nSane taxation. \n\nConsumer protections finance reform.\n", "No that's wrong. They saw the evidence. \n\nWhat happened was that Comey thought it was too close to an election to say anything about Russia and Trump, for fear of influencing the election. But Clinton and her Emails, well *that's* fair game...\n", "Now everything is your fault enjoy.", "Hillary Hubris.  Everything she touches turns to shit.", "I bet a lot of people her forgot how ugly her race against obama was. All the shit Sanders supporters get blamed for making up she did a lot of the same crap then. ", "Lets examine the likelihood.\n\nRussian intelligence services are infamous for using honey traps.\n\nTrump has been to Russia for pageants.\n\nTrump is known for trying to come on to women he finds beautiful strong.\n\nPageant-age women usually find the idea of a guy his age repulsive so he gets rejected often.\n\nSuddenly in Russia a couple come on really strong and thinks he is *irresistible and so sexy*.\n\nGoes to their appartment or prerigged hotelroom.\n\nGets encouraged to get **really** freaky. Choking/playrape/the works.\n\nProfit.\n\n\nYup...checks out.\n\n&amp;nbsp; \n\nEvery single embassy staff, government worker and generally businessmen in large companies from every country are warned *not* to fall for unusually attractive women coming on to them in Russia. Has always been that way.", "\"To the 'Bernie or Bust' people you're being ridiculous.”", "Hey hey hey..Let's not forget the big picture here Putin is ex-KGB and they have only ever wanted the best for America. ", "Because republicans are in power now. That's really all that matters to them. This so called \"drain the swamp\" motto that Trump took hold will fall apart early February, why? Because he's placing insiders in key positions in his cabinet, among other places.\n\nIt seriously has a chance to devolve into similar political cronyism that Russia has. With an adoring audience that is Trump's supporters who see him as he can \"do no wrong.\" Meanwhile rolling-back social progress for the rest of the nation, so a few evangelical conservatives can have their status quo.  ", "The Washington Post now has less credibility than Fox News. Try to wrap your head around that one.", "No on turkey. Since turkey shot down one of Russia's jets Turkey has tried to cool down tensions but there is an deep animosity between Russia and Turkey that goes back centuries. ", "It sucks that the MORONS who voted for this clown will all be long gone by the time the consequences of their STUPIDITY materialize enough where they would directly suffer because of them.", "yep.  laying down ignoring your allies, only worry about yourself.", "We are all fucked.\n\nCanada just had an election with two fairly progressive candidates. I'm scared for the next election even though it is so far away because the idiots here are already propping up alt-right rhetoric and alt-right goons. I'm terrified and probably won't sleep well after this.\n\nGermany has a fucking conservative government (by their standards) in power but that's not enough for the so called alt-\"right\". They're nothing more than fascists, there is nothing right about them. ", "That's what made me immediately discount her as someone I would vote for.  I actually pay attention to US foreign policy and her time as SecState was deeply troubling to me. ", "I feel like we tried that before WWII", "Libya Syria, Honduras, Egypt...sorry, not sorry, the Syrian refugee crisis was not one borne out of the West's lack of compassionate admission of refugees, but rather, the West's destabilization policies in the ME. And Hillary was a huge part of those policies.\n\nIt's astonishing that more people on the Left didn't point out that the NeoCons in the Republican establishment praised Hillary and, many of them at least, publicly stated they were voting for Hillary.\n\nColin Powell, the guy who lied to the UN about WMD's, voted for Hillary.\n\nAnd Hillary was the anti-war candidate? The one who voted for the authorization of force? Just how did Americans forget that Hillary lost to Obama largely because he was seen as anti-war and Hillary as pro-war?", "&gt;I believe Trump is going to focus much of his attention on the four blue states in the rustbelt of the upper Great Lakes – **Michigan Ohio, Pennsylvania and Wisconsin**.\n\n:(", "And almost lost to a socialist jew even with the party behind her. ", "And now conservatives are praising Russia. What exactly is your point?", "I feel like at some point during the campaign trump said he'd like to invade Iran. Or is that just my imagination?", "Oh I got downvoted to oblivion during the campaign for citing Clinton's unambiguous race-baiting in '08. Remember \"hard-working white Americans\"? Like, what is the word \"white\" doing in that sentence? As if we didn't know.", "&gt; CONSTANT liberal circlejerking in the media and refusal to even consider that the working class isn't a bunch of idiotic evil racists, but bases it's vote on real world experiences that they go through and rational self interest.\n\nIf you didn't want liberals to think that, you probably shouldn't have nominated an idiotic, bigoted, fraud, without any policy understanding whatsoever. I'm not denying that liberal elites have been in a bubble or that this is why Trump got elected, but society has an obligation to describe Trump objectively - even if it hurts your feelings.\n", "What communities do working class Americans think will be most affected by gutting the EPA (or not even having an EPA?) \n\nWhere do they think companies are going to send their waste or concentrate their pollution - in working class communities that can't fight back. \n\nAnd do they think the states will have enough power to stop them? No they'll be happy they're providing jobs, etc.\n\nI'd like to say this wouldn't happen, but we know it already has and continues to.\n\nSo, there you go - another reason you voted against your own interests Trump voters.\n", "We've just entered the Dark Ages of the 21st century.", "I'm surprised Trump never asked her that. How do you become worth hundreds of millions after leaving the White House worth around 1 million then never holding a job earning over 185k. People saw through that saw through the obvious corruption, the \"barely legal\" world view she holds. The DNC was corrupt because it was corrupt from the top down. Clinton spent the years after 2008 capturing the DNC and corporate media and bent it to her own benefit. \n\nThe DNC basically tossed Tulsi Gabbard out of the Democratic party because she refused to bow down to Clinton, and this was during the primaries, before a candidate was choosen. They cut off funding for her re-election race. \n\nClinton did much more damage to America than simply losing to an idiot game show host. She blew our best hope to retake the Senate. The Republicans were defending almost 20 seats and won almost every one of them. Her DNC strangled down tickets monetarily and funneled the majority of the money raised directly to her. How many Senate races did you see her appear at to rally support for the Democratic candidate? \n\nThe fault of this miserable, overall failure of the 2016 Presidential and Senate elections lies directly at the feet of the Clinton machine.", "Ahh straight out of the 1939 German playbook: Slowly ramp up aggression. First you attack small territories then small countries before going all in on Europe. \n\nWhat does Donald Trump suggest? It almost looks like Appeasement.", "My girlfriend and her family immigrated to the US from Lithuania about 15 years ago and they are terrified. I was able to visit there this past year, and to say that most of the country was paranoid about a Trump presidency even then--this was before the NATO comments or the interview where he said Putin would never enter the Ukraine--would be a massive understatement.", "Every single time she made a policy speech no one seemed to care. Even the most popular changes to her platform only made a couple headlines. And then people ignored it again.", "Is this after he shoots someone on 5th Avenue? ", "Well when you're patrolling the Mojave...", "I was at the same event. I had a Bernie shirt on because I was at his rally earlier in the day. I ran into many people at the event  all were Hillary supporters. I was dismissed by them for supporting sanders and openly mocked by stating \"aw, I was idealistic once too. But don't fool yourself, Hillary is the nominee.\" The person who said that is a close family friend.\n\nI felt like a second class citizen for supporting Sanders. ", "Manafort alarmed me but what convinced me that Trump's ties to Russia were disqualifying was when a former chief of the CIA wrote this:\n\n&gt; In the face of a high-confidence judgment of the U.S. intelligence community that Russia hacked the Democratic National Committee and then weaponized embarrassing emails to sow confusion here the man who would be president has declared: “Our country has no idea,” “I don’t think anybody knows it was Russia that broke into the DNC. . . . It could also be lots of other people” and “They always blame Russia.”  \n\n&gt; Rejecting a fact-based intelligence assessment — not because of compelling contrarian data, but because it is inconsistent with a preexisting worldview — that’s the stuff of ideological authoritarianism, not pragmatic democracy. \n\nTL;DR: In case it's hard to parse that quote, basically Trump got an intelligence briefing that said \"Russians hacked the DNC emails\" and Trump's reaction was \"Nah, wasn't them.\"\n", "My thoughts exactly fuck this newspaper.", "Here's the thing...  \n\nTrump is ALSO backed by the establishment. That was a lie. Look at his appointees. Look at who he surrounded himself with. That was a myth. The establishment still won.  \n\nBetter yet Trump actually didn't gain any real new ground. He's looking at 2012 Romney numbers. If he ran against anyone likable, even if they were establishment, he loses.  \n\nThere was no great movement. There was no revolution. Republicans voted for a republican. Democrats stayed home. ", "You see how you just lumped an entire group together into a stereotype?  Were you just going balls to the wall for most ironic post of the day or are you really that blissfully ignorant to the fact that your mind is rigged for bigotry?", "When she sent Podesta out election night\n\nEveryone should have seen in that moment that she wasn't a leader \n\nAnd America got it right ", "It's a popular narrative from alt-rights in Europe as well.   \nRT was pushing it and is very popular here.", "Yup. Putin is goin to do exactly as he wants when he wants. Trump is a tool to him he's going to use him as he wishes.\n\nGood luck america you fucked up.", "The majority of us know this.", "All he needs to do is say the \"media is lying\" and none of his supporters will believe it anyway. Here come four years of denial.", "Nothing like funramental/Evangelical Christian religion when it comes to picking and choosing your moral philosophy on the fly. ", "I'm not fearful of Trump's policies reckless and destructive as they may be.\n\nI'm fearful of deep-rooted narcissism boiling to the surface. I'm fearful of watching my country openly turn on itself. I'm fearful of watching people erecting walls not on territorial borders, but between their fellow human beings.\n\nIn short, I'm fearful of people's suppressed hatred being invigorated via wanton demagoguery and derision. Validated. Accepted. *Expected*.\n\nWe are capable of so much more than this.", "And casinos and luxurious golf courses. Remember his \"blind\" trust is being run by his sons Uday and Qusay Trump.\n\nBut yah this is probably all over reaction by the wacky left. It's not like he had a campaign manager who worked in Ukraine as an unregistered lobbyist who was getting paid off the books to run scams like this. Oh wait.", "&gt; The multicultural utopian worldview would quickly collapse when faced with the reality that working class people deal \n\nTIL there aren't people of multiple cultures in the American working class. No black people are working class. No Mexican Americans are working class. No Muslims are working class.\n\nYou call us blind and yet here you are dismissing millions of real people offhandedly.\n\n&gt; They are sick and tired of their acquaintances screaming on Facebook UNFRIEND ME IF YOU SUPPORT TRUMP YOU RACIST BIGOT.\n\nI'm not going to apologize for standing by my loved ones that aren't white in the face of people that dehumanize and belittle them.", "Putin is going to be gaslighting the USA for the next four years.", "&gt; It's no time to just give up on the environment it's just time to fight harder.\n\nHow do you propose we do this? We've handed them absolute power by giving them every branch of the government. What makes you think a bunch of liberal protesters are going to stop them from removing every piece of environment protection in the country. They literally don't believe this is a problem. They don't believe in facts/science. We're going to spend the next 100 years cleaning up after the next 4, and we might as well start planning for it.", "This is the irony. This hilarious condescension is the reason they lost. All the suburbs went to Trump. All the rural areas went to Trump. More black people and Latino people voted from Trump than Romney. More WOMEN voted for Trump than Hillary. \n\n&gt;popular vote\n\nVotes aren't done tallying and there are literally millions of voters in Cali and New York that don't even bother because it will never go red. ", "The article up top mentions the Clinton contact but specifies that they \"refused similar requests for meetings.\"", "It's not just going to be everything accomplished in the last 8 years but much further back. Remember that the right is taking aim at stuff that has been a right as long as abortion and the civil rights and voting acts.\n\nPeople don't realize the new SCOTUS judge isn't going to be another Scalia, it's going to be another Justice Thomas and that's far scarier. Scalia was a troll, but he was at least a principled troll. Thomas on the other hand is a religious zealot first and judge second and holds incongruous positions on civil rights, the constitution and the amendments; if you are like him those rights apply, if you are not, they do not.", "I'm just hoping the rumor he's considered palin to be in charge of national parks isn't true =x", "Spot on Russians aren't our friends.. they just like a weakened and divided America.", "If it's anything like with Berlusconi the deals will be secret. You'll never see it with Putins name on it. \n\n&gt;US diplomats have reported startling suspicions that Silvio Berlusconi could be \"profiting personally and handsomely\" from secret deals with the Russian prime minister Vladimir Putin, according to cables released by WikiLeaks.\n\n&gt;Exasperated by Berlusconi's pro-Russian behaviour, American embassy staff detail allegations circulating in Rome that the Italian leader has been promised a cut of huge energy contracts.\n\n&gt;The two men are known to be personally close, but this is the first time allegations of a financial link have surfaced.\n\n&gt;Hillary Clinton's state department in Washington sent a special request to the Rome embassy this year, asking for extra intelligence-gathering on the allegations about the men: \"What personal investments, if any, do they have that might drive their foreign or economic policies?\".\n\n&gt;The US ambassador in Rome, Ronald Spogli, first reported the claims in a series of dispatches in 2008-09. He said the prime minister had taken \"single-handed\" control of Italy's dealings with Moscow, with the over-riding aim of pleasing the Russian leader.\n\n&gt;Berlusconi acted as a \"mouthpiece\" for Putin, he reported, supporting him in public when Russia was being criticised.\n\n&gt;Personal ties between the two were close, \"with Putin's family spending long visits at the Berlusconi family mansion in Sardinia at Berlusconi's expense\". Berlusconi in turn has the rare privilege of being invited to Putin's dacha in the Black Sea resort of Sochi for what the embassy speculated on one occasion would be a \"blow-out party\". A contact in Berlusconi's office told the embassy of \"exchanges of lavish gifts\". https://www.theguardian.com/world/2010/dec/02/wikileaks-cables-berlusconi-putin", "They also beat up immigrants....so they've got that going for them. ", "Pretty soon we are all going to be north of the wall.", "Doesn't matter the GOP is an anti-liberal party.  That's all the stand for.  They're going to keep beating that drum even though they hold control of all branches of gov't now.  Just watch.  ", "Until the third parties change their strategies and really focus on building ground up at the local level which this helps with anyways, this is the best thing they could do to gain viability.\n\nHopefully it comes off well and spreads across the country.", "Did I miss a news cycle where our entire intelligence apparatus confirmed by other countries, came to the conclusion where the Saudis hacked systems in an effort to sway the election?\n\nBecause that's the reason it's a big deal. ", "Well I am in total shock.  Trump has been right all along.  I would of course like to be transported to an alternate universe where Bernie won the primary and see if the outcome changed.  I'm on a phone, so I won't write much more, but suffice to say I am beyond dejected.", "&gt; She tried explaining her plans nobody listened.\n\nI'm not sure about this, but agree on everything else. Like she didn't have a 'policy theme' for her campaign. Even her slogan stronger together was a slight against Trump. Her daily emails begging for cash never mentioned her policy, just a bunch of Trump hate. Like compare the primary policy discussion to the general... it just wasn't there. ", "What just a minute.  Are you telling me that voters prioritized the issues and voted for the candidate that best matched their most important ones?  No way.", "They won't. It was passed with a conservative leaning court and come on you think they'll do anything to threaten thousands upon thousands of current marriages? I suspect they'll steer clear.", "And that's another thing.  This is going to delay ASOIAF because Martin is a huge liberal and gets depressed and stops working when Democrats lose elections.", "Yeah but the left doesn't condone this and neither did Hillary. When two men pissed on and beat a homeless Hispanic man, Trump called them \"passionate\". Big difference there. ", "That was my first thought.  A bunch of bleeding hearts on here talking about \"mending fences\" and \"healing the divide\".  8 years of Republican obstructionism 8 years of being unquestioningly anti-Obama, and we're supposed to \"Respect the position\" and bend the fucking knee?\n\nFuck that shit. The Republicans made this game and we're going to play it better than they did.  If a 14% approval rating do-nothing congress got REWARDED by getting a majority, then guess what we need to do?  Fuck the GOP shit up, get in their way at every turn, and fight harder than ever to stop the GOP from tearing apart the progressive agenda.", "\"Since you guys kept pointing out what jackass hypocrites we are we elected a proto-fascist to lead the nation!\" \n", "Trump adviser Michael T. Flynn was invited to RT's celebration and sat at the main table at [Putin's right hand](http://i.imgur.com/MqjcdR2.jpg).", "Look I despise Trump as much the next guy, but is this really evidence of anything? It would make sense that a campaign as close to attaining power would have contacts with their counterparts in another world power. There could also be a translation error, maybe it should read \"were in contact\" instead of \"have contacts.\" \n\nThere are many other troubling Russia-Trump connections, but I don't see this article in particular as anything to be too alarmist about. \n\nOf course if I misread I look forward to someone correcting me, because Trump is awful and the more evidence against him the better. ", "Run on Anti-establishment rhetoric and fill your cabinet with establishment nincompoops. \n\nThe first *fuck you* to all those who voted for him. This is just getting started. ", "The destroyer thing is soooo fucking stupid our Navy is \"shrinking\" because Navies are becoming obsolete. Ships are big, slow, hard to hide, and \"easy\" to sink. And, if one does start to sink, then there goes all our fancy shit, and our seamen start to drown. \n\nThe best thing about the Modern Navy, is its ability to perform humanitarian relief. I got so pissed off when Pence, in the VP debate, brought up the Navy (it was more of a quip), and how it was weaker than our 1945 fleet. We also have weaker cavalry divisions (the horse kind).\n\nAs for the Air Force, we have so much dope shit, like the A-10 (albeit it is old and nearly useless in a symmetric war). I mean we have the two largest Air Forces in the world. So yeah...\n\nLike I get that we are on the same page, but damn it's so stupid it makes me feel stupider for having to explain it to other people.\n\nEDIT, fixed a word.", "Nope.  *We* handed a surveillance state and the world's most powerful military over to a maniac.  Don't go playing that game.", "First Lady went from being a double Ivy League educated IP lawyer to an ex-Commie Mail-order bride softcore porn ~~prostitute~~ model who plaigirizes speeches from the former.\n\nThe president went from having two lovely kids to four mouth breathing affluenza-ridden scumbags from three different women. Four kids from three different baby mommas.\n\nParty of family values y'all.", "Reasons we warned America not to build a turnkey totalitarian dictatorship...", "The truth is that they literally know so little about the world that they think that \"weaker than our 1945 fleet\" makes them weak which makes them scared and paranoid.\n\nYou know why you had a fucking huge 1945 fleet?\n\nBecause you'd just fought WW2.\n\nThey live in such a fucking vacuum of intelligence that any kind of modern context is foreign to them.", "The guy literally ran on deregulating wall street and the banking industry and had a bunch of these people around him the entire time.\n\nEveryone told them this would happen. They didn't care.\n\nDonald Trump was the corporate candidate.", "Out of all the things I don't want Trump to destroy the environment has to be at the top of that list.", "Pence sounds like an idiot. Our navy shrunk because modern force projection requires flexibility and specialization. We don't build battleships anymore because they're giant slow targets. The Yamato (one of the biggest battleships ever built) was destroyed hundreds of miles away from the fighting by US subs and planes.", "Tldr:\n\nLiberals hurt uneducated and uninformed voter's feelings when they call them uneducated and uninformed so they go out and do things only uneducated and uninformed people would do. ", "Its Obama's fault the NSA spying program is still running. \n\nHe's had 8 years to shut it down. Instead he kept it secret until Snowden exposed it and has just glossed over it since. \n\nIts one of my least favorite things about Obama. \n\nI voted Clinton but this is a perfect example of one of the many ways the democratic party alienated potential supporters. \n\nDemocrats lost because they built up so much dissent, and became so comfortable saying one thing and doing the other that a meaningful number of people couldn't bring themselves to vote. \n\nI'm not happy with how this ended up, but it is important we understand all the reasons this happened. ", "Fuck 2020... We have 2018 to work towards!!!\n\nhttps://en.wikipedia.org/wiki/United_States_elections_2018\n\n&gt; The 2018 United States elections will be held (for the most part) on Tuesday, November 6, 2018. During this mid-term election year, all 435 seats in the United States House of Representatives and 33 of the 100 seats in the United States Senate will be contested. 38 state and territorial governorships and numerous other state and local elections will also be contested.", "DNC (now): EVERYONE ELSE IS TO BLAME. LITERALLY EVERYONE BUT US.", "An extremely anti-Hillary article.  \n\nStill alive after three hours.\n\n80% upvoted.\n\nDamn it's good to have the sub back.\n\nI can't believe Hillary had to resort to paying shills to prop her up in places like Reddit, and I can't believe Reddit allowed it.  How is it legal?  This is psy-ops.\n\n\n\n", "\"FUCK HILLARY AND HER CORRUPT WALL STREET TYCOONS!\"\n\n\"CHEER AND SUPPORT (UNITY PEOPLE) FOR DONALD AND HIS CORRUPT WALL STREET TYCOONS! As a bonus, Caribou Barbie!\"\n\nY'all got played for suckers. ", "But it was Obama! He was *looking forward*. Hope and Change! The future was so bright. It would have been petty to harass him over some silly detail like the legality of torture or Gitmo. It would have compromised his agenda blunted his momentum.\n\nDear Democrats: Fuck. You. This is *your mess.*\n\nEdit: Before the rest of the people in the known universe comment to tell me that Bush signed the PATRIOT Act and created the modern surveillance state: *I know that.* The point is that Democrats had the last opportunity to dismantle it. Obama took office with majorities in the House and Senate, just like Trump is doing now. You guys could have stopped this. You didn't. That ring was just too shiny, wasn't it?\n\nAlso, I'm a lifelong independent, not a Republican.", "Yesterday I got a private message here on Reddit and it went something like this:\n\n&gt;HAHAHAHA. FUCKING FAGGOT! HOW DOES IT FEEL NOW :D :D :D NON-MAN :D LEFTIE :D MISS GAY :D go seek an asylumn from iraq fucking gay! FUCKING NON-MAN! :D :D :D TAMPERE MAGA!\n\nI'm Finnish never even been to the US, and the original message was in Finnish, and the guy has gone through my comment history and knows that I'm gay, and has previously sent messages about smashing my head with a baseball bat.\n\nSo yea, Trump victory seems to fuel some crazy people all over the world.\n\nEDIT: For the curious, [vclip of the baseball bat threat](http://i.imgur.com/LaVDEkO.gif) and a [google translate of it](https://translate.google.com/#fi/en/Eli%20vaikka%20haluaisin%20muokata%20naamaasi%20uudestaan%20pes%C3%A4pallomailalla%2C%20se%20ei%20liity%20mitenk%C3%A4%C3%A4n%20homoseksuaalisuuteen%2C%20vaan%20siihen%20ett%C3%A4%20haluat%20tuhota%20maallistuneen%20euroopan.%20N%C3%A4hd%C3%A4%C3%A4n%20helvetiss%C3%A4%2C%20hinttari.%0ATai%20Sorsapuistossa.). The \"duck in the park\" means \"or see you in the Duck Park\", a real park in the Finnish city of Tampere he asked do I live in, and he referred to in the MAGA message.\n\nAnd [vclip of the message I received yesterday](http://i.giphy.com/Hkx0SdMXSnPH2.gif) and a [google translate of it](https://translate.google.com/#fi/en/AHAHAHAHA.%20VITUN%20HINTTARI!%20MILT%C3%84%20NYT%20TUNTUU!%20%3AD%20%3AD%20%3AD%20EP%C3%84MIES%20%3AD%20VASURI%20%3AD%20NEITIHOMO%20%3AD%20hae%20turvapaikkaa%20Irakista%20vitun%20homo!%20VITUN%20EP%C3%84MIES!%20%3AD%20%3AD%20%3AD%20TAMPERE%20MAGA!).\n", "Maaaaaybe that's the problem with having a war machine and surveillance state?", "Yes Russia and [the US intelligence community was saying this even before the election was over.](http://www.telegraph.co.uk/news/worldnews/europe/russia/12103602/America-to-investigate-Russian-meddling-in-EU.html)\n\n[This has been standard operating procedure for Russia for the past couple of years:](http://www.nytimes.com/2015/06/08/world/europe/russia-fights-wests-ukraine-sanctions-with-aid-and-ideology.html?referrer=)\n\n1. Recognize that a segment of people in Western Societies are unhappy because they've lost status as a result of globalization and neoliberal economic policy. Despite overall global inequality decreasing, intra-national inequality has increased, in the US at least because of decades of new capital accumulating mostly into the hands of the wealthy due to trickle-down economics, lack of corporate tax reform, cutting of social programs and excessive lobbying.\n2. [Promote/fund right-wing/nationalist populist groups in Western countries that feed off of this unhappyness.](https://www.theguardian.com/commentisfree/2014/dec/08/russia-europe-right-putin-front-national-eu)  \n3. Watch as nationalistic, anti-neoliberal populism leads to dysfunction of any organization or teamwork between Western countries.  \n4. Take advantage of this power vaccuum to expand Russian interests in former USSR states (Georgia, Ukraine, Estonia, Poland, Moldova, etc.).\n\nRussian support of Trump is just a continuation of this policy. ", "I feel like this is the introductory part of a future history book's chapter on world war 3. \n\nI know I'm being dramatic but it's still a little scary.", "Warning im a heretic, downvote as you wish. I doubt any \"christians\" would admit to it, but they get off on the idea of global devastation and war as a confirmation of thier apocalypse fantasies. If you want Jesus to come back, first you need an antichrist to unite the world powers (US, Russia, and Greece is a good start), then when a water shortage pushes refugees into more habitable areas... BINGO! Holy war. You say climate change, they say Gods wrath. Dont forget, the majority of the planet believes this planet isnt as real as heaven. Its disgusting, dangerous, and becoming more and more inevitable.", "Lol...trump's idiot supporters get conned like they always do. ", "The Bismark was crippled by a damn biplane. ", "Trump in a year: \"Meh you can have Chechoslovakia.\"", "DNC corruption lost themselves this election.  The establishment had their heads up their ass and look where it left them.  The next decade is going to be ugly because of their incompetence.  ", "Except she wasn't defeated by populism. Trump got 2012 romney numbers and barely above 2008 mccain numbers. He got the basic Republican vote.  \n\nShe just did not inspire people to vote for her. That's not a message for populism. That's a message for apathy.", "No don't you remember? Clinton tried to call him on being Putin's puppet, and he very clearly retorted with an elegant and well thought out \"No, you're the puppet!\"", "&gt; It's not my fault \"middle class\" America is too lazy and illiterate to read a policy platform.\n\nYes it is... That's *exactly* the problem. People like you would rather laugh and sneer and call them dumb than explain why Trump is bad. You'd rather demean than try to understand what motivations could encourage someone to vote Trump. \n\nIf you just mock everyone who disagrees with you without trying to change their mind how the hell do you expect your side to ever win *anything*? You just think people will figure it out on their own? How's that working for you?\n\nThis election's results are your fault and the fault of those who are equally as close minded as you are. And that *is* what you are. Do you even *hear* yourself? The entitlement and privilege is outrageous... ", "You don't get it. No matter what happens in the next 4 years. Everything will still be Obama and Hillary's fault.\n\n\"We made tremendous progress people but look at what Obama did for 8 years. It ruined our country. We need to continue our progress to undo everything Obama did. 4 more years!\"\nI can almost hear it in Trump's voice.", "Did you see the clip of guiliani talking about them having tricks up their sleeve and laughing maniacally 2 days before they release that letter?", "&gt; The destroyer thing is soooo fucking stupid our Navy is \"shrinking\" because Navy's are becoming obsolete. Ships are big, slow, hard to hide, and \"easy\" to sink.\n\nI don't disagree that adding 400 destroyers to the largest Navy on the planet is ridiculous, but saying Navy's are becoming obsolete is just as ridiculous. 90% of the worlds trade is done over the ocean. The US Navy isn't just about being able to win a war. They maintain shipping routes and help insure the safety free passage of those trade routes. This includes doing what they can to keep piracy in check as well as taking a trip through waters when a country like China decides that they own more of the ocean than is agreed to under international and maritime law. Add to that the Navy being the best way to get a lot of firepower to most parts of the world as well as humanitarian aid, and the Navy is nowhere near obsolete. Evolving, yes.....but nowhere near obsolete. ", "This.  Please do not fall for their bullshit psychological manipulation.  They are trying to win back your trust so they can manipulate your thoughts as before. They are nothing more than agents of propaganda for the establishment. Do not make the same mistake again people.\n\n", "Drain the swamp??  More like filling it with creepy vermin.", "Wikileaks tweet from yesterday:\n\n&gt;Remember how you legalized \n\n&gt;✔Assassinating anyone \n\n&gt;✔NSA mass spying \n\n&gt;✔Prosecuting publishers \n\n&gt;✔CIA drones everywhere \n\n\n\n&gt;It's all Trumps in 71 days", "Maybe it's time to stop and actually google Trump's policies:\n\nTrillions upon trillions of debt massive cuts to services, the cost of his immigration policies,  absolutely no plan to create these jobs he has promised. \n\nI know you're feeling smug because you voted for the candidate who promised completely unattainable and unrealistic things, and that was preferrable to having to deal with the inconvenience of reality, but now is the time when things are supposed to actually happen. \n\nWhere do you think those jobs are coming from? \n\nHow many people are going to be out of work during the recession his trade policies cause? \n\nThose dastardly educated Liberals you rail against will ride the recession and raising prices out far better than the uneducated rural Trump supporters.   Good luck with that ", "Yep it's called appeasement.", "I've seen this comment posted a few times now and I disagree with the general reasoning. It's been interesting to see people who supported Trump talk about why he won, because they all seem to credit the issue that defined the election *for them* as the issue that defined the election *for everyone*. In reality there are a lot of reasons different people voted for Trump (HRC was never well-liked by any demographic, gun control was unpopular, abortion and gay marriage are still benchmark issues for religious voters, etc.). To say that Trump was elected because people reject multiculturalism is an oversimplification.\n\nWhite Christian culture is in decline in the US, and ironically, a lot the same people who want Muslims to assimilate hold religious views that prevent them from assimilating into modern culture. They want to be able to deny marriage licenses to gay couples based on their religious beliefs, deny abortions to women based on their religious beliefs, etc. Denying Americans their Constitutional rights because of your religion is fundamentally wrong, even if you happen to be a Christian. This is not a Christian nation, this is a pluralistic society of human beings who are free to believe whatever they want. Christians see no problem with going against the grain culturally because of their religious views, but they see a problem when Muslims do it. The OP said, \"we will continue coming out to the voting booth and burning your entire globalist establishment to the fucking ground,\" and I'm sure the demographic he's referencing will continue to vote. However, that demographic is shrinking rapidly, and won't have much of a say in anything a decade or two from now. That's why many people view it as an obstruction to inevitable progress.\n\nIf the Trump vote really was a referendum on pluralism and globalism as the OP suggests, why is American culture still moving headlong towards a secular, pluralistic society?", "Also 49% of college educated women voted for trump.... DNC underestimated how bad of a candidate Hillary was. ", "&gt;This so called \"drain the swamp\" motto that Trump took hold will fall apart early February\n\nIt's already falling apart, he's appointing a Goldman Sachs banker as part of his cabinet after saying literally \"I will protect you from Goldman Sachs\" in the primaries.", "No Hillary lost rural Democrats. There were white bread areas of PA that voted Obama in 2008 and voted Trump in 2016 in similar numbers. Clinton had great turnout...in coastal Democratic strongholds. She lost the rust belt.", "You have to be possessed by a special kind of stupid to believe a multi-millionaire business man is not going to be exclusively pro-business. Who cares if he renegotiates TPP and NAFTA; it will be in the interest of our new Treasure Secretary from Goldman Sachs", "We did and admittedly the war machine was already there.  But a combination of the Bush and Obama administrations are responsible for the surveillance state we have today, and it, as well as their attempts to hide its creation, are unforgivable.", "Pretty much the biggest problem with her campaign. People just ignored her every time she talked policy or announced something really great. I remember when she put out the \"official\" release of her work vacation plan for maternal/paternal leave along with a whole string of work related grievances pretty much every worker has. It's a MUCH better plan than we have no across the country and it wasn't particularly new since she was pushing this for most of her career, but this was the official release of it and it gained no traction in the news. One night, a couple articles, then poof. Gone from the collective memory.\n\nSince the right ran a total disinformation campaign it pushed the \"I don't believe anything she says unless she says something bad\" feeling to the max. When she told people in the rust belt the truth about their job situation - how it's never coming back - and her extensive plan to re-educate and re-train those individuals so they could re-enter the work force elsewhere, they ignored her. They didn't accept the reality of the situation that she told them.\n\nThey decided to go with the guy who sold them snake oil.", "Didn't anyone think it was odd that the Democratic Primary only had 4 candidates? In 2008 we had a hispanic and african american, a woman, and a number of politically diverse other candidates. Clinton was the favorite then as she was this time again, but a nobody came out of no where to upstage her-- Barack Obama.\n\nObama proved it could be done. So you're going to tell me there were no women african american senators, or hispanics, or some other diversity who wanted to at least get their name out there in field? Clinton didn't want risk getting upstaged again.\n\nMeanwhile, the advantage of having people that look like you to at least pretend to represent you goes a long way in rallying people behind the ultimate party nominee and as a result, some how the more diverse field of Republicans managed to make off with 30% of the latino vote and some 45% of the woman vote.\n\nThe DNC did this to themselves from day one.", "There is one that always stuck with me.  Remember that bank that gave him a gun?  It was presented in the film as if anyone can walk in sign up, and walk out with a gun.  \n\nThe guns were not kept on site.  The only reason they gave Moore one that way was because he requested it and they worked with him so he could have a good shot for the film.  They didn't know they'd be presented in the light that they were.", "I made a rule not to be a sore loser after my primary I pulled up my Sanders yard sign the day after, I chose to hold back on my own criticism of Clinton as a candidate for fear I would damage the party or dissuade voters from the polls. \n\nBut on election day, I had to deal with Clinton supporters trying to guilt third-party voters in my state as being misogynist, Trump-enablers, and self-destructive even though Trump carried it by something like twice as many votes as Clinton (it was never close.) The Clinton campaign, and Clinton supporters were the very definition of toxic femininity.", "She put out a two page plan about incorporating mental health into our healthcare system. It was a detailed plan that brought drug abuse and opioid abuse into focus- something middle America endlessly bitches that they want the government to do something about.\n\nAnd no one gave a shit.", "\"There is no such thing as a former KGB man\". \n-Vladimir Putin", "Don't forget her 2008 remarks about staying in the race against Obama [\"because Bobby Kennedy was assassinated in June\"](https://www.youtube.com/watch?v=DLNFsl130_Y)", "So does CNN.", "this election is fucking terrifying. In broad daylight the FBI just influenced an election and now there will be no one to prosecute them. This was a fucking coup", "Oh the irony... \n\nEdit: Thanks for electing us Trump, btw. ", "this is why EU-Army is a already a plan", "LOL. Also tl;dr.\n\n&gt;we will continue coming out to the voting booth and burning your entire globalist establishment to the fucking ground.\n\nThat's just rich. How's that working out for you? Have you seen Trump's potential Cabinet picks? The leading climate-change denier as head of EPA, for one. Oh and I forgot one: Goldman Sachs as Treasury! You don't think the GOP is part of your so-called \"globalist establishment\"?? He's going to be a rubber-stamp for the GOP. Not any old GOP either, the worst of the worst for environment, workers, civil rights, women, etc. etc. Oh and just wait for the SCOTUS and Federal judge picks. \n\nAmerica has really, really fucked up this time. These \"anti-establishment\" (LOL) voters may have made this country way worse for the rest of my natural life.\n\nChrist, to see non-college-educated working class males vote en masse for a guy who takes shits in a gold-plated toilet and lives in a literal tower with his name on it. Or to see evangelicals vote for a serial adulterer pig... It's insane... ", "&gt;Secretary of Homeland Security:\n\n&gt;Chris Christie \n\n&gt;Sheriff David Clarke\n\nThis is a really bad joke\n", "He really is the greatest con man am I right? Believe me. ", "&gt; PUT GOD BACK IN THE WHITE HOUSE SCHOOLS, GOVERNMENT.\n\nPut God back?? Bitch Thomas Jefferson revised the Bible to take God OUT.", "You gave me hope then crushed it instantly. I hope your warm coffee is extra cold today. And if you drink cold coffee, I hope it's a bit too warm. Dick.", "Because rampant unfettered pollution is ALWAYS good for business. Welcome to what everyone voted for.", "He’s been married three times said lewd things, berated the beloved Bush family and offended women and Latinos, but conservative Christians helped send Donald Trump to the White House anyway.\n\nFour out of five white evangelicals voted for the Republican nominee, according to exit polls.\n\nHow did people of faith reconcile the teaching of Christ with the tough rhetoric of the reality star and real estate mogul?\n\nFor many, it came down to a few major issues, such as abortion and Supreme Court appointments. They also were swayed by party loyalty and fear of a government under Hillary Clinton.", "They _do_ line up with most people's realities.  I _hate_ this \"out of touch\" line because it's simply not true; the reality of the situation is that these rural people are the ones out of touch with their own economic situations.  They definitely and obviously know they're suffering but they only think they know why.\n\nTrump blames Obama for the loss of coal jobs, and that was an especially strong point of his in PA, where they did lose many of them.  However, the reality is that those jobs are lost for many reasons and chief among them is the lower price of natural gas.  Which state gained the _most_ jobs from natural gas?  That's right, PA.\n\nThere are strong indicators that high income inequality slows economic growth.  Which economic policies are more likely to lead to economic inequality?  \n\nAsk the average Trump voter how the economy is doing compared to 2008. Ask them about the relative performance of economies that tried austerity versus increasing spending, and ask them which Obama did.\n\nAsk them what a 25% tariff on Chinese products means for jobs in construction and the price of products that they buy from Wal Mart.\n\nThe fact of the matter is that these voters are low-information voters, and they voted overwhelmingly for a man who has not proposed things that are likely to help them.  Hillary's economic message wasn't out of touch, it was the truth.  It was a hard truth and it was a nuanced truth, and these voters simply didn't care about the nuance.  \n\nThe primary issue, in my opinion, is that there is an asymmetry in political dialogue.  Wrong answers are easier to satisfyingly simplify than correct ones, so people identifying the wrong problems and proposing the wrong solutions will sound better -- they will better capitalize on truthiness -- than others.  Without an informed electorate willing to investigate and understand, I'm not sure I see a way out.", "You hit the nail on the head. The DNC actively discouraged competition limiting who would be willing to run. Ironically, it created perfect conditions for Bernie to run. \n\nJim Webb would have likely beat Trump too, but that's like saying Rand Paul would beat Clinton, because neither would have made it to the top of the ticket. ", "Darned Aero-mobiles making water horses less important.\n\nBut to play the devils advocate we do have better AA weaponry on ships now.\n\nEDIT, added the word better.", "I did plenty of explaining why Trump is bad over the last few months and every time I was met with stubborn ignorance or hatred for hillary. ", "Man fuck you, America. Fuck you so hard.", "Gee maybe it wasn't such a great idea to hand so much power to the executive branch, just in case. No one could have ever predicted that someone they didn't like would be elected. ", "Charleton Heston's \"cold dead hands\" quote shown \"ten days after\" was taken a year after. Actually a lot of the Heston/NRA stuff was heavily edited he's wearing different clothes at different segments because he's at different conventions. Rallies supposedly given 2 days after the shooting actually occurred half a year later for the presidential election. Bowling outright lies about the timeframes for a lot of their stuff.", "Why the fuck would anyone want to repeal the Clean Air Act?", "Can someone please explain to me why the Republican side is so fervently against climate action and renewable energy?  What does America and the world stand to gain with this perspective?", "Considering Trump's lack of GOTV operations and the numbers he was able to bring considering it means one of two things:\n\nWe have a populist candidate or our understanding of the effectiveness of GOTV is flawed and it is unneeded.\n\nI'd argue that the former is more likely than the latter. Mind you I agree that Clinton failed to inspire people and that hurt her numbers.", "Nuh uh. Trump will just make a deal with the ozone layer in order to fix this.", "  If you showed up at a [Hillary](https://www.youtube.com/watch?v=PHQLQ1Rc_Js) rally with a handmade sign they would take your sign away and give you a sign the campaign had made which was supposed to look handmade.  Not just once this happened it was standard practice.", "How the fuck is this even politics?", "We kinda brush it off now but if he invaded another country the world would look to NATO and NATO would look to their number one country by military, funding and leadership and ohh shit, that's the country who elected Trump who wanted to disband NATO.", "Google Koch brothers.", "The interesting thing about Clinton and Trump is that each of them is the only person the other stood a chance against. Any decent Republican would have crushed Clinton long ago. Any decent Democrat would have crushed Trump. I don't think a lot of people are very happy with what's happened this year. I just hope we can learn from it.", "Trump was never going to drain the swamp. He's just another fat toad that wanted to move in. It'll be just as much of a swamp after he leaves as when he first came.", "He doesn't strike me as a guy that would voluntarily go to any gathering that required him to sit and listen to another person talk for an hour regardless of his belief in a higher power.", "It's about the Supreme Court appointments. ", "&gt; A biology professor from a highly esteemed college condescendingly dismissed my support for Sanders -- her main focus was ending wars. Her support for Hillary was interesting to say the least.\n\nsmh\n\nHillary is the last person who would \"end wars.\" I still remember one moment during the primary debates when she said things like\n\n* I made a mistake with the Iraq war vote, but\n* let's attack Assad and ISIS both at the same time.\n\nYeah, that's \"ending wars\" all right.", "Because they didn't want to influence the election.\n\nI was literally not able to type that with a straight face.", "Both sides need to chill the fuck out against each other.", "Yup. Obama turned out to be a corporate democrat. \n\nHRC another corporate democrat, had her minions rig the system in her favor during the primaries.\n\nIf the Democrats would have been the party of the people, for the people, and actively sought out the best candidates, we would not be in this mess, since they would have won. \n\n\nThe racist and the angry joined forces, and now we get a maniac in power.", "It's crazy how this man can predict the future....\n\nRemember how he once said in debate that North Korea was our biggest threat and the media tore him up for it? And then not 2 weeks later NK detonated their most powerful nuclear weapon and everybody freaked out? \n\nGood times..", "People really are doubling down on this awful attitude that disliking or disagreeing with a woman for any reason makes you a \"misogynist\" because she's a woman irrespective of whether or not your dissent had *anything* to do with that. It's like the gradeschool \"Everything Proof Shield\" against criticism.\n\nLike, this election has made it clear that this fucking attitude and toxic \"identity politics\" does more harm than good, however cathartic terrible people find it to cry bully their *own possible allies* away then wonder why they don't have any allies later. But instead of coming to terms with that the hard way, it's like the perpetrators are doubling down and whinging even harder, as if they think the only reason they lost was because they didn't antagonize and alienate everyone else *hard enough*.  ", "Can't wait to visit the Yellowstone quarry the Everglades housing development (drain the swamp... literally!), and the Sequoia logging company. ", "I'm always amazed how people talk about globalism and economic depression as the reason Trump won the white vote.  As if the black and hispanic communities were left completely untouched by the closing of factories.", "Actually the FBI said trump as no ties to russia so...", "Well no sh*t. They absolutely love Trump's \"the West against Islam\" narrative. Trump will be their top-performing recruiter. American General's warned him but of course he knows better, right?", "Any Dem that saw the writing on the wall and chose not to vote is a bigger idiot than the self-interested climate deniers on the other side.", "Fuck off with this bullshit headline. WE vited in a new President. Obama didn't hand pick the guy he campaigned on Clinton's behalf in opposition to Trump. ", "Oh Jesus Fuck I forgot about this due to being overshadowed by environment and basic human rights. ", "Sheriff Clarke please tell us more about whats wrong with blacks\n\n&gt;Everything!\n\nThank You Sheriff Clarke", "It doesn't have to be ugly for the next decade. If people who voted Democrat don't immediately go apathetic to politics there's always a chance to take back Congress every 2 years. In 2018, all 435 seats in the House of Reps and 33 seats in the Senate go up for re-election. \n\nI know it's tiring, but one of the biggest reasons why Hillary lost is because there was a lower voter turnout for her than there was for Obama in 2008 or 2012. \n\nEveryone keeps saying she won more of the popular vote compared to Trump which is great but she still didn't get as many votes as Obama did and we should try to figure out why that's the case- why 3 million voters who turned up in 2012 didn't turn up this year. Voter turnout is abysmally low for midterm elections too and that doesn't help either.\n\nedit: plug for /r/Political_Revolution and /r/BrandNewCongress ", "&gt;&gt; It's not my fault \"middle class\" America is too lazy and illiterate to read a policy platform.\n\n&gt;Yes it is... That's *exactly* the problem. People like you would rather laugh and sneer and call them dumb than explain why Trump is bad. You'd rather demean than try to understand what motivations could encourage someone to vote Trump. \n\n\nLet's not pretend that Trump's terrible policies haven't been debunked ad nauseum for a year. ", "Let the bigotry and stereotyping flow through you. You're surely going to convince them that they're wrong! \n\nReplace \"evangelical\" with &lt;insert any race here&gt; and you'd be derided for your bigotry. ", "All of America is so embarrassing. ", "Berlusconi is basically Trump. ", "Do you know why no one wants the NSA position(s) under Trump?\n\nBecause [intelligence officials believe](https://www.washingtonpost.com/opinions/former-cia-chief-trump-is-russias-useful-fool/2016/11/03/cda42ffe-a1d5-11e6-8d63-3e0a660f1f04_story.html) that he (Trump) is a russian ['useful fool'](https://en.wikipedia.org/wiki/Useful_idiot). \n\nDo you understand the national security implications of this? ", "And the 4 million of us who did vote Johnson hoping to get to 5% and qualify a third party for federal election dollars in 4 years are shaking our heads right now. At least I can say I tried."], "links": ["5c7b7b", "5c694x", "5c727d", "5c727d", "5c7b7b", "5c7b7b", "5c5fsn", "5c5fsn", "5c727d", "5c7b7b", "5c694x", "5c5fsn", "5c5gso", "5c7b7b", "5c727d", "5c694x", "5c727d", "5c727d", "5c727d", "5c5rx8", "5c5gso", "5c5gso", "5c5fsn", "5c694x", "5c727d", "5c727d", "5c727d", "5c7b7b", "5c5fsn", "5c7b7b", "5c574a", "5c727d", "5c694x", "5c574a", "5c7b7b", "5c7b7b", "5c739p", "5c7c1o", "5c739p", "5c727d", "5c5l6p", "5c6spo", "5c739p", "5c5l6p", "5c7b7b", "5c694x", "5c727d", "5c45qw", "5c7azq", "5c4kir", "5c5fsn", "5c5l6p", "5c6jt1", "5c694x", "5c5fsn", "5c7cfx", "5c727d", "5c5l6p", "5c739p", "5c5rx8", "5c43f3", "5c43f3", "5c3sbs", "5c5pvx", "5c7dlz", "5c694x", "5c7b7b", "5c7f0g", "5c5gso", "5c5l6p", "5c5fsn", "5c7cfx", "5c694x", "5c739p", "5c7b7b", "5c694x", "5c5fsn", "5c4kir", "5c7dlz", "5c4a8q", "5c7cfx", "5c7cfx", "5c727d", "5c7c6e", "5c727d", "5c7dw0", "5c79ru", "5c43f3", "5c574a", "5c6z2m", "5c5fsn", "5c7b7b", "5c5rx8", "5c5rx8", "5c5fsn", "5c39q1", "5c7azq", "5c7c1o", "5c727d", "5c727d", "5c7kxy", "5c727d", "5c7n7w", "5c7b7b", "5c694x", "5c7kxy", "5c727d", "5c7hwx", "5c7hwx", "5c7kxy", "5c7hrm", "5c7hwx", "5c7b7b", "5c727d", "5c7kxy", "5c7hwx", "5c7hwx", "5c694x", "5c694x", "5c7hwx", "5c5l6p", "5c5fsn", "5c694x", "5c7hrm", "5c727d", "5c694x", "5c7kxy", "5c727d", "5c7kxy", "5c7hrm", "5c694x", "5c5fsn", "5c694x", "5c7hrm", "5c727d", "5c7i17", "5c7hwx", "5c727d", "5c694x", "5c5rx8", "5c694x", "5c7hwx", "5c7b7b", "5c5rx8", "5c7hwx", "5c5l6p", "5c694x", "5c727d", "5c7jhf", "5c5rx8", "5c7iir", "5c727d", "5c7hrm", "5c727d", "5c7kxy", "5c5l6p", "5c694x", "5c7kxy", "5c694x", "5c7kxy", "5c7b7b", "5c7hwx", "5c7hj4", "5c694x", "5c5fsn", "5c5l6p", "5c5l6p", "5c7b7b", "5c7hwx", "5c694x", "5c5rx8", "5c5fsn", "5c5gso", "5c7b7b", "5c5fsn", "5c5l6p", "5c5fsn", "5c5fsn", "5c46b7", "5c7hwx", "5c574a", "5c7b7b", "5c5gso", "5c5rx8", "5c5l6p", "5c7b7b", "5c5fsn", "5c727d", "5c574a", "5c694x", "5c727d", "5c727d", "5c7hwx", "5c5rx8", "5c7kxy", "5c7nkb", "5c7nkb", "5c7nkb", "5c7nkb", "5c7nkb", "5c7nkb", "5c7nkb", "5c7nkb", "5c7kxy", "5c7kxy", "5c7nkb", "5c7nkb", "5c7nkb", "5c7nkb", "5c7nkb", "5c7hwx", "5c7nkb", "5c7t1o", "5c7hwx", "5c7nkb", "5c7t1o", "5c7n7w", "5c7nkb", "5c7nkb", "5c7nnv", "5c7nkb", "5c7hwx", "5c7nkb", "5c7nnv", "5c7nkb", "5c7hwx", "5c7p85", "5c7hwx", "5c694x", "5c727d", "5c694x", "5c7s6n", "5c7kxy", "5c7nkb", "5c7hwx", "5c727d", "5c7qtc", "5c7hwx", "5c7nkb", "5c7s6n", "5c7p85", "5c7kxy", "5c7nkb", "5c7nkb", "5c7nkb", "5c7t1o", "5c694x", "5c7nkb", "5c7nkb", "5c694x", "5c7nkb", "5c7nkb", "5c727d", "5c7b7b", "5c7qab", "5c7s6n", "5c7kxy", "5c5fsn", "5c727d", "5c7nkb", "5c7nkb", "5c7t1o", "5c7hwx", "5c7nkb", "5c7nkb", "5c7p85", "5c7s6n", "5c7qtc", "5c7n7w", "5c7s6n", "5c7nkb", "5c694x", "5c7hwx", "5c727d", "5c694x", "5c7vxr", "5c7nnv", "5c7b7b", "5c7hwx", "5c7hwx", "5c7nkb", "5c7n7w", "5c7nkb", "5c727d", "5c727d", "5c727d", "5c7nkb", "5c7nkb", "5c7nkb", "5c7pu3", "5c7nkb", "5c727d", "5c727d", "5c7qab", "5c7b7b", "5c7nkb", "5c7nkb", "5c7nkb", "5c836b", "5c7nkb", "5c7nkb", "5c7nkb", "5c836b", "5c7hwx", "5c7nkb", "5c7nkb", "5c7nkb", "5c727d", "5c7n7w", "5c836b", "5c804o", "5c836b", "5c7vor", "5c7nkb", "5c7kxy", "5c7nkb", "5c7hwx", "5c7nkb", "5c7nkb", "5c7nkb", "5c7nkb", "5c7nkb", "5c7t1o", "5c7nkb", "5c81o1", "5c7nkb", "5c7nkb", "5c727d", "5c7nkb", "5c7nkb", "5c7nkb", "5c727d", "5c7nkb", "5c7vor", "5c7nkb", "5c7nkb", "5c7nnv", "5c7kxy", "5c727d", "5c7nkb", "5c7vor", "5c7nkb", "5c7nkb", "5c7hwx", "5c7nkb", "5c727d", "5c7nkb", "5c694x", "5c727d", "5c727d", "5c7nkb", "5c7qab", "5c7nkb", "5c7nkb", "5c7b7b", "5c727d", "5c7hwx", "5c7nkb", "5c836b", "5c7kxy", "5c7kxy", "5c7nkb", "5c694x", "5c7nkb", "5c7nkb", "5c694x", "5c7hwx", "5c86nm", "5c727d", "5c7hwx", "5c84ol", "5c727d", "5c7hwx", "5c7nkb", "5c7nkb", "5c7hwx", "5c5fsn", "5c7nnv", "5c694x", "5c81o1", "5c83fl", "5c7nkb", "5c7kxy", "5c7nkb", "5c727d", "5c727d", "5c5fsn", "5c7nkb", "5c85wg", "5c727d", "5c7hwx", "5c7nkb", "5c7kxy", "5c836b", "5c836b", "5c7kxy", "5c7n7w", "5c7nkb", "5c7nkb", "5c7nkb", "5c836b", "5c85wg", "5c804o", "5c836b", "5c7kxy", "5c7nkb", "5c7nkb", "5c7kxy", "5c836b", "5c7nkb", "5c7kxy", "5c7nkb", "5c836b", "5c836b", "5c7kxy", "5c7nkb", "5c727d", "5c836b", "5c7nkb", "5c7n7w", "5c7nkb", "5c8exk", "5c7kxy", "5c7kxy", "5c7nkb", "5c7kxy", "5c7nkb", "5c7nkb", "5c7b7b", "5c7nkb", "5c7n7w", "5c7nkb", "5c7nkb", "5c7kxy", "5c7nkb", "5c7kxy", "5c727d", "5c7kxy", "5c7nkb", "5c7nkb", "5c7kxy", "5c836b", "5c7n7w", "5c7n7w", "5c7kxy", "5c7nkb", "5c7nkb", "5c836b", "5c7nkb", "5c7t1o", "5c7kxy", "5c7nkb", "5c7b7b", "5c7kxy", "5c836b", "5c7kxy", "5c7nkb", "5c7nkb", "5c7nkb", "5c7nkb", "5c836b", "5c81o1", "5c7n7w", "5c836b", "5c7nkb", "5c7n7w", "5c7hwx", "5c7nkb", "5c7n7w", "5c7n7w", "5c7nkb", "5c7nkb", "5c7nkb", "5c7t1o", "5c7nkb", "5c804o", "5c7s6n", "5c727d", "5c836b", "5c836b", "5c7n7w", "5c7t1o", "5c81o1", "5c727d", "5c836b", "5c7nkb", "5c7nkb", "5c8n9i", "5c7nkb", "5c8jlf", "5c836b", "5c8jlf", "5c7nkb", "5c8n9i", "5c8izb", "5c7nkb", "5c836b", "5c8jlf", "5c7hwx", "5c7kxy", "5c7kxy", "5c8n9i", "5c8jlf", "5c81o1", "5c8jlf", "5c7nkb", "5c7nkb", "5c8izb", "5c8n9i", "5c7nkb", "5c7nkb", "5c85wg", "5c7kxy", "5c7nkb", "5c836b", "5c8exk", "5c7nkb", "5c7nkb", "5c7b7b", "5c8n9i", "5c8jlf", "5c836b", "5c7nkb", "5c836b", "5c836b", "5c7nkb", "5c7kxy", "5c8n9i", "5c8jlf", "5c836b", "5c7kxy", "5c727d", "5c7kxy", "5c836b", "5c7nkb", "5c7kxy", "5c7b7b", "5c7nkb", "5c836b", "5c7nkb", "5c836b", "5c8n9i", "5c8n9i", "5c836b", "5c7nkb", "5c8p0h", "5c836b", "5c7hwx", "5c7kxy", "5c7nkb", "5c836b", "5c836b", "5c8jlf", "5c727d", "5c8p0h", "5c7n7w", "5c7kxy", "5c8izb", "5c7kxy", "5c7t1o", "5c7nkb", "5c7n7w", "5c7kxy", "5c8n9i", "5c836b", "5c836b", "5c7kxy", "5c7nkb", "5c8rhp", "5c8jlf", "5c7p85", "5c7kxy", "5c7n7w", "5c836b", "5c7nkb", "5c8q6n", "5c7n7w", "5c8jlf", "5c7n7w", "5c8n9i", "5c85wg", "5c836b", "5c836b", "5c7nkb", "5c7nkb", "5c8n9i", "5c7kxy"]}