{"comments": ["Honestly this part blows. If you're gay in America, your new VP has genuinely said he's out to stop you from living the way you want. It's hard to feel optimistic, I've been trying to feel good about this presidency for the past few days and it's tough.", "Bernie is doing the right thing in this confusion -- taking charge. ", "&gt;“These temper tantrums from these radical anarchists must be quelled. There is no **legitimate reason to protest** the will of the people” \n\nThe constitution is clear on the peoples right to peaceably assemble and it isn't based on whether the government thinks they have a legitimate reason to protest.", "Bernie Sanders needs to lead the Democratic Party.", "It's almost like......... We *shouldn't have a surveillance state* or something......", "It's beginning to look like Trump really is the first ever presidential candidate to do a center pivot AFTER the election.\n\nThe guy called Obama \"A Great Man\" and said he would seek his council. ", "Obama is overly positive about Trump and the more extreme campaign promises that Trump made are being pulled from his website.\n\nTruly the strangest timeline.", "God Emperor to you heretic.", "In the summer of 2015 Kieth Ellison was laughed at on an ABC news panel for suggesting Trump may be the Republican nominee and that dems need to take that seriously and prepare. He clearly has the foresight for the job. \n\nhttps://youtu.be/FHkPadFK34o", "non-racistly of course", "&gt; the will of the people\n \n~50/50 split and a technical win is hardly \"the will of the people.\"\n", "If he does pivot center then I'll be able to sleep at night", "How would the right have treated Obama if he had four kids with three different women?", "Agreed. If anything Dems now all know him by name we know he energized the base far better then Hilary did, and he has charisma. \n\nWe should listen to what he has to say\n\n", "The only reason she chose him as a running mate was because she owed it to him once he stepped down as chairman of the dnc to give it to shultz. Her entire camapign was shit from the get go", "Dude!!! Don't call them idiots. Don't you know that's why they voted for Donald because we called them names? Don't call them out for their ignorance and lack of good judgment or they'll make us pay. Promise, if you bow to them and treat them like the brilliant minds they are, they will definitely give us what we want.", "[FBI came out and said that they found no communications.](http://www.nytimes.com/2016/11/01/us/politics/fbi-russia-election-donald-trump.html) \n\nThis admission by Russia makes the FBI look like incompetent fools. Russia played a master manipulation game. \n\nEdit - This is really a big deal. Worthy of a congressional investigation. Very alarming at the least. ", "The opposition to the Paris climate change agreement has also been pulled.", "Bernie is exactly what we need right now. If he feels healthy enough to run he will have my vote and those of millions of progressives.", "My hope is Trump is not lying when he says he will seek Obama's council and that meeting him now he understands things the President has to do clearer.\n\nHopefully that hope isn't misplaced....", "But....but...Trump voters are sick and tired of being labeled as racists and homophobes for voting in a racist homophobe.", "The same FBI who leaked shit directly to the Trump Campaign?\n\nNOOOO!", "Wasn't he the one who called this way back before any of the campaigns got off the ground? That Dems should be afraid of this Trump run? And then he got laughed out of the room for it?\n\nYea I'm ok with this.", "As a Minnesota resident I support his 100%.  He's a good man. ", "Did you not read his statement? He accepts that he's president and actually supports some of his economic plans. He'll just be vocal if Trump does anything that upsets people socially ", "So we can't argue on policies because policy is irrelevant.  We can't argue on character and decorum because that's calling people names.  We can't talk about competence because nobody wants to be called an idiot.  Can you let us know when you're done moving the goalposts so we can find a reason you like to be against Trump?", "When future generations look back at the early 21st century they will look at the Trump presidency like we look at the first half of the 20th. They will ask about us, \"How could they be so stupid and blind to what they were doing?\"\n\nOn the bright side for Trumpsters, if we continue to merrily accelerate climate change, we may condemn those future generations to a marginal, low-technology sustenance at best, so they won't have much access to education or history, so the devils won't be able to judge us harshly. ", "Then the DNC will have learned nothing.", "Trump seemed weirdly humble in both his victory speech and this short statement with Obama. Let's see how things play out...\n\nAlso he said that he'll look to Obama for counsel. I found that interesting (unless that's just what president-elects say).", "to be fair I suspect Obama and Clinton I were agnostics, too.", "I'm actually cautiously optimistic right now.", "This is one of the most heartbreaking parts of this election to me and it's maddening how little attention the media paid to Trump's stances on the environment.\n\nNot one single fucking question about climate change in any of the three debates, barely a whisper about the environmental policies that Trump wants to roll back and how it will impact our country and the world.\n\nI was talking to a friend yesterday, a Johnson protest voter in AZ. He had no idea about the EPA and what Trump planned to do to it, and he asked \"shit, what can we do about that?\" How many voters like him did the media fail?", "Meanwhile his supporters are touting a photo of him waving an LGBT flag. Guess what he also said nobody respects women more than him. I'll take his actions of treatment towards women over his words, and I'm going to take his nomination of Pence over a photo op.", "And now Hillary supporters want to further marginalize \"flyover country\" because they did not vote how they were told.\n\nMaybe if they actually gave a shit about these states and built a coalition they wouldn't have to try rewriting the rules.", "Wouldn't expect anything less than full hypocrisy from Trumplandia.", "&gt;DNC: Let's rig the primary so that we can push Hillary to be our candidate.\n\n&gt;Voters: Wouldn't that defeat the purpose of holding primaries? Isn't the point of the primaries to select the strongest candidate that can win the general election?\n\n&gt;DNC: Fuck you!\n\n*post election*\n\nDNC: how could you voters do this?", "It was never about Trump for them. It was about saying fuck you to everyone else and wanting the rest of the country to join in their perceived plight.", "Russia can just meddle in our elections the FBI covers it up or they are incompetent, and GOP suppresses the vote as best it can.  Fuck this election, fuck the GOP, fuck the DNC, fuck Russia, literally fuck everything.  I hope a meteor hits the Capital building", "I hope they start listening to him. There have been far too many examples of people in our leadership ignoring his opinion only to have him proven correct months or years later. ", "Yet 90% of Congress was reelected", "If Trump reverses course other countries will pick up the slack. There is simply no alternative. Survival is more important to large emitters like China and India than maintaining high speed development.\n\nIt's a real shame too because these industrializing nations (Yes, even China and those in Africa/Latin America as well) have already made major development concessions to meet international climate goals. \n\nWe are just lucky that the climate denial conspiratards have not spread beyond Russia, Australia, America, and a few of the gulf states. ", "So easily triggered by being called names that they elected a fascist just to show us how mad they were.", "Your party put up a fucking lunatic who is now considering Sarah Palin for a cabinet position.  That's some truly 69DD chess you're playing.", "Amazing how Trump supporters are still deflecting to Clinton. She lost. He won. No excuses now. He promised to drain the swamp; he promised to end corruption; he was supposed to be anti-establishment. If these guys are even being considered for any high-ranking position then literally none of that would hold true. ", "\"Well Governor, we also have fewer horses and bayonets because the nature of our military's changed.\"", "&gt; David Brock\n\nI remember watching an old documentary about the Hollywood \"after parties\" which is a pretty big open secret involving big Hollywood hotshots and sex parties with young wannabe celebrity girls. And David Brock was mentioned countless times as the ring leader. Then the leaks happened... And I'm still not sure what to make of it but God damn, he sure is tied into that conspiracy pretty neatly when it comes to child sex. ", "Its literally a bullet point in his 100 day plan. To 'remove the barriers to domestic natural resources' aka privatize federal land for a quick buck.", "For the longest time I was a Hillary supporter. I too looked at Bernie supporters and wished they would get on board. For a while the leaked emails revealed nothing interesting, just a bunch of conspiracy theories that the Trumpers loved. But two things came out of those emails that turned it all around for me. One, the rigging of the primaries. This wasn't just conspiracies from sore losers, it was proof to me that deals were being made at the top to rig it.\nSecond was getting debate questions ahead of time, more proof that groups of people at the top of the Democratic party were essentially cheating. I ended up not voting for Hillary (nor Trump either). \n\nThis was Hillary's election to lose, and she lost it. The hacking of the emails was a crime, but they exposed a rotten core. It's just too bad that a pile of shit like Trump benefited from it. God help us get to 2020 safely.", "Admiral Josh Painter - (Fred Thompson): This business will get out of control. It will get out of control and we'll be lucky to live through it. ", "I'm surprised how quickly it went back to normal I've sworn the manipulators would have kept running for at least another week.", "Bit late to catch on now isn't it?", "Clinton never embraced Sanders. She got SoS as a consolation prize for losing to Obama in 08. Sanders got a pat on the back and some vague attempts at implementing some of his ideals without pissing off her massive pro military pro Wall Street donor base. You can't blame the liberals for not endorsing post Watergate Nixon even if the alternative was Commodus.", "The irony of a bunch of 4chan neckbeards supporting the guy who will ban porn. Hahah", "Ellison is who we need. Down with the Clinton Cronies. ", "Which is the scary part. We can sit around and talk about *It's only four years we'll get them next time* but the damage in the SC will be done. For decades to come. ", "In an era where the American people were screaming at the top of their lungs for a populist non-establishment candidate -- They nominated the lady who is in the dictionary as the example for establishment politician.", "I'm sorry what congressional vote gave us PRISM?\n\nObama didn't do a damn thing to shut that program down. I definitely take issue with the programs existence. I definitely take issue with the fact that he used powers that are symbolically the opposite of the platform of transparency he campaigned on.\n\nIt doesn't need to be a partisan issue for it to be indicative of a Democratic party that says one thing and does another.", "Don't cry; fight.\n\nEdit: No really, if the GOP tries to sell Shenandoah National Park, I will fucking sit on that sign till I fucking die rather than let even a fucking inch that beautiful land be privatized.", "I think he would do miles a head of anybody currently in the \"running.\" The fact that mainstream centrist sources like Mother Jones and QZ are seriously floating fucking Andrew Cuomo and Tim Kaine as 2020 is amazing. It's like they're asking for another whooping. Keith Ellison needs to be the DNC chair. ", "Florida still too close to call - CNN probably", "No Bernie. Please be the elder statesman the party needs right now. Let a fresher face take up that torch, because we're going to need more people like you in the future.", "&gt;  more extreme campaign **promises** that Trump made are being pulled from his website.\n\nPlural? Apart from the Muslim one was their another?\n\nEDIT: Ok thanks for the replies peeps!\n", "Eh. I don't like rumor-mongering. Besides which David Brock is openly gay, so an odd candidate for the ringleader of a sex party with young girls.\n\nThe things we actually *know* he's done are more than sufficient to indict him.", "But he knows their pain! He knows how they feel! He cares about them! ", "We've told you he's been lying to you for a year now. We've outlined his policies. We've debunked what he's said. We've proposed a plethora of solutions (that only republicans refuse to put into play).\n\nYou don't listen because you don't want to listen. You want to take the easy road out but guess what? There is no easy road. If it's too good to be true, it must be. And that's what Trump is. \n\nYou want to talk about privilege? When a white rural blue collar worker can't find a job because he refuses to adapt to a changing economy, that's called \"economic anxiety\" and we should bend over backwards to regress the country backwards so that he can get paid a middle class income to do unskilled labour no one needs. When a scientist spends 15+ years in academia getting credentials and living in rank poverty, and then has to wake up one morning realizing that funding is cut to the state school he does research at and he won't be able to even start his career, that's called \"being a lazy liberal who should stop being so entitled.\"\n\nLuckily the latter can move to any other first world country and do just fine. But you will die out if you don't change.", "Congratulations Rust Belt. You got super duped. This man isn't gonna start a nuclear war. He's gonna open up the government for business. ", "Yeah so unlike Republican resistance to Obama, Sanders isn't going to automatically gainsay everything Trump wants.\n\nWhile a vindictive part of me would enjoy Republican-style obstructionism from the Left, a better part of me would prefer to relegate that petulant, childish attitude to history's dustbin forever.", "You do realize that trump didn't ride a huge wave of support that had never been seen by the right? He got the same number of votes as McCain and Romney.  He didn't create some populist uprising. The reason he won is that Clinton didn't turn out voters like obama did the previous two elections.  ", "https://youtu.be/FHkPadFK34o", "Her twitter is very salty right now", "1. Open a book.\n\n2. Read it.\n\n3. Learn how to accept actual documented facts and logic. \n\nThen maybe we can come to a understanding.\n\nUntil then I'm not going to pretend to tolerate world views entirely based on \"muh feelings\" like:\n\n\"Crime is way up!!!!\". \n\nActual fact : it's getting lower.\n\n\"Isis is at our doorstep\". \n\nActual fact : current America is the safest it ever been statistically. \n \n\n\"Climate change is fake!!!\"\n\nActual fact : it's fucking real. \n\nAnd so on and so forth.\n\nFuck the hillbilly rednecks.", "They're feeling the effects of DWSs shit run as democratic chair. At least in that regards they're feeling self inflicted pain. Dean would've never let the rust belt get so ignored. ", "Valar Harambes", "They did not have the same support by evangelicals that Trump does that's the interesting difference. ", "Typical Trump voter. Feels over reals.", "She lost everywhere except very blue cities. Look at county by county map. It's pathetic.  If this election doesn't cause complete redo of DNC nothing will save them.\n\nand don't forget, the corruption investigation is yet to begin. That Clinton Foundation will bring down the entire thing.", "Yet nobody ever shits on Obama for running a surveillance state and war machine. LOL", "We need a leader. Bernie is that leader. If in four years he decides not to run I will take his suggestion for our next nominee. ", "DNC has nothing to do with it. If he runs he runs. I don't think he'll get anywhere, though. He's forever tied to the ticket that lost to Donald Trump.\n\nBooker, Warren, and Gillibrand will be the front-runners, I suspect, with or without Kaine. And Biden and Sanders, too, if either of those old timers wants to throw their hat in.\n\nIf we're lucky, maybe we'll get Colbert or Stewart, as well. Though I'm secretly hoping one of them challenges Trump in the Republican primaries, just to troll him (and maybe get a progressive on both tickets).", "The idea that it \"hurts jobs\" is one.  \n\nAnother one is that the environment was picked up by the left so the right just assumed they had to be against it.  \n\nThere's also a part of the evangelical movement that God made the Earth for people to exploit and that people cannot \"destroy\" it.  God wouldn't let that happen.", "I find it amusing that the religious right votes for a candidate and praise god when that candidate exhibits the worst behaviors that they themselves accuse atheists of having. ", "You'll probably be hearing about Tim Kaine in four years (two and a half really)", "ding ding ding\n\nFacts aren't important if they  don't drive the narrative.\n", "&gt; Andrew Cuomo\n\nHoly moly. It's like they learned nothing in the last 48 hours.\n\n", "Turnout was so low because of the rigged primary and the fact that Hillary ran a campaign entirely devoid of enthusiasm. She tried to use Donald Trump to coast into the White House and now we all get to suffer for it.", "Lol during one of he debates Trump did suggest she was worth many millions of dollars and asked \"why didn't you put your own money into your campaign?\" And she didn't answer.", "Ooh I member I member. Member when he campaigned on wealth inequality and everyone dismissed him as a nutcase then it turned out that the entire election was won on wealth inequality? ", "Post a screenshot and report it to the mods.  That kind of nonsense should be exposed, ridiculed and shut down.  ", "Oh my dear God. We are so fucked. Newt Gingrich for Secretary of State? Criminal Chris Christie as attorney? This is without a doubt the lowest point in the executive branch's history especially when you consider that election rigger James Comey is still head of the FBI.", "You say incompetent fools I say willing collaborators, but really who cares anyway when torturing people and deliberately misleading the nation into a costly and lengthy war leads to a retirement of painting portraits on a ranch.", "&gt; They can't make a living any other way.\n\nAnd Liberals would have been cool with giving them financial assistance and extensive training until they were ready to move into the new jobs in the new energy sector.", "\"a bit\" =\"we did it\" with added sly wink.", "It's not even the Clinton name which is what hurt her.  It's the Hillary Clinton name.  Ex-President Bill Clinton comes across as compassionate to people who speak with him.  He feels your pain.  Hillary comes across as cold as if she's doing you a favor even taking time to shake your hand during her rallies.  It's no wonder why a good portion of the country, who feels disenfranchised by both parties, voted for Trump.", "When George Stephanopolous dies his room in Hell will have that clip on infinite repeat.", "Yeah no one cares about the biochemist from Salt Lake City who will basically be unemployed for the next four years once the Republicans cut funding to STEM-related academia. Hell most people right now are begging for unpaid internships. In four years they will be terminally unemployed.\n\nNo, it's all about \"bringing back jobs\" that are obsolete and can't be brought back. These people are stupid and lazy and refuse to adapt and change, and you know who will hurt from this? The people that invested in change and invested in the new economy, the people than spent the last decade learning new skills. All because a bunch of middle class hicks wanted to take the rest of the country down with their lazy asses.\n\nPeople only care about the \"economic anxiety\" that unskilled white people have. They got to do unskilled labour for a hefty pay cheque for decades. Parties over, the gravy train has ended, for the party of \"personal responsibility\" that denounces UBI as \"welfare queening\" they sure expect a lot of handouts. They expect the gov to keep industries that are basically as good as dead afloat, and to force businesses to pay them for products we don't need.\n\nOnly in bumfuck backwards America is a scientist a \"lazy liberal elite\" and an unskilled worker who refuses to change is \"hardworking and deserves a break\"", "And it sucks that so many hillary supporters are blindly attacking people like you for \"throwing away a vote\"", "He's got at least five kids. Two adult daughters (Ivanka and Tiffany) two adult sons (Donald and Eric), and Barron.", "&gt;\"You cannot be a party which on one hand says we're in favor of working people we're in favor of the needs of young people but we don't quite have the courage to take on Wall Street and the billionaire class. People do not believe that. You've got to decide which side you're on.\"\n\nF**ing A", "as much as I would like someone younger I only trust Bernie atm in the democratic party..", "Does this mean that Sanders is essentially trying to become the defacto leader of a more populist Democratic party now? ", "No but they love the idea of others doing it.", "Do people really leave friends/family/jobs behind just to make their 1 vote for President every 4 years more meaningful?", "Time to restore r/SandersforPresident?\n\nEdit: r/BernieSanders is now open for business.", "still Bernie :)", "Don't forget he also created an HIV outbreak in Indiana by shutting down needle exchanges. ", "In 2060 they'll be running his brain in a jar.", "Pence is wayyyyyy worse than Trump. At least we have no idea what Trump will do. Pence is actually insane ", "Still more lively than Ben Carson", "Come to Michigan. Detroit is getting better.\n\nNo seriously. Stop laughing. Damnit stop laughing.", "Because a great many Americans hate LGBT people.", "I don't understand. How can the Vice President of a first world country be so openly hateful toward a significant minority of the country that spans multiple races and religions? How can you look at the man and say he's the Vice President of the people of America?", "They're both trying to keep Americans from killing each other. Good job. ", "This is why it's so hard to understand how there's ever going to be a compromise. Now that the election is over people are saying that Americans should all try to get along and respect each other. But these hateful views on the LGBT cannot be respected. How can you respect the view that \"gays can't marry because I don't believe it's right\"? You can't compromise with that it's opposition to the rights of another citizen.", "&gt; They don't care about who he is as long as he serves their interests\n\nYou can say literally the exact thing about Clinton. In fact this is the exact reason why I voted for Clinton.", "Assasination insurance. ", "Sanders would not be too old. Hell the man ran an extraordinarily high-energy campaign and can run circles around most of us even at his current age. He's a proven workaholic with a strong loving family at home to recharge him when he needs it. He takes care of himself and has more than enough stamina. What he didn't have was D party support, even though he caucused with them for decades and even paid party dues (while proudly remaining Independent). There is nothing left of the D party today EXCEPT for Sanders, the last one still standing with integrity to help ALL Americans (regardless of party, ethnicity, gender, sexual orientation, et al).", "A very sound decision. I look forward to seeing the President elect defend himself.", "I'll post the facebook statement Bernie made 10 minutes ago:\n\n&gt; We cannot be a party which on one hand says we're in favor of working people we're in favor of the needs of young people but we don't quite have the courage to take on Wall Street and the billionaire class. People do not believe that. The Democratic Party has got to decide which side it's on.", "I don't get reddit. Last two days: they spend all post-election wailing about how there's no doubt 100%, you better believe it that Sanders would have won against Trump. Today: well, we need someone else in 2020 cause *old people.*\n\nI'm no fan of Bernie's politics, but 79 doesn't seem to be *that* much of a stretch. Pick someone as VP that would be an excellent follow-behind in 2020 and have Sanders just serve one term.\n\nAnd edit: so what if Bernie won? And what if he was doing well? Would everyone here be calling for him to step down and let someone else carry the torch in 4 years?", "The Democratic Party has got to decide to coalesce around Sanders as the head of a newer more progressive Democratic party. The current DNC are certifiable losers corrupt, with no credibility. FIRE EM ALL", "while I still hate Pence the idea of Trump backstabbing his supporters is hilarious now that he is pulling extreme right policies from his site.", "\"He tells it like it is fuck this PC SJW bullshit\"\n\n\"Serves you right for being mean to me\"\n\nEdit: Thank you for my first gold, kind redditor :)", "I hope President Obama takes the lead on this one... \n\nChuck Schumer believed the Democrats would pick up 2 moderate Republican voters for every blue color Democrat they lost. This ideology failed.  ", "Oh sweet mother of God I can already feel my pulse slowing down", "There's no good jobs in the swing states. That's the whole problem in the first place!", "Fucking thank you I'm so tired of hearing fellow Dems and liberals always speaking in terms of 4 year cycles. Midterms exist people! Let's actually fucking show up this time for once", "Backstabbing?\n\nEven as far back as the primaries I saw Trump supporters saying that most of what he was saying wasn't meant to be taken literally.\n\nI think this headline called it the best: \n\n&gt;Trump supporters take Trump seriously but not literally. Trump critics take Trump literally but not seriously.", "Then we have the nutjob religious zealot though...", "I'd love to hear that he calls Obama late at night freaking the fuck out over something and Barack is just like \"Ok Donald it'll be ok. Want me to read Goodnight Moon to you over the phone?\"", "We are truly living in the darkest timeline when Trump is not even the worst person who could be President. ", "What if Trump turns out to be a centrist that saves the republican party from itself?", "Exactly if Trump goes, you get President Mike Pence, republican house, republican senate, and a conservative supreme court.", "Obama? He stepped up and campaigned for her ass because she didn't have the charisma to do it herself. She kept going into hiding. How the hell could she be blaming Obama?\n\nAs for Comey also her damn fault. She never should have had the server in the first place. She also never should have ran in the first place while being under investigation for it. It was a live grenade the entire time, and it gave us Trump instead of a Sanders with a democratic house, senate, and supreme court. ", "That's exactly why I voted for Clinton too. But there were enough democrats who thought that Clinton didn't make them feel warm and fuzzy inside enough to vote. So they stayed home or made idiot protest votes instead of voting for their interests and now we have Trump. ", "TIL most everybody I know is racist simply because of the region we live in. ", "\"Stop calling me a racist/bigot/misogynistic asshole!\"\n\nStop supporting electing, and defending the behavior, policies, and rhetoric of assholes. ", "trump's opinion of people is transaction-based. obama must have said nice things about him like putin.", "Yes he was her chosen VP when he stepped down for DWS in 2008.", "I watched an interview where some sources said after the election she was blaming Comey and *Obama* for her loss.  It's never her fault.\n\n**Edit**\n[Link to video](https://www.youtube.com/watch?v=VbN4RqeSfPw)", "My friend we are no longer Clinton or Bernie supporters. We are the liberal opposition. Welcome back.\n edit: Thank you for the gold.", "Hey he only had one term, right? Carter 2020", "The payments stopped.", "France and the UK are dealing with their own surge in right-wing craziness right now so I would not hold your breath. China and India are still growing economies, which means cutting their emissions would majorly stifles economic growth. They will not do anything without external leadership. Russia is Russia, good luck accomplishing anything with Putin in power.\n\nThe world is fucked. BG no re.", "Everyone saying \"oh look he is pivoting towards being responsible\" did not look at the leakes for who he wants in his cabinet.  We're in deep deep shit ", "minus Aidan \"The Tool\" King please.", "For both terms eight years, the GOP and Tea Party and Independents who voted Republican have been saying that Obama was a usurper, a secret Kenyan, an imposter, a traitor, only the birth certificate can prove it, there was a government conspiracy to let a non-American into the White House.\n\nNow that the shoe is on the other foot, they can't deal with 1 day of protesting.", "I've said it many many times before:\n\nThe racist south chose a black guy over her. That should have been the wakeup call she, the DNC and all Democrats needed.", "Even if the pivot does come though the rumored cabinet leaves one in fear. ", "Gotta at least give credit where it's due. He held it together when it wasn't a popular idea and then it got massive. Not all people sign on for that kind of explosive growth and aren't cut out for it. He'll get older wiser, learn from it, like most people do.", "Nobody can predict what he'll be like. ", "The right is taking over.\n\nCanada stands strong. The North remembers.", "Time to throw bums out and get new people in.\n\nWhile the GOP has been working to effectively own grassroots local political offices the DNC seems to have been focusing on making it Her Turn^^tm for 2016 with obviously crappy results.  Clean house and get people who aren't so stupid and self-interested.", "trump will be what 74-75?  given his weight anger and lifestyle, HE'S lucky if he makes it 4 years.", "Clinton was influenced by corporations Trump is the corporations.  \n\nOh well you all knew this when you voted for him.  Good luck everyone!", "That's what is happening.  He's been a New York Democrat his entire life up until 18 months ago.", "And hire Keith Ellison! Bernie supports him as the new DNC chair we should too\n\n[Consider signing this petition to help make it happen](http://petitions.moveon.org/sign/appoint-keith-ellison?source=c.em&amp;r_by=16758931)", "The problem was that s4p became THE sanders sub and then when it was needed public discourse was shut down and there were no viable alternatives.  The credit gies to Sanders for inspiring millions, not mods.", "And now he consults with Jeff Sessions and Steve Bannon. He may have been a Democrat but he's been completely radicalized, I think. Probably started with the birth certificate and he kept going down the Breitbart/Drudge/Daily Caller rabbit hole. ", "The neoliberal order has fallen. They got me to support Hillary and ignore the toxic ideology she represents and the gaming of the primaries on the lie that they would at least stop the monster. Well now the monster is president with a Republican Senate House, soon to be Supreme Court, and near total control of the majority of state governments.\n\nThe lie is over. They weren't even competent. Their hubris and lack of spine has damned us to a fascist regime. \n\nThe Democratic party lies in ruin.\n\nThe time for political revolution is now. ", "I agree that he will be too old. But I do want to say that Jimmy Carter is damn sharp for being 92. ", "And I'm down again.", "No current president in history have campaigned so much for the next nominee as much as Obama did. She surely can't be blaming him!!", "he's appointing all his cronies to the highest positions in the nation regardless of merit. he's putting a climate change denier in charge of the epa, which is the absolute definition of the lunatics running the asylum.\n\nand yet it looks like a lot of trump haters are already falling into the abusive relationship pattern here. all it took was a couple nice words, even though his actions directly contradict any chance of a pivot.", "100% this.\n\nThe Podesta leaks revealed that she couldn't even be bothered to *just act* like she gave a shit much less really give one. She had always been completely out of touch with the electorate, and her campaign was not quiet about that fact internally.", "[Indiana has passed a law that makes it a felony for same-sex couples even to apply for a marriage license](https://www.queerty.com/indiana-will-send-same-sex-couples-to-jail-for-wanting-to-get-married-really-20130709).\n\n18 months in jail for simply *applying* for a marriage license.  This is Pence's vision for America. ", "Clinton is actually a practicing Methodist. The key differentiation is that they have to do good works in this world to get to heaven which clearly informs her life. ", "If Don actually watched Law &amp; Order instead of ranted about it then he would know that public comments about a trial can be used against him regardless of his status.  \n\n", "jesus fucking christ.", "Thank fuck.", "Whenever people want to come on here and still try to talk down about the Bernie Sanders campaign (which is funny considering those people just had their credibility destroyed after Tuesday night but there's a few stragglers coming in here trying their best to speak with an air of confidence) they bring up the *\"Bernie lost by 3 million votes in the primary.\"*\n\nAnd ultimately, they are TRYING to brag about Hillary's southern firewall votes in states........that don't mean shit in the general election.\n\nShe ran up millions of more votes in places that don't matter. They might as well have been facebook likes.", "Contrast this with the fact that he absolutely refused to prepare for the debates.  I'd be happy if he's finally decided to listen to others and admit he's going to need help but it just doesn't seem like his style at all.", "lol. Trump isn't doing any kind of pivot. He was nice because things are going his way and Obama was nice to him. This is the same shit he always does.", "Ive actually already had them on here blaming us for being mean to them which forced them to vote for Trump.", "Exactly. I've been telling everyone this but no one seems to understand my point. Her supporters deserved to hear her speak that night. \n\nNot long after Podesta spoke ('they're still counting, we'll speak tomorrow'), Hillary conceded to Trump. Podesta's statement was a microcosm of her campaign: telling a half-truth so the world wouldn't see how weak of a candidate she really was. ", "Here's what side I'm on (my political priorities in order):\n\n1- Climate Change requires immediate and drastic action even if its painful economically.\n\n2- The internet should remain free, open, and available to as many people as possible (especially kids who benefit enormously from internet access with regards to their education).\n\n3- Get money out of politics for good (overturn Citizens United).\n\n4- Deal with wealth inequality by taking on the 1% and forcing them to pay a much higher tax rate.\n\n5- End the drug war. It's costly, stupid, and targets minorities disproportionately. \n\nThere needs to be real discussion about the DNC's new platform, and it needs to be dramatically different from its current platform. ", "he's only a few years older than trump who is over weight and loves mcdonalds.", "Bernie will live until 120 in perfect health.  Vermont air and righteous democracy is his life blood.", "People keep saying this while in the same breath decrying muh \"liberal city elite\" SJW boogyman. Republicans are now calling for the left to take the high road and play nice after they just spent the past decade trying to make the word \"liberal\" an insult. Give me a fucking break. ", "Yes. \nUnder Hillary the media would have given this issue the same treatment it gave Obama apologetic softball non reporting.  \n\nThat was always the greatest danger of Hillary, the elites would allow her to continue to build a militarized surveillance state. \n\nNow the elites are faced with prospect of not only losing control of that state, but having it used against them. \n\nRed and blue partisanship needs to be set aside and focus placed on dismantling the surveillance monstrosity. ", "Hey we might just be so lucky about the climate that there are soon no future generations left to bemoan this election.", "I think talking fault is very nuanced and there are 2 ways to look at it. 1 way is the immediate actions which caused this voting. And the 2nd way is the \"game theory\" way of looking at the election as a whole. I prefer the 2nd way because that is what will go down historically although the 1st way looks at the specific concrete action of individuals voting.\n\nNo one looks back at old elections and goes \"Its bob and janes fault for not voting\". They say \"the campaign failed in x,y, z ways while the opposition succeeded in grabbing this demographic. Similarly I think the historical version of this election will be looking at the failures of the DNC as an organization.", "He makes it sound like they elected trump because we wanted to build something nice and had a plan to do so and because we were mean to them they wanted to take it away. He's saying they elected trump because they are bratty spoiled children.", "Your party nominated the person who lost to him. This is both of their faults.", "ITT: Democrats have learned nothing after devastating loss. ", "Trump and the GOP are about to erase 8 years of progress. A sad time for America.", "Oh god it's too real, this is literally everyone I know right now who voted Trump. ", "That was Kaine's reward for stepping down as the DNC chair to get loyal Debbie in.\n\nA little speculation here.", "The reality of politics ever since it's conception, is what just about every politician bitches about, \"It's like highschool\". Politics is VERY clicky. Sanders isn't necessarily the cool kid people gravitate around. So he's going to have to run exclusively off his political capital gained through his mandate of 13million votes and public popularity. But on the inside, he's still not very popular, thus it's far harder to get the cliques to listen to him. ", "Trump: after spending 90 minutes with Obama I realize I didn't know what I'm talking about. I'm now sticking with Obama's legacy. ", "I think there should be a 3rd take away too.\n\nDemocrats don't understand Republicans and can't empathize with them. In the wake of the election a large majority of people have been posting how people voted for racism and bigotry. But in truth I doubt many voters were specifically voting for those ideals. I bet they were voting for what they saw as a better economic solution and against the corruption they saw in Clinton.\n\nAnd I don't think you can convince people to vote for your candidate if you are unable to understand their viewpoint or empathize with them.", "I love the idea that Trump supporters voted for him with the expectation that he wouldn't act like himself as president and wouldn't impose the policies he promised as a candidate.", "McConnell's already said that the GOP shouldn't overreach here. He knows that the nuclear option will bite him in the ass down the road.\n\nDemocrats need a spine here and they need to force Trump to come to the table with his own Garland-esque pick, that both sides can stomach. If that means the seat is vacant for another two years and the Dems get beat up for their obstructionism every single day, so be it. ", "The US manufactures twice as a much as did it 30 years ago with one sixth of the workers. NAFTA didn't take away their jobs, computers, robots, and new business practices like Lean and Six Sigma did.\n\nThose jobs are never coming back. Go to any factory built in the US in the last 5 years and count how many workers you see. Everything is automated.\n\nThese working class whites need to get skilled up or start pushing for a Universal Basic Income, because those jobs are never coming back. Ever.\n\n", "I'm just saying anyone who cared to inform themselves could have known all of this beforehand. Trump got pretty much the same amount of votes as McCain and Romney, a tiny bit less, so there's no great surge that defeated the Democrats. Liberals just didn't care to show up to vote, even for down ticket to be a check on power. So now you get conversion therapy advocated from the White House.", "He went mod crazy.  He thought he was some wunderkind heir apparent to Sanders but he's just a redditor.  He failed to let the community explore democratic socialism and instead went for authoritarianism.", "Please let his motto be \"Hindsight is 2020!\"", "Good ", "I completely understand the age argument. It's totally reasonable to have that concern.\n\nThat said I completely trust Bernie's judgment on his own limits. If he thinks in 4 years time that he is able to run and hold office then I will absolutely rally behind him.", "Yes that does seem to be his goal. Or, at least, the role fate has put him in.", "Friendly Reminder: [Keith Ellison tried to warn people about Trump when he was gaining momentum in the GOP primary.  ABC laughed at him](https://www.youtube.com/watch?v=FHkPadFK34o)", "I would campaign and vote for Bernie if he was 99. I will follow that man and his ideals for the rest of my life. ", "That's some gold. \n\nDemocratic ads against Trump would all end with #Hindsight 2020", "Suddenly Sanders gets more press and interviews as he did when he was running for presidency. Everyone was waiting for what he would say and everything he said (his statement yesterday and his interviews today) was widely reported everywhere.\n\nYeah it is nice, but still --&gt; fuck you, mainstream media", "Bernie is in good health. Fuck anyone that says he shouldn't run. He'll have a VP for worst case scenario.\n\nBernie motherfucking 2020.", "For those who don't know Keith Ellison is a Muslim.  Not that that should matter, but it does make an interesting counterpoint to Trump's rhetoric.", "It's not ageism. It's a legitimate concern. Bernie is pushing 80 and would be applying for the most mentally (and physically) taxing job in the US. And no Sanders would probably not run circles around 95% of people on this site.", "He only used the uneducated white male for his vote. That's where the relationship ends. None of those controversial topics were meant to be actually carried [to the dismay of the KKK] but it's still emboldened racists and bigots.\n\nAll of these middle class Trump supporters that think that he's going to bring back jobs to the Mid-West and South are delusional and don't have functioning brains. Their current state is going to remain the same especially when he himself will buy Chinese steel over American steel to save a buck.", "I think that would be a great symbolic thing for the Democrats.  Plant our flag squarely on the side of a diverse and tolerant America.  ", "Fucking god please run. I don't care if you're 80, age is just a number. People die randomly at age 30 and 20, and some people live to be over 100 and want to die but can't seem to.\n\nFor the love of christ, run, he will win. 4 years from now, we'll have so many more millennials that will get out there and vote, and 4 years from now, more baby boomers will be dead &amp; not voting for trump and friends (not hoping they die, just stating a fact).", "They voted for a con man. He says whatever is necessary to get what he wants. No one knows what the hell he's going to do on policy.\n\nI'm 100% positive about one thing though in 4 years time the Trump family will be several billion dollars richer. ", "Tim who?", "Hi Reddit speaking. I'm more than one person.", "Listen you lazy assholes. There is no quick fix to this problem. You aren't going to just move to an economically depressed area and drowned out the people who live there on election day. This is the height of elitists shit right here. How about we make a Democrat party that doesn't abandon 70% of the states in the union and has a platform that actually empowers people to provide for their family instead of trying to do an end run around democracy.", "The media is trying to find the new face of the party after Obama is out of office... with Hillary fading to the background the logical choices based on their positions in the election are Tim Kaine and Bernie Sanders.\n\nEdit: I'm not saying I want Tim Kaine. I'm saying the biggest figures in the party right now are Obama, Clinton, Biden, Kaine, and Sanders. The latter two are the only ones that will hold office three months from now.", "He's already getting down and dirty in the trenches. Didn't waste a day.", "And refused to acknowledge the outbreak for a while ", "My money is Trump becomes \"status quo\" man and nothing changes and then I can die fucking laughing at the Trumpers. \n\nHowever I do strongly have my doubts. ", "Yeah Tim Kaine was a freaking dud.  Good on paper, not so much in practice.  The guy could barely deliver Virginia.", "Bernie/Tulsi 2020!\n\nTulsi/[insert VP here] 2028!\n\n\nEdit: Christ Reddit why are we still saying a centrist would be a good candidate? Anyone who thinks centrist policies are important to most Americans and the most electable, clearly haven't been paying attention.", "Also what's with all this bullshit ageism? Birdy would run circles around you neckbeards.", "I wish the campaign occupied a non specific name like /r/BernieSanders or one of the other similar ones out there just like Trumps campaign occupied /r/The_Donald. That way it would still be here, /r/Sanders_For_President was almost necessarily shut down because he obviously couldn't be associated with /r/sfp after he dropped out and supported Hillary. \n\nAnd I'm sure he would not be willing to participate in r/sfp so close after the election, It would generate a ton of bad press and complicate things politically. Now is not the time to start a campaign for president for 2020.\n", "Don't worry man! Trump will bring all the manufacturing jobs back from the robots! ", "\"...I love the poorly educated\" - Donald Trump\n\n\"Republicans are crazy just nuts\" - Donald Trump", "That's a real interesting thought experiment. A Muslim and a socialist leading the Democratic party would probably be a real boon to Hannity's ratings.", "Well he already changed the Democratic platform so he might as well go all out at this point. Considering Keith Ellison partially predicted a Trump presidential victory seems all the more reason to have him become the head of the Democratic Party.", "&gt; I'm 100% positive about one thing though in 4 years time the Trump family will be several billion dollars richer.\n\nHe basically said as much when he refused to place his business interests in a blind trust.\n\nUSA 2016 looks very similar to Russia early 1990s. Wonder if our GDP will shrink to a quarter too, as the oligarchs and politicians carve up the riches.\n\nThe most idiotic thing: American citizens voted for this highway robbery.", "Isn't Ellison black too?  It's a trifecta!", "have you seen that fucker  ball?  dude would trounce you on the court", "Doesn't matter.\n\nEmails.", "Act one must be to challenge the Ohio vote. They already won the case that ruled it illegal \n\nNow Ohio must show they reinstated those voters in time for the election,  the evidence suggests they did not. \n\nhttp://www.cleveland.com/open/index.ssf/2016/04/ohio_secretary_of_state_jon_hu_6.html", "He wasn't that great on paper either", "Part of me wonders if the only reason Trump picked Pence as his VP is because now nobody is ever going to assassinate him. President Pence is objectively worse than President Trump\n\nEDIT: Okay so maybe not the only reason. But I'd like to think that he doesn't *actually* support Pence's thoughts on LGBT people. I'm not an American but I don't want those ideas spreading over here", "Rich elites telling poor people to disparage slightly poorer people. Elite agenda achieved.", "Meanwhile an [old man was attacked by a group of thugs](https://www.youtube.com/watch?v=PIAjIByVgdk) for being a Trump voter. Make no mistake there are assholes on all sides.    \nClosing one eye won't make the other see better.", "His doctor recommended 20 hours of sleep.", "One term.\n\nHis supporters will be very angry &amp; bitter once they discover they have been duped &amp; used by the self-admitted groper.", "Tell me again how Trump is going to be good for working class Americans...", "They will never agree. Intellectual dishonesty is what republicans do best.", "Didn't you hear? They were *upset*. /s", "Seems like. From outsider -&gt; de facto leader of the party is an appropriate reaction when the current leaders fuck up this badly. ", "Well then maybe you can put your trust in a Berniecrat, a up and coming new breed of Democrat sworn to uphold his legacy.\n\nA promising one is Zephyr Teachout.", "Matthew 4:8-9 is pretty applicable. \n\n&gt;Again the devil took him to a very high mountain and showed him all the kingdoms of the world and their splendor. \"All this I will give you,\" he said, \"if you will bow down and worship me.\" \n\nTrump came along to Evangelicals and offered them power over the nation. Like Jesus, most Evangelicals I know recognized Trump as Satan... they acknowledge how vile and terrible he is. \n\nUnlike Jesus however, they bowed down and voted for him in exchange for promises of power. ", "If you support this then please sign [the MoveOn petition](http://pac.petitions.moveon.org/sign/appoint-keith-ellison?source=c.em&amp;fb_test=0)!", "I'd love to see a Obama vs. Sanders 1 v 1 matchup on the court.", "Fucking hypocrisy at its finest. ", "Hi this Reddit again. Don't listen to that last post I made. It's just me here.", "My 4 point plan:\n\nIdentify the House &amp; Senate seats most likely to be vulnerable in 2 years at the midterm elections.\n\nWork with Bernie to create a network to financially support those candidates and act as a grass-roots PR campaign to raise awareness of them and generate name recognition well in advance of the midterm elections.\n\nCreate a database and article hub of flip flops bad calls, and damaging actions &amp; statements from the vulnerable Senators &amp; Congressmen. Keep their corruption and failures in the public eye constantly for the next 2 years, allowing their constituents to tire of their drama, giving a new candidate a better shot at the seat.\n\nCreate update lists, support groups, local networks for outreach &amp; discourse. Get young voters involved in the process now so they will remain engaged and show up to vote in 2 years.\n\n4 things (in broad strokes) to limit Trump's damage to half a term. Rebound from what just happened and get active now rather than in 2 years. If the high emotions can be tapped into now and carried for just 2 years, we could potentially carry the midterms and stop this crazy ride.", "[Deleted for this](https://i.imgur.com/Blysl7S.jpg)  \n ^^^^^^^^^^^^^^^^0.38127236456186064 \n &gt;", "I can't wait for the day all the disillusioned Trump supporters to realize the \"I'm the only who can fix everything\" lie that Trump pushed was just another one of Trumps lies.\n\nEdit:  Looks like this will happen sooner than anyone thought.", "That's unsurprising when you vindicate racist opinions on a national scale by electing a man who is pathologically incapable of treating other people with respect. ", "Seriously? This kind of back door favor exchanging is exactly what makes politics so ineffective. Politicians are so busy keeping track of who owes whom and what favors they can call in that they don't spend any time simply doing work.", "This is just the beginning. I want the heads of every prominent DNC employee on a spike.\n\n\nMetaphorically speaking of course. ", "We need Trump to make it. No one wants Pence. ", "It makes me so happy to see this on /r/politics again", "I think it's been made clear that America doesn't want extra trade routes. ", "But how is this possible? Trump supporters told me his platform would stand by the lgbt flag!", "Just remember that at every step in the past 18 months of this election season there was talk Trump would finally pivot. Never happened. He is who we saw this past year and a half. There's no reason to disbelieve it now just because some pleasantries have being exchanged in light of his victory.", "These are the same people threatening an armed rebellion if Clinton won.", "Man this subreddit is so different now that CTR is gone. ", "Day one Trump and the Republicans take credit for the Obama economy. ", "It was just not a good idea when we had a candidate as hated as Hillary.  If someone like Biden had won the Democrats would have been able to win over a lot of moderate republicans who couldn't' stomach Trump.  I think the party needs to focus on making a direct appeal to working class Democrats though.  ", " #GeriatricTogether", "Sorry we weren't able to stop you from fucking up the country....again.", "This can only be a positive. Maybe just maybe, some of this rhetoric was just a strategy to win the primary, then the general, and he now realizes that being president will require Trump 3.0. ", "This is actually quite comforting. \n\nAlso lol to all of you who voted for this guy. The rich are going to have a field day at your expense, and you fucks will continue to stew in poverty and Mountain Dew sweat and blame someone else for it. \n\nYeah, I'm bitter and salty and mean. I'll be nicer about it later on, maybe, when you guys are hurting as badly as a family member of mine whose mother won't be able to afford his hospital visits without the ACA. Repealing that is still very much on the table, I'm sure. ", "Omfg this is desperate lol how about appeal to the working class instead?", "You are already losing with Trump He is now rewriting his campaign page to remove all those promise  he made you. \n\n\nhttp://www.businessinsider.com/trump-muslim-ban-removed-from-website-2016-11\n", "A Sanders/Ellison ticket for 2020 would be my dream ticket to be honest. Just imagine the heads that would explode at that duo being the two most powerful people in the world. A beautiful partnership of two amazing progressives. However if Ellison becomes chairman of the DNC that would also be fantastic, of course!", "More #draintheswamp amirite?\n\nHere is a helpful image for what Trump is doing except replace the \"filter\" with \"diaper pail\" - http://www.hth.co.za/images/pump/How-it-works.jpg", "Day two: They wreck it. ", "Bernie has become the defacto leader of the progressive movement. I expect Hillary to check out now that she can't be president.", "Flip side Trump supporters being attacked: http://abc7news.com/news/peninsula-teen-attacked-at-school-for-support-of-trump/1599714/", "As always when Republicans fuck shit up; blame Democrats.", "It was known and it was ignored.  \nApparently sending a message was more important than values and dignity.   \nToo bad that the message was horseshit too.  \nNow deal with it.", "You do realize that there is actual video proof of a Trump supporter being attacked and you ignore it because it doesn't fit your narrative? And yet you chose to believe these twitter victims with 0 proof who couldn't possibly be lying like we've seen in the past?", "I don't understand this assassination insurance concept. Surely any would be assassins would have more than one bullet.\n\nNot that I'm advocating this.", "He gave boners to people like the KKK Anne Coulter, David Duke, and their followers. No shit hate crimes are going up. \n\nNot all Trump supporters are racists but all racists are Trump supporters. He's said things to embolden these people and grow their ranks.", "People like to speak confidently over things they know nothing about.  You can't let their hypocrisy bother you.  Just be the best person you can be and forget about what other people's biases make them say.", "My dad just called. He says \"thanks for the tax break suckers.\"", "He couldn't even go a week keeping up the charade of being the working class hero. ", "Anybody but herself apparently. She is a narcissist down to her core nothing will ever be her fault. ", "&gt;Rather than continuing the current path to undermine and block America’s fossil fuel producers the Trump Administration will encourage the production of these resources by opening onshore and offshore leasing on federal lands and waters. We will streamline the permitting process for all energy projects, including the billions of dollars in projects held up by President Obama, and **rescind the job-destroying executive actions under his Administration.**\n\n&gt;**scrap the $5 trillion dollar Obama-Clinton Climate Action Plan and the Clean Power Plan** and prevent these unilateral plans from increasing monthly electric bills by double-digits without any measurable effect on Earth’s climate.\n\n&gt;**We will lift the restrictions on American energy**, and allow this wealth to pour into our communities. It’s all upside: more jobs, more revenues, more wealth, higher wages, and lower energy prices.\n\nSounds like he wants to roll back a lot actually", "So Trump himself would be ineligible for a position in his own administration. Ironic.", "SIGN ME THE HELL UP BOYS!!! LETS FEEL THE BURN IN 2020!!!", "&gt;Speaking to Bloomberg News ministry spokeswoman Maria Zakharova said staff of Russia’s embassy in the United States met with members of Trump’s campaign — meetings she described as “normal practice.” Democratic Party nominee Hillary Clinton’s campaign refused similar requests for meetings, she told the agency.\n\n&gt;Asked later for clarification, a Foreign Ministry official declined to elaborate on Ryabkov’s remarks but said standard diplomacy called for “contact with the leaders in the campaign” on matters such as clarifying statements by the candidate or conveying interview requests from Russian journalists. The ministry official spoke on condition of anonymity because of the sensitivity of the matter.\n\nIs this a big deal?", "&gt;it seemed unlikely that **BernieBros** would be very interested in that invitation\n\nPatronizing much?", "How's that draining the swamp working out for you trumpers?", "And Sander's populist platform is the only way to get that done.", "And even if he does he has caused actual harm in stoking these racist fires. He should not be forgiven for it just because he is President-elect. He needs to actively work at it for many many years to undo the harm he's caused.", "Well evangelicals across the board tend to lean republican add to that Mike Pence, who is very well liked by evangelicals, being one himself, and there you go.", "It's been 5D tic tac toe all along! ", "Let's cryogenically freeze him now and thaw him out in 4 years", "He has said that in 2 years when his senate term ends he plans on running for reelection which would put him in the senate for the same amount of time as the 2020 term. I think he'll be fine.", "Wow.\nThat video and the reaction to his statement, is incredible.", "Well so he says now. If it's the same in 2020, then great.", "It's about damn time. We wouldn't have had this problem if the Democratic establishment party LISTENED to the public's outcry. Idiots. Now we're stuck with Trump for 4 years. Bernie deserves to lead - he's been right for over 30 years and we'd all be incredibly stupid to not listen to him now.", "~~Elizabeth Warren~~\n\n[Tulsi Gabbard](http://www.ontheissues.org/House/Tulsi_Gabbard.htm)\n\n[Sherrod Brown](http://www.ontheissues.org/OH/Sherrod_Brown.htm)\n\n[Keith Ellison](http://www.ontheissues.org/House/Keith_Ellison.htm)\n\n[Jeff Merkley](http://www.ontheissues.org/Senate/Jeff_Merkley.htm)\n\n[Corey Booker](http://www.ontheissues.org/Senate/Cory_Booker.htm)\n\n[Nina Turner](https://votesmart.org/candidate/75105/nina-turner#.WCT-1fkrLcs)\n\n[Jon Stewart](https://www.youtube.com/watch?v=V1Xf1Kn53Es&amp;ab_channel=TheBostonGlobe) (Added for /u/alterv27 because god I miss Stewart)\n\nWe have some good fighters here. I'd go all out for a Gabbard/Brown or Warren/Gabbard ticket\n\nEdit: From the comments on this I can tell Reddit has a general distaste with Warren. She'll still back liberal principles, but I can see your point on her being weak against Trump. Not sure why people are calling Gabbard conservative.\n\nWent ahead and added some of the people mentioned below. ", "you are god damn right", "*This ad payed for by Hindsight 2020 For a Better America PAC*", "I work in a Nursing Home with people younger and older than Bernie who are in terrible health. If you're 95 and in great health why not? The people I've met who are old and in great health tend to be the wisest people I've ever met. One term for Bernie to set the tone would be a great way to start. ", "The problem isn't Trump. The man is hot air - he just said what he needed to say to get elected. No the real problem is everyone he brought up with him, because they are the ones who are really running the show.", "The first people to hurt are going to be the farmers.  \n\nTrump has promised to \"renegotiate\" NAFTA in the first 100 days and [if that's not possible he'll scrap it](http://www.npr.org/2016/11/09/501451368/here-is-what-donald-trump-wants-to-do-in-his-first-100-days).   This will allow other nations in Latin America to make [a politically popular move](http://www.iatp.org/blog/201311/nafta-and-us-farmers%E2%80%9420-years-later): adding tariffs to U.S. produced food, especially wheat and corn.  What's the problem with that? Well, since NAFTA was passed, [U.S. wheat exports grew by 300%](http://www.ers.usda.gov/webdocs/publications/wrs0201/31319_wrs0201i_002.pdf).  The United States is going to have a glut of non-exportable food in the market.  Indeed, NAFTA has been best at protecting the interests of farmers, [even at the expense of manufacturers.](http://www.npr.org/2013/12/08/249570005/nafta-turns-20-to-mixed-reviews)\n\nAt the same time -- if Trump does not pass immigration reform and focuses on deportation, as he has promised -- [labor costs for farmers will rise](http://magicvalley.com/business/agriculture/trump-s-immigration-plan-raises-questions-for-farmers/article_5b0645ae-24d5-5841-9072-9876cfa7f59b.html). Within Trump's first 100 days, they will be selling their products for at cost or below cost, AND dealing with rising labor costs. [It will be cheaper to let crops rot](http://farmfutures.com/story-crops-rot-while-trump-led-immigration-backlash-idles-farm-work-17-142405) rather than harvest them and put them on the market. \n\nWithin the first two years, we can expect to farmers lose their land because they can't afford Trump's policies. These will be the first jobs sacrificed in the name of protecting the Rust Belt's dwindling manufacturing jobs -- jobs that [are disappearing due to automation.](http://www.chicagotribune.com/business/ct-trump-biz-tech-automation-robots-jobs-20161109-story.html) \n\nAnd that doesn't take into account the likelihood that [water rights will become more expensive](http://www.desertsun.com/story/news/environment/2015/09/30/even-drought-ca-water-rights-politically-toxic/73065384/) in the American West as climate change affects drought.  \n\n\nFarmers will be the first to hurt.  \n\n\n\n\n\n", "Well hold on the democratic party has been much more aligned with the needs of working class people than the republican party. Getting that message across has been the failure.", "Obama would win. Dude can seriously ball.\n\nIf it were a 2v2 game with Bernie and Obama vs Trump and Hillary the score would end 21-0.\n\nBERNIE LOVES DISTRIBUTING THE ~~WEALTH~~ BALL.", "This edited one gave me a laugh back when it was funny: https://www.youtube.com/watch?v=J6M_2fTACeI\n  \nAlso glad to see you are still around!  I was a big fan of your work during the primaries.  Some of the best, most informative posts I've seen on this site.  ", "&gt; UPDATE: Trump's proposal to bar Muslims from entering the US has been restored to his website. \n\n&gt; \"The website was temporarily redirecting all specific press release pages to the homepage\" his campaign said in a statement.", "But guys he wasn't serious about it, he actually likes the gays, he was just pandering to win the election. /s", "The mainstream media was so smug arrogant, and out-of-touch this election.", "Hahahah oh my god\n\nLast night I teared up but damn I am literally laughing now. I actually burst out laughing at this articles.\n\nSo he's got a Goldman Sachs banker whose been on GS payroll for 17 years (announced before the election, Mnuchin, his campaign finance manager... wow that doesn't sound shady at all!), and now JP Morgan...\n\nWho is next? Morgan Stanley? Maybe round it off with Chase.\n\nWhat an amazing anti-establishment.", "&gt;At the same time -- if Trump does not pass immigration reform and focuses on deportation as he has promised -- labor costs for farmers will rise.\n\nIt's interesting you mention this because I heard of someone in Texas that's a farmer and had all of his illegal workers rounded up in an ICE raid. That entire area saw their crop spoil and go to waste right in the fields because they couldn't find anyone willing to work $3/hour in scorching heat to harvest.\n\nIt's why I can't take Republicans seriously. Elite Republicans need cheap labor but middle class Republicans hate immigrants that provide the hard cheap labor.", "jew socialist endorses black muslim for dnc chair\n\nget rdy america the revolution is coming", "The president and vice president are kept apart as much as possible for this exact reason. They never fly on the same plane either.", "Yeah I remember the time he gave three huge rallies in one day. I was sitting in my pajamas in the middle of the afternoon reading about it and was getting tired just thinking about how exhausting that would be. And I am less than half his age.\n\nNot to mention all of the travel he was doing - and at the beginning flying economy no less! I get worn out and cranky during the travel days when I am on *vacation*. \n\nThe man is a superhero.  Or I am extraordinarily lazy. Probably both though. ", "Companies are gonna be thrilled having to pay human workers who do a third of the work as free robots!", "If Trump follows through with what he's said on the campaign trail and what he's laid out in his 100-day plan - my fellow Americans have truly fucked up. \n\nWe're already at a point of catastrophe with the earth's global climate. The science that suggests emissions from human industry only serve to make the matter worse which turns out to be even more compounding than previously though, dismantling 50bil in renewables spending and appointing a climate denier to the EPA is basically suicide. \n\nOf course, Trump and the Boomers won't be around for long after drought, sea rise, hurricanes, and a massive decline in the planet's biodiversity essentially put all of humanity in crisis. \n\nThis cannot stand... if our president moves forward in this manner something must be done. America going full-tilt fossil fuels in 2016 will have a devastating effect on the entire planet. ", "Wait Trump isn't actually a champion of the gay community ? Who would've guessed, it's not like his VP advocates gay conversion therapy or anything.", "They're going to have to invent a new name for the emotion they'll be feeling in a few years when he fails to deliver and the social safety net that keeps them alive is systematically dismantled by the very people they voted into power.\n\nThen the Democrats will get voted back into power and will do their level best to fix the country for four years, maybe eight.  And because fixing problems isn't sexy or fun, and requires things like taxes, the GOP will groan and grumble and get all those people and their kids to vote for them again because those awful Democrats just tax and tax and tax.", "You can't compromise with shit like this because it is wrong and evil. And that's why we need to fight it not \"give it a chance and see how it goes\".", "Move to Michigan Pennsylvania, Missouri, Florida?  But there are no jobs there.\n\nhmmmmmm....... wait a second...", "I love Bernie as much as anyone and voted for him but I think he is much more valuable as a reformer now than anything else. I want to see new faces lead the Democratic party -- faces that publicly supported Bernie. I think Ellison head of DNC is great. My personal too early choice for democrat candidate in 2020 is Gabbard. I think her name cannot be thrown out enough as someone with integrity freedom from corporate ties, and an ideology/experience that both progressives and conservatives can get behind. ", "&gt; What an amazing anti-establishment.\n\nGonna drain the swamp and replace the alligators with crocodiles.", "Mike Pence was the reason decided I would vote against Trump regardless of who the democratic nominee was. I actually like the idea of education people marrying who they love regardless of sexual orientation, and even logical things like not causing HIV epidemics.", "Keith Ellison would be a great first step to returning the Democratic party to the people. Watch him grill the CEO of Wells Fargo just like Elizabeth Warren: https://www.youtube.com/watch?v=NNbg14F2paU\n\nHe is also co chair of the progressive caucus the same group Bernie Sanders is part of. ", "Ken Bone asked the one question about climate change.  And all we talked about was his fucking sweater.  \n\nIf the experiment of democracy is going to continue we really need to work on our attention span. ", "TrumpedUpTrickleDown ", "As I said above - for Christian fundamentalists and Dominionists he (pence) is dream come true. They undoubtedly realize that they are one heartbeat away from realizing the God-driven America they've always wanted. \n\nIf these folks can shoot abortion doctors don't think they won't shoot a president to bring about the kingdom of God on earth. \n\nBe very afraid. ", "Yes and the faster that we support him in this role then the faster we can start organizing against Trump and planning for Bernie's 2020 run for the White House.", "Because the American people just elected a candidate running on a platform of hatred.", "Some years back (around 2011) Georgia cracked down super hard on employers who hired undocumented workers. It damn near destroyed agriculture in the state, with nobody able to afford to pay people to pick their crops, and no citizens willing to do the back-breaking and surprisingly complex work of quickly living crops. The immigrating scapegoating is built on not actually ding anything beyond making noises and picking up the occasional undocumented immigrant for deportation. That changes, and the economy is screwed.", "Ugg. They tried that line so hard and it's so sucky.", "Wait you mean he actually doesn't like the LGBTQ community? But he waved their flag during a rally! /s", "So as a European I always thought Republicans stood for a small government? That the government shouldn't decide too much? Why is it that they \"excuse\" meddling when it comes to gay rights and abortion? Suddenly, it's very important that the government has a saying in your life? ", "Jesus dude leave the echo chamber once in a while, there has been a lot of senseless violence against Trump supporters.\n\nhttps://youtu.be/EMux_UHmpvc", "Thanks\nGlad the election is over. Hopefully lessons are learned.\nMy best hope is that Trump continues to defy the \"establishment\", from both parties. Not confident, but as Keith said, stranger things have happened.", "As someone who lived through the Bush years I can tell you that you and anyone else who voted for Trump are going to get what you deserve - and that isn't jobs and new ideas.", "Fuck the Democrats. Start a new party Bernie!", "As someone who is gay. I am trying my best not to panic but seeing both Trump and Pence's track record it is difficult to maintain an optimistic attitude. Regardless, the best thing that could happen over the next four years is lgbt rights just staying the same and not loosing any.", "Holy shit that is good.", "Most of the more fundamentalist \"christians\" would vote for the devil himself if he ran as a republican against Jesus as a democrat.", "They knew what they were getting. They just wanted to send an message to Washington no matter what the price. Even to themselves.\n\nEach voter was just just willing to cut off their nose to spite their face.", "This isnt the best advice. Or good advice.", "It's already Pence. Trump isn't gonna do shit. Pence + Paul Ryan + Mitch McConnell are the presidents of the country now.", "Or just don't move the DNC will make your locale a swing state soon enough.", "This this to the top.\n\nFree trade deals are EVIL until you actually read a fucking book and understand why we have tires that don't cost $500 a piece and cheap toys at Wal-Mart.\n\nBut it's cool, WI and MI are going to be 1950s prosperous, you just wait!", "Every incumbent Senator in states that went for Trump was re-elected. \n\nSo much for \"draining the swamp.\"", "Tim Kaine is the absolutely wrong direction the party should go in. If they do they're just doubling down on Hillary's image of robotic boredom. The DNC should kick out the idiots who rigged the primaries against Sanders, like Debbie Wasserman Schultz and Donna Brazile. Those two idiots lost us the election. ", "Bernie needs to lead the Democratic Party. ", "As a Minneapolis resident I really like the work Ellison does. He is a great fit for the role. ", "The consequences of not voting for Clinton to become President have already started to kick in.\n\nShe was an infinitely better candidate in practically every way but an appalling 60 million Americans ignored her and pretty much every intellectuals' warnings. That's their fault for not listening, so this is what you end up with.", "Carter 2: Cart Harder", "He was total fucking disaster as governor of Indiana too. ", "A con man doesn't actually care about the product he's selling you. He simply wants your trust long enough to take advantage of you. ", "Yep. And he's currently supporting MN Rep Keith Ellison one of the few Dem office holders to endorse him in the primaries, as the new DNC chair. Let's help make it happen. [Considering signing this petition to make a little noise](http://petitions.moveon.org/sign/appoint-keith-ellison?source=c.em&amp;r_by=16758931)", "Runningback in the NFL is the most physically taxing job in America fwiw.", "Dude drop this mentality. We need to not waste time squabbling over the MSM, line up behind Bernie immediately and start planning on Trump's opposition and Bernie's 2020 run.", "We have the technology we should just clone Sanders and put him in every important position in government.\n\nedit: actually think about it, it would make a cool movie, clones of the best politician have some sort of accelerated aging gene so that we can get mature clones into the government. But they keep aging till they die, giving them a natural term limit, removing all the problems with people trying to hold onto power forever. ", "Wish she had won her election. Would have been easier for her to run as the dem nominee for the presidency in 2020.", "Lived in Ohio for years and you're right - the \"kind of\" bit is way too generous.  Apart from Columbus it's a giant shithole.  Not as bad as Michigan but in some parts it's not far off.", "still more electable than clinton", "Yeah man! Why would companies from around the world just build machines or send their manufactoring business to chinese bots when they can spend three or more times as much paying people who aren't as efficient!", "&gt;Hillary primary voter here(ive been a bit reformed recently \n\nNothing like getting played like a fucking fiddle to wake you up I suppose", "Im sick of people suggesting Corey Booker as the leader. Corey Booker sucks. he's a neoliberal practically a republican.", "I know right? It's like the majority of people are actually reasonable! Seriously, I'm so glad for /r/politics to be back to normal.", "Rigging your own primary to nominate a flawed candidate doesnt appear to be a winning strategy.", "This comment brightened my day. I'm so tired of the \"we need to heal the divide\" narrative. No thanks. I'm going to crack a beer and watch rural America slip deeper into poverty Florida disappear beneath the sea, and Trump's net worth eclipse Bill Gates.", "It's the same sort of concern trolling that the far right does in France and the U.K. \"no, we have to stop Muslims from entering out country because they don't share our liberal values such as our tolerant attitude toward gays.\"", "&gt; He held the flag what more do you want?! \n\nT_D", "Clearly you have not considered the possibility that Pence's views are broadly considered a feature not a bug. I'm actually more concerned that a good percentage of the electorate realizes now that an evangelical (potentially a Dominionist) is one heartbeat away from the presidency. They could very easily find themselves in a position to create the semi-theocracy they've hoped for many years. Troubling to say the least. ", "Here's where Trump voters get left behind. Hope you alt righties enjoy being tossed in the garbage like the used condom you are.", "&gt; the candidate who waved rainbow flags\n\nWow that makes him such a friend to gay people. Meanwhile, he picked Mike \"gay conversation therapy is awesome!\" Pence as VP.", "I feel like I've probably met/heard of someone with either first or last name \"Zephyr\".\n\nHer middle name is \"Rain\". *Edit that means you can take her name to mean wind rain teachout. \n\nHer wikipedia says she grew up in Norwich Vermont. It's a weird place. You have a mix of total hippies, Dartmouth intellectuals/trust fund kids, rednecks and all sorts of unexpected hybrids between those groups. It really is a pretty unique area.", "/r/WayOfTheBern /r/Political_Revolution", "We will soon see whether or not they have done so successfully or instead simply handed the bomb to the establishment.", "Perhaps not but this is: \n\n&gt; It is not clear whether Trump currently has any investments in the country, because he has not released any tax records.", "Yeah you might say Clinton represents corruption. But Trump represents the corrupter. He was never for the people but for himself only and his own personal interests. I think that's worse tbh.", "Make a quick buck declare bankruptcy, and run away to try again?", "He hasn't ruled out a 2020 run despite his age.  Wouldn't surprise me.", "I notice this thread is oddly empty of Trump Supporters defending this. \n\nAs his cabinet list grows and shatters the entire narrative are any Donald subreddits actually talking about it? Or are they just ignoring it?", "seriously remember how he was calling massive voter fraud in the middle of an election that he *won* just because it didn't look like it was going his way for the first few hours?\n\nhttps://twitter.com/realDonaldTrump/status/796102093727793152\n\nRemember how he tried to sue Nevada the day before?\n\nhttp://www.cnn.com/2016/11/08/politics/nevada-voting-lawsuit-donald-trump/\n\nRemember how he vowed to sue the New York Times (twice!), people running campaign ads against him, and every woman who accused him of sexual misconduct?\n\nThe minute the bipartisan lip service and polite platitudes end we should see Trump as his usual self.", "You mean 51 to 49. Hillary won the popular vote bro! But yeah this sheriff is a real twot", "And \"The Clinton Foundation took money from the Saudis. She won't fight for your rights!\". Even though Democrats have been on record fighting for their communities while the Republicans were having their War on Bathrooms. ", "I just don't get it.  Trump voters had such high concerns about Clinton's trustworthiness and financial dealings but gave Trump a complete pass on the taxes .  It's not just an issue of his financial ties in foreign companies (if any) but his net income tax rate given he's pushing tax cuts for high earners.  There's a real disconnect here that I find hard to explain.  \nI suspect it may just have been an \"anybody but Clinton\" movement", "SO PUMPED! Already feeling the BERN for 2020", "The aclu cares about the constitution they defend the klan in a first amendment related case.", "They mean come together in the sense of fall in line.", "Gabbard is way too conservative.\n\nI was a Clinton supporter. Gabbard is to the right of Clinton.", "It doesn't matter that it doesn't make sense it's a comforting, hopeful lie.", "I think just the opposite. Bernie would have been an excellent candidate for president (and a really good president) and was not as effective in simply trying to mobilize people against trump (and the election kind of proves the latter). Bernie is at his best when he is conveying the messages of his long held ideals and rallying people who believe in his vision for the future. Both campaigns in the general election offered largely fear to motivate people. Trump used fear of immigrants and Hillary used fear of a Trump presidency. I felt Bernies message didn't focus/rely on fear as much. ", "&gt; Donna Brazile the interim leader of the Democratic National Committee, was giving what one attendee described as “a rip-roaring speech” to about 150 employees, about the need to have hope for wins going forward, when a staffer identified only as Zach stood up with a question.\n\n&gt;“Why should we trust you as chair to lead us through this?” he asked, according to two people in the room. “You backed a flawed candidate, and your friend [former DNC chair Debbie Wasserman Schultz] plotted through this to support your own gain and yourself.”\n\n&gt;Some DNC staffers started to boo and some told him to sit down. Brazile began to answer, but Zach had more to say.\n\n&gt;“You are part of the problem,” he continued, blaming Brazile for clearing the path for Trump’s victory by siding with Clinton early on. “You and your friends will die of old age and I’m going to die from climate change. You and your friends let this happen, which is going to cut 40 years off my life expectancy.”\n\n&gt;Zach gathered his things and began to walk out. When Brazile called after him, asking where he was going, he told her to go outside and “tell people there” why she should be leading the party.\n\nThe man is a hero.", "&gt;“The party is at a crossroads. They have been using the same playbook for decades and now, they won’t let anyone else come in and change it up,” said one former longtime DNC staffer, who requested anonymity to speak freely. “The fact that Democrats just sat through a devastating defeat and now have to trust the leadership that not only contributed to Clinton’s loss, but the crushing 2014 midterm losses, well, what do they expect?”\n\nWow, this is gonna get ugly.\n\nTo think I was convinced a few days ago that the GOP would be coming apart right about now.", "Do something about it Bernie suggests Keith Ellison and if you agree sign the petition.  http://pac.petitions.moveon.org/sign/appoint-keith-ellison\n\nEdit - suggested by others -\nOf course, do your research before signing any petition, I thought that was a given.", "Zach we love you! Go spread the good word! Then please go find Bernie and help him revolutionize the democratic party. We need more people like you.", "there is zero fucking reason Donna Brazile should still be in charge of the DNC. \n\nShe should have been fired the night Hillary Clinton lost. She should have in fact resigned before that.  \n\nI hope there are more exits happening in the fractured democratic party that is an absolute and utter fucking failure.", "After what transpired through this entire election cycle I cannot fucking believe the democrats aren't cleaning house.  I sure hope there are quite a few more Zachs in that crowd.  ", "AMA Request: Zach.", "Why wasn't she fired the second everybody found out she was giving debate questions to HRC.", "Help us Sanders you are our only hope.  ", "\"9 out of 10 drivers favor other people taking the bus to reduce traffic\".", "CNN fired her. She's still head of the DNC though.", "These people don't have the sense of honor or responsibility it would take to resign on their own. Obama had to force DWS to resign. ", "You know in 2008 when Obama won Republicans hoped (in vain) that the party would perhaps nominate someone in 2012 that the base actually wanted they responded with Mitt Romney, and their plan for 2016 was another Bush. Until the Democrats get serious about cleaning out their leadership they'll get the same type of BS from their own party, Donna Brazile and the rest of the people who gave you Clinton are even now scheming to undercut populist Dems like Bernie in 2020. ", "If Donna \"the cheater\" Brazile is part of the new DNC we can look forward to 8 years of Trump.\n\nThese DNC losers are blind.", "If you really look at the past of Donald Trump there is absolutely no reason to think his presidency is going to be successful. There aren't many people who have come out saying they love Donald Trump who have worked with Donald Trump. Just his own kids. The rest are well...the guy that wrote his book launched a campaign to tell the truth about dealing with Trump because he thought he was a sociopath.", "We need more Zach's in the Democratic Party. ", "&gt;It's a legitimate concern. Bernie is pushing 80 and would be applying for the most mentally (and physically) taxing job in the US.\n\nSo pick a young promising democrat for VP (Tammy Duckworth, Tulsi Gabbard, Seth Moulton, etc).", "People are saying he'll wipe out Obama's legacy. But I disagree. He'll wipe out everything Obama has signed into law but not his true legacy, which is decency, togetherness, grace, friendship, humor, kindness, and always making the best of a shitty situation.\n\nHe will be the modern JFK.", "Bernie/Zach 2020", "Hell Hillary couldn't even come out to address her THOUSANDS of supporters on Election night and sent John Podesta to do it for her. ", "This tbh fam.\n\nWho cares how old he is? If he thinks he's fit enough and doesn't show signs of bad health then let him run with a young likeable progressive", "&gt;“Look the president’s views haven’t changed. He stands by what he said on the campaign trail,” the press secretary replied. “He had an opportunity to make his argument. He made that argument vigorously. He made that argument in states all across the country. But the American people decided. The election is over. The president didn’t get to choose his successor, the American people did. And they have chosen President-elect Trump. And President Obama is determined to preside over a transition that gives the incoming president the opportunity to get a running start.”", "Apparatchiks are gonna appparatch. A Tea Party-like grassroots movement can and will overthrow these fucks. Volunteer now.", "Zach needs to be placed in a major role at the DNC. All those who nodded their heads during his righteous rant do as well.", "Yup. Black Muslim partnered with a Jewish socialist. Fuck the establishment sideways.", "She seems to be \"to the right\" on issues regarding the military and gun rights which is probably a good thing if you're talking General Election. Makes sense considering she's a vet.", "Huffington Post is being pretty humble about their part in it.", "I really hope the DNC has a real hard look at the many factors of why they lost. There were many but who they nominate to lead the DNC in the end will be a real indicator. \n\n", "It fucking astounds me how tone deaf the Democratic party was this election. It doesn't take a rocket scientist to see that most everyone in the country is done with establishment politics and they collude against a man who revitalized excitement in their platform and trot out the embodiment of establishment politics as one of the weakest candidates in history. Their finger couldn't have been further from the pulse and it's their fault we have President Trump.", "\"9 out of every 10 people favor raising tax rates for brackets they are not in\"", "What matters is how he marketed himself. And the media played his rallies live on TV with no interruption.", "It's nice to see a little fight-back within the DNC over their incredibly short sighted and just flat out stupid way they approached the election. Hopefully there's more people like 'Zach' within the DNC they definitely need people like him to unfuck the organization. ", "They go wherever the clicks are. Hating the DNC is so *in* right now.", "Elites don't like democracy. It is too real and unpredictable. While some controls are nice. Too much and it becomes this year.", "And all those who booed him and told him to sit down need to be kicked out. ", "They fucking boo'ed him for speaking the truth? \n\nWe are fucked. ", "The Costanza presidency", "Nah hostile takeovers are more effective.  See Trump, Donald.", "But Hillary gets to start with 400 points.", "I think this may be the beginning of a DNC civil war.", "How? You play for a week or two and then sit out for most of the season on IR.\n\nSource: My fantasy team.", "It's like Reagan.  Mike Pence is a really evil version of Reagan.", "what I would do to get those people in a room again just to replay that clip.", "&gt;compromise\n\nThe evangelical right doesn't want compromise they want control.", "Bingo. I am far left. Had a lot of problems with Obama but he will go down as one of the all time greats. He is exactly what a president should be. The exact opposite of Tiny Trump.", "Who the fuck thought Obama was happy about this?", "Zach\n\nHow do you manage to move each and every day while carrying the sentiments of US on your shoulders and giant brass balls between your legs?", "Yikes! \n\nObama probably not too happy right now... ", "I'm pretty sure he would refuse any PAC support as he did this year.", "I feel this one's poorley contrived.\n\nI'm by no means poor but their taxes should be lower, mine should be higher, and the 1%'s should have more regulation and closed loopholes.\n\nI feel like your saying is only held by the highly wealthy", "I really am even more scared of all these Republican establishment hacks being in charge of the government than I am of President Trump. Giuliani Gingrich.... UGH. ", "ZACH/BERNIE 2020", "The re-organization of the DNC is going to be a bloodbath.", "How tone deaf is the leadership at the DNC if they are even considering using the same leadership and strategies that allowed for a president Trump. Neoliberalism is over and dead, and they will keep losing if they don't change. ", "You know for everyone saying the Democratic Party lacks a leader to move forward... Uhm guys, Obama ain't dead. He can't run for President, but that doesn't mean he has no role in our movement.", "Good! We need change.", "But he is going to fund it by privatizing them. Enjoy the $10 toll on your trip over Trump Bridge.", "They won't. Somehow it will be Obama and Hillary's fault. ", "Let the irony sink in. The Republicans don't stand for anything except making rich people richer and shoving their interpretation of christian values down our throats. They lie to stupid people to get their votes then destroy their lives, then blame it on Democrats. Trump has already removed the policy proposals from his website that won him the idiot vote. They are about money and power, full stop. \"Drain the swamp\"? Look who he is proposing for cabinet members. The swampiest of the swamp. ", "&gt; People die randomly at age 30 and 20 and some people live to be over 100 and want to die but can't seem to.\n\nYeah... but... people die less randomly at 80 than they do at 20 and 30. He'd be older than the average American male's life expectancy at that point and, assuming he won, he'd be taking on one of the world's most stressful jobs. ", "&gt; Regan was 77 when he left office.\n\nBernie would be 79 when he ENTERED. \n\nAnd the rest of your examples are irrelevant because the Queen is a figurehead and yes Daddy Bush is 92 but he's not in any political office right now so...?", "Gabbard as President  Sanders  as VP would mean...\n\nGabbard- Possible First ever female President getting more voters for Gabbard.\n\nSanders supporters- still having Bernie on the ticket. And it would get rid of the  stupid ageism concerns because Bernie is VP not President.\n\nAnd both are progressives so i think it would be a successful ticket", "I would love to see Keith Ellison as the new DNC chair.\n\nIf you're not familiar with him here's a video of him introducing Bernie Sanders during the 2016 primary:\n\n[https://www.youtube.com/watch?v=4fP3znoF_WQ](https://www.youtube.com/watch?v=4fP3znoF_WQ)\n", "[Deleted for this](https://i.imgur.com/Blysl7S.jpg)  \n ^^^^^^^^^^^^^^^^0.3164284765241746 \n &gt;", "&gt; You've got to decide which side you're on.\n\nI think it's quite clear what side Trump is on.  \n\nNow it's time that it sinks in.", "I'd rather have a moderate democrat than 4 more years of Trump though. She's still progressive where it matters on trade, foreign policy, and social issues - she's conservative on guns and a few other issues which would actually make her more appealing to the general public.", "Appointing Newt Gingrich and Goldman Sachs' lobbyists will show the establishment who's boss.\n\nBut seriously Trump isn't gonna do shit but press conferences. Pence is your master now. The only \"anti-establishment\" we're gonna get is hard-right tea party policy.\n\nDemocrats need to be very loud.", "http://i.imgur.com/U9idvAo.jpg\n", "Donna Brazile being the acting chair is a slap in the face to a great deal of the party.", "Signed! You should make this it's own thread.", "I was watching ABC's election coverage and you could tell Stephanopoulos (one of them in the video) was slowly losing his mind as the night went on.  This is what happens when you get complacent.", "America is so fucked.\n\n\nPeople really fell for this crazy dirt bag of man.  They think he can;\n\n* Change the 1st Amendment Freedom Speech to suppress negative press (which he can't and won't)\n* Change the 1st Amendment Freedom of Religion to suppress Islam (which he can't and won't)\n* Build a 21 Billion dollar wall (which he can't and won't)\n* Make a foreign country pay for his stupid wall (which he can't and won't)\n* Deport 11 million people (which he can't and won't)\n* Stop Muslims from entering this country (which he can't and won't)\n* Repeal Roe v Wade (which he can't and won't)\n* Repeal the Affordable Healthcare Act (which he can't and won't)\n* Magically bring back jobs (which he can't and won't)\n* Force businesses to keep manufacturing in the U.S. (which he can't and won't)\n* Force Industries to hire people instead using tax cuts to boost profits (which he can't and won't)\n* Renegotiate our National Debt (which he can't and won't) \n* Make coal relevant (which he can't and wont')\n* Leave NATO (which he can't and won't)\n* Turn our military into mercenaries (which he can't and won't)\n* Fire Generals that don't agree with him (which he can't and won't)\n* Force our troops to commit war crimes (which he can't and won't)\n* Force our troops to torture people (which he can't and won't)\n* Force foreign countries to have nuclear weapons (which he can't and won't)\n* Stop ISIS...because he knows more than the Generals (which he doesn't and can't)\n* Stop POWs from being called HEROs (which he can't and won't)\n* Stop crime across America (which he can't and won't)\n* Implement a Nationwide 'STOP AND FRISK' law (Which he can't and won't)\n* Convict Hillary or the Clinton's of anything (which he can't and won't)\n\nand last but not least....\n\n\nHeal a nation that he himself divided with his hateful bigoted, sexist, homophobic, xenophobic, white supremacy, racist, anti-military, anti-veteran, anti-American rhetoric...\n\n\nAmerica is so fucked for what 59 million people did on Tuesday. ", "And he needs to start by gutting the corrupt sychophants that caused this.", "Totally. People have no idea what privatization does. Imagine Kansas but on the scale of a country. This man is going to destroy people's lives on so many levels, holy shit.", "And the Queen of England is 90. Her mother was fucking 101. Regan was 77 when he left office. Daddy Bush is 92. Trump is actually now the oldest president ever elected to office at 70. (yes he's a 70 year old)", "Progressives have been pushing him in that direction.  He *is* a leader now that's not in dispute.  Now we see which side wins control of the party - us progressives or the neoliberal establishment.  We know full well that populism is the winning strategy and sentiment in this country right now.\n\nI believe fully that Bernie Sanders would have won Minnesota, Wisconsin, AND Pennsylvania if he'd been running against Trump.  We need a New Labor movement in this country and progressive Democrats (under a new party leadership and with a better platform) are the party to make that happen.\n\nPopulism is the key and it's a message Hillary Clinton couldn't have sold to the American people even if she wanted to.", "You realize up to this point Trump has done the exact opposite of what everyone thought right. He could be the greatest president ever. ", "Remember the last time we had an idiot in the Oval Office?(Bush Jr.) As I recall his evil VP (Cheney) who is very much the United States version of a Sith Lord pretty much ran shit while dum-dum sat back and let it happen\n", "NotMyAbuelo", "What would have been nice about if Warren had ran instead of Sanders is Hilary couldn't attack her for being sexist like she did with sanders.", "Dude probably just wants to chill a bit.\n\nThe next leader of Democrats likely someone we've yet been instroduced to.", "And Reagan had Alzheimer's with the rumors his cabinet was running things the last 2 years of his term. ", "&gt; the social safety net that keeps them alive is systematically dismantled by the very people they voted into power.\n\nThe worst part is they want it dismantled. \n\n\"No more food stamps\", \"no hand-outs\", \"time to go get a job\"...they think ending these programs would only hurt lazy inner city minorities, without realizing that 40% of food stamp recipients are white, and most of those living in rural areas...you know, Trumpland.\n\n\"Repeal Obamacare\", not realizing that there is no good backup plan, that they're going to lose the pre-existing condition clause, and of the 21 million who will lose their coverage, many of them are his own supporters.\n\nI don't want to see anyone suffer for political points, but the only positive in all of this is that there will be no blaming Dems in Congress. Or Obama. Or Clinton. When their world turns to shit, the only place they have to look is their own party, and the mirror.", "Followed by another 4 hours of rest.", "Anyone else appreciate the irony of a major political party turning to the longest serving independent in congressional history to be its elder statesman?", "I think he'll just sign whatever the Republican house and Senate passes.", "just like the DNC! How fitting", "Because the republicans call us lazy undocumented immigrant and terrorist sympathizers. ", "Majority of America thinks we should get on cleaner energy therefore majority of Americans want to get rid of coal. It sounds shitty when you say \"put them out of work\" but that's the reality.", "Well he is. I hope I live to be 1,000 so people in the future can ask me what the fuck America was thinking when they elected him. My answer will be \"memes.\"", "And I deserve some ice cream damnit", "\"Stop comparing us to Nazis just because we voted for a man with fascist views!\"", "We have to recognize one thing: he'll likely build infrastructure well probably renaming bridges and highways after himself or some such shit. But in the mean, he'll get popular for \"putting people to work\", all while deregulating out the ass, and who knows what else. We are so fucked. The planet is fucked too.", "They can have their beliefs of other people.\n\nThey cannot be allowed to act on belief that have negative affects the lives of others. ", "This is what the left needs. Anger at our own who have failed us not at others who got their way because of it.", "I find it highly ironic that dems were giddy at the idea of Trump wrecking the Republican party and instead it's them who were demolished.  ", "&gt; A third attendee told HuffPost that despite Zach’s blow-up, **there was “overwhelming” support for Brazile in the room.**\n\nYou people don't fucking get it. You just don't fucking get it.", "I left them my message. I encourage everyone to do so as well\n\n&gt; The Democratic party needs to be rebuilt from the ground up. There is blatant corruption and corporatism spread within the party that has alienated and disenfranchised a once enthusiastic base. Those at the DNC who conspired to manipulate public opinion in order to promote a certain candidate over the other need to be immediately let go and replaced with people who have more integrity. The Democratic party needs to adopt a more progressive platform because quite frankly, that is the direction the party supporters and future voters are going. Your old ways are not going to work. You need new leaders. Leaders like Bernie Sanders, Elizabeth Warren, who are going to lead the way and pave the path for future victories. Get behind the movement or get left behind.\n\n\n\nEDIT: Since the comment gained a bit of traction, I implore other like-minded people to subscribe to /r/Political_Revolution, the spiritual successor to r/S4P, and keep the movement going.", "any chance you could make the Hindsight 'H' the Hillary logo just to twist the knife a bit more.", "[Just for you bud](http://imgur.com/a/t56fT)", "In an election year that was filled to the brim with idiotic moronic acts giving your candidate a debate question up front was one of the most stupid. Over email? When your candidate already has an email problem!?!\n\nAnd she's the DNC chair?!?\n\nWe are so fucked.", "They will never look internally. I've already heard numerous reasons why clinton lost. I've heard women betrayed women I've heard it was swing voters &lt;$30,000, uneducated white males, educated white women, educated white men, minorities betrayed obama, sexism, Obama, comey, but I haven't heard \"we fucked up\". They betrayed their core and their party. The fact of the matter is she is untrustworthy. The collusion with the media, DWS, Donna Brazille, emails, Wikileaks, it was soo much corruption.\n\nEdit: u/russian_upvote_bot points out my list would not be complete without \"the Russians\" excuse. I would like to add racists, xenophobes , bigots, anti-lgbt, and Christians. Before racist_xenophobe_bigot_anti-lgbt_christian_upvote_bot calls me out. ", "I tried to predict that the GOP will split apart if Donald Trump loses a close election. Instead he won the election and the Democratic party is shattered between the remnants of Hillary's people and the progressives. The Democrats seriously need to clean house of the Hillary people in the coming years and look to a new Democrat party. That DNC scandal really killed the integrity and reputation of the Democratic party this kind of scandal is what we would think of the GOP.", "He's back. He did what he feel he had to but the gloves are back off", "Man I want to call this racist but I can't because trump supporters might get triggered, and threaten to re-elect trump.\n\nedit: You know what I'm realizing guys. Once Trump fucks the country up enough, the same people who said us liberals forced them to vote him in by insulting people will actually blame us for Trump being president. Exciting. I can't wait for those spicy memes.", "&gt;A third attendee told HuffPost that despite Zach’s blow-up, there was “overwhelming” support for Brazile in the room. Her motivational words “had some staffers in tears, per this attendee, and Brazile spoke to Zach’s concerns after he left.\n\nThis shows exactly why the democrats got stomped, the complete disillusionment and lack of accountability for their so called \"leaders\". Good on you Zach not falling into the \"liberal bubble\" that is the Democratic Party. ", "Didn't know who this guy was.  Went and looked him up.  Result?  \n\nA Muslim Black anti-war pro-civil liberties pro-cheap education representative who has spent time doing real work for our government.  \n\nBased on that, this is someone I can get behind.  Trump is going to do real damage to our government, and its citizens, especially in minorities.  But at least it's refocusing the left.  Let's rebuild now and come out swinging in 2018, before any more damage can be done.  ", "Bernie is a once in a lifetime political unicorn\n\nIf he even hints at running in 2020 I will literally drop everything and hit the ground running towards volunteering for his campaign 24/7 as I'm sure many others would.\n\nAlso shameless marketing, don't forget to buy Bernie's book \"Our Revolution\" on Nov. 15th when it releases. It's an expose about the entirety of the primary campaign if you're at all interested in that kind of stuff. Please don't hurt me r/HailCorporate ", "&gt;what one attendee described as “a rip-roaring speech” to about 150 employees about the need to have hope for wins going forward\n\n...the *need to have hope*??!!\n\nIs that all, Donna Brazile?\n\nAnd other than that, what? Just DNC business as usual?\n\nYou had the chance to embody the spirit of the election, but no - you ceded that over to Trump because your precious power structure was more important.\n\nYou just imperiled your entire fucking electorate for some power and cash. You let your voters fall into the jaws of old fashioned bigotry, and that party's just getting started. You're a disgrace to American values and people of all stripes, and you should all be fired immediately. You deserve nothing. Step out of the way.\n\nThe DNC will never win another presidential election now with you at the helm, and no amount of hipster shirts and cozies are ever going to change that. Get out immediately, take your corporate friends with you, and hand over the reigns to people who actually care enough to do the work.", "Madam: Why Mr. Sanders. What do we have here? \n\nMr.Sanders: Why a political Revolution, ma'am.  But only if you are willing to fight for it. ", "Oh finally an article about protests which are directed at the correct place.", "PACs (Political Action Committees) are not the same thing as SuperPACs. Bernie had plenty of PAC support but refused SuperPAC money. There were also some (four I think) SuperPACs that favored Bernie, but he explicitly ~~rejected their money and support~~ did not structure his campaign around a reliance on SuperPACs, as is par the course in establishment politics. There were SuperPACs that supported him, such as the NNU, but because campaigns are barred legally from collaborating with SuperPACs, there wasn't much he could do about it. Corporate media used this fact to slander him as a hypocrite when in fact it was proof positive of his authenticity. EDIT: the difference between PACs and SuperPACs is further expanded upon in the comments below this one.\n\nPACs are usually grassroots organizations and have a legitimate function in our democracy. They are more strictly regulated than SuperPACs through which unlimited dark money can flow. It's important to make that distinction.", "We'll call them superpoints", "This is true if we're being honest, my friend.", "The most rational thought I've heard on this whole matter. ", "god i hope he doesn't go quietly. we need this voice in particular to give them hell for the next four years. ", "DNC is an echo chamber. They should go out to all these states that turned red and spend a few days with those people. ", "Thats because her campaign had not written a concession speech. Wasnt even on the radar.", "I didn't know high schoolers could have economic anxiety.", "Fuck the DNC. \nFuck Donna Brazile. \nFuck Debbie W. Shultz \nFuck Podesta. \n", "Not I'm with him. He's with us.", "and she was HIRED by Hillary the same day!", "No we start planning for the 2018 elections. Democrats need to start taking midterm elections seriously, more now than ever. We need to limit a completely unchecked republican government to 2 years. ", "Donna Brazille has shown the highest incompetence known to modern electioneering. This election wasn't just an embarrassment for her. It was disqualifying. It was beyond hubris. There is no way anyone would have faith with her to continue to run the DNC properly. Whatever data operation they have there was terrible and the GOTV efforts were just as bad. \n\nKeith Ellison should be the head of the DNC now. But Harry Reid an EXTREMELY IMPORTANT FACTOR HERE, immediately needs to implement whatever democratic machine he's got in Nevada nationwide, because he delivered everything on election night. ", "Yeah you never know when that wall is going to hit.  You're healthy as hell and 85 and one day you lose all your muscle and start deteriorating. ie: Jack Lalanne. \n\nBernie may be just fine for another 10 years, who knows.", "No they are fucked.  They've been exposed and now that have a choice; change or die.  We can support a new party led by the politicians we choose; they can't earn our support back if they continue as they are.", "or she was shit faced or too emotional...are other theories.", "Probably instructed by Sanders to lay low so he can start grooming her for a 2020 run if he doesn't try again.", "Donna Brazile is a disgrace.", "Unfortunately there are no elites left for them to run. Donna Brazille is behind one of the worst Democratic electoral disasters in modern history and for a Clinton no less. Hillary Clinton's legacy is going to be this loss. The fact that Brazille is still head when she managed to not just fuck up Clinton's legacy, but aided in the demolishing of Obama's legacy is on her now. I'm amazed people booed Zach. Like holy fuck, did they not see the returns. Did they not see the look on people's faces when they walked out in the morning realizing that a brick was just thrown into the future of the human race.\n\nAnd that's on her. Clinton's campaign had an operation, but the DNC should have been able to see what was happening in the Rust belt sooner and addressed it. I imagine that all Brazille did was say \"you go girl\" and did nothing else to supplement Clinton's run. She needs to resign in the next two weeks. This is a stain and it has her name written all over it.", "The libertarians were the only consistent ones with that message.. ", "http://pac.petitions.moveon.org/sign/appoint-keith-ellison\n\nYeah yeah it's a petition, sign it or don't. \n\nIneffective e-petition or not, it's important that people focus their energy behind Bernie and Ellison if they actually want to successfully oppose the current DNC leadership. It helps to have some goals and demands in mind when you form your angry mob. \n\nLike the vast majority of progressives, I *really* don't like Trump and think he's going to set us way back, but that's out of our hands at the moment. The first step to opposing him is removing the people who led us into this mess and forced the people to decide between Donald Trump and the one of the few people capable of losing to him.\n\nMidterms are in 2 years, and the Dems have way more seats up for grabs. Primaries for those midterms are even sooner. This shit has to be sorted out ASAP.\n", "Yep. I wonder if they have had any self reflection in the past 48 hours or just keep blaming Comey.", "&gt;This tbh fam\n\nELI50?", "Obama just explained to Trump that we are actually ruled by lizards and if he steps an inch out of line he'll be killed.  Look at Trump's face during the press conference.  You know it to be true.", "I'm hoping for someone like Tulsi Gabbard. ", "Then I guess the last good person in the DNC walked out today.\n\nFire every fucking one of them. All 149 others that weren't Zach.", "Giant Meteor 2016\n\n*it's not too late*", "You're violating my beliefs by not allowing me to oppress you. \n-\nMy beliefs say you have to be oppressed because you are a lesser person. \n-\nDon't you respect my beliefs? \n-\nYou're oppressing me.  \n-\nSee your beliefs oppress others. You're evil.      \n-\nNo, my oppressing ***you*** isn't wrong. It's my belief. What are you talking about. Don't you respect my belief? \n-\n\n\n*^It ^chills ^me ^to ^the* ^***bone*** *^that ^some ^people ^in ^this ^country ^actually ^live ^in ^that ^fucking ^bizarro ^world.   \n^Some ^people ^would ^actually ^say ^these ^things ^with ^a ^straight ^face ^and ^not ^a ^scrap ^of ^irony ^about ^them.* ", "We need to make this entire country a safe space for conservatives so they don't become triggered. ", "Eventually they need to come up with a plan to win next election.  If their plan is \"Keep doing the same thing and hope the voters change,\" well, good luck to them.", "Love it he could have used a bit less hyperbole on the climate change bit. But this is the kind of outrage and passion that we're going to need to reform the Democratic Party. ", "Definitely don't see why a pro-2nd democrat strategy hasn't become a thing yet at least in certain states like Texas where it all boils down to gun rights. ", "Ha that's right he totally predicted it and almost got laughed off the stage. God damn almost everyone got it wrong the talking heads, the pollsters, everyone.", "The Kambucha Party?", "He's on the same side Clinton is on: Exploting everyone else to get ahead. \n\nYes they may use different means to maniupulate people into supporting them but at the end of the day they are both narcisists and only care about themselves. \n\nGreat example is HRC not bothering to say anything to her supporters when it was clear she lost. ", "The rest of the article is fucking terrifying. \n\n\"A third attendee told HuffPost that despite Zach’s blow-up, there was “overwhelming” support for Brazile in the room. Her motivational words “had some staffers in tears, per this attendee, and Brazile spoke to Zach’s concerns after he left.\"\n\nEven after the most embarrassing defeat in American political history, they still stand by the party line. \n\nI'm getting the feeling that they learned nothing at all from losing to Trump. ", "What happened with Tulsi btw? She kind of left the whole thing.", "Now this is a swamp that should be drained. God damn.", "Race relations are dead in this country. ", "&gt; I sure hope there are quite a few more Zachs in that crowd.\n\nIn the party?  Sure.\n\nIn **that** crowd?  The DNC?  Oh no.  Oh no no no no no.  Just no.", "The people who were calling the shots in the DNC were a part of the establishment. They've staked their entire careers on playing within the confines of the corrupt political machine. They knew a Sanders victory would mean the end for them. They were fighting for their political lives. Of course they wanted an establishment nominee. Of course they didn't care what the electorate wanted.", "No the *DNC* is fucked. So is the GOP. \n\nViable so-called \"third\" party candidacy is now a thing. Expect to see a lot more of it with a now-marginalized private corporation system no longer calling all the shots.", "Lots of us backed Clinton specifically with climate change as the issue above all others worried about what Trump and friends might do to backtrack us on a race we're already behind on. So hyperbole, not really.", "\\#IBACKZACH\n\nget it trending", "Clintons are people who thought they were the smartest people in the room for decades and they convinced the Democratic party that Bill Clinton's centrism was the only path to the White House.  \n\nThird-wayism is no longer a viable path to POTUS.  ", "I want to know more about this \"Zach\" guy. He spoke the truth in front of Donna like a pro.", "/r/WayOfTheBern is basically just trump guys pretending to support Bernie to discredit Hilary. ", "ZACH / GIANT METEOR 2020", "Passed out in a van again?", "Bernie/Kanye 2020", "It's all about economic anxiety ", "Vanilla Chai Initiative", "Since people are probably wondering what the difference is a PAC collects campaign contributions from its members, and donates them to a campaign. A Super PAC does not donate directly to the campaign, but does things like run ads in support of a candidate (or against his or her opponent).", "I think this is a no brainier. Love how they took the states where Republicans enacted strict voting regulation. ", "Wait I thought they were biased against him? Are you suggesting that there's no such thing as bad press?!", "2 billion in free ads is a weird way of bias", "I would think Comey's letter saying nothing really pissed off Obama.", "Yup. He's going to be overwhelmed. He has no idea what he's really in for. People are going to be shocked at how weak a leader he turns out to be.", "\"I want you to know that also I will not make age an issue of this campaign. I am not going to exploit for political purposes, my opponent's youth and inexperience.\"\n\n- Ronald Regain, presidential debate - 1984", "[petition](http://pac.petitions.moveon.org/sign/appoint-keith-ellison) to appoint Keith Ellison as the DNC chair. ", "We can fear two things ", "So can all of those \"be open minded and give Trump a chance!\" people never talk again? It's been two days and he's already assembled what may be the worst most anti-minority team possible. ", "The idea is to run someone who can go two terms so you can run as an incumbent once -- which is much easier has major advantages. \n\nThe real difficulty is that Sanders would be 83 during his second term race. Few Democrat insiders are going to support that effort. ", "What if Bernie ran as a strong VP with a much younger democrat doing all the major electioning?", "It was not OK when Bush controlled it it is not OK with Obama controlling it, and it will not be OK when Trump controls it.", "The democrats had the house the senate, and the presidency, yet still re-passed and expanded the Patriot act.", "Zach not Zack don't disrespect the man!", "We need new blood. The DNC as it was cannot continue. We failed spectacularly. The country is rising in protest. The cost of this defeat was devastating. They gambled with our lives and lost. They gambled with our very lives to put Hillary in office and they lost. \n\nWe need new blood. Things cannot stay as they were. We need leaders. We need change, and we need change now. ", "Sanders better get everything he wants because he was the savior of the Democrat party and Hillary supporters denied him. It was basically Jesus getting crucified all over again. Hillary supporters were basically the pharisees. Full of self-righteousness, arrogance, and hypocrisy. ", "Sure cherrypick and exclude Trump's name.  That's a good argument.\n\nHere's a few more for ya, Bush Sr. lost to Reagan in '80, Reagan lost to Ford in '76.  Nixon lost the General in '60.\n\nMan, you'd look pretty silly if Nixon, Reagan, Bush Sr. and Trump had all become president.", "That's what I'm afraid of the most.   That he's just gonna let a seasoned pro like Pence run things.  I'm sure Pence has is already working on a mountain of back assward Christian legislation that he's ready to push through a GOP held congress.  Meanwhile Trump is trying to figure out if his tie makes his skin look too orange. ", "I think Warren is probably too unpalatable for a significant portion of our electorate.\n\nI think she'd be a good president but another polarizing candidate.", "I really really fucking hate to make this comparison, but we had it with Bernie. \n\nHe said it himself that the DNC needed a campaign to energize the base and they gave us the political version of Valium. Trump got the middle class, and got it big. ", "Well I'm not sure many people knew of the shenanigans the DNC played throughout the election. But it certainly helped them lose.", "It goes beyond that though. IMO, it's not just that they were looking out for their own self interests, they (being part of the establishment) just couldn't fathom a candidate like Sanders being more desirable than their preferred candidate Clinton.", "https://twitter.com/i/moments/796417517157830656\n\nDay 1 of Trump's America.", "It wasn't OK when Bush controlled it then it was kind of OK because Obama, and now it's not OK again.  \n  \nEvery 4-8 years independents fight with a different side against the other side on the same damn shit.  I don't care if a actual saint who was incapable of abusing the system is in the White House.  You can't accept legislation like this if you're not OK with a less savory president having control of it because eventually that is going to happen.  "], "links": ["5c92pw", "5c8wbm", "5c8wf8", "5c95na", "5c8jlf", "5c97yq", "5c97yq", "5c836b", "5c8wbm", "5c836b", "5c8wf8", "5c97yq", "5c836b", "5c8wbm", "5c7kxy", "5c8n9i", "5c91xj", "5c97yq", "5c96xx", "5c97yq", "5c8rhp", "5c91xj", "5c8wbm", "5c8wbm", "5c95na", "5c836b", "5c8izb", "5c7kxy", "5c97yq", "5c836b", "5c97yq", "5c7n7w", "5c92pw", "5c7kxy", "5c8wf8", "5c7kxy", "5c8n9i", "5c91xj", "5c8wbm", "5c8n9i", "5c7n7w", "5c8n9i", "5c8jlf", "5c8n9i", "5c7nkb", "5c7kxy", "5c7n7w", "5c7kxy", "5c7nkb", "5c7kxy", "5c92pw", "5c7kxy", "5c7n7w", "5c8wbm", "5c836b", "5c836b", "5c8jlf", "5c7n7w", "5c8wbm", "5c7b7b", "5c96xx", "5c97yq", "5c7kxy", "5c836b", "5c836b", "5c8n9i", "5c95na", "5c836b", "5c8wbm", "5c7kxy", "5c836b", "5c7kxy", "5c7t1o", "5c836b", "5c8wf8", "5c7kxy", "5c8jlf", "5c8wbm", "5c7kxy", "5c7n7w", "5c836b", "5c7kxy", "5c7nkb", "5c8wbm", "5c85wg", "5c7kxy", "5c7p85", "5c81o1", "5c8n9i", "5c91xj", "5c7qab", "5c91xj", "5c7kxy", "5c8wbm", "5c836b", "5c7kxy", "5c836b", "5c96xx", "5c96xx", "5c9jq7", "5c9d3j", "5c9d3j", "5c96xx", "5c96xx", "5c92pw", "5c96xx", "5c92pw", "5c96xx", "5c9d3j", "5c92pw", "5c92pw", "5c97yq", "5c92pw", "5c836b", "5c92pw", "5c96xx", "5c9i0q", "5c9bw7", "5c96xx", "5c9bw7", "5c97yq", "5c836b", "5c9jq7", "5c97yq", "5c9d3j", "5c7hwx", "5c97yq", "5c9i0q", "5c97yq", "5c9i0q", "5c97yq", "5c92pw", "5c7kxy", "5c836b", "5c7kxy", "5c836b", "5c97yq", "5c7kxy", "5c7kxy", "5c8wbm", "5c96xx", "5c7kxy", "5c7n7w", "5c97yq", "5c96xx", "5c8wf8", "5c7kxy", "5c97yq", "5c96xx", "5c97yq", "5c7n7w", "5c9jq7", "5c96xx", "5c8n9i", "5c97yq", "5c9bw7", "5c96xx", "5c97yq", "5c9bw7", "5c96xx", "5c97yq", "5c7kxy", "5c97yq", "5c7kxy", "5c92pw", "5c836b", "5c9i0q", "5c7n7w", "5c97yq", "5c7kxy", "5c97yq", "5c97yq", "5c836b", "5c7kxy", "5c9bw7", "5c96xx", "5c96xx", "5c836b", "5c8jlf", "5c8izb", "5c836b", "5c836b", "5c8jlf", "5c836b", "5c9d51", "5c836b", "5c7kxy", "5c8wbm", "5c97yq", "5c836b", "5c97yq", "5c7n7w", "5c8wbm", "5c92pw", "5c96xx", "5c96xx", "5c9jq7", "5c96xx", "5c9jq7", "5c9jq7", "5c96xx", "5c96xx", "5c9jq7", "5c96xx", "5c9jq7", "5c96xx", "5c9nkb", "5c9jq7", "5c96xx", "5c9nkb", "5c9jq7", "5c96xx", "5c9d3j", "5c9jq7", "5c9jq7", "5c92pw", "5c9nkb", "5c9jq7", "5c96xx", "5c96xx", "5c96xx", "5c9d3j", "5c9nkb", "5c9jq7", "5c9jq7", "5c9nkb", "5c9jq7", "5c96xx", "5c92pw", "5c9kx9", "5c9jq7", "5c92pw", "5c9nkb", "5c9lcn", "5c96xx", "5c9nkb", "5c9uln", "5c8wf8", "5c9nkb", "5c9jq7", "5c96xx", "5c836b", "5c9jq7", "5c96xx", "5c9q7z", "5c96xx", "5c9jq7", "5c9nkb", "5c92pw", "5c9lcn", "5c7kxy", "5c7kxy", "5c96xx", "5c7kxy", "5c96xx", "5c92pw", "5c9nkb", "5c8wf8", "5c7kxy", "5c9nkb", "5c9jq7", "5c96xx", "5c8jlf", "5c9nkb", "5c9nkb", "5c9d3j", "5c9kx9", "5c9jq7", "5c9uln", "5c9nkb", "5c9l3s", "5c9lcn", "5c8jlf", "5c92pw", "5c9lcn", "5c92pw", "5c9lcn", "5c7kxy", "5c9nkb", "5c9uln", "5c7kxy", "5c9nkb", "5c9q7z", "5c9l84", "5c7nkb", "5c95na", "5c9uln", "5c9jq7", "5c9nkb", "5c836b", "5c97yq", "5c96xx", "5c96xx", "5c9jq7", "5c96xx", "5c9jq7", "5c96xx", "5c96xx", "5c96xx", "5c96xx", "5c9nkb", "5c9nkb", "5c9d3j", "5c96xx", "5c9jq7", "5c9nkb", "5ca6lq", "5c9jq7", "5c9uln", "5c9nkb", "5c9jq7", "5c92pw", "5c96xx", "5c9d3j", "5c7n7w", "5ca6lq", "5c9nkb", "5c92pw", "5c9d3j", "5c9jq7", "5c9uln", "5c92pw", "5c9jq7", "5c7n7w", "5c9jq7", "5c92pw", "5c9jq7", "5c92pw", "5c9nkb", "5c9jq7", "5ca6lq", "5c92pw", "5c9lcn", "5c9jq7", "5ca9jh", "5c95na", "5c92pw", "5c96xx", "5c836b", "5c8n9i", "5c9d3j", "5c96xx", "5c9d3j", "5c9nkb", "5c8n9i", "5c9jq7", "5c9zdd", "5c9jq7", "5ca6lq", "5c96xx", "5c92pw", "5c9nkb", "5c9zdd", "5c96xx", "5c9jq7", "5c96xx", "5c96xx", "5c9d3j", "5c96xx", "5c9d3j", "5c96xx", "5c9jq7", "5c7kxy", "5c8jlf", "5c9nkb", "5ca6lq", "5ca6lq", "5c92pw", "5c9nkb", "5c9d3j", "5c96xx", "5c96xx", "5c9nkb", "5c7nkb", "5c8n9i", "5c8n9i", "5c9jq7", "5c9uln", "5c97yq", "5c8wf8", "5ca6lq", "5c7nkb", "5c96xx", "5c9kx9", "5c92pw", "5c96xx", "5c9nkb", "5c9jq7", "5cah7s", "5cah7s", "5cah7s", "5cah7s", "5cah7s", "5cah7s", "5cah7s", "5cah7s", "5c9jq7", "5c9d3j", "5cah7s", "5cah7s", "5cah7s", "5cah7s", "5caev2", "5cah7s", "5c96xx", "5caev2", "5cah7s", "5cah7s", "5c96xx", "5caev2", "5cah7s", "5cah7s", "5c9jq7", "5c96xx", "5cah7s", "5cah7s", "5c9jq7", "5c9d3j", "5c96xx", "5cah7s", "5cah7s", "5cah7s", "5cah7s", "5cah7s", "5caev2", "5c95na", "5c96xx", "5cah7s", "5c96xx", "5c92pw", "5c9jq7", "5c92pw", "5caev2", "5caev2", "5cah7s", "5caev2", "5c96xx", "5c9d3j", "5c9nkb", "5cah7s", "5cah7s", "5cah7s", "5caev2", "5cah7s", "5caev2", "5c92pw", "5c92pw", "5c96xx", "5c96xx", "5c96xx", "5c9jq7", "5caev2", "5c96xx", "5c96xx", "5c9jq7", "5c96xx", "5cajfc", "5cah7s", "5c9jq7", "5caev2", "5c95na", "5caev2", "5c96xx", "5c9jq7", "5caev2", "5c92pw", "5c96xx", "5c96xx", "5caev2", "5c96xx", "5c9nkb", "5c96xx", "5c9jq7", "5caev2", "5c9jq7", "5c9d3j", "5c9d3j", "5caev2", "5cah7s", "5ca6lq", "5caev2", "5c92pw", "5cas73", "5cah7s", "5cah7s", "5cah7s", "5c96xx", "5c96xx", "5cah7s", "5cah7s", "5cah7s", "5c96xx", "5caugw", "5cah7s", "5c9jq7", "5c96xx", "5cah7s", "5c9jq7", "5cas73", "5c96xx", "5c96xx", "5c96xx", "5cas73", "5c96xx", "5cah7s", "5cah7s", "5caugw", "5cas73", "5c96xx", "5cah7s", "5c9jq7", "5calmo", "5c96xx", "5cah7s", "5cah7s", "5cah7s", "5cah7s", "5cah7s", "5c8jlf", "5cas73", "5cah7s", "5c96xx", "5c97yq", "5c96xx", "5cah7s", "5cah7s", "5c92pw", "5caugw", "5cah7s", "5cah7s", "5c96xx", "5c9jq7", "5cah7s", "5c96xx", "5cah7s", "5cah7s", "5cas73", "5caugw", "5cah7s", "5c9jq7", "5cah7s", "5cah7s", "5cah7s", "5cah7s", "5cavok", "5c96xx", "5cah7s", "5cah7s", "5c96xx", "5car30", "5cah7s", "5c96xx", "5cauza", "5c96xx", "5c96xx", "5caev2", "5caev2", "5c9jq7", "5calmo", "5caywd", "5caw4i", "5c96xx", "5c96xx", "5c8jlf", "5c8jlf", "5cah7s", "5cah7s", "5cajfc", "5c95na", "5c92pw", "5c96xx", "5cah7s", "5cavok", "5c9jq7", "5caugw", "5c8jlf"]}