{"comments": ["Thank you Bernie, for confirming why you were the man meant for the job. This needed to be said.", "Asking on the 'what if' is unhelpful.  What he is *going* to do that is what carries merit.  ", "Representative Ellison got on ABC during the primary and warned them that Trump winning the whole thing is a very real possibility and they all laughed in his face on national television. Who's laughing now?\n\nThis guy needs to be the DNC Chair, not Donna Brazile.\n\nEDIT - I forgot to link the clip, but so many shared it in the comments below that I don't need to. Now let's share it with the DNC.", "I hope some people here take his words to heart. If liberals are serious about a) winning back Congress and b) making sure Trump doesn't get to implement his far-right policies there are more important things to invest our energy into than playing a game of \"I told you so\" for years to come.", "Fucking Bernie always right. We now work towards the future.", "CNN has better ethics than the DNC. Let that sink in.", "I want **ranked-choice voting in the primary**. We need to make the playing field more competitive we need to decrease the power of superdelegates, and we need to create a system that doesn't pit us against each other in a harsh campaign for months before suddenly asking us all to rally behind whoever wins. People would be much more likely to rally behind the winner if that person was their 2nd or 3rd choice in the primary.", "[After Reagan/Bush]:\n*\"C'mon guys we have to vote the lesser of two evils\"*\n\nYou know what, you're right. We'll do it!\n\n[4 Years Later]:\n*\"Guys, we need to just stop the Republicans, and just vote the lesser of two evils.\"*\n\nYeah, I guess you're right\n\n[4 Years Later]:\n*\"Listen, its not perfect, but it should be enough. We have to vote the lesser of two evils.\"*\n\nAlright, if you say so.\n\n[4 Years Later]\n*\"C'mon guys, we can't have this moron Republican in office. Yeah, our guy isn't perfect. But we can SAFELY say that HE'S THE LESSER OF TWO EVILS!!\"*\n\nYeah, you're right I suppose. But, man, I dunno.\n\n[4 Years Later]:\n*\"Alright let's feel great about ourselves. We definitely need to wipe the past 8 years off, lets change things for real!\"*\n\nWhat a relief. Easy choice.\n\n[4 Years Later]: \n*\"I know things haven't been going the way we had hoped. But we can CLEARLY deduce that the other guy is very evil, and therefore its easy to choose.\"*\n\nAlright. I still feel a little good about it. But I sense a pattern here.\n\n[4 Years Later]:\n*\"Guys, you just need to be quiet and stop complaining, and think about the big picture here. We're voting the lesser of two evils. Got it?\"*\n\nW-wait a minute.  There's definitely a pattern going on here. Maybe we need to be more proactive here-\n\n*\"NO!. Lesser of two evils. Don't you get it?\"*\n\nI got it the last several times you've been selling that to me for the past 30 years.", "Fuck every single super delegate in office who lined up behind HRC from the start is ripe for flushing in my opinion.", "The whole super delegate system just needs to be trashed  in my opinion. Make sure you all let them know that as well", "[Here you go](http://i.imgur.com/Hcbb0UN.png)", "No they don't they're just slightly smarter.", "If anything his popularity is soaring. I can't believe what I am seeing.", "He's now a lobbyist for healthcare companies.  He was a huge Hillary supporter.\n\nSo no.", "&gt; if he doesn't try again.\n\nBro he'll be 79. He's in good shape for his age, and I hate to ever say somebody is \"too old\" to do something, but 79 is too old.\n\nHopefully Tulsi runs though. I like the cut of her jib. ", "First time I saw her was on a panel on CNN being very anti-Bernie in discussions and the same in interviews, during the primaries. I had no idea she was supposedly neutral.", "Arrow pointing left this time!", "Don't give it time! Start NOW. Primaries for 2018 start in 2017... kick these fucking idiots and corporate shills out.", "Bernie. Fucking. 2020.", "&gt; The real difficulty is that Sanders would be 83 during his second term race\n\nI will not make age an issue of this campaign. I am not going to exploit for political purposes, my opponent's youth and inexperience.\n\n--Bernie Sanders, 2024", "You realize he is filling up his cabinet with old guard GOP right? And you realize Pence is going to be doing the governing right? \n\nDo you *really* think the wall is going to be built? \n\nBwhaahhaaaaaaaa!\n\nYou just got *TRUMPED*! ", "When you get beat by somebody who isn't on the ballot you don't deserve to receive public funding.", "Few Democratic insiders would support him if he was 35 and running triathlons lol. We saw just how badly the superdelegates refused to vote for him even in states where he captured over 60% and 70% :(", "Sounds like the only reasonable staffer just walked out. I wish there'd be some introspection and changes but the other 149 folks were enjoying Donna's rip roaring speech even after her shameful actions were exposed.", "Just playing devil's advocate: if the RNC had one then trump wouldn't have got the nomination...", "I thought I was done reposting this awesome comment from u/masamunecyrus but here it is again\n\nPence got the endorsement from the much-liked former Republican governor Mitch Daniels (now president of Purdue) basically with the promise that he wouldn't pursue a social agenda. Mitch Daniels was liked because he focused almost exclusively on the economy and government efficiency. He gave no fucks about social issues and it was implied that Pence, as the successor of Daniels, would set aside the social dogmas that he was known for and govern a state that was on a very good path, economically, after Mitch Daniels' two terms.\n\nHe didn't do that. \n\nFrom day one, Pence didn't govern--he played national GOP politics. Whatever the big firey debate of the day was among the national GOP, he grabbed ahold of it and pretended to be its conservative crusader, even if it had absolutely zero relevance to the state of Indiana. He spent time, money, and resources on championing issues that Hoosiers didn't care about or didn't support, because he wanted to pander to the National GOP's ultra conservative base for his future career. Essentially, he was using Indiana as a stepping stone. He never cared about being governor. He always had higher aspirations, and the governorship was a stepping stone to a higher federal office. Most Hoosiers, left or right on the political spectrum, espouse this opinion about him.\n\nAs I said before, Mitch Daniels literally gave no fucks about social issues. Indiana is generally a conservative state, but it's never been a state particularly hung up on social issues, and it's never been a state that follows the national GOP's social platform. Indiana has, for as long as I've been alive, been a business Republican state--politicians like the Bushes, Mitt Romney, etc. We voted Obama into office, and prior to Mitch Daniels in 2005, we had 16 straight years of Democratic governorship. Indianapolis, the capital and largest city in the state, routinely switched between Republican and Democrat mayors, and it has managed to have long-term plans and continue its momentum regardless of which party is in office.\n\nSo Pence, with his national conservative GOP politics, has been an aberration that has directly harmed Indiana's image and its pocket book. \n\nIn the three years since Pence took office, he:\n\n* Pushed through legislation making harsher penalties for drug crimes against the protests of numerous major legal organizations including the Indiana Bar Association, as well as most Hoosiers\n\n* Inherited a phenomenal state balance sheet from Mitch Daniels and used it as an excuse to push tax cuts so extreme (would have caused a tremendous deficit) that the Republican-controlled Congress shut him down\n\n* Tried and failed to amend the Indiana constitution to ban gay marriage, despite widespread polling that showed that Hoosiers didn't support it, and despite the vociferous condemnation of virtually every major business in the state\n\n* Since his gay marriage amendment failed, he literally, as payback (not exaggerating, the signing ceremony was invite only, no media was allowed or invited, but someone leaked a picture that showed Pence surrounded by well-known anti-LGBT extremists), came back with the Religious Freedom Restoration Act which was a genuine political circus. It humiliated Indiana on the national stage, directly harmed Indianapolis, and was met with, perhaps, the fiercest backlash by the people of any state in the Union. The extraordinary protests of Hoosiers and businesses allowed the state GOP leaders to basically coerce--to his visible chagrin--Pence to amend the law and \"fix it\" (this was actually the [front page](http://media.theindychannel.com/photo/2015/03/31/indy_star_fix_this_now_1427838279029_15914269_ver1.0_640_480.jpg) of the biggest newspaper in Indiana). \n\n* The RFRA was such a debacle that Pence ended up hiring an expensive out-of-state public relations firm to heal Indiana's national image. He couldn't answer why he chose an out-of-state firm. He couldn't answer why he chose such an expensive firm, when there are many firms in Indiana that could have done the job. It was eventually canceled, and was yet another waste of taxpayer money. To date, the RFRA has cost Indianapolis (a city that fought against it, changed the official tourism website to rainbow colors, and hung a huge rainbow banner at the airport) $60 million, and the total cost--to the economy and reputation--to the rest of the state is unknown. \n\n* During the gay marriage supreme court fight, he literally sent the Indiana attorney general to *other states* to advise them on how to craft their laws and fight gay marriage nationally. He did this on the taxpayer dollar. He continued to spend taxpayer money fighting gay marriage in the courts and with lawsuits despite, at the time, everyone knowing what the Supreme Court decision was going to be. It was basically a political stand by Pence; an expensive political stand that Hoosiers didn't support.\n\n* He fought to pass a law preventing cities from passing their own minimum wage statutes. Is this \"small government\"? \n\n* He has acted like a strongman (think Turkey's Erdoğan), doing everything in his power to make Glenda Ritz, the state superintendent **and an elected official**, quit her job, and barring that, stripping her of the power given to her by the Indiana constitute and the Hoosiers that elected her through backroom deals, conspiracy, and highly technical legal challenges. Just Google \"Mike Pence Glenda Ritz.\" You could write a thesis on it. \n\n* Everyone, literally everyone, was on board for receiving a *huge* federal grant for preschool funding. The Indiana Department of Education was literally in the final stages of the application process--and the federal government was happy with Indiana and going to give us an especially large chunk of money--when Pence came in and shut it down for no reason because accepting money from the feds became politically untenable among the national GOP tea partier crowd. And, of course, you can't be elected president--Pence's eyes were always on the future--without support from the GOP's far right base. After shutting down the process, he has recently been opining that it would be a good idea to get federal money to fund preschools... A year after he shit all over the Dept of Education's proposal to do just that. \n\n* The HIV epidemic in southern Indiana is out of control and among the worst in the country. Of course, we could provide free needles for heroin addicts like has been done in many states to curb HIV problems, but that is politically repugnant to Mike Pence. He also managed to get the Planned Parenthoods in that part of the state shut down, eliminating the opportunity for poor people to get tested. The HIV epidemic, which never had to be an epidemic, continues, and Pence gets to push the problem on our future governor as he goes to join Trump on the national stage. \n\n* Speaking of Planned Parenthood, Pence is highly proud of his accomplishment at passing the single most restrictive abortion law since Roe vs Wade. The law, HEA 1337 is far stricter than anything even in the Deep South and is almost certainly unconstitutional. He knows that it's probably unconstitutional. Nevertheless, Indiana taxpayers will spend millions of dollars for our attorney general to fight the law all the way to the Supreme Court, just so Pence could make his political statement. \n\n* He literally tried to make a state-run news agency that he would then give exclusive interviews and access to. I don't even know if that's legal, but he tried to do it and was promptly crucified by the media and even his own party. \n\n* He asserted authority to ban Syrian refugees from being settled in Indiana. He has no authority. No governor has. He knew that, but he was planning to be a GOP presidential candidate, and he needed to show that he was strong and anti-Muslim refugee to appease the national GOP base. He took leadership role in this discriminatory crusade, appearing on national TV to preach his ignorance. This particular event managed to throw multiple refugee settlement organizations into disarray--which, by the way, actually include the Catholic Church of Indiana (the arch bishop of Indianapolis publicly criticized the governor)--and several Syrian refugees which were well into the process of moving to Indiana had to be relocated to another state. Pence didn't back down until the courts affirmed that his order was unconstitutional.\n\n* He shut down a highly successful energy efficiency program--one of the first in the nation, making Indiana a trailblazer--initiated by the Indiana Utility Regulatory Commission with the support of previous governor Mitch Daniels. He did this for no good reason, other than to signal to his far-right constituents that he was fighting against Obama's evil despotic EPA. \n\nThis is all just in his three years in office. He is reviled across the state, and especially so in Indianapolis. There is (was--now that he's the VP nominee, he can no longer be governor) a bipartisan *Pence Must Go* campaign to get rid of him, and there are literally [billboards](http://media1.fdncms.com/nuvo/imager/u/original/3821872/pmg_billboard.jpg) and [yard signs](http://media.theindychannel.com/photo/2015/04/17/16x9/_Fire_Pence__signs_go_up_after_RFRA_2839710000_16967639_ver1.0_640_480.jpg) plastered all over the city. Pence is, by virtually all objective measures, one of the worst governors in recent Indiana history, at least in terms of working for the benefit of the state. He has basically focused on far-right Christian social conservative interests to the clear detriment of all else, most importantly the current and future well-being of the state's reputation and economy. ", "she still denies she ever received debate questions in advance. \n\nShe is a very catholic woman so you know she is telling the truth.", "Last two times Republicans had control of the House Senate and Presidency for at least 4 years resulted in the Great Depression and the Great Recession.....so yeah spot on.", "Pretty sad that CNN has higher standards than the DNC.", "Clinton 2020. Clinton 2024. Lets do this America!", "I agree with the other guy. We're fucked. Know how I know? Because we turned right around and reelected DWS. We're fucked.", "&gt;“Why should we trust you as chair to lead us through this? You backed a flawed candidate and your friend [former DNC chairwoman Debbie Wasserman Schultz] plotted through this to support your own gain and yourself,” he said, according to the report.\n \n&gt;“You are part of the problem. You and your friends will die of old age and I’m going to die from climate change. You and your friends let this happen, which is going to cut 40 years off my life expectancy,” he added.\n\nHoly shit, Zach. The hero we need.", "As long as we're collecting things to throw into the Democratic Party Dustbin can we please add the garbage-churning bag of shit that is the Huffington Post?", "\"Why didn't you stop me from voting for Trump! THIS IS YOUR FAULT!!!\"", "How in the holiest of fucks did we go from having a black president to *this*?\n\nI used to think things were getting better in this country.  Sure we had our share our problems, but we knew what they were and we were working on them.\n\nNow I won't be able to pass a person on the street and wonder to myself if they support all the bigotry and violence this caused.\n\nI spoke to a Trump supporter at my job the other day.  I tried very hard to understand his position.  He admitted Trump was crazy, that he didn't trust him with the nuclear codes.  He said he thought things would get worse in this country (and they already are).\n\nSo his main reason for voting for Trump?  He didn't like Hillary but thought she would get elected anyway so he wanted to stick it to the establishment.\n\nWTF America.", "And I was so hopefully for all of forty five seconds...", "Everyone on Reddit seems to think Hillary lost because she was insufficiently inspirational.\n\nRepublicans will have carte blanche to keep fucking over minority voters so long as Democrats keep buying into the pernicious lie that a 10M vote decline since 2008 was all caused by candidate optics.", "[Deleted for this](https://i.imgur.com/Blysl7S.jpg)  \n ^^^^^^^^^^^^^^^^0.9106614978212028 \n &gt;", "&gt; he could have used a bit less hyperbole on the climate change bit. \n\nHe's right though. Posted less than 24 hours ago: \n\n**Climate change may be escalating so fast it could be 'game over' scientists warn**\n\n*New research suggests the Earth's climate could be more sensitive to greenhouse gases than thought, raising the spectre of an 'apocalyptic side of bad' temperature rise of more than 7C within a lifetime*\n\nhttp://www.independent.co.uk/news/science/climate-change-game-over-global-warming-climate-sensitivity-seven-degrees-a7407881.html?cmpid=facebook-post", "No they are hacks defending the only way they keep their jobs. They will all be sacked if true progressivism rules the party. ", "Hillary Clinton and the DNC just suffered the most humiliating defeat in the history of modern politics. Their supporters are pissed beyond belief and their enemies have never been more smug. \n\nThey'll go with the Trump model: nominate who the people want and then kidnap their grandchildren as hostages the moment they win.", "&gt; You're violating my beliefs by not allowing me to oppress you.\n\nI've been told like 5x today that *I'm* the bigot for not tolerating bigotry.", "Surprise  surprise. He rails against Obama, calls him the founder of ISIS, then says today that he is a great man. No one should be surprised that he changed his mind. It's par for the course.", "Yup clean house first.  Then once Trump gets in and starts fucking shit up, then we'll be ready to fight him.", "It's almost like he is a fucking liar", "Elon and Sanders make North America great again. Dunno wtf mexico is doing tho they're basically the internet explorer of NA", "The GOP is exactly where most of its voters want it to be. It is now Trumps party and this will be the largest overhaul of the GOP since Reagan reshaped the party. There will be older party elites who won't like it and they came out against Trump because they knew what would happen to the party if he won. They were willing to allow Hillary to get elected and lose the Supreme Court in order to 'save their party'. Now it is too late for them and their only choice is to live with the new party that will be emerging in Trumps vision or start a third party based on their ideology (true conservatism). They no longer have power in the GOP and the party belongs to Trump and us Centipedes. I am almost as happy about taking control of the party as I am about winning the White House!\n\nIf the Democrats are smart they will JUMP on this opportunity to take the DNC away from the 'old guard'. In two years there is a mid-term election where the Democrats will have to defend a YUUUGE amount of Senate seats which could be a disaster if they don't get their house in order! ", "cheating for your own team = lapse in judgement wont happen again\n\nthe other team cheating = unforgivable\n\nThe saddest part is that she can't even follow that script and shows no remorse for what she did: https://www.washingtonpost.com/news/the-fix/wp/2016/11/07/donna-brazile-is-totally-not-sorry-for-leaking-cnn-debate-questions-to-hillary-clinton/", "Now add a puppy!", "Here is another good idea my fellow democrats - SHOW UP AT ALL THE FUCKING PRIMARY ELECTIONS.\n\n\"State senate duh, what's a state senate\"?\n\nA MAJOR FACTOR IN HANDING THIS ELECTION OVER TO TRUMP (assuming other forces were not at play).", "That's why the meeting lasted 90 minutes. Trump was like \"No fucking way, Barry!\"\n\nAnd Obama's like, \"I knew you were gonna say that so I brought the files.\" Then he shows Trump all the underground shit that leaves him dazed and confused. Trump's gonna need some of that counsel from Obama, especially to keep all the ET races and their agendas straight. \n\n", "That sounds like something one would do if they were bought and paid for by Wall Street.  \nI must be misunderstanding.", "It's amazing that what it took to force Racists and Bigots to understand what discrimination felt like was calling them out on their racism and bigotry.\n\nWhat a world they get triggered by being called out on their behavior. ", "I was worried they would exhaust all their anger on trump and then forget about the corrupt DNC", "How about the New Deal 2.0?  \n\nWe rebuild the rural white areas and the inner cities.  ", "Especially because there are 25 dems up for re-election and only 8 gop.  It will be a struggle just to hold our ground.", "I wouldn't put it past them. Cronyist moneybaggers.", "Yeah tulsi is young and has integrity. While i like Elizabeth Warren she has done some stupid things that would be used against her. Bernie while being a democratic socialist which the word socialist making people scared, his dream is just a better life for all of us. He may not be 100% perfect but i have never seen a politician that has given so much of his life and cares so much for the people. A presidency with him i can see us finally moving towards a utopian society. Bernie 2020, let's do it! ", "The American political landscape is pathetic. Just let the mountain fucker in the debates ffs. We have like 800 channels of bullshit on the fucking TV box let him have his 5 minutes and let me have my fucking democracy.", "They'll learn soon enough", "Put some Respech on his name!", "And think about this: this is the worst they have to deal with. They get this fucking angry and \"triggered\" about being called racist. That's pretty fucking weak and pathetic IMO.", "&gt; How in the holiest of fucks did we go from having a black president to this?\n\nWe tried to elect a woman. Michael Moore put it best \"First a black? Then a woman? What's next a fucking gay? A transvestite? God next thing you know Peta will take over and we'll have a fucking Hamster running things!\" (Badly paraphrased but that's the jazz.)\n\nA lot of people who voted hated Hillary because she was a woman. Had a charismatic man been standing there with the exact same history as Hillary did he would have won. He would have won by a landslide. \n\nInstead we just elected a racist bigot who demands that America forget eight years of actual progress, because he's a charismatic man. It didn't matter that he's associated with Epstein, the class 3 sex offender that sold child sex slaves. It didn't matter that he admitted to groping women and forcing himself on them. It didn't matter that he bragged about leering at naked teenage girls. \n\nHe had a penis, he could wave and smile and reminded white America of the days when only white people had power. \n\nAnd I guess in the end they bet on that. ", "\"I'm actually getting judged not on the color of my skin but the content of my character! The nerve of these people!\"", "He is.  The old guard is gone.  He's gotten more screen time since yesterday than he got in a full month during his nomination run.  And good on him for seizing the opportunity.", "While we're expanding the scope of the list...\n\nAlex Jones.", "https://www.theguardian.com/us-news/video/2015/dec/08/donald-trump-calls-for-complete-ban-on-muslims-entering-the-us-video.\n\nNo one in that crowd thought it was just a \"shorthand\". You voted for a bigot. You elected a bigot. You are a bigot. Own it coward.", "Yes! [Get the fucking money out of politics. Join the fight sign the petition and volunteer.](http://www.wolf-pac.com/sign_petition?recruiter_id=42321)", "And they don't even see it. They never fucking see it. It's ***creepy*** man. ", "We got here in part because we had a black president.  All of the nasty racist shit that would have stayed buried under a veneer of civility got dredged up to the surface because \"how *dare* one of them think they're *better than us.*\"  ", "While I agree with the thought the symbolism of an arrow pointing right usually subconsciously makes us think of it moving forward.  Pointing left would be a great turn on it,  but I think it would have the negative effect of making people subconsciously getting the wrong message.   Our brains are weird like that. ", "Shame Reagan was a disaster his speech writers were top notch ", "No that's fucking bullshit.\n\nClinton has a long, empirically verifiable history of supporting policies that would be better for the middle class than the status quo at the time. You can argue if you want that her motivations were entirely cynical and she just wanted to build an impressive legacy for which people would remember and praise her. You can argue that she capitulated too much in the name of what she thought was political realism. But regardless of what you think she really cares about, what she has DONE is advocate policy positions that overwhelmingly align with the interests of the middle class and have the support of people like Bernie Sanders.\n\nTrump, on the other hand, has done nothing his whole life but screw other people over and take their money.\n\nThere is no goddamned comparison at all.", "Fuck that is sobering. ", "no.  The DNC generally suck at it.  Hence the loss.", "Hey some of their supporters are trying to pin the blame on Sanders supporters. \"If you voted for who we told you to vote for, she would have won.\" Of course that's a non-argument, they only get one vote each and there wasn't enough of them, that's their real problem. I've been telling them for 12 months that she was gonna lose and none of them wanted to hear it so they just downvoted me.", "When Hillary won the nomination I basically asked my girlfriend \"did you hear Trump is president?\" but by election day I was also pretty sure Hillary would win.", "Howard Dean has announced he will seek it too. He's done it before. Under his fifty state strategy, they got big gains in 2006 and 2008. Do you think he would be a good choice?", "She had an onion tied to her belt which was the fashion at the time. ", "Yeah so what if you want to persecute more than half the country? \n\n*What. About. The. EMAILS???*", "My SO's grandfather is 90. Sharp as a tack. He even said to me in private on Tuesday that \"I hope Trump gets fucking demolished.\" \n\nHe was a Republican for 70 of those years. ", "I was alive when gay americans were regularly being detained and beaten in the streets.  \n\nThe people who did that didn't die or change their minds they just got older and resentful that they weren't allowed to do it anymore.\n\nNow they're back and they've taken control of the entire apparatus of government.\n\nAnd if any of you conservatives in this thread want to say that I'm being unfair and most Trump supporters aren't bigots, then prove it by vigorously opposing every anti-LGBT measure that is going to come out of this White House for the next 4 years.\n\nIn fact, you can start today. Pence already promised to overturn the executive orders Obama issued to protect trans people, so you can express the outrage that you, as non-bigots, share with the rest of us, right here.", "I mean I'm also angry for the Republican base for picking Donald \"Pussy-Grabber\" Trump.", "That endorsement also proves more to me about her character than anything else. She was explicitly warned not to help Sanders and she took a hit in her fundraising support for doing it anyway.", "Eh the DNC got caught rigging the primary and colluding with the media, but they still haven't changed anything.  They've just resorted to blaming white women for Hillary's loss. ", "Well that's just the senate. The whole house is up for reelection (obviously) so that's a good place to work on too", "They are coming across our atmosphere.  They're bringing space drugs.  They're rapists.  Some I assume, are good people.", "Too much.", "Climate\n\nEducation\n\nMarriage Equality\n\nWomens Health\n\nRace War\n\nSurveillance\n\nIm sure Ive left out several. ", "y'all going to jail in a few months.", "\"We're still not Trump! 2020\"", "&gt;Who would have guessed that a quarter of America is still this racist?\n\nHA!\n\n-Black People", "Wall St. big business, and bankers are salivating right now. Their shackles are about to be taken off... I don't know how this bodes for the working class Americans who voted him in. ", "Mexico has the 2nd richest man in the world.  What is Canada's job?  Make sure we get new Orphan Black episodes?", "Here's what I wrote them.\n\nI have only written once and that was in December when you the DNC, shut down Bernie's data access.  Now I write you again because you never learned and your selfishness cost the country a generation.  Donna Brazile and any trace of DWS need to go IMMEDIATELY and not patronize your countrymen thinking you know better BECAUSE OBVIOUSLY YOU DO NOT.  Hillary was a horrible candidate who failed at everything she has ever done!  90's healthcare?  Fail.  What did she do in NY besides help Wall Street and get her daughter a Wall street husband?  She left the most scandal ridden state department since her idol Henry Kissinger.  Why or why did you force her down our throats when she couldn't even win the primary without your fingers on the scale?!\n\nYou better listen to the people this time and listen good or else.  You have the blood of the nation on your hands.  Clean it up and take accountability and show us how sorry you are.  \n\nI hope I don't have to write a third time to the DNC.  You're never getting another dime from me you greedy selfish assholes.", "This is freaking terrifying.", "When the economy tanks the minorities will be the first ones getting blamed.", "Two people on a plane? That sounds like coach and you know Trump don't roll that way.", "Republicans had 16 candidates and most probably thought Jeb Bush was gonna be the one but guess what? The people picked Trump to beat everyone else in the primaries and they all dropped out. He had no competition everyone dropped out. It wasn't like Bernie vs Hillary till the end with decently close. And because there was no one left, Trump became the clear winner and the Republicans just had to make him their nominee. Unless you are suggesting the GOP should've tried to rig the same way like DNC did with Bernie, then you also are part of the problem and glad you're stuck with President Trump.", "&gt; But in general Bill Clinton’s viewpoint of fighting for the working class white voters was often dismissed with a hand wave by senior members of the team, as a personal vendetta to win back the voters that elected him, from a talented but aging politician who simply refused to accept the new Democratic map. \n\n&gt; At a meeting ahead of the convention, where aides presented to both Clintons the “Stronger Together” framework for the general election, senior strategist Joel Benenson told the former president bluntly that the voters from West Virginia were never coming back to his party.\n\nIf they didn't listen to Bill, they definitely would have laughed off any warnings from Bernie about fighting for working class voters. How incredibly frustrating and I completely understand why the [Bernie campaign would not have had nice things to say post-election](https://twitter.com/freddoso/status/796374481308520448?ref_src=twsrc%5Etfw)\n\nedit: popular post plug for [Our Revolution](https://ourrevolution.com/), /r/political_revolution and [Brand New Congress](https://brandnewcongress.org/home)\n\nedit2: [Keith Ellison for DNC Chair](https://www.facebook.com/KeithForDNC/), [hear what he thinks the next DNC Chair should do](https://clyp.it/xkrux31h) or [read the transcript here](https://www.reddit.com/r/Keithellison/comments/5cbwby/rep_ellison_says_he_will_be_making_an/d9votim/)", "I can't think of anything this man has done that I disagree with. \n\nGoddamn I love Sanders so much.", "This was the most shocking revelation of the article. Perhaps a former president and governor of Arkansas miiiiiight have a little insight", "He's already endorsed a great candidate to be head of the DNC. Ball is in the DNC's court.", "The democratic party has no identity anymore. I go a long long way back and the Democratic party of my memory was the party of the working man and the Republicans were the party of the business man and the rich. Where is our identity now? How are we different from Republicans when we have paid lobbyists acting as Super Delegates? The DNC is so focused on the presidency they have abandoned the real power center - congress. ", "Trump promised his dupes the sky but is going to deliver the same old failed GOP corruption.", "CNN is slightly smarter than the DNC. Let that sink in.", "The lack of self-awareness and the arrogance is enraging.", "This election was opposite world. The Republican candidate was highly skeptical of trade deals hates NAFTA, and promised to kill TPP. The Democrat was pro-free trade, supported NAFTA from the beginning, and called TPP the \"gold standard of trade deals\".\n\nHow the Democrats didn't expect to bleed working class/union votes like crazy is beyond me.", "&gt;November 10 2020\n\nScientists: You've been cyrogenically frozen for four years\n\nBernie: Oh boy I can't wait to run for president again!\n\nScientists: Wait shit", "Welcome back /r/politics", "I hope millenials wake the fuck up soon: You know the baby boomer working class in the rust belt that tipped the electoral college to Trump?\n**It wasn't mostly about race or SJWs like Redditors love to fight over (from any side) it was about keeping their obsolete jobs in their sinking ship industries at the cost of all our futures.**\n\nThe rest of America, but especially the millenials, are neck deep in student debt and working our asses off to remain competitive in the crappy post-recession job market because we see that the world has changed and we are adapting.\n**These baby boomer fucks decided to elect a fascist to keep their mythical 'good-paying stable middle class factory jobs' that requires barely anything over a high school diploma, while not bothering to work to update their skillsets and remain competitive in the modern job market like the rest of us.  Pure fucking entitlement.**  \n\nWouldn't ANYBODY want that kind of an amazing low-requirement good-paying job?  The difference is that we know they aren't coming back because the post-WW2 global environment is not coming back: these selfish idiots metaphorically want to keep their middle class typewriter-manufacturing jobs back when the world has moved on to computers.  The incredible irony is that these baby boomers have been voting Republicans who preach competition and 'picking yourselves up by the bootstraps' while demanding their entitlements to come back from China.\n\n**These Trump-supporting baby boomers are willing to destroy EVERYTHING that will affect our futures ALL SO THEY CAN GET THEIRS RIGHT NOW: from leaving us with a bankrupted social security that us millenials are funding (notice their curious lack of opposition to social security?) , to destroying the planet that they will leave behind for us to fix, and fucking over all other modern industries that can potentially employ us in the upcoming trade wars.**  \"Who gives a fuck about you all when I've kept my outdated factory job that can sustain my 4 person family and will retire to nice social security paychecks you all will fund for me?\"\n\nThey made a deal with the devil to hold onto their dying jobs for just another measly decade or two, and thanks to the electoral college, gave up not only their souls but the souls of every other citizen in America in the form of less global stability, less security, less economic safety, less kindness.\n\nFuck the people, the media, and the various narratives who are calling for empathy for their \"economic anxiety\" when those workers show none for anybody else as anybody can see from their vote this election.\n\n\n**I hope millenials will see this and stop fighting about SJW bullshittery from ANY side and will vote to stop these baby boomers from siphoning whatever is left of our futures.**", "&gt;  others blamed Bernie Sanders for “poisoning” millennial voters who never came back on board.\n\nInstead of getting salty about this they should have used the information they gained from the primaries and thanked Sanders for showing them the way.", "There was definitely #NeverHillary sentiment amongst Sanders supporters. The problem is the media insulted and diminished us all constantly by saying we'd \"fall into line eventually\". And then Clinton supporters insulted us by saying they didn't want our votes and we were being ridiculous. Even on Reddit which is fairly ensconced in the \"left\" category, anything that was remotely critical of Clinton even being posted by a democrat was almost instantly downvoted, ridiculed, and buried.\n\nAnd then in the end, both parties ridiculed those of us who stayed \"NeverHillary\" and said we wasted our votes, even though we were willing to vote on principle and take a loss to stand up for them.\n\nSo, I completely agree with the point you are making. I'm an Independent who supported Sanders this time and didn't vote for Trump or Clinton, and I completely reject the \"vote for the lesser of 2 evils\" or \"a vote for x is really a vote for y\" ideology.", "I think Obama lulled them into a false sense of security. He's so calm cool and charismatic, it's easy to overlook just how incompetent most other top people in the party act. The interim head of the DNC gets caught leaking questions to CNN debates, and there's not even a call for her to resign?", "As a die hard berner a socialist, and just a huge fan. \n\nThis, this, this, this, this, this. \n\nLook, Hillary lost. Looking back at the past is pointless. We need to make sure he can't do shit, and prepare for 2018 and 2020. \n\nEdit. Y'all saying the 'doomed to repeat ourselves' thing or whatever clearly are not reading the comments and just being reactionary... I meant looking at Bernie v Trump is pointless ", "Red state / blue state is wrongheaded. That's part of the problem.  The real divide is urban / rural. They need to get into rural areas and really understand their issues if they hope to have ANY chance in the future. \n\nThis is why Bernie polled so Mitch better than Hillary in hypothetical general election matchups last spring - he spoke to issues that some rural folks could get behind.\n\nRemember Hillary won the nomination by winning a lot of southern states that were never going to go for her in the general. Meanwhile Bernie won in the rust belt states of Wisconsin and Michigan.  Those states flipping red killed her chance at the WH. ", "Clinton's lifetime dream was to become president of the USA.  She had four decades of experience and a lifetime of preparation.  She lost to a reality TV star who treated the entire process like a joke.  I'd say you should not be angry at her anymore you should laugh at her. ", "This is why the Democratic party wont change.  You guys arent willing to take a loss to stand for principles.  There is no Tea Party on the left.  The Tea Party was willing to lose seats in the House and Senate to primary Republicans they didnt feel were good enough.  Until Democrats are willing to do that to their own why the hell should the Democrat leadership care what progressives think.  You'll all just fall in line when necessary cause the Republican is worse.\n\nThere were TONS of republicans that didn't vote for Trump, even though he was running against fucking Hillary Clinton.  These people were #NeverTrump before any of the revelations about sexual assault or any of that came out.  They were against him because they didnt think he was a conservative at heart, and they BLASTED him for it on the radio and on TV constantly throughout the campaign.  Where is that on the left at all?  Was there any real #NeverHillary in the media?", "Democrats are always the underdogs. The people fighting for human rights are the underdogs. The people who want facts information, science, and to help the real world are the underdogs. \n\nWe have to fight to gain every inch we get, and we have to fight to keep it. \n\nWe fucked up, and now we get to be reminded about our roots. Why we fight. ", "[CNN just interviewed their cameraman and tried to pretend he was a random street protester.](https://www.youtube.com/watch?v=0_W5cDjy3uU&amp;html5=1) There is no such thing as \"standards\" in 2016 anymore.", "Why the fuck did they marginalize Bill? I mean I know his last win was 20 years ago so he may be politically rusty but his instinct to fight for working class whites was on point. She didn't need to win them outright, but had she just done some damage control and contained her losses in that demographic, the three rust belt states would have never flipped (narrowly) red. \n\nShe let her sycophants run roughshod and ignore the advice of her husband who, you know, WON THE FUCKING PRESIDENCY TWICE. Yes, Bill can be a loose canon (2008 South Carolina Primary, Obamacare comments this time), but we just elected Donald Trump President. Clearly some loose cannoning is ok. \n\nThe staff told him \"lol that's alright grandpa, this isn't your era anymore, you don't know what you're talking about\" - and then it turned out the very voters that cost Hillary the election happened to be Bill's core constituency in the 90s. \n\nUnbelievable. ", "I think it would still be as undemocratic if the RNC did it too. Its purpose is to make sure the party gets final say in their candidate not the people who make up the constituency.", "i forgot what life was like under republican rule.", "At the same time if we just continue with Hillary's friends in charge, come 2020 they will once again ignore the people who warned them this time.", "While its true that Trump is as unpolished and brash as they come I think its disingenuous to say he didn't take the process seriously.\n\nTrump controlled the media superbly and went to a heroic number of rallies. He just ran a very unconventional campaign. ", "&gt; Donna Brazille is behind one of the worst Democratic electoral disasters in modern history\n\nTwo.\n\nShe was also Al Gore's campaign manager.", "Literally no comments in here are in support of Hillary. I thought there would've been some left since this sub was crazy about Hillary. /s ", "Oh fuck don't remind me how anti-science the orange oompa loompa is. RIP climate. RIP forward-thinking technological policies. RIP NASA.\n\nFUCK", "Trump is absolute madman. Not only he was able to win despite all obstructions but he also wrecked both major parties in the process.  ", "It's going to be wonderful seeing Trumpettes excuse this. I can't wait to hear how it's Obama's fault.", "That was one of the surest signs she was going to lose. She should have saved us the trouble and told Sanders supporters to fuck off and vote Trump.  I've never seen two candidates obsessed with destroying their own campaigns", "Holy fucking hell. She's failing upwards.", "Further proof that the smartest thing Hillary ever did was marry Bill.  She failed when he allowed her to create a system of national healthcare she accomplished nothing in the Senate, and was a dud as a Secretary of State. She has essentially been campaigning for the presidency since 2000 and she's now a failure there too. \n\n\n\nBill was right. She needed to appeal to disenfranchised voters of all stripes-- including Republicans. That's what he did. She and her social justice team rejected that and tried to build a coalition of hyphenated Americans.  Rather than addres the issues of the country she addressed the issues of social media. Unlike Bernie Sander and Trump-- who aimed to convince people, she tried tried to target certain groups. \n\nI hope her and her brand of identity politics are gone. Issues are what matter, not focus groups and labels. ", "Welcome to DNC.\n\nIt seems like things aren't going your way.\n\nBut thats ok! You dont need to take responsibility! You can just blame..\n\n&gt;Russians\n\n&gt;FBI\n\n&gt;white people", "The cheques stopped flowing...", "Bill Clinton was the guy that took the DNC down the corporate path and turned his back on unions. \n\nThe idea that he was calling for the DNC to reach out to the working class suggests he was going against his own direction he took the DNC towards.", "Wow who could have POSSIBLY seen this coming but liberal Democrats telling Harry Reid he should have ditched the thing 6 years ago for this exact reason.", "I love this man. ", "&gt;\"You're going to die of old age and I will die from climate change.\"\n\n\nZach is the shiznit. ", "That's a story for my nightmares and I'm a white straight male.", "Last year I paid more in taxes than I ever drew out of SNAP and unemployment combined. \n\nAnd I would gladly pay twice as much. It is my civic duty to uphold the safety net which once caught my wife and I. I am proud to be a taxpayer. ", "Bill Clinton/James Carville's 3 messages for the campaign back in 1992:\n\n1. Change vs more of the same\n2. The economy stupid\n3. Don't forget health care\n\n... I guess Hillary Clinton forgot all 3.", "Although that is correct it doesn't make his unheard advide any less true.", "The best part about all of this is that Bill Clinton was the person that encouraged Donald Trump to run for president a year ago. ", "It's not going to happen. McConnell actually sounded very reasonable on this point yesterday with an obvious dig at Obama implied:\n\n&gt;MITCH MCCONNELL: I think it's always a mistake to misread your mandate, and frequently new majorities think it's going to be forever. Nothing is forever in this country. We have an election every two years right on schedule. We have had since 1788. And so I don't think we should act as if we're going to be in the majority forever.", "Unabashed Hillary Supporter.         \nLobbyist.            \n       \nSeems like the perfect choice. /s       ", "The truth is… They only cared about winning the minority vote… They didn't care about the white working-class vote or had an appealing message to them.\n\nThey're idiots.", "From the very beginning Clinton has had an air of superiority, entitlement and deceit that has pervaded everything she has done. It really shouldn't be surprising that this has rubbed off on those around  her. ", "The problem was also that HRC can't convey the authenticity required to connect with working class whites.\n\nDumb as it is many voters go by their gut and HRC always felt too scripted.  She's well versed in policy but Bush Jr proved Americans would rather have an idiot than someone who lacks charisma.  Is there a decent election where the most charismatic candidate didn't win?", "Tim Kaine and DWS were chairs of the DNC from 2009 to 2016.  Republicans DECIMATED democrats during that time from state legislatures to governorships to the house and senate and there was not a peep out of anyone to get rid of either of them because of it.  Why the fuck should Donna Brazile feel like she should resign?  All she has to do is preside over 4 years of total incompetence and then she may be someones vice presidential pick.", "Yea I agree there were voters who were #NeverHillary, but was ANYONE in the media or any position of influence or in congress #NeverHillary?  I certainly didnt see it and I think she was a flawed enough candidate to warrant at least a little push back.\n\n", "This headline is awful. It makes Bernie Sanders out to be an obstructionist which he is not. He is a center-left politician who always puts policy before personal feelings and grudges.\n\nWord for word in his announcement, he said Donald Trump's Policies  that \"*improve the lives of working families in this country, I and other progressives are prepared to work with him*\".\n\nThe narrative they are pushing with a headline like that will only serve to alienate Trump supporters. Stop encouraging this. The old, hateful, fear-mongering ways of both the old-right and old-left parties needs to die. Let's focus on progress and discovering the issues that unite us, not divide us.", "That definitely sounds like Hillary.  \"Not my fault\" is pretty much her official motto as she ratfucks everything she touches.  Hopefully the DNC fires Brazile soon and anyone else touched by the taint of Clinton.", "I don't know if it is plausible but I saw a site saying that Hillary was breaking down in tears and blaming other people in a call to a friend at the time. She was in no condition to go in front of a crowd.", "I never thought it was crazy about Hillary so much as defeating Trump.", "Look at how the DNC has been run for the past several decades. Everyone fails upward- so long as they were loyal to the Clintons. That's the only metric required for success.\n\nHopefully now that the Clintons are shunted out of politics for good some change might actually happen.", "George W. Bush term #3 but stupider and more reckless this time. \n\nThis should go great! /s", "Well he basically held a rally everyday. And people were screaming \"rapist\" at him all the time whenever he was in the spotlight Trump would bring up his sexual assault allegations. \n\nBut he had rallies more then her, he worked pretty hard. ", "Maybe if Hillary wasn't the most untrustworthy person in America she would've had a better chance", "Already breaking his promises", "Thats why we have to ask these progressives to start guiding us NOW on how to bring about real change.  We all want it but none of us really know what to do.  We have to begin NOW if we want to be ready for the midterms, which is by the most important thing to think about at this point.  We have to get dems or whatever you want to call this group (like the tea party equivalent for the liberals) use to voting on more than the stupid general elections if we want ANY shot at balancing power now.", "We should all follow that lead.  Don't lose the energy.", "Of COURSE it's back!  Of course!  Someone commented they thought he was easing up on some if his stances.  I told them WRONG.   ", "&gt;Clinton’s advisers have explained to the stunned candidate that she lost the race of her life in large part due to Comey’s October Surprise -- they said their plan of winning college-educated white voters and turning out record levels of Latinos was working until Republican-leaning supporters shifted back to Trump in the wake of Comey’s bombshell letter 11 days before the election, and the necessary enthusiasm among Latinos and African-Americans could not hold.\n\nComey's \"October Surprise\" didn't do shit. The polls barely moved. (Edit: I'm wrong, they moved by about 3 points.) They were just systematically underestimating Trump's support in the Midwest.\n\n&gt;But in general, Bill Clinton’s viewpoint of fighting for the working class white voters was often dismissed with a hand wave by senior members of the team, as a personal vendetta to win back the voters that elected him, from a talented but aging politician who simply refused to accept the new Democratic map.\n\nI believe the key words here are \"elected him\", as in, this was advice from a man who *was elected president twice*. Maybe you should have listened.", "Holy shit mitch mcconnell being reasonable? Now i KNOW the end-times are upon us. ", "I had to read that part of the article twice because I couldn't believe the sheer amount of stubbornness and arrogance within the campaign.\n\nAlso:\n\n&gt; And some began pointing fingers at the young campaign manager Robby Mook, who spearheaded a strategy supported by the senior campaign team that included only limited outreach to those *(downscale white)* voters — a theory of the case that Bill Clinton had railed against for months, wondering aloud at meetings why the campaign was not making more of an attempt to even ask that population for its votes.", "He looked a bit irritated. Which he has every right to be given CNN's obvious bias toward his opponent in the primary. CNN has a lot of nerve asking him this.", "Well duh Clinton was clearly the perfect candidate. A beacon of integrity and ethics, inspiring and charismatic, healthy and energetic, personable and down-to-earth.\n\nThe problem couldn't have been her. It's clearly the fault of the Russians/FBI/white people.", "Uh did you post in the right thread?  This article has nothing to do with emails or Sanders' supporters not voting for Clinton in the general.\n\nBut now that you brought it up, stop fucking blaming us.  Clinton and the DNC handed this election to Trump on a silver platter by ignoring Sanders' supporters and his populist movement.", "It's more of a \"conservative bubble.\"  Looking at what already worked and expecting it to keep working.", "As long as we actually learn something from the 2016 election.\n\nIf we just ignore the problems of the primary and Hillary's terrible campaign then it *really* doesn't matter.", "I agree it is undemocratic. Fact is, the DNC had them for that purpose and the DNC backed the wrong horse in my opinion. Granted we didn't have the same knowledge of DNC manipulation we do now, but they still could have avoided it. They had the evidence, they had the polling, even the RNC admitted they wanted the nominee to be Hillary. RNC knew it would be more difficult to campaign against Bernie than Hillary, and it paid off. ", "I would agree with you if they weren't frantically throwing blame themselves. The charge that Bernie \"poisoned\" millennials is particularly galling.", "Of course NOW Politico is willing to cite info from wikileaks.", "lol! Don Lemon fucked up.", "Democrats seem to outright hate middle class workers now.  ", "&gt; there are more important things to invest our energy into than playing a game of \"I told you so\" for years to come.\n\nFor sure. But it's been less than 48 hours. \n\nAt some point we do have to put the past behind us and get ready for what the Trump administration will mean. But inauguration day is still over three months away. \n\n*This* is the time to look inward and see where things got fucked up measure the pulse of the electorate, and figure out what changes the DNC needs to make in order to be more successful. Part of that is recognizing the role Bernie may have played if not for what happened in the primaries. \n\nSo with all due respect to Senator Sanders, we'll move on in due time. But for now we can and should be playing \"what if\". The only way you avoid repeating history is to study it and learn from it. ", "Two years.  Two.\n\nVote in the fucking midterms people.", "&gt; this kind of scandal is what we would think of the GOP.\n\nThe fact that you believe this means you have been seriously brainwashed. Direct evidence lies before you. Do you think this is the first time democrats have ever acted this way? Or the first time they got caught? \n\nRepublicans obviously have no idea how to rig a primary. Dems were like a well oiled machine. \n", "We have a budget surplus in California along with shrinking unemployment. Pretty sure liberal policies work like gangbusters when their implemented correctly.", "If Trump would have lost people *would* have forgotten all about the corrupt DNC. \n\nThe DNC finally getting the ass-reaming it deserves is the silver lining of his election. ", "Bill was always the politician and Hillary is the money manager. Her believing she is a good politician can only be attributed to living in a bubble of yes men and brooking no dissent. ", "same. When they picked Kaine as a final \"we won't cater to you you'll fall in line\" to the Sanders voters, I thought they were in deep shit. Sanders voters were not traditional democrat voters and many were young and angry enough to risk a Trump presidency. \n\nAs fall went on I figured Trump said enough abhorrent shit that people would come back. Nope. ", "Surprise! He's like the rest.", "Coincidentally neither does the firm hired to discredit global warming when they were hired by the tobacco companies.", "I mean this is very true in hindsight.  Bill is clearly vindicated here.\n\nBut the honest problem is that _nobody_ saw this coming.  Not the press, not the pollsters, not even the Trump team itself.  Hillary's campaign was following the data and doing what the data told them, which was delivering her large surpluses in crucial swing states and setting her up for near unbreakable odds going into election day.\n\nIt turns out that the data that we were all following was _wrong._  Everything about this election hurts, but I have a hard time faulting the team for making a reasonable case based on data they all had every reason to believe was accurate.  \n\nWe can hindsight all we want based on what we know now, but based on what they knew then - they were doing everything right.  They were winning, and winning, and winning, until the moment defeat took the entire world by surprise.", "He won white states and counties that went to Obama twice. Those states did not go red on White Nationalism. ", "Isn't it completely insane that we elected someone knowing exactly zero of his beliefs and plans? \n\nCompletely insane. ", "Keith Ellison is a good politician that stood with Bernie since the primaries. Naturally Bernie has already endorsed him to be the chair of the DNC as Ellison is a member of the congressional progressive caucus. This whole election has showed us who our real friends and enemies are and Keith Ellison is definitively a friends so i support this 100%. Sign this petition if you do too :\n\nhttp://pac.petitions.moveon.org/sign/appoint-keith-ellison?source=s.icn.tw&amp;r_by=4033250\n\nThe first step to fighting against Trump and the republicans and gaining senate and congress majority in 2018, and getting the presidency in 2020 is to purge our own ranks of the very people who caused this mess (Clinton and her allies, establishment democrats, corporate media, DNC). ", "Seriously. I've been saying this for weeks. The DNC's emails didn't change who Trump was on election day. And with Republicans controlling the presidency and both houses let's take a look at how the Sanders agenda will be fairing:\n\nClimate change: Gutting the minor measures we've taken.\n\nInequality: Tax cuts for the wealthiest no change or crappier deal on student loan debt.\n\nHeathcare: Back to the old system\n\nBig Banks: Deregulated even more\n\nIt goes on and on...\n\nNo matter how dirty she was, Clinton would have at least moved the ball towards Sanders's position on each of those issues. So all you Bernie Supporters who voted Trump, 3rd party, or sat out this election thinking Bernie \"sold out\" by endorsing Clinton, read that list again and ask who sold out who?", "Politico should add themselves to the shitlist too while they're out taking names. Their one-sided campaign coverage only fueled distrust in the establishment.", "We're talking about two different things. \n\nSure they leveraged his remaining popularity for rallies and that is perfectly fine, but I'm asking why they'd ignore his advice. ", "Repeatedly hammering that he's a socialist would have lost a lot of older people.\n\nBut the fact that he's Bernie Fucking Sanders he would have made up ton in true blue Dems and Independents.", "Wikileaks revealed that the democratic party's donors were extremely upset at her for supporting Sanders. So she will be ignored. ", "Yea I feel the transitional period these next few months is the best time for Democrats to air out all their grievances and as you said, clean house.  They can work on building coalitions and gaining voters once Trump's presidency actually starts.\n\nTrump has handled himself well in the last 2 days, and it's a honeymoon period for him and the GOP.  There's nothing the Democrats can do to hurt the GOP now, and it'll just make them look like sore losers.  So might as well focus on themselves.", "The Bernie supporters who went to Trump cared largely about only one issue: Their jobs suck their hometown sucks, it didn't used to be that way, no one seems to care, and if someone is paying attention and telling me they'll fix it, it's the most important thing. They're people who need to put food on the table for their kids, and they're the first generation anyone can remember in their family to have been consistently in poverty for decades. It's very difficult to worry about someone else claiming they are being oppressed when you're that desperate.\n\nBernie connected with those people, especially across the rust belt. Hillary did not. When Bernie was out of the race, Donald Trump recognized a vacuum and promised to help them. We can disparage them all we want, but as a Bernie supporter who was leaning toward a third party for most of the race, you cannot convince someone to vote for your candidate by yelling at them. People who are hurting have to be inspired by sincerity and empathy, whether it's real or fake.\n\nGod help us getting those states back if he can somehow pull it off.", "Hey no fair. We do stuff.\n\nSocialized healthcare\n\nLONG parental leave that can be shared between both spouses\n\nAffordable universites\n\nShort campaign cycles\n\nStrict campaign finance laws\n\n...", "\"You liberals had 30 years to stop me!! That makes me smart because I used the douchebag loophole!!\"", "&gt; A third attendee told HuffPost that despite Zach’s blow-up, there was “overwhelming” support for Brazile in the room. Her motivational words “had some staffers in tears,” per this attendee, and Brazile spoke to Zach’s concerns after he left. “If he had stayed, he would have heard that,” this person said\n\nThey've literally learned nothing", "One of the things that most impressed me was that after the election when I was numb with despair and disbelief, Bernie immediately came out fighting.\n\nThat he was going to work with Trump on the issues that made him attractive to the Rust Belt states, but on most everything else he and the other senators would oppose him vigorously. He gave me hope that maybe Trump won't be able to wreck everything Obama had accomplished in the next 4 years, and that we might actually get some of what made Trump appealing to boot.\n\nBernie really is a leader through all of this, while most the DNC is running around like headless chickens.", "Same.  I remember being dismissed and demonized because he wanted too much change too quick. As if saying we can do better is a crime.  ", "&gt;One of the things that most impressed me was that after the election when I was numb with despair and disbelief, Bernie immediately came out fighting.\n\n\nThis is a slap in the face to the criticism that he was too idealistic. He backed Clinton, because he was pragmatic. He says this, because he's pragmatic. He's coming out fighting, because taking action is the pragmatic thing to do. \n\nBernie and Chuck Schumer are the only brawlers liberals have on the senate floor, I hope to god they can lead a scrappy Democratic party. ", "even though he lost he is in a real position to change the Democratic party for the better. He has the upperhand after this election and the way it turned out. If the DNC wants the younger generation to stay they will have to listen to him.\n", "This is going to sound weird unpatriotic to some, but I'm actually OK with the rest of the developed countries imposing sanctions on us for our environmental/climate change non-conformities.", "It's disheartening to read this and to see them say that white working class voters turned on her because she's a woman. They turned on Democrats because Democrats abandoned them the article even lays out their dismissal of Bill Clinton on that issue. ", "Fuck anyone who said CTR had no influence on this sub. Bunch of idiots.", "Just the fact that she cheated and gave the questions to Clinton is publicly damaging and she should step down. I've been a Democrat all my life, but how can I trust this group in the future if they have a cheater at the top? They seriously need to clean house. We win by doing it correctly with integrity, or not at all. To do otherwise risks disaster, such as what we are seeing right now.\n\nThey don't stand up in front of me and talk about taking the high road, and then cheat during the campaign. Not if they want my future votes.", "&gt; The Democrats seriously need to clean house of the Hillary people\n\nThe DNC *are* the Hillary people that's been the root of the problem all along.   \nHow do you make a decision to clean house when the mold is in charge?", "Liberals and progressives of every stripe you owed it to this man to get your ass out of the house and vote on Tuesday.", "Yeah. The rubes in Ohio and Wisconsin and Michigan are going to be sorely disappointed. Bigly.", "I'm sorry but HOW F_CKING DARE the mainstream media come crawling back to the candidate THEY COLLUDED in shutting out of the primary process.", "a cheater that can't even win\n\njust let that sink in... they cheated and still can't win..\n\n", "The actions of Brazile Schultz, Podesta, and Clinton all got Trump elected. They were dishonest, careless, and tried to cheat through backroom dealing. The Democratic party needs a total shakeup and wakeup.", "Hahaha jesus christ ", "then\n\n&gt;Team Hillary : \"Bernie can never win - not enough support!\"\n\nnow\n\n&gt;Team Hillary : \"Bernie fans didn't support us so we lost!\"\n\npick one.", "&gt;“She got this gift of this complete idiot who says bizarre things and hates women and she still lost” said one longtime Clinton ally and fundraiser. “They lost in a race they obviously should have won. They need to take some blame.”\n\n\nSums it up pretty well", "It wasnt just the white working class that rejected Clinton. Over 30% of latinos in Florida gave trump the swing state he needed to reach the White House. Trump flipped SIX solid blue democrat states. Democrats and latinos put Trump in the White House as much as anyone else did and alot of the reason was the 24/7 race baiting by Clinton and her cronies at CNNMSNBC,WashPo,HuffPo,DailyBeast/Slate,Vox, and Politico. ", "I doubt people are that self-aware. Trump will always have others to blame and they'll just accept whatever nonsense he farts out. \n\nHe's an amazingly gifted bullshit artist. ", "I'm actually pretty okay with Nuclear energy. But hey he is still humam", "Every quote in this article reads like \"She was *owed* this presidency but such-and-such didn't play ball.\"  It's amazing how fast that fucking toxic attitude makes me want to shout \"MAGA!\" or whatever.  These people are just horrible.  They think they are owed money and power and yet offer zero reasoning other than \"I'm owed it, so just accept that.\"  Trump is a piece of shit, but these people are actual monsters.", "I want Obama to seem to disappear but really become the phantom of the white house changing wording on treaties and vetoing offensive legislation. \n\nSometimes you would hear sensible mutterings about policy through the walls, but he would never be found. ", "I'll say this now and I will say it every day Trump proves to be the con many of us thought he is: His supporters really don't care.\n\nThey hate the Obamas. They hate the Clintons. They wanted to beat them and they did. Everything else is secondary to them. If they lose their jobs they will complain. If the market tanks, they will whine. But you will never ever see them blame Trump for anything. This victory was their Obama 08.", "I posted this on another thread but it fits here as well:\n\nMy 4 point plan:\n\nIdentify the House &amp; Senate seats most likely to be vulnerable in 2 years at the midterm elections.\n\nWork with Bernie to create a network to financially support those candidates and act as a grass-roots PR campaign to raise awareness of them and generate name recognition well in advance of the midterm elections.\n\nCreate a database and article hub of flip flops, bad calls, and damaging actions &amp; statements from the vulnerable Senators &amp; Congressmen. Keep their corruption and failures in the public eye constantly for the next 2 years, allowing their constituents to tire of their drama, giving a new candidate a better shot at the seat.\n\nCreate update lists, support groups, local networks for outreach &amp; discourse. Get young voters involved in the process now so they will remain engaged and show up to vote in 2 years.\n\n4 things (in broad strokes) to limit Trump's damage to half a term. Rebound from what just happened and get active now rather than in 2 years. If the high emotions can be tapped into now and carried for just 2 years, we could potentially carry the midterms and stop this crazy ride.", "CNN blacklisted any decent coverage of Bernie. Fk them.", "In no particular order I think this would make the Dem primaries better:\n\n1) Change voting system (ranked choice or similar)\n\n2) Get rid of caucus (lower turnout=bad)\n\n3) Open or Semi-open primaries everywhere\n\n4) Same day voter registration for primaries\n\n5) Change primary schedule there's value in a long primary which allows for lot's of vetting and name recognition building, but large swaths of the country end up being completely irrelevant to the process. Not exactly sure what the best idea is, a series of super Tuesdays likely favors the bigger name recognition candidate, but the current system give crazy amounts of power to Iowa and New Hampshire, not exactly the most representative of States.\n\n6) Significantly alter the super delegate system, probably easiest to do away with it completely as it looks terrible\n\n7) Avoid any appearance of favoritism at the DNC, ensure all campaigns have a seat at the table.\n\n8) You can never have too many debates, but maybe mix up the format much more than is currently done. Really too easy for everyone involved to just talk past each other and go into their stump speeches.", "Both needed to get wrecked", "Works for me. Howard Dean's 50 state strategy worked. Even if we can win with only the urban vote it's not healthy for the party or the country.\n\nDoes anyone actually like banks that are too big to fail? Does anyone like cable or telephone companies? Does anyone actually like insurance companies? Yes, they make campaign contributions, but we need to make sure that accepting those contributions carries a price in lost votes.\n\nWe need to drop issues like gun control. I've never heard anyone say that they switched to voting for a Democrat because of gun control. I've heard plenty of people say that they won't vote for a Democrat because of gun control.\n\nWe need to push back on Republicans about taxes. We need to tell voters that Republicans want to take the money for services that they use, like roads, libraries, and education, and give that money to billionaires. Voters understand potholes. That's another lesson from Trump: don't bring out experts using fancy words. Use simple words, simple choices. Do you want to fix the pothole, or do you want to give it to a billionaire. Do you want more teachers in your kid's school, or do you want to give it to a billionaire? Do you want to go fishing in a clean lake with big, healthy fish, or do you want to go fishing in a polluted lake so that some investor makes more money?\n\nFDR did well in rural areas, and he did well in the South. We can do it again.", "A black man doing all the work a white racist takes credit for. A proud American tradition.", "Have you got a link to that video?\n\nEdit:  [Found it.](https://www.youtube.com/watch?v=FHkPadFK34o)", "I like how Sanders couldn't keep from smiling when he was asked the question. He fucking knows what his actual answer is.", "Can't wait to hear how these kids need to stop whining about their rights and follow what Capitalism demands. ", "http://i.imgur.com/jqLVblu.png", "&gt;The real divide is urban / rural. They need to get into rural areas and really understand their issues if they hope to have ANY chance in the future.\n\nIt's pretty telling that the county maps in the primary were divided Clinton/Sanders in some similar ways they broke for Trump/Clinton in the general. \n\nNot identical but while urban areas with liberal elites went for Clinton, lots of the rural parts went Sanders.  Islands of concentration breaking for the establishment liberal.\n\nSomehow, it was decided that the rural parts would tick through to Clinton and she'd keep her islands, instead of stopping to consider that the islands would obviously go through to any Democrat nominee, while Sanders was able to additionally contest the rest.\n\nWhen your primary map looks like a general map and you go with the candidate who locks up all your existing safe votes,  you're in trouble.", "My man. \n\nHe will always be a hero to me. No fascist can take that away. ", "\"As a christian woman I understand persecution...\"\n\nReal quote from her lol", "The party just lost in devastating fashion. There will be a reckoning. What we're seeing is almost certainly the 90s-Democratic-Establishment releasing its grip on the party but its going to be messy and ugly in the process.", "I would rather start bargaining from Bernie's sky's the limit position instead of Obama's here is everything you want but you want less anyway position ", "If you look further Trump only did as bad as he did because of things he said. If he just read from a teleprompter and took it seriously he would have destroyed Hillary.\n\n", "They're as flexible and adaptable as a freakin' octopus. They want Trump. Many of them don't care what that means and will adjust their views accordingly whenever necessary.", "Donald Trump is looking to put Jamie Dimon in charge of the treasury repeal dodd-frank, and repeal the fiduciary rule. \n\nHe hasn't even taken office and he's shaping up to be the most pro-wall street president ever.", "Not many. Even people like Bill Maher were saying \"you gotta swallow the kool aid when you can't have the chicken, take the fish\", etc etc and completely misunderstand the actual basis of support many Sanders supporters had, which was beyond liberal/conservative idealogy and more about our actual lives, families, jobs, and futures. Hollywood is too far removed from reality to understand these things, at least during this election cycle they were.\n\nThe problem with democrats organizing an equivalent to the Tea Party became real clear to me though when I attended various OWS protests around the country (I was living in a camper trailer and had the opportunity to see different areas). Every place was the same, people diluted the clear sentiment of anti-corruption, anti-plutocracy, and instead injected their own pet beliefs into the movement which may or may not have been valid. But the central rallying cry was lost. The Tea Party was always pretty clear, no matter if a person believed in their movement or not.\n\nThe democrats need to do as you suggested and be willing to fight battles that are losses in the name of integrity. But they also need to figure out what their central message is and agree with it nationwide.\n\nIf Obamacare is eliminated, if Roe vs Wade is overturned...things like this will provide that sort of unity. At least it seems that way to me. So if Republicans don't want a Democratic Tea Party to rise up then they should take this into consideration. I dunno, just the chess player in me thinking and strategizing here, because I find things from both parties I truly despise and some things I completely support.", "It's as if he were somehow an unscrupulous business man that would say anything to close the deal then welch on the deal once he got what he wants. If only we could have known somehow. Say what you will about the tenets of Pay for Play Politics, Dude, at least it's an ethos.", "Back in you go!", "Have to agree with this. I think a majority of Clinton voters were more concerned about the prospect of a Trump presidency and Republicans having control over all stages of government rather than actually believing in Clinton's vision of America something they did believe in with Obama and Sanders. ", "Yep it's sports team mentality. \n\nThey'll also somehow manage to blame Obama for it just like somehow Iraq was Obama's fault.", "And you just nailed his only real strength. He's a true [demagogue](https://en.wikipedia.org/wiki/Demagogue).\n\nThough he *has* seriously over-promised and will likely severely under deliver.", "They didn't really care about winning the minority vote either. I think they kind of just assumed minorities would vote for them while portraying Trump as a racist bigot. ", "Remember the Trump IAMA at the_donald?\n\nQ: Mr. Trump what plans do you have for NASA and space exploration?\n\nTrump: I think NASA is great, very great! I love NASA. MAGA!", "I disagreed with some of his policies but I don't doubt he's a great guy. ", "He also said that NASA is \"low priority\" because he wants to focus on \"infrastructure\" (that is privatizing roads.)", "Democracts in power need to get their fucking heads out of their asses pull up their shirt sleeves, and stop trying to think Republicans are going to play fair. Grow some fucking balls, god damn it.", "Lack of foresight was 2024", "\"The new rule says that states cannot withhold Title X funds from recipients like Planned Parenthood for any reason other than the provider’s “ability to deliver services to program beneficiaries in an effective manner.”\n\nThat means states will no longer have the ability to vote to defund Planned Parenthood because some of its clinics offer abortion services.\"", "&gt; The case rests on the legal argument that climate change threatens the plaintiffs’ fundamental constitutional right to life and liberty. Julia Olson a lawyer for the plaintiffs and executive director of Our Children’s Trust, argued in court that the federal government has understood the threat of climate change for decades and knowingly put the lives of future generations in danger. The current measures in place to reduce greenhouse gas emissions are insufficient and not aligned with current science, she argued.\n\nIt's unfortunate that a conservative Supreme Court would likely overturn any rulings in the lower courts, but it's hard to argue that these kids are wrong. ", "\"If you can convince the lowest white man he's better than the best colored man he won't notice you're picking his pocket. Hell, give him somebody to look down on, and he'll empty his pockets for you.\" - LBJ", "They demonized Trump support so it went quiet, where being a supporter couldn't cost you your job or ruin your reputation.\n\nI never once mentioned my support outside of anonymous boards until the day after the election, when I told my boss how I voted and why.", "He'll be pushing 80 so I remain doubtful.\n\nStill, if we get someone like Sanders, with his moral fiber and policies, but younger, I think they'd win in a landslide. Maybe Duckworth, Hassan, or Gabbard? Castro's another decent choice, though he doesn't have much room to rise with living in Texas. \n\nAnd of course, Democrats will probably pick up a few Governors and maybe one or two senators in 2018. We might find our savoir from among them.", "This is fascism poisoning the minds of young people. This is what happened in Germany and we have to resist it. ", "And the DNC has no unique selling proposition.  It's actually worse to claim to be for the people but still make bank off lobbying.  That one issue transcends party lines, Americans are sick of it and are looking for meaningful change.  \n\nI think the only salvation is to kick HRC crew who highjacked the party out and make a party policy against PACs and a pledge not to take lobbying jobs for at least 5 years after public office.  I have to believe the goodwill pr would outweigh the financial advantages that would give RNC.  ", "Nobody likes to admit they got conned. Trump is going to serve them someone else to blame most will gladly bite. We've seen this countless times before.", "To go along with what you said I think one of the reasons the data was wrong was the insane amount of pro-Hillary/anti-Trump propaganda coming out of the pro-Hillary corporate media. Among the effects were a massive amount of the silent majority keeping quiet about supporting Trump and the pollsters were probably reinforcing false assumptions when any positive Trump data came up. As far as I know the only polls that showed Trump ahead was the LA TIMES poll that EVERYONE was mocking. The other pollsters probably felt compelled to jump in the circle jerk. I have no idea why more people aren't pissed at CNNMSNBC,WashPo,HuffPo,DailyBeast/Slate,Vox,Politico, etc etc for the obscene amount of propaganda and character assassination. It was INSANE especially on r/politics. ", "Wanting to be president should be an instrumental goal not a terminal one. The major difference between the Trump and Clinton campaigns was that Trump told people why he wanted the office: to make America great again. You may call that an empty slogan, and perhaps it is, but it's *something.*\n\nWhat did Clinton use? \"I'm With Her\". That's not a reason, it's a declaration of personal loyalty, as though electing her president should be something Americans value in itself. \"Stronger Together\"? A process statement. \"Love Trumps Hate\"? The less said, the better. This stuff matters, and it's not as silly as you may think. It forms an impression in voters' minds, not just of the campaign, but of the *reasons* for the campaign. If they don't hear one, they're likely to assume mere ambition is the reason, and that's not good enough.", "If they were dumb enough to fall for such a terrible charlatan I don't have much faith they'll figure him out.", "Although I completely agree with you and Bernie and disagree in that the idea of looking back is completely pointless. We can't have a \"if only\" mentality but we can come up with new ideas to do better. We can peer into the past to observe what did and didn't work. ", "I see this election as a repudiation of both machines albeit different sides of the same coin: Both Dem and Repub machines tried steamrolling their respective bases. Repub steamroll job hit early but died off...Dem steamroll job hit late and was somewhat effective, so it was too late to change course with Clinton.", "That moment when just a few weeks ago this sub was up in arms about Trump saying he might not accept the outcome of the election. ", "&gt;The democratic party has no identity anymore.\n\nThat's not remotely true.\n\nThe Democratic Party is a party of:\n\n1) College-educated city-dwellers who have contempt for the working class so long as they're not black or hispanic Democrats;\n\n2) Single women who view the government, and its safety net, as a replacement for a husband or partner (check the exit polls since 1980);\n\n3) A patchwork of minority groups who are enticed by identity politics (La Raza, Black Lives Matter, and other activists) or government dependency. ", "I love how the MSNBC framing admit's the DNC is not even leftist at all.", "What difference at this point does it make?", "You don't see to have the same problem with HuffPo and Salon", "I don't know. Trump's base is pretty dumb and willing to twist all sorts of pretzel logic as long as they can delude themselves into believing they have it better than black and brown Americans.", "I agree and that's part of the problem. \n\nHowever, you're wrong in that there were at least two people who called this 100 percent: Michael Moore and Bernie Sanders. It's just that too many, myself included, got so caught up in the poll numbers and Trump's antics that the message was lost and the connection with the voters was lost. ", "It is. Please do not be ignorant about this.\n\nYes there is a chance it might not be as bad as people fear. The dude has switched political alignment numerous times. \n\nBUT. But he is surrounded by what are basically some of the worst elements of the American right. What's most likely going to happen over the next several years is the country being dragged back as far to the right as the GOP can muster.", "It makes me so sad that he didn't get his chance to take on Trump.", "Just like the good old days. Man MAGA sure came fast. I remember when I was a young man and it was perfectly acceptable for the other children to mock me and threaten me because of my ethnic heritage. Really takes me back. ", "Time to resign and get that sweet gig fellating Trump in the WH.", "Is it? Since Trump has been elected all of the conflicts we've been in around the world have had their leaders come forward and voice their willingness to take a diplomatic route.\n\nWe can't just blame Trump or hope for his failure. If we want a progressive government, we need to make it happen by changing what went wrong.\n\nI am a progressive. I would have voted for Sanders. What Hillary brought to the table represented nothing of our interests. She echoed a continuation of oppression against the human rights of other nations for no plausible reasons, something that we're seeing confirmation of in the wake of a Trump presidency.\n\nWe need to take a good long hard look at ourselves and ask what the hell we're fighting for. We've done things under a progressive banner that horrify me and others with genuine empathy for humanity. What we NEED to do isn't what we HAVE been doing.\n\nWe can fix this. We can return to a progressive government and populace. The first step is acknowledging that we need to fix it.", "Those guys all got fired yesterday.", "This. So much this. It cannot be overstated how much of this happened in this election.", "The 2018 senate races will be a bloodbath for Democrats.\n\nIf Bernie feels up for 2020 I'll support him him all the way but if not, I hope Sherrod Brown survives 2018 and wins in 2020. Check him out; he's very much in the same wing of the party as Bernie, with strong support from blue collar whites.", "Yep. As much as she tried to relate to working class voters by [bringing up her father's working class roots](http://theweek.com/articles/652409/why-hillary-clinton-suddenly-talking-about-dad) she was never herself someone from the working class. \n\nAnd she certainly does not know how working class people live these days. She does not see the issues they face now.\n\n[Bill and Hillary Clinton Shamelessly Mock the Working Class (09/13/2016)](http://observer.com/2016/09/bill-and-hillary-clinton-shamelessly-mock-the-working-class/)", "Because according to all available data, she was winning.  And handily. \n \nPresidential campaigns get advice from every angle, from everyone's gut feeling and instinct.  In hindsight, it's easy to pick out the few gut feelings that turned out to be right and call those people savants.  But at the moment, the actual data told them that they had every reason to believe that they were winning, and that their strategy was working fine.  If your best data (and not just yours, but everyone's too, including your opponent's) is telling you that you're winning, do you disregard that to go with someone's gut?  Whose gut?  Which instinct?  \n\nIt made sense to follow the data.  It was reasonable.  It just turned out to be terribly, terribly wrong.", "\"The liberals forced us to vote for him by calling us mean things\". ", "His surrogates are amazing at gaslighting I await how they'll explain this as him actually reforming Washington.", "And in case anyone still has doubts what fascism looks like here's a list:\n\n* Cultivate cult of personality (\"I'm the only one who tells you the truth\")\n* Discredit media (\"They're all liars, every single one\")\n* Discredit the entire system (\"It's completely broken and corrupt, top to bottom\")\n* Offer self as the sole person able to fix it (\"and I'm the only one who can fix it\")\n* Create your own media (Use current media until they wake up, Twitter, rallies, internet)\n* Use conspiracy theory and appeal to emotions, allowing for discounting of all exterior facts\n* Blame the victims, begin smearing of enemies, especially traitors perceived disloyal\n* Use dog whistle: violence (\"Throw him out. And do me a favor, punch him in the face.\")\n* Hyper misogyny, misguided populism, racism\n* Declare foreign threats, play on fears (\"ISIS\")\n* Stoke nationalism (border security, military) (\"We need a strong military, a strong police force.\")\n* Denouncing of traitors, foreigners, outsiders, deviants\n* Suppression of vices (anti-liquor, anti-drug, anti-porn, etc)\n* Unification under one ideal (One army, one flag, one God)\n* [Emergency event / attack] used to seize power\n\nThe most insidious thing about fascism is that by the time it's finally obvious to absolutely everyone, it's too late to do anything about it. Early warnings are critical.\n\nWhen a person's faith in a system they had lived in their entire lives becomes shaken, they become particularly prone to suggestion and conspiracy theory, further undermining that core belief in the system. Look for irrationality and a total disregard of facts. \n\nPeople laugh these things off, but this is not a joke, this is not a drill. Democracy is facing a threat not seen in our lifetimes. We need to focus and pay attention to what's going on. We elected a true [demagogue](https://en.wikipedia.org/wiki/Demagogue).\n\n[What a riled-up mob sounds like.](https://www.youtube.com/watch?v=R9YPYRaeTW0)", "It's surreal. In the last decade the least qualified candidate with the smallest number of voters has the most political power. \n\nI'm amazed at how civil Obama was today. ", "The right is fact and reason immune.  No argument will move them from their imaginary view of the world.", "Such a good article. 2016\n\n&gt;Clinton aides blame loss on everything but themselves\n‘They are saying they did nothing wrong which is ridiculous,’ one Democrat says.\n\n&gt;“She was the wrong messenger and everyone misjudged how pissed working class people were,” said one Hillary Clinton surrogate. ", "I found the lack of Bill extremely weird in the campaign. Sure he has tons of liabilities but given who they were up against I don't think those would have mattered. Hilary's just as tied to his policies as president as he is anyway, and he's actually likeable.", "It can and **must**.\nr/Reform_The_DNC", "There are a couple of points that are generally ignored for the cause of Trumps election:\n\n*  Trump won with fewer people voting for him as a candidate than have voted for any presidential candidate in the past 3 election cycles.  Yes even fewer than the number of people who voted for Hillary as she won the popular vote.\n*  Turn out was low on BOTH sides.\n\nImportant things to watch for in the GOP spin machine:\n\n*  There is no 'Mandate' that resonates here.  The MAJORITY of America that voted did not want Trump.   Sure if you look at the Electoral count and how it all played out it was dramatic, but this was a low turn-out election with weird shit happening.   \n\n*  Voters did not send a 'message' about anything re: Obama Care, Women's Heath care, Climate Change, or Net Neutrality.   Now well see what the GOP does with this barely won power.\n\nElection votes compare of last 3 elections: \nhttps://i.imgur.com/TOGIbcP.jpg\n\nTrump comes in dead last for number of votes received.", "\"The mess that Obama left folks. People are saying - smart people - they've never seen such a mess. Such a mess. So sad.\" \n\n- Trump 2020. ", "25 y/o white guy checking in. Voted Bernie then Hilary; my white peers seem to be thoroughly upset. They grew up in a post civil rights era and couldn't wrap their mind around the concept of \"white privilege\" and far left, obnoxious SJWs started using it as a slur. Plenty of them are racists to begin with, the ones that weren't were constantly told they were, so they fulfilled that prophecy. It's a lot to take in (systematic racism, \"The New Jim Crow\", all the fuckin white collar crime; pretty much everything is corrupt and a fuckin lie) and they were berated with misinformation and insults. \n\nBlack Lives Matter was taken way out of context, it was in response to cops indiscriminately killing black people in situations that it didn't call for; it wasn't supposed to be a race war. Both sides took it for it as a \"RABBIT SEASON! DUCK SEASON!\" fight when we all should have just worked together against Elmer Fudd.", "I wonder how many primaries Sanders lost because \"she could win\" she was constantly polling higher in exit polls in that category.", "In his defense (barf) he turned out to be a better deal maker than everyone thought.  \nHe duped ~30% of the population because he targeted desperate and undereducated.  \nI'm leaving the rich out of this. This won't hurt them at all. ", "I believe that without a doubt that Bernie would have won the election hands-down had he been the Democratic runner.", "Exactly. I don't want to say \"I told you so\" for years. But I might say it for a week or two.\n\nWe really need all Democrats to understand what just happened -- Hillary was a terrible candidate, we had a superior alternative who likely would have won the general election in a *landslide*, but we lost that superior candidate because Hillary supporters chose to smear him, and smear his progressive supporters, and close their eyes to her flaws, and to accuse those who pointed out her flaws of being right-wing conspiracy theorists. Predictably, she ran a terrible campaign, and now Donald Trump will be President.\n\nDemocrats in general, and especially the staunch supporters of Hillary Clinton during the primaries, chose to actively and aggressively engage in the collective *denial of reality*.\n\nAnd now Donald Trump will be president.\n\nThe reason why we have to say \"I told you so\" is to wake up those supporters -- some of whom are *still* -- impossibly! incredibly! -- blaming Sanders supporters for the outcome of this general election.\n\nFolks, Sanders supporters are not to blame for Donald Trump. We're the people who tried hardest stop it.\n\nIf you want to help us stop it in 2020, and you were a staunch Clinton supporter in 2016, you're going to have to open \nyour eyes to the realities of what just happened.\n\nSo we can move forward.", "There goes the media being the media. Asking the relevant questions about issues. I'll try to sum it up.\n\nWolf: \"Do you think you could have won if you were running against trump?\"\nSanders: \"It doesn't matter now.\"\nWolf: \"Ok Next question. Do you think you could have won if you were the democratic nominee?\"\nSanders: \"What good does it do now?\" Then he continues to talk about issues that face us.\nI love this man.", "Everything Brazile is involved with turns into a clusterfuck. I cannot understand how anyone can have faith in someone so fucking incompetent.", "He's got a little less than 10 weeks to try and put up as many sandbags as possible to mitigate the damage Trump can do.\n\nThe good news is he's smart and determined. He'll do every last thing he can.", "That's because the DNC is full of sycophants and yes-men/women. They're so up their own respective arses that they just lost an election due to their own pure arrogance.    \n ", "With all the states ignoring Federal law on legalizing cannabis and now Trump's election I wonder if this is going to usher in a new era of anti-federalism.", "The Democrats will never get Ohio PA, Michigan or Wisconsin again.\n\nAt least not until they can offer meaningful solutions to the hundreds of thousands of people who are losing their livelihoods out there.\n\nJust look at Michigan.\n\nMichigan has lost over 200,000 jobs since the Clinton administration.\n\nThey've only JUST begun to really recover *at all*.   Some sources think they MAY have 75% of their lost jobs back by the next election cycle... Not due to Trump, but to organic (if extraordinarily sluggish) growth.  They may be ¾ of the way back to where they were back in 2000... By 2020.\n\nMichiganders are hurting.\n\nThe same is true in Wisconsin, Ohio, and Pennsylvania...  All four states that Clinton lost but desperately needed.\n\nAnd the Democrats just ignored the fact that almost all economic recovery efforts have been concentrated in California, Florida, Texas and New York Metro area.\n\nAmericans ignored them, too.\n\nAmericans in Los Angeles and New York think \"things are going well!\" when things are really not going very well.  They're going well for *you*.\n\nMichael Moore was right.  You were living in a bubble and you either couldn't see or refused to admit that a LOT of your fellow Americans were in a bad way.\n\nAnd even now all you are is mad at them for voting for the only candidate who offered a solution.  You're not mad at Clinton or the Democrats for ignoring an obviously key demographic.\n\nYou're so worried about the current and future middle class that you've completely forgotten the former middle class.  You're not interested in talking about them.  You want to talk about student loans, jobs for young people, and social justice when these people aren't even employed and are likely too aged to switch careers.\n\nThe Democrats ignored the very people they claim to be the champions for, and they deserved to lose because of it.\n\nShame on the entire Democratic Party, and shame on liberals who are angry at vulnerable people acting out in the only way they had available to them.\n\nEdit: thanks for the gold, kind stranger! \n\nEdit: thanks for the second gilding, kind stranger! ", "it was unfair to delegitimize Obama's entire Presidency by challenging his American citizenship but what are you gonna do? ¯\\\\\\_(ツ)_/¯ ", "theres not much he can do that Trump can't undo.\n\nthats the problem with executive orders or administrative rules.\n\n\nfor the record I don't think P.P. should be defunded I'm not a fan of abortion but its not for religious reasons. just the struggle we went through to have our child made me rethink my stance, however i don't think my feelings should have any bearing on anybody elses options.", "It's already started.\n\nTrump is bringing in republican establishment insiders cronies, lobbyists, and Wall Street execs to run his administration. \n\nAll I keep hearing from his fan club is \"Hillary would have done it, too\" or \"Just like Obama\". Like, THAT'S what you're going with? That Trump is behaving like your sworn enemies?\n\nDenial is setting in. ", "And yet. It didn't stop Megan from grilling Donna Brazil as if that's the first time it ever happened. Fuck megyn and fox", "And we get President Trump. Awesome. ", "Now thanks to those that propped up Clinton and didn't think change was possible we're going to be seeing lots of change real fast out of the Republicans. ", "If this isn't proof of the fact that Democrats and progressives are two different parties I don't know what is.  ", "Everybody I know under the age of 40 who voted for Trump except for one, voted for him in protest for how the DNC handled ramming Clinton down our throats.", "&gt; How the Democrats didn't expect to bleed working class/union votes like crazy is beyond me\n\nNo that's the thing. They *knew* they were going to bleed those voters and were counting on demographics and identity politics to carry them through. Yeah, most women, blacks and latinos are default not going to vote for a Republican, let alone Trump. But the assumed and wrong logic is that they would all put up with our shitty, declining democracy to vote *against* Republicans and Trump. I stood in line for 3 hours to vote for Obama, I would not have stood in line for 3 hours to vote for Clinton (I did absentee ballot but even that my state made more complicated this year and was a hassle).\n\nThey literally wrote off an entire demographic so they could take a different demographic for granted. The Democrats need to wake up and realize that as voter suppression gets worse under a Republican World Order they're not only going to have to energize the shit out of women and minorities but they're going to have to find a way to also reach out to the \"yucky\" white working man.", "He's draining the swamp and filling it with sewage ", "Mods need to resign. Wtf.", "He needs to get fucking used to it. He's going to face criticism for the next four years all presidents do. He needs to put his big boy pants on and get over it.", "I'm still seething at comments I've read where people are now becoming concerned about a Trump presidency but for whatever reason they didn't vote", "I guess it's better than this tidbit from 1990:\n\n&gt;When the students poured into Tiananmen Square the Chinese government almost blew it. Then they were vicious, they were horrible, but they put it down with strength. That shows you the power of strength. Our country is right now perceived as weak ... as being spit on by the rest of the world—\n\n Donald Trump", "The thing about executive orders and rules promulgated in executive branches is that they are completely rescinable by the next president and his appointees. There is nothing permanent about this but I really wouldnt expect some random reporter to know that", "Well the fear is that the house senate, Supreme Court are now going to be far right. So there's a very real chance that some crazy shit can go down.  ", "Yep. Schumer just helped crush the TPP after Obama tried to sneakily pass it through.\n\n\nhttps://www.washingtonpost.com/news/powerpost/wp/2016/11/10/the-trans-pacific-partnership-is-dead-schumer-tells-labor-leaders/#\n\n\nPeople seem to have forgotten that our government has a system of checks and balances. The president is not a monarch with unlimited power. Even if Trump actually is Hitler 2 (he isn't) Senate and Congress and the Supreme court will be able to block any crazy shit he proposes.", "Or voted for a dead gorilla. ", "&gt;How could Trump be worse than Obama on Climate Change? If Trump does nothing at all but give speeches and play golf then nothing will have changed.\n\nParis Agreement Clear Power Plan, MATS - to just name a few - all stand in defiance of the inference Obama has only made empty promises; the idea is flatly false. \n\n&gt;Maybe Trump will be better? How could he be worse?\n\nHow about by simply following through with his published 100-day plan? Reversing renewables spending by billions, appoint a climate change denier to head the EPA, and backing out of the Paris Promise and/or ignoring it completely - how about that? \n\n&gt;The US needs to be unified if we are to address Climate Change. You need to stop the partisan BS and get ready to unite behind your President.\n\nTo what end, exactly? We're all supposed to hold hands and the power of our friendship will remove the methane and carbon from our atmosphere? The country, and largely the world, *already is* united on climate change. Trump's proposal is essentially suicide by climate; spooling up Coal and investing in Big Oil is virtually the opposite of what the rest of the world is doing - because those two things have an enormous impact on the emissions that affect the global climate. \n\n&gt;He is going to tear up all of the worthless treaties, so don't wail and gnash your teeth then. Wait for the next phase. Stand and help unite our nation to make progress, to create binding treaties on Climate Change.\n\nMore pointless, trite, rhetoric. Nothing of substance to even respond to. ", "Instead of trying to adapt to the situation and move forward they're chasing ghosts of the past.  Time they could have spent building up their economies and modernizing will be wasted for nothing.  They're going to end up even further behind than they already are.  Then they're going to come looking for a bailout.  ", "Sensationalized title is sensationalist. ", "Yeah...not a great start. Something like \"I understand the disappointment and uncertainty felt by the protesters but look forward to winning their trust and respect as President\" would've gone a lot farther than \"Unfair!\".", "Wow they must've really expanded their military over the past 72 hours.", "I think it's unfair you can win an election by receiving less votes than your opponent ", "How do trumplings defend this? I thought he was going to drain the swamp? Now he's cuddling up to obama and Paul Ryan. Is he still god emperor? ", "Clinton was less \"a candidate for the position\" and more \"A bag of favors being pushed through by those who wanted to redeem those favors at a higher value.\" ", "Even if the factories did come back the jobs wouldn't.  Things are automated to a huge degree now.  The only way that number of jobs could return is if you do them cheaper than Malaysia.  So yeah, let's just shred regulations on business.  Then when you die on an assembly line your family can die of starvation 3 weeks later because you never made enough money to save anything and there's no compensation to your family", "How the fuck is this happening? We have a president elect on fucking Twitter angry at protesters. In America. This isn't real.", "Except the GOP wasn't wrecked.\n\nTrump ran a low cost campaign allowed the GOP to free up funds for the down ballot elections, and now they control the Presidency, the Senate, and the House.\n\nI seriously can't believe it.", "I still can't believe what you Americans could have had and what you ended up with. It's a sickening tragedy. ", "I can't remember the exact quote but I believe George Washington said the two party system would be the death of America (someone help me out here)\n\nYou guys really need to go third party fourth party even. It's the ultimate check and balance in government. No one can pass anything unilaterally, no matter who's in power. They are utterly forced to work together in order for government to function and no one has enough of a majority to unilaterally stonewall legislation. It's almost as if everyone's interests are represented and government is forced to compromise", "Presidents don't complain about people exercising their God-Given rights.\n\nOnly cowards do.", "seriously what would we do without him. He's a fucking hero.", "This is going to be an odd four years.", "The viewpoints that Trump has had for decades are the ones that really terrify me. On most things he's a wishy-washy flake who will try to ingratiate himself to whomever is listening which in his presidency will be the Republican establishment.\n\nBut he really is committed to this idea that good leadership is about being the meanest bully on the playground.", "&gt;No that's the thing. They knew they were going to bleed those voters and were counting on demographics and identity politics to carry them through.\n\nI initially thought this, but then I realized we're giving the Clinton campaign way too much credit. If they really believed this, they would have done much more to play defense in the light-blue rust belt states of WI, MI, and PA, instead of doing stupid shit like trying to flip AZ. But they completely ignored Wisconsin, and didn't pay attention to Michigan or Pennsylvania until way too late in the election. They really thought they could have their cake and eat it too.", "Bernie is doing what he has done since he launched his political career - which is sticking to his convictions and doing exactly what he said he will.", "Another instance of Trump being guilty of something he accuses the other side of. Except in this case Hillary really was tipped off, but so was he.", "He's the reason I still believe there is hope in politics. Bernie and Tulsi. ", "Every time he stopped talking his approval went up. Whoever it was that revoked his Twitter privileges probably won him the election.", "That's probably the only policy of his that I don't agree with - but I can live with that because of all of his other policies and beliefs ", "I'm glad he's humble because I sure as hell can't be.\n\nBernie would have won.\n\nWithout the Clinton camp's terrible strategy of propping up Trump and using him as a \"pied piper\" to lead the other GOP candidates further right he would never have gotten off the ground in the first place.\n\nThe DNC created that monster and sabotaged the only candidate who might have still stopped him.", "That is because a good portion of them are a part of the establishment.  Of course they sided with her.  I'm sure to them a trump presidency is actually less threatening than a sanders presidency.  Because bernie sanders would have been against everything the majority of the DNC is pushing for.  The DNC is no longer a liberal party it is bought and paid for.  My protest is directed at the DNC.  Trump had nothing to do with the rigging of the primaries, that was Hillary and her planted people.  The DNC is absolutely responsible for the trump presidency!!   They are the whole reason it happened.  It's time for a new party.  ", "Ahahahah. \n\nThat's hilarious. He's whining about the thing he should be ignoring.", "Sounds patriotic to me as it's about the continued survival of the United States. Bring on the sanctions- we need to act. ", "The DNC will have a mini-convention in March and basically everybody who gives a shit needs to show up in person and throw their bodies into the gearbox of the machine until we stop it.\n\nEdit: to spare my inbox here is all the details currently available on the mini election:\n\nhttps://en.wikipedia.org/wiki/Democratic_National_Committee_chairmanship_election_2017\n\nAs for getting involved, follow Nomiki Konst on twitter, she's a big player in that fight: https://twitter.com/NomikiKonst", "GOP could split into a religious fundamentalist party and a nationalist populist party. dems could split into progressives and neo-liberals. libertarians and the greens could become relevant. ", "&gt; The Democratic establishment had their chance with this election. It's time for new leadership of the Democratic Party — younger more diverse, and more ideological — that is hungry to do things differently, like leading a movement instead of dragging people to the polls\n\n— Stephanie Taylor, Co-founder, Progressive Change Campaign Committee", "Everything will be a battle but remember how the Republicans were able to slow the Senate down to a crawl with just about everything but budget items needing a \"super majority?\"   That same mechanism is still in place for the Democrats to use when the Republicans get overly crazy.\n\nThe scary thing is when Republicans have power they use it polite Democrats use it sparingly to show they can be restrained.  When Obama had the House and the Senate for 2 years we should have pushed everything through, close GITMO, close down the drone program, reign in the NSA, go after the criminals on Wall Street etc.  Instead they tiptoed accomplished little but demonstrated incredible restraint.  Something you might want in a spouse that works with models of the opposite sex everyday, but not what you want out of politicians that promise change.", "Honestly I kind of figured he'd just go back to his job and fade back into obscurity.\n\nTo see him moving the fight forward post-election gives me hope that people won't just roll over and take it but keep the fight going and take the midterms", "It's what will happen if Trump strong arms us out of the Paris Agreement. \n\nUnfortunately sanctioning the US leads to a global recession. ", "Lol. They won. Hillary became democratic candidate. That was what they cheated for. ", "I honestly don't think Obama started there. I mean he came out swinging for the most part with healthcare reform. He only had a mandate for less than 2 years though, when Democrat voters stayed home like assholes in 2010. And the Blue Dogs fucked his healthcare law by siding with Republicans. ", "Good for them. They can start by taking over the 650 billion dollar European defense bill america is currently paying for.\n\nNext they have to worry about the rising nationalism within their own country that will depose merkle just like brexit and trump did in other western countries.", "Stand strong CA! We in Massachusetts are right there with you.", "Huh. We can say it now without getting banned. Neat.", "OPPOSE! NO UNITY! I will oppose this racist lying, misogynistic, bigoted, xenophobic piece of shit beyond the 2020 election. I'm sure there are these moronic, backwards ass Republicans out there who say that they didn't protest President Obama. Ignoring the obstruction of the Republican party, President Obama did not campaign on coming to implement Sharia Law or forcefully taking away your guns. Donald Trump on the other hand did push radical policies like banning Muslims from entering the United States, stop and frisk, building a useless wall---on top of insane sexually predatorial comments and fraud.\n\nThere will be no unity! ", "This is your anti-pc America Trump. Better get used to it.", "Most of the staffers are moronic puppets. People with conscientious (like Zach) will protest Donna and other 'bought' persons in the DNC. \n\nIf she has iota amount of shame she should take all responsibility for losing this election and resign NOW. \n\nAll of them must go. ", "We let him down and he's still out there fighting for us. ", "I mean aside from his extremely ridiculous off the cuff remarks he ran a brilliant campaign. The 4-5 rallies a day, sometimes long into the night in states he had no business being in is nearly unprecedented. The man is 70 years old and was starting rallies at 10pm then tweeting until 3am. You can despise the man but you can't deny he put up a god damn valiant effort. ", "Remember on Election Night 2012 when Donald Trump advocated for taking to the streets to protest the election results?\n\nhttp://abcnews.go.com/Politics/donald-trumps-2012-election-tweetstorm-resurfaces-popular-electoral/story?id=43431536", "Yeah this is pretty pointless. Nice gesture though.\n\nI suspect his game is just to try and make the incoming Administration look as mean-spirited as possible but somehow I don't think they're going to need any help with that.", "So fucking unprofessional. You're the President-elect start acting like it.", "This. This. This. Drop gun control. We aren't going to get it and it's just dragging us down on everything else.", "And this is how it starts. My fears about Trump were most acute not around him having actual malevolent plans. It was around \"shit happens\". To be the President is to be in the middle of a continual firestorm. You are going to be tested. You are going to be challenged. You are going to be fiercely criticized. How you respond to that all comes down to experience judgment and temperament. \n\nSo when I heard Trump give a gracious acceptance speech, my fears weren't diminished. With the best will in the world, our safety and prosperity is going to be determined in a large part by his ability to keep his cool, and make good decisions.\n\nAnd that remains my source of fear from a Trump Presidency. \n\nEdit:\n\n&gt; David Frum David Frum‏ @davidfrum\n\n&gt; What kind of person is sunk in self-pity not even 48 hours after winning election to the presidency of the United States?\n\nBe very afraid. ", "I've been shocked from the beginning by Hillary's botched messaging. I had always assumed that because she was married to a man who had the best political instincts of his generation she would be able to effectively communicate a resonating message and deflect criticism.\n\nNow I'm finding that she just decided to ignore him and listen to a bunch of guys who never won an election in their lives.", "He can't handle scrutiny. He's insecure and a narcissist. ", "&gt; \"Just had a very open and successful presidential election. Now professional protesters incited by the media, are protesting. Very unfair!\"\n\nHe's still losing the popular vote atm. Why is he surprised there are people not happy with the result?", "Here we go folks. Thin-skinned president elect can't handle criticism.", "\"Professional protesters incited by media\"\n\nI love how he complains about 'whining' by 'whining.' Just go about the business of running the company, Pumpkinhead.", "And he still bombed it. That's amazing.", "There's that Republican Privilege again. ", "But part of the reason he maintained that voter turn out in 12 is because he ran an inspirational campaign.\n\n\"I'm a flawed dishonest, untrustworthy politician who gets paid $250,000 for giving speeches to bankers\" surprisingly was not an inspirational campaign, hence the turn out.", "It's like he doesn't understand that even if he's the greatest fucking president ever he's still the president and like all the rest he'll be under massive amounts of scrutiny regardless, it comes with the title. If he doesn't get a grip on that soon there's going to be a problem.", "Yup a bunch of hypocritical morons so entrenched in the aristocracy that they couldn't journalism their way out of a flaming bag of dog shit.", "\"this election wasn't about one person\" says the person with a giant H as her logo and \"I'm with her\" as a slogan. Unreal.", "Fuck man I forgot about that. Remember back in the day when some people thought Trump was a Clinton plant?\n\nI miss those days of innocence and naivete.", "Doubt it. The GOP have the best rubber-stamp President since Reagan.", "Just like cutting your nose to spite the face.", "I don't believe he will last that long because he will be impeached for doing illegal things which are yet to be revealed.", "It's never going to happen.", "Idiots", "&gt; January 1 2020\n\nScientists: We reanimated you at the time that you asked.\n\nBernie: Oh boy, I can't wait to run for president again!\n\nScientists: Yeah we don't do that anymore.", "I hope he's ready for lots of \"unfairness\" coming his way; I'm not sure if protests are going away anytime soon. What happens if he begins deporting 2 million immigrants? Or even removing the climate change legislation? Can you imagine the number of hippies? (note self identified hippie here)", "And when investigative journalists expose government corruption during the Trump administration his supporters won't believe it's real, and they'll say it's all \"liberal media lies\".", "The calls of \"too ideal\" were wrapped in cowardice money, greed, and cynicism. People too afraid to look at the future and break out of the horrors humans can sometimes inflict on each other - selfishness and tribalism embodied and put through a wood-chipper megaphone. ", "The camera man was a dumbass or being fed lines by dumbasses anyway.\n\n&gt; Just like back in the day when your vote counted for 1/3rd!\n\nEarly U.S. history isn't exactly my favorite subject and even I know that it was 3/5ths and fucking stupid besides because it wouldn't have been HIS vote then.", "They voted \"their conscious\" and it seems some now recognize that the consequences of doing so weighs more heavily on their conscious now that the reality of the election settles in.", "I don't think I understand your argument.\n\nOf course he's devastated.\n\nIts still humble of him not to use the opportunity to say \"I told you so\" like all of his supporters (including me) are doing.\n\nAnd for the record he did tell them.", "Opening up new avenues for deportation. Truly 4D chess", "Just wait until he finds out that being President means you have to work long hours and make hard choices.\n\nHe'll bored of the office within a year.", "Let me put it to you like this.\n\nIn 2015 Clinton was lining up to make her run, and let most of the party leaders know it.  She lined up her super delegates, wink wink, nudge nudge, and then made sure she had the financial backers.  It's smart, and not illegal.\n\nIt's also the non-populist way to do it.\n\nSo she announces, and everyone from the get-go in authority, is on board.  That tells the party to line up behind her, and push this thing through.  Why?\n\nJobs.\n\nTheir jobs.\n\nIn the Clinton administration, each and every one of them has a guaranteed, or at least a good chance of retaining or improving their jobs, and pay.  They go from working for the party, to working for the administration because of their loyalty.  It's a major step up.\n\nNow here comes Sanders - and he has NO ONE from the leadership on board.  He has ZERO big whale investors or connections in business.  Not a single donor has signed on and is offering to fit the bill for some quid pro quo.  The guy is absolutely fucking terrifying, because he shifts the qualifications for the job from loyalty, to competency.  The internal establishment shits themselves looking out at the numbers he's pulling.\n\nSo they reach out to the media puppets, promising access, promising exclusive information in the new administration in exchange for positive press, or a few hit pieces.  Washington Post jumps on board and goes in on Bernie.  5 to 1 ratio of negative articles on him, and she gets glowing reviews despite the low energy.  Governors and mayors and other politicians are jumping on the Clinton bandwagon just to feed at the trough.  Clinton is the quintessential power distributor now, and everyone wants some skin in it.\n\nSo they do everything they can to screw Bernie out of \"her turn,\" because he threatens hundreds of staffers, donors, DC insiders, politicos and power brokers.  He doesn't want any of them because he knows they're essentially corrupted by the current structure.  They can't be brought back into the ideology of working *for* the people, not for the party, and for themselves.\n\nOnce they got through the primaries, they assumed, just like Romney did, that the polls would annoint her, since she now had the unifying theme.  But she and everyone in the DNC fucked up - they told the Bernie people to piss off - we don't need your vote - we'll pick up the independents and others who are scared of Trump.\n\nAnd therein lies the fatal flaw of the Clinton and DNC plan.\n\nWhen you run on a paradoxically stupid concept of \"vote for me or else the psycho gets into power,\" you create a self defeating paradigm where in order for you to win - you have to be right - and in order for you to be right - the psycho has to win to prove it.  Otherwise, your argument has no merit and it's just fearmongering.  When you have low likeability numbers, and low trustworthy numbers, people look at the two choices and say... nope.  It's why 10 million fewer Democrats came out to vote for her than in 2008, and 8 million fewer than in 2012.  GOP voter numbers are consistent from previous years.\n\nShe was a terrible candidate, and the people who desperately wanted her to win, were doing it so that they could also ascend.\n\nNow here they are, reeling from defeat, and they still don't get it.  They look around and say \"how did we lose?\"  It must have been the female non-college graduates who voted for Trump 70 / 30.  It must have been the female college graduates who favored Trump 54 / 46.  It must have been the 3rd party candidates who took 1.7% (Stein) and 2.9% (Johnson) - assuming those people were going to vote for her anyway (they weren't - Johnson pulled more Republicans away from Trump than Stein pulled from Clinton).\n\nThe point is, they don't want to rebuild the party, because they literally don't know how.  All they have ever known is the DC Beltway mentality - donors give money for access.  That's how things get financed.  Grass roots campaigns require lots and lots of work, and don't always yield results.  It involves talking to a lot of people, and rallying around big ideas and big plans.  The Democrat party is no longer about that.  They're about maintaining the status quo - and their power base - even if that means that they lose every single election for the next 10 years.\n\nIt's time for Progressives to have their own party.\n\nEDIT:  Thank you kind folks for the Gilding.  If you liked this, please upvote the comments this is in reply to - and spread the message social democracy style.  The rising tide lifts all ships.\n\nAnd I just realized it's my cake day / veterans day.  Happy 241st birthday to my fellow Marines.", "I've been reading the Podesta emails.\n\nThey knew Hillary was a deeply flawed and unpopular candidate.  The DNC's plan was to use their influence with the major networks to get Trump nominated because she was the Republican she polled best against.  \n\nWe all remember the constant coverage of Trump in the media.  That was at the request of the DNC.\n\nThey also asked the networks to frame Sanders' candidacy as a \"pipe dream\" and generally suppress the Sanders vote so she could win the primary.\n\nThe networks were too effective.  They at the request of the DNC, launched a movement to elect Trump and suppressed the progressive and liberal independent vote all the way to the actual election.\n\nThe DNC is directly responsible for President Trump.  They made it so he didn't even need to fund-raise, presented the weakest possible Democrat as his opponent and suppressed their own base.", "I can't wait for the people saying \"he always says the same thing it's boring listening to the same message over and over\"\n\nAnyone who knows him can probably quote his entire stump including hand gestures. And that's a *really good* thing. We need to make public colleges and universities, ↓ Tuition → Free!", "Saying Germany is leader of the free world is like saying the U.K is a colonial empire again because it holds a few overseas territories. Germany is loathed by Europe seen as causing austerity in South Europe (particularly Greece and Spain), and reviled in East and Northern Europe because they feel they're loosing control to Brussels and by extension Germany.\n\nAt the end of the day, Germany has no ability to lead Europe, let alone the Americas and East Asia. I get that Trump jeopardizes America's standing in the world, and I'm just as terrified of him doing things like leaving NATO. But lets not allow our hesitations to make us sensationalists.", "I don't know if I'd necessarily call it arrogance. But clearly before everything started they wanted Hillary as the nominee and did everything in their power to sabotage Bernie. Michael Moore (who predicted that Trump would win btw) said it best: People were begrudgingly voting for Hillary but it wasn't the same as when people voted for Obama because in the case of Obama, people were making sure they got their neighbors and family members to go. I know more than one person who just decided not to vote at all. If they let things play out organically, instead of trying to shove a candidate down everyone's collective throat, we might be looking at President-elect Bernie Sanders right now.", "If only there was a candidate on the Democratic side who was like super inspiring and generated interest among working class whites in the rust belt where Hillary lost", "The USA can not have a multi-party system unless the voting system is reformed and that requires amending the constitution.\n\nI get downvoted every time I speak about this but I sincerely believe people are barking up the wrong tree with this. Instead of trying to split the vote (which will only result in electing people you agree with even less) the focus should be on forcing voting reform which would then naturally result in a healthy multi-party democracy. The best way to force voting reform is what Bernie Sanders was trying to do, and that is to reform one of the existing major parties from within itself.", "Just secede California. And New England too.\n\nThe rich, wealthy blue states are what make America great... and then the crappy red states pay us back with fascism and hatred.", "I think a lot of people will happily vote for a female president if she doesn't make \"being female\" a pillar of the campaign. That doesn't mean a candidate not acknowledging that aspect of themselves.\n\nObama did this well about being black. He when appropriate, talked about how much it meant to him to be a black man, black presidential candidate, black president. He spoke about it with candor and obvious emotion, admitted his perspective was personal opinion and feeling. He recognized that the milestone wasn't *his* milestone, but a milestone for the country and for his race. He seemed humbled by it, not because he said, \"I'm am humbled\" but because he acted like he was actually humbled.\n\nHillary Clinton made her sex part of her campaign at every opportunity, crowed over it, even booked an election night venue with a glass ceiling (was she trying to jinx herself?). It seemed (to me and others I've spoken with, so presumably to many) like it was *her* milestone. She would say things like, \"I'm not a female candidate, I'm a candidate who happens to be female,\" but then the next day make a big deal out of it to another audience. Her actions proved the lie at every turn.\n\nIt came across to me as disingenuous - pandering. From a person who already gave off the impression of being willing to say or do anything to be president.", "CNN sees the evidence that Brazile gave Clinton debate questions ahead of time and they immediately fire her. The DNC? Nahhhh she fits right in.", "I have always been glad I live  in California but never as much as after Tuesday.  Also, never been a huge fan of Jerry Brown, however I agree with him on this. ", "[Deleted for this](https://i.imgur.com/Blysl7S.jpg)  \n ^^^^^^^^^^^^^^^^0.2499801808455061 \n &gt;", "I'm wondering how many Trump victories it's going to take before you all realize that this guy is dead serious and he played the media like a fiddle. Campaign Trump is Reality Star Trump. President Trump will be serious businessman Trump. \n\nHe had a rally every day for months sometimes 2-3/day. That's called a grassroots campaign, just go out and meet the people. I imagine that's how his presidency will be, he'll just get out and get to work because that's who he is. I don't think the man even sleeps.", "Seriously! We need all new moderators in this sub! Every single one of them needs to go! Just like the DNC we need to clean house.", "&gt; I don't know if I'd necessarily call it arrogance.\n\nThat and cronyism.  Kaine became VP because Clinton owed him for stepping down as DNC chair (to bring now-disgraced Clinton fanatic DWS in) not for any political reason.  Any number of populist Democrats would have been excellent VP choices to cut Trump's support from independent populist voters... but no, Clinton thought she could run her establishment empire and then pass it off to another establishment supporter when she got out.", "Honestly I couldn't help but laugh when I read this.  The man is a child.  Hillary laid this out for everyone to see during the debates.  When somebody attacks him he hits back no matter who it is.  \n\nThis is what truly worries me about the Trump presidency.  I can deal with terrible Republican legislation (that was bound to happen at some point anyway) but we can't forget that Trump is a unique danger.  What is going to happen if North Korea publicly taunts Trump?  I'm serious, is anybody willing to tell me that Trump wouldn't respond with military force?  How sure are you?", "Sanders is a much needed voice in the Democratic party. He needs to unite and invigorate.", "Found the person who actually knows a few things about Europe.", "\"We don't need you\"", "&gt;On the day of the debate Ms. Kelly writes, she woke up feeling great. Then an overzealous, suspiciously enthusiastic driver picked her up to take her to the convention center. He insisted on getting her coffee, though she’d repeatedly declined his offer. Once it was in her hand, she drank it. And within 15 minutes, she was violently ill, vomiting so uncontrollably that it was unclear if she’d be able to go on and help moderate that evening. It was so bad that she kept a trash pail beneath her desk throughout the debate, just in case.\n\nhttp://www.nytimes.com/2016/11/12/books/review-megyn-kelly-tells-tales-out-of-fox-news-in-her-memoir-settle-for-more.html?_r=0", "don't worry you'll be able to access affordable basic healthc-\n\noh", "Because they were blind and arrogant. How could they spend so much money on polls and not know that these states were in danger.  I'm so pissed off about this. It was their fucking job to know. ", "Heh it's even more than that. Their *direct actions* pushed to get Trump or Cruz elected.\n\nhttps://wikileaks.org/podesta-emails/emailid/1120 (see attached PDF).\n\n&gt;Operationalizing the Strategy\nPied Piper Candidates\nThere are two ways to approach the strategies mentioned above. The first is to use the field as a whole to inflict damage \non itself similar to what happened to Mitt Romney in 2012. The variety of candidates is a positive here, and many of the \nlesser known can serve as a cudgel to move the more established candidates further to the right. In this scenario, we \ndon’t want to marginalize the more extreme candidates, but make them more “Pied Piper” candidates who actually \nrepresent the mainstream of the Republican Party. Pied Piper candidates include, but aren’t limited to: \n\n&gt;• Ted Cruz\n\n&gt;• Donald Trump\n\n&gt;• Ben Carson\n\nThe DNC did this to themselves. They pushed for Trump. Now they have Trump. Every single Democrat that hates Trump needs to ask the DNC heads why they invited destruction to their door steps with a massive amount of hubris in thinking they could control the fire they lit.", "Honestly there's a lot that can get done at the state level in many places. Universal Health Care, free education, police reform, infrastructure, free college, etc. In places where the population supports these things, we need to get them on the ballot, or elect members of the legislature that will enact them.", "He's never going to impose term limits or ban lobbying. Whoever believes that is fucking stupid beyond words.", "Was it the Daily Show or Last Week Tonight that had that sketch about a Democratic House Rep and how he had to devote almost 3 hours a day to go to the Washington DNC Headquarters and sit down at a crappy looking call-center and go through this notebook full of phone numbers in which to do cold-calls for setting up luncheons and asking for donations from lobbyists.\n\nWe're talking about OUR Democratic Party. That's what they're doing. That is \"the system\" under our Democratic Party is operating on right now.\n\nHow can we continue doing that and continue being surprised that our Democratic Politicians are nothing more than Republican-Lites?\n\nWe need to remove that system.....BUT we need to replace it with a financing system in which the politicians can be more than happy to adopt.\n\nA universal pool of funds that come from donations of all Democrats across all 50 states for all Congressional Seats.\n\nI would pay $50 a year that goes into a universal pool of funds. Therefore thats $100 over a two year House term.\n\nLet say we need to compete for at least 300 of the 434 Congressional seats, back in 2013, the NY Daily News published a report by Maplight.org, based on FEC data, that the average House of Representative seat required about $1.69 million dollars. Let's round that up to $2 million.\n\nWe need to generate $300 million a year, for two years for a total of $600 million.\n\n$50 annual donation, would require 12 million donations over the course of two years. That could be 6 million Democrat making a $50 donation every year.\n\nAnd for $50.........why not have my local congressmen GIVE ME A COLD CALL, speak to me for about 10 minutes?\n\nOperate it like a kickstarter. For $100, you get a package of signed Capitol Hill Swag, personally signed. For $500 donations, you get to attend a luncheon when your congressmen arrives in your district, free lunch for 2 and a sit down. For $1000+ donations, you get a personal tour of the Congressmen's office, and Capital Hill, and a luncheon, and a sit down.\n\nThis also serves as a form of campaigning. How come we can't do something like that?\n\nBernie Sanders received more than 7 million individual donations. I can't see why the entire Democratic Party can get over 10-15 million individual donations on a consistent basis.\n\nWe can't just pretend that all of this runs on sunshine and rainbows. Elected officials need money for campaigning. We NEED better elected officials that serve the interest of the middle-class as their highest priority. I look at that and see a business proposition.", "They went into Arizona a cycle early. They played for a landslide instead of playing for a win.", "Hahaha yeah the senate is a dumb system however you try to spin it. Six million more votes and basically no say. Fucking absurd. ", "Most people who actually looked in-depth at Trump knew this was coming. I mean we've seen his SCOTUS list, hand-picked by the Heritage foundation (so he was letting a conservative lobbying group set some of his agenda long before he was elected.) And he chose Mike Pence, a hard-right GOPer who ticked off his own state, as VP...\n\nI know a lot of people hated Clinton, but had she been elected, we would've had a liberal SCOTUS that wanted to overturn Citizens United. While she might have been corrupt, we knew where she tended to stand on the issues, because we had a voting record from her and a long political career to look at and examine.\n\nBut instead, pushed on by a mix of hope and fear people decided to gamble on Trump, and anyone who pointed out that his history looked more like the \"elite\" businessmen who had been using lobbyists to control congress, or who pointed out that he had repeatedly enriched himself off the middle-class were dismissed as shills and propagandists. \n\nI only hope that, if as expected, he starts simply toting the hard-right line, his voters realize that he managed to pull a fast one on him, rather than trying to find ways to justify him.", "It's been this way for years too. Reid and Pelosi are two of the worst leaders in this party's history but they still kept control of their legislatures.", "His 10 year old son is in charge of the cyber ", "One of the major themes in this election was the fundamental misunderstanding of technology of baby boomers.  We simply don't have people in leadership roles yet that grew up with computers.  ", "Really? That's awful. They care so much about progressive ideals yet they're willing to give up the Supreme Court for the next 30 years. That is crazy. ", "I hope we get sanctioned.  I hope we get sanctioned out the ass.\n\nThe rest of the world can see climate change as a huge deal-- a deal that will kill us all if we don't do anything about it.  The USA creates 16% of the planets CO2 emissions and if we say \"nah fuck it, we ain't gonna throttle back\" the rest of the planet has a duty of survival to sanction us to hell and back until we are finally forced to deal with it.", "Obama had 60 votes in the Senate for about 4 months. And that included both independents along with every single Democratic Senator. A single defector kills anything. \n\nHe wasn't in as strong as a position as you think. Leiberman basically killed the public option by refusing to support it. They lose him they lose the 60 votes they need. Etc etc. That's why ACA was watered down. That's why there wasn't anything after ACA. Don't forget that a majority of republicans believe Obama is a secret Kenyan muslim sleeper agent and literally said day 1 that their unifying goal was to obstruct Obama and make him a 1 term president.", "Just because he didn't break the rules doesn't mean its fair.", "\"A society is good with its old men plant trees whose shades they know they will never sit in.\"\n\nIn this case the Trump voters not only will not plant trees, but will rip up seedlings to just to give us the finger.", "Trump wasn't actually voted in by America's underclass looking for change Clinton massively beat him in every demographic except whites, and the big split was on white males. They voted for him because he launched his big on 8 years of calling the first minority president a foreigner, started his campaign with a promise to build a wall to keep minorities out, said that he'd stop all of the scary brown Muslims from entering the country, etc.\n\nAgain, the only group he won with was whites, particularly males, and they most certainly do not have a monopoly on economic hardship. What they do have a monopoly on is being partial to his campaign of promising to go after 'the others'.", "Yep. And then they turn around and say that D.C. shouldn't be a state because it would be unfair to have 2 more Democratic senators.", "Lol drain the swamp my ass. You Donald voters are true morons", "&gt; When Obama had the House and the Senate for 2 years we should have pushed everything through close GITMO, close down the drone program, reign in the NSA, go after the criminals on Wall Street etc.\n\nYou *think* they wanted to do all that, but their record shows they didn't. Hell, Citigroup decided on what Obama's cabinet was supposed to look like *before he was elected* and then he's expected to reign in Wall Street?\n\nThe truth is that the Republicans are bought by big business and everyone knows it; the Democrats are bought by big business but everyone pretends they're 'progressive'.", "This is real. Despite that nice speech he's still not pivoting, guys. He's still gonna act like a child. This is going to be an embarrassing 4 years.", "Do you know anything about the National Front party in France? My guess is no. ", "A little sure but mostly because Hillary was an AWFUL choice. Do you see that?\n\nThe DNC knew about the server before they designated her Queen. Obviously Hillary knew about it too, and she had to know it would haunt her. I doubt she was that inept. Wikileaks and the FBI investigation only looked bad because they WERE BAD!!!", "Un. Fucking. Believable. The election is over yet the full extent of his projection is still coming to light.\n\nPretty soon it's gonna come out that he wasn't born here.", "Every good person should strive to be Trump's worst nightmare.", "Best fucking line this election season not exaggerating. It's gonna be fucking sewage monsters walking around and running the white house. Oh and I'm hearing rumors that Bannon is slated to be chief of staff.....", "Yep. He's just getting more press for doing it now. He'd have said the same kind of thing when Bush was elected but nobody in the national media asked him.", "I love all this bullshit that the media is spewing about how it might not be so bad because he used to be a democrat and how he'll work across the aisle. These people haven't been right about anything for months. It's going to be so much worse. ", "&gt;\"A bag of favors being pushed through by those who wanted to redeem those favors at a higher value.\"\n\nFucking poetry man.", "&gt; But he really is committed to this idea that good leadership is about being the meanest bully on the playground.\n\nthat is how he has lives his whole life ever since adolescence when he was sent to a military academy for being a little shit by his parents. they hope that it would change his behavior it only amplified his sociopathy\n\nwatch the PBS documentary, The Choice 2016 where they talk with his friends during his teenage years:\n\nhttp://www.pbs.org/wgbh/frontline/film/the-choice-2016/", "That sucks but it's the Senate. Why should California decide who represents Alabama?", "Sounds great but I'm sure Trump can pass a new rule undoing this. And just wait till the country winds up with 2 Trump SCOTUS justices. This is going to get bad.", "*\"Clinton was so unpopular that she lost the lower-class vote to man who lives in a golden skyscraper with his name on it.\"*\n\nI wish I knew the origin of that quote but it's fucking perfect.", "Hillary **never went** to Wisconsin and only went to Michigan **once**. Losing by only 1% is actually a great result for that.", "The most infuriating part of the Clinton campaign for me was the \"it's her turn\" nonsense. As if she deserved something she couldn't earn herself. It just screamed of arrogance and complacency. Which is not surprising coming from the DNC. ", "Releasing this after the election seems kinda hypocritical \n\nWhy did Comey have to alert everyone so haphazardly again? ", "Well sure but all those people in the tech sector on the coast can now buy cheaper goods manufactured in other countries and as economist tell us, it's better./s\n\nWhat economist and politicians seem to not realize is that economics is subject to accumulations of wealth.  This means aggreagate is made of variation around a mean.  Well votes don't accumulate.  All those data points below the mean are real people doing worse than average.  And it turns out they aren't happy about it.  And eventually, if they're only option is a loudmouth saying all sorts of stupid shit courting some horrible parts of the electorate, well there are only two choices and thirty years of free trade has left them nowhere but below the mean.\n\nFree trade is good in aggregate.  Unfortunately if your nations wealth is held by a minority of people, the majority of the benefits of that free trade are only felt by those with wealth.  Inequality means that is a shrinking number of people.", "Honestly I'm iffy on it. On one hand it's much much cleaner than existing technologies and investing in research can also edge us closer to the overall end goal for energy in sustainable large scale fusion reactors. On the other hand we also have promising technologies in solar and wind power that should also be a main focus and the question of what to do with the entirely new environmental impact that nuclear can bring in the form of the waste product, we should learn from the downfalls of fossil fuels that we should take this into account before we go gung ho into nuclear. I think it's a good conversation to have moving forward and maybe even a good stopgap for the advancement of existing technologies to improve or for more big advancements towards practical fusion. ", "are you being serious right now or do you have no idea how the senate works?\n\noverall popular vote literally means nothing for senate elections they're voting for their own state and only their own state", "Interesting. I thought we had already plumbed the depths before election day. But this election is a gift that keeps on giving. All that faux outrage about corruption and election rigging when he was getting questions fed from the beginning! ", "It would be impossible to impose term limits without the consent of the people he supposedly wanted to limit. Transparently a false promise.", "The bar is not a high one to set. Let that sink in.", "Can we have a week? I'm exhausted ", "Considering they thought the solution to this embarrassment was fucking *Tim Kaine* I'm going to say they're so far up their own ass that it doesn't really matter what they thought of us.", "President-Elect runs a campaign based around dividing the country calls it unfair when the country feels divided. Okay, sure. ", "You're not addressing the article. Are you in favor of these potential appointees?\n\nHere's the list:\n\n&gt;Leaders in his transition include former Rep. Mike Rogers former Reagan Attorney General and Heritage Foundation fellow Edwin Meese, former President of Heritage Edwin Feulner, former Bush administration official and lobbyist Christine Ciccone, former Dick Cheney adviser Ado Machida, former Senate Budget Committee staffer Eric Ueland and former Sen. Jeff Sessions' chief of staff Rick Dearborn. The effort is chaired by New Jersey Gov. Chris Christie and Trump counts former New York Mayor Rudy Giuliani, former House Speaker Newt Gingrich and Sessions as close advisers.", "Kindof - the entire strategy was to get Hillary *president* - I think even the most idiotic of DNC staffers would agree that her losing the presidency defeats the purpose of winning the primary.\n\nTechnically you're right but... you know.", "I think it was NPR who said Bill was livid that Hillary never once visited Wisconsin as if it wasn't even important. She got trounced by Bernie in Michigan and even though he could read the tea leaves apparently no one else could.\n\nThat was what propelled him to the oval office and she paid no attention to the Midwest. And it showed.", "&gt; but he will need to admit that he was wrong to cast his superdelegate vote for Clinton so early if he wants me to even help him get reelected to the senate. He was part of the problem unfortunately.\n\n...and this is why the Democrats aren't going to gain any ground back in 2018.  This is the **EXACT SAME BULLSHIT MENTALITY** that caused the Democrats to get wiped out in 2010 and led to the massively gerrymandered electoral map we're stuck with until 2020.  Brown isn't perfect?  So the fuck what?  Go with the candidate you *mostly* agree with and work on compromise from there, instead of sulking in the corner and watching as the Republicans win and shred everything again.", "DNC is too busy blaming everyone but themselves.  Bernie just accepts it but works from  here.", "/r/calexit \n\nhttp://www.yescalifornia.org/", "Because California should cast votes for other states senators.. \n\nSeriously who thinks this up ", "Yep he won on eight years of calling the first minority president a non-american foreigner, on starting a campaign with the promise to build a wall to keep foreigners out, on promising to ban all Muslims from entering the country, etc.\n\nThe only demographic he beat Hillary on was whites, and the big split was on males - he didn't win the economic underclass vote at all, minority demographics voted massively more for Clinton than Trump.\n\nwww.pewresearch.org/fact-tank/2016/11/09/behind-trumps-victory-divisions-by-race-gender-education/\n\nPeople might like the narrative, but his original loudest platform, and the only people who voted for him more, suggests his victory was about racism, not economics.", "I knew Hillary would crash and burn when the DNC started treating the millions of Bernie supporters like they didn't need them. I hope the left takes over the DNC and fires every single person there along with every insider all the way to the top.", "Let's not forget that Trump's proposed Treasury Secretary worked for Goldman Sachs for 17 years and is now a hedge fund manager.  BOTH parties are the parties of Wall Street.", "Military power is the *only* real power. At least on the world stage that is. You think everyone in the world lets America do whatever it wants because we have \"strong leadership\"? Give me a break.", "I definitely agree that renewable energy is the future - but i think that we're still a long way off from it being the primary energy source and nuclear has potential during the transition ", "Which unfortunately boils things down to social issues being main deciders. I just can't support a party who believes my brother can't marry the man he's been with for 12 years.", "Our voting system will always converge into two parties.  A third party will never ever gain any traction.  If progressives want a chance our only shot is through DNC insurgency.", "Alternatively she cost millions of people health insurance. ", "And [here's another one](https://www.youtube.com/watch?v=qfy0FNOmmaI) complete with incredulous laughter, eye-rolling, and absolutely correct political conjecture.", "Also none of the other countries are going to have the balls to do it whether it's right or not.", "I don't know but I do know Trump had a bigger Hispanic vote than Romney.", "And then Mitch McConnell said today that infrastructure is not a \"high priority\" for the senate right now. So we probably won't get that either.", "They couldnt ask for her resignation because they would have to acknowelege the leaked emails that exposed her.  The DNC went to great lenghts to claim that the emails were doctored so if they fired Brazille after she was caught in the emails they would be acknowleging that the emails are legitimate.  They can't do that so they have to wait till March to kick her out.", "That's some majory fantasizing there.\n\nI would love some research into accounts that were brand new around CTRs inception and how many have died overnight.\n\nI wonder if they ended up deleted or just abandoned. ", "Hey do you remember Joe Lieberman? Because I do. I'm sure Obama does. We didn't have support for single payer or socialized healthcare within the Party. Forget about negotiating with Republicans, getting your own house in order is step 1. ", "I had some arguments with Bernie die-hards about voting Hillary on Reddit; it drove me crazy to think they placed more importance on idealism than realism (I voted for Bernie too btw). \n\nI can empathize with their sentiment but hell, even Bernie tried to tell them not to be fools and to vote Hillary. At least Bernie would have been able to wield his influence in the Senate then. But now, we are looking at a lost generation for social and economic liberals.\n\nFuck those people.", "Sensationalized article is sensationalist.\n\n&gt;France will likely elect Marine Le Pen in their upcoming election and with her anti-EU sentiment, leaving behind Germany as the last beacon of hope for those that believe in absolute liberty and freedom for all of humankind.\n\nApparently if you vote for your country to be free from an existing  politico-economic union, then you're actually against liberty and freedom.", "&gt; but they're going to have to find a way to also reach out to the yucky white working man.\n\n*\"Gah-roooosss.... poor white guys. I bet they don't even know how to Instagram.\"* -  Some DNC Staffer probably.", "\"But this candidate wasn't **everything** I wanted to the extent I'll let a maniac who doesn't believe in Climate Change into the White House with a VP who believes in Gay Conversion therapy.\"\n\nSeriously how fucking bad does the opponent need to be before you hold your nose?  It's shocking to me not that so many voted for Trump but that so many didn't care if he became president.", "Millennial voter turnout in 2008 - 51%\n\nMillennial voter turnout in 2016 - 19%\n\nHillary lost because she didn't inspire the youth.\n\nGuess who Bernie's best numbers were with.", "Are you putting the blame on Millennials?\n\nAre you including the 12-17 year olds in that judgement?\n\nAre you ignoring the vast number of college educated non-millennial women who specifically voted for Trump instead of Hillary?\n\nAre you ignoring the massive amount of voter apathy about an election between two horribly unlikable candidates?\n\nJust checking.\n\nBecause I'm pretty sure Millennials didn't have a huge amount of sway in this election and whatever apathy there was is COMPLETELY understandable.", "Been saying the same thing.  They chose the quick and lazy route by not working on their skills then and they did the same again by picking the \"bring back your jobs \" promise now.\n\nTheir social welfare nets will be gutted and their jobs wont come back.  They are gonna end up sicker and poorer.  \n\nIts pure entitlement.  They feel they deserve the same high pay without any of the hard work more skilled people have put into acquiring their skills.", "Tim Kaine a solution to quell that outrage? Nah he was selected from the start. In fact it was he who dropped down as head of the DNC to let DWS take over and fuck the system.", "I can't believe we will need to endure this for at least 4 years. The president of the United States tweeting his inane thoughts daily like a child.\n\nForget all the bigotry authoritarianism, etc. for a second, the pure comedic, amateurish nature of this man will put a stain on this nation's standing in the world for decades.", "Only in America. This was always coming people just didn't know it. Finally Americans realize how stupid the rest of the country is. 300 million people. Not 20, not 50, not 100. 300 million people in America and they let this crap happen.", "Crickets", "Story of Trump's life. ", "Warren Bernie and Ellison should be leading the DNC from now on. Kick out the corrupt members and actually make the party a progressive party.", "There's nothing else to say.  This is everything. DNC fucked us all.  Should be out there protesting that.", "&gt;So to take Bush down Clinton’s team drew up a plan to pump Trump up. Shortly after her kickoff, top aides organized a strategy call, whose agenda included a memo to the Democratic National Committee: “This memo is intended to outline the strategy and goals a potential Hillary Clinton presidential campaign would have regarding the 2016 Republican presidential field,” it read.\n\n&gt;“The variety of candidates is a positive here, and many of the lesser known can serve as a cudgel to move the more established candidates further to the right. In this scenario, we don’t want to marginalize the more extreme candidates, but make them more ‘Pied Piper’ candidates who actually represent the mainstream of the Republican Party,” read the memo.\n\n&gt;“Pied Piper candidates include, but aren’t limited to:\n\n&gt;• Ted Cruz\n\n&gt;• Donald Trump\n\n&gt;• Ben Carson\n\n&gt;We need to be elevating the Pied Piper candidates so that they are leaders of the pack and tell the press to [take] them seriously.\"\n\nhttp://www.politico.com/magazine/story/2016/11/hillary-clinton-2016-donald-trump-214428\n\nThis story is just now getting articles written about it. The email got released in fucking July and Sanders supporters were spamming is everywhere but people wrote it off as \"conspiracy theories\" just like everything else that ended up biting them in the ass.", "If the Republicans succeed in forcing their agenda which seems very likely given their complete control of the branches of government, then you will see a rise in anti-federalist sentiment on the part of democrats and liberals.", "&gt; I'm not a fan of abortion but its not for religious reasons. just the struggle we went through to have our child made me rethink my stance however i don't think my feelings should have any bearing on anybody elses options.\n\nThis is the mature perspective. It's too bad there are so many people who aren't capable of just personally disagreeing with abortion without wanting to take the choice away from others as well.", "Endorsed by Sanders and Warren.\n\nSo... it probably won't be him will it :(", "The popular vote in the senate is pretty meaningless when each state has two senators but hugely different populations.\n\nIt's the house where gerrymandering can cause big disparities between number of votes and number of reps elected that the real problem lies.", "Reddit is still trying to blame this whole thing on Hillary existing there was genuinely coordinated horseshit working against her. Russia, the FBI, Fox, every Ron Paul fanatic turned Bernie Holdout \n\nOh and I'm sorry Bernie Holdouts, the fact that you didn't get your first choice and decided to punish the world for it makes you no better than the guys who voted for him. \n\nThose of you who think the DNC needs to do what the GOP did and cater to the angry white people, please start a fucking third party and leave mine alone ", "Trump is in way over his head. Way way, way over his head. His entire political platform was based on armchair cable-news rhetoric. Now suddenly he finds himself on the phone with international leaders, attending briefings which discuss real threats to America's safety, and the burden of making good on all the asinine promises he made to America.", "They voted for a dead meme and ended up with a living one. ", "The thing that infuriates me is that they *did* know.  She lost those states in the primary to Bernie Sanders because he was  the anti-establishment candidate who wanted to fight for the working class.  They arrogantly thought that all of the Bernie voters in those states would just fall in line and vote for the Democrat when in reality the game of politics is dead to that group of people.  They voted Trump because he was the only one willing to go there and talk to them and scream at the top of his lungs that he was going to bring those blue collar jobs back.  \n\nThere is no excuse for their incompetence and they deserve this loss.  The only ones to blame for this are the people that will show up when they look into a mirror.  ", "Hillary's 3 messages:\n\n1. It's my turn\n\n2. What does it matter\n\n3. Why am I not 50 points ahead", "&gt;Remember that in politics that there is much hyperbole.\n\nMaybe in a speech or debate but not in written form for your 100 first days in office. \n\n&gt;Remember that none of the plans and agreements would have stopped climate change, at best they would slow the rate of acceleration.\n\nWho said it did? Are you aware the effect tends to compound? Doing less is doing more harm than spending inwardly *towards* fossil fuels could ever do economically. \n\n&gt;So the key question is if Clinton's election would have resolved anything important other than slowing the rate of acceleration?\n\nOther than slowing the rate of impending doom? It doesn't need to be better than that - we desperately need to slow it down so we can buy ourselves more time to develop renewable energy to supplant the types of energy that are impacting our planet's atmosphere. \n\n&gt;Trump may unify America behind climate change. He also might not. Obama actually reduced public support by making it a progressive's only issue, so can Trump do better?\n\nI'd love to look over your source for \"climate change public support\" showing an illicit decline over the last 8 years Obama was in office.\n\nNo - Trump cannot do better. 1) because your supporting claim is false and plain rhetoric and 2) because reversing progress on climate change will never unify anyone, that would imply people at large could get behind the idea that it's really not that big of a deal and we really should trade short-term economy for long-term humanity. \n\nAre you aware humans all over the world are already being displaced by sea-level rise in the most low-laying areas of the world, including here in the US? \n\nTo deny climate change is to declare one's willful ignorance, whatever that's worth. Moving backward on renewables and simultaneously bolster fossil fuel is suicide - maybe not for boomers, though, since they'll likely be dead before widespread drought has ravaged agriculture, sea-rise causes mass migration, mega-storms decimate everything else (more heat = more energy for storm systems) and most of the biodiversity on our planet is dead and gone. ", "Ellison heads the DNC Dean can help, re-introduce the 50 state strategy, connect with workers of all races on issues that really matter to them while still protecting minorities and social justice and making this the country we want it to be. \n\nIt's not hard, the hard part is removing the leeches that are the Third Way baby boomers who just delivered us a loss to Trump.", "http://nymag.com/daily/intelligencer/2012/11/trump-is-election-nights-most-unhinged-goper.html\n\nTrump wanted people to march and start a revolution in 2012... and get rid of the electoral college... and said America had a sham democracy. LOL but it's ok now though since he won.", "Yeah except when you burn your coal in Red states we all suffer the consequences.", "The fortunate thing about the Trump victory is that the mainstream media has finally been exposed for what it is: a tool for the political establishment. With such a humiliating loss those low-level media columnists are starting to go rogue and finally own up to the pure dishonesty of what the elites ordered them to do. Expect a flurry of independent media outlets and groundbreaking journalism to come from the most unlikely of sources during the Trump presidency as the leash has finally been cut. ", "We DID speak up and they labeled us \"Bernie bros\" and misogynists and obstructionists. Fuck that.", "I'm not sure which of his victories I find the most impressive:\n\nBesting a corrupt Establishment\n\nBesting a corrupt Media\n\nBesting a stupid weak GOP\n\nBesting a corrupt DNC\n\nDefeating the Bush Dynasty\n\nDefeating the Clinton Dynasty\n\nWinning an impossible campaign", "I'm still pissed that Warren didn't come out and support Bernie during the Mass primary.  But at this time we'll need all the support for the progressive movement as we can get.", "Makes sense why it's just getting written about now. Seems the democrats were pretty much controlling the media. They obviously wouldn't want anyone to write something about this email.", "Pack your bags establishment DNC, you had your chance and you got us Trump.", "With my parents methodical FOX news watchers, they will never see the outcome no matter what. And it's actually making me depressed. ", "\"Independents dont matter this is a democratic primary\"", "The elections *were* rigged - Trump was telling the truth the whole time.", "https://twitter.com/wikileaks/status/793217446777880581\n\nhttps://wikileaks.org/podesta-emails/emailid/1120\n\nhttps://wikileaks.org/podesta-emails//fileid/1120/251\n\nhttp://www.salon.com/2016/11/09/the-hillary-clinton-campaign-intentionally-created-donald-trump-with-its-pied-piper-strategy/", "Martin O'Malley?", "I hear Sarah Palin may find a job in the administration. God help us all.", "As a California resident I'm hoping he sticks to the republican ideology of states right to self determination.", "I hate the fuck but nobody worked harder to gain the presidency than he did. The guy was a machine. ", "Howard Dean has the CEO of Pfizer so he'll be **hard** to beat.", "They ganged up and beat the shit out of him while yelling \"HE VOTED FOR TRUMP! DON'T VOTE TRUMP! DON'T VOTE TRUMP! and it was caught on video.\n\nThat's ALL true.\n\nI don't care where you stand politically that was fucking disgusting and disgraceful.", "This election really worked out well for everyone. The Republicans won the Presidency Congress, and Supreme Court, and the Democrats won the popular vote.", "Here's the best part: He absolutely WAS a plant. Or at least they intended for him to be one.\n\nThat whole thing about pied piper candidates to make Republicans take more extreme positions? They definitely pushed that. A half asleep Ben Carson polled at 20%+ for MONTHS.\n\nTrump was pushed as a plant and he wound up eating Hillary Clinton whole like Little Shop of Horrors.", "I have a strong feeling though that the republicans will be eating their words for the next few years. A whole lot of them.", "you got any links to the part about the DNC asking the media to get Trump nominated?", "My heart hurts for Oboma. Like a kid so proud of their project that they put their heart and soul in. Then the big ugly bully comes along and destroys it. Except on a much bigger and scarier scale.", "Nah they will do what they did with Bush and blame Obama.", "It's still early but /r/askthe_donald has people from both sides posing legitimate questions. Sometimes the responses are okay other times they're outlandish and in complete [denial](https://www.reddit.com/r/AskThe_Donald/comments/5ccede/legit_concern_does_it_worry_you_for_2020_that/).\n\nThe funniest questions are Trump voters that are confused. \"Wait he's putting a climate change denier in?\" and \"I thought we were getting rid of insiders?\"", "&gt; Kelly also suggests that Trump had her poisoned so she couldn't host the debate.\n\nI really doubt even he would go that far but in the unlikely event that someone did, it gives a new meaning to his \"blood coming out of her eyes\" remark.", "/r/berniesanders reopened today.  We all just chillin there now", "Because he's a lifelong conservative who has been going after the Clintons for 20 years ", "&gt; If the DNC doesn't bend it will break with the stain of being clearly labeled the enemy of progressives and populists.\n\nRight now there are a bunch of DNC elites thinking they'll just ride out the next 3 years, and then, people will be so desperate to kick out Trump, they could *appoint* anyone they like as their nominee.\n\nI'm desperately hoping we don't let that happen.  And frankly, I'm hoping Trump makes an effort to work with Sanders on their shared goals.  Not only would that make things like killing the TPP and booting corrupt politicians easier, but it would also grant them both more legitimacy as the leaders of their parties.", "If you are a progressive his infrastructure plan should terrify you\n\nhttp://peternavarro.com/sitebuildercontent/sitebuilderfiles/infrastructurereport.pdf\n\nSummary: Sell off infrastructure to private investors (read that how you will) and build out our oil an gas pipeline infrastructure.\n\n", "What about that Chafe guy? He seemed to draw the largest crowds", "They knew before they fired her. They only fired her once it became public news. ", "I feel very guilty about how insulated I feel in Washington...", "It's time to Occupy the DNC.  The only major party on the left is so centrist and corrupt that it can't even win over poor progressives in rust belt states that make under $30k.  A new progressive party can't form until the Baby Boomers die.  But it is a perfectly reasonable goal to so disrupt the democratic party that it is forced to level the playing field, decimate superdelegate influences, and give a reasonable number of peak prime time debates that don't intentionally conflict with major sporting events.  If the DNC doesn't bend, it will break with the stain of being clearly labeled the enemy of progressives and populists. ", "Setting aside the unvarnished xenophobes we've seen a lot of \"if you didn't want us to vote for the racist you shouldn't have made us question whether we're racist or not\" cognitive dissonance.  Many people harbor bias and illogical fears, but would never engage in open bigotry.  Those who admire individual people of color in popular culture, and totally had that one black friend at their old job.  Yet on some deep level because they grew up in segregated communities or in less tolerant times, the dog whistles appeal to them without them even admitting it to themselves.  \n\nThe other angle, is that there is a huge segment of plain old low information voters who've been fed on a steady diet of fear and outrage based media.  Who are inundated by advertising designed to make them feel impotent and jealous of the Joneses.  Who haven't been challenged to think critically in decades.  Who are all too ripe for a conman too come along and make vague promises to them.  ", "Ball is in everyday berniecrats hands. Speak the fuck up so that the world can hear you. There is a straw that will break the camel's back. You just need to keep adding straws.", "Yup. Minorities aren't about to just shut up and take it. We have a voice and if you wanna speak against it, we'll just get louder. You thought Beyonce at the superbowl was \"too much\" just wait and see. ", "College educated Hispanic here from Florida just wanting to say she did absolutely nothing to grab the vote of me or my African American fiance. She poured 80 million into ads for my state but there wasn't a single dime spent on any other election. The DNC lost the state in every possible way.\n\nI voted Stein and I don't regret it. I'd honestly rather watch the entire system burn to fuck than support that party.", "All the progressive things bernie wants to achieve stripped away because of conservative supreme court republican majority, possible repeal of obamacare etc... All because of protest votes, non voters, and people scared that hillary would stand up to russia if they attacked a nato member. Fearmongering and propaganda are tearing this party and the U.S apart and now we have something worse to fear... A trump presidency, but hey lets try to tear apart the democratic party because bernie lost the primary.", "&gt;Even if the factories did come back the jobs wouldn't. \n\nI wish this point had been made more. Trying to revive the manufacturing economy of the 50s is a total lost cause, but because a lot of progressives would also like to pretend it's possible nobody was willing to hit Trump on that issue. This gave a lot of voters the impression that his promises were feasible.\n\nAnd now maybe the best case scenario is that they just elected a Paul Ryan/Pence ticket that's going to gut social programs and de-regulate and in general serve all those rich elites they hate so much. And I don't think we even know what the worst case scenario of a Trump presidency is.", "Wolf Blitzer is a mouth breather. CNN only exists to get ratings. If you want to get informed read books. Not books written by pundits or political hacks, but books by political scientists, economists, etc. ", "They forgot Bill's original motto: \"It's the economy stupid.\" That will always trump identity politics.", "The gop in north carolina was bragging about how successful their voter suppression was. ", "I just hope the DNC fucking *listens* this time. They ignored him when he said business as usual would lose the election... back in 2015.  They ignored him when he said that Americans don't *want* bad trade deals that make the rich richer and the poor poorer.\n\nAnd because of the DNC's hubris we're stuck with a Trump presidency. Bernie did everything he could to support the candidate he was sworn to support by the terms he accepted when he initially ran as a Democrat, and that wasn't enough because she is so self-entitled.", "Neoliberalism has a specific definition that you are misusing. It refers an economic theory similar to that of Laissez-faire economics of the 1800s. Modern implementations would be the bailing out of NYC in the 70s Reganism, and Bush Economic Policies of the 2000s.\n\nIt has nothing to do with the DNC or liberals or progressives.", "Blunder of the fucking century", "They probably went to AZ hoping to get a bigger latino turnout. Thus playing the identity politics card. If I was going to give them advice I'd say: go for the working class vote. The working class covers all demographics. \n\nBut it still boils down to the candidate. You can't really say you'll champion the working class while being so cozy to Wall Street. Should've run Bernie. ", "Foreign powers and the FBI conspiring against you and voter suppression are not elements of a fair election.  The election was without question rigged against Clinton.  I'm honestly amazed she didn't challenge it.  ", "Yeah that was my point.  These jobs he's promised can never return.  They don't exist anymore; those good union jobs that mom and dad had are gone for good.", "I think this is the first time I have read an informed and logical comment in /r/politics in months.", " Yes\n\nhttp://www.latimes.com/nation/politics/trailguide/la-na-election-day-2016-how-did-the-weakened-voting-rights-act-1478670026-htmlstory.html\n\nThe areas that were blue under Obama and went red suddenly were full of black people who could not vote ", "It's not that he was a good candidate - it's just that she was so bad. And bad on so many levels. A hawk in a dove's party. A Wall St. whore that's somehow  supposedly representing the working man. A Big Pharma puppet playing the Affordable Care Card. And the lies about all of it that wouldn't cease. She treated classified intelligence like yesterday's snap chat and got people killed for it. She was so bad she couldn't win a rigged game. Thanks and Fuck You DNC ", "He's not talking about the Hillary endorsement and the presidential candidate is not the head of the DNC. He's talking about Sander's recent endorsement of Keith Ellison to head the DNC.", "God damnit I love you California", "You legitimize this at your own risk. Security services working to publicly criminalize a candidate they don't have a case against while staying silent on the other is not acceptable. One-sided kompromat by a foreign power that the other campaign is secretly communicating with is not acceptable. Bernie Sanders and any other candidate is vulnerable to this. The FBI would be perfectly free to leak ominously that Bernie Sanders is under investigation for profiting off of embezzlement at Burlington College for a year and a half. The media would then speculate about Bernie Sanders and an embezzlement indictment every time Trump was in trouble for \"balance,\" while Russia leaks staffers' emails distortingly presented by RT. Such abuses by US and foreign powers threaten our democracy and cannot be accepted.", "Considering they haven't really been trying to appeal to progressives since Carter it might be nice to try and you know NOT lose pennsylvania michigan wisconsin and minnesota ", "He's incompetent his businesses were run in an incompetent manner, his campaign was run incompetently.  That's a huge target for well-organized, smart, experienced Republican lobbyists.  He's going to get rolled harder than W was.", "The one I heard that I liked was \"cutting your throat to lower your blood pressure\"", "If the European Union had a backbone it would happen. Which is also why you're right and it won't happen.", "And yet they blame Bernie and third party voters.", "&gt;is a terrible candidate just because you preferred someone else.\n\nPlease forgive me while I get my italics game on but...\n\nI'm not saying she was a terrible candidate because I preferred someone else. I'm saying that because she lost to *Donald Fucking Trump*.\n\nShe lost to ***Donald. Fucking. Trump***. How do you *lose* to *Donald Trump*.\n\n&gt;ever consider that people genuinely liked Clinton?\n\nYeah, of course. I know people genuinely liked her. Just speaking anecdotally though, when Bernie lost the primary I had significantly more people on my social media groaning about how they were going to have to hold their nose to vote Clinton than anything else. \n\nBut regardless, she ran a campaign that belittled her base and belittled moderates, and then they, surprisingly, didn't show up to vote for her in the election.", "Conspiracy by the FBI Russian meddling, and voter suppression are not fair and square.  Trump won a rigged system that benefited him.", "Yeah that's the point.  We can't bring those manufacturing jobs back here unless they want to work for a dollar a day with no benefits and no future.  OR, the prices of everything could rise astronomically and making $25/hour doesn't matter when a McDonald's number 7 runs you $40", "I hope youre right", "My prediction: He will be an establishment puppet.", "Warren and Bernie? I mean they're the only progressives with any credibility left. Those are pretty major endorsements, imo.", "If he hates how he looked on SNL he's gonna hate the next 4 years.  Alec Baldwin is gonna win so many Emmy's.", "[Donald Trump said that he would get the electric chair if he had received debate questions in advance](http://www.politico.com/story/2016/10/trump-donna-brazile-wikileaks-230545)", "Bernie was the one trying to give it an identity. He kept speaking about turning it into the people's party. It resonated extremely well in the rust belt that got Donald Trump elected.\n\nThey're idiots.\n\nWhat'd they do only poll Democrats? Thats what it looks like. Yes, 70% of Democrats were fine with Clinton and wanted \"to continue Obama's legacy\" and didn't want change. But Democrats are only 35% of registered voters. The biggest voting block by far is Independents.", "Reddit gets that. That's not their point.\n\nLet me put it to you this way: you live in a place that's halfway to the apocalypse and then I come along and tell you I'm going to get your job back. Now, a lot of the other shit that comes out of my mouth isn't that appealing. But, at least I'm talking to you about something you care about.\n\nMeanwhile, someone else comes along and pretty much ignores you. Just like it feels like they've been doing for decades. \n\nThen, they ask you to vote for one of them.\n\nI mean, sure, the first guy sounds a little crazy. But at least he's fucking talking to you. And, besides, how much worse can it get? You live in a shithole town, where people are pulled up and killing themselves with pharmaceuticals, alcohol, or guns. What do you have to lose by going with the one politician who sounds nothing like the others?", "I really wonder what the stress and pressure of being President will do to him.  He's never had to work this hard learn this much, or handle this much responsibility.  He's truly out of his league.", "Has the west coast ever thought of joining up with Canada? Legal recreational weed on the horizon for both Canada can get some more NBA teams, NFL will have to switch to three down though because that is Canadian law, you get universal healthcare in return and never have to be associated with any of the freak states ever again.\nDeal of the century", "Christie Arpaio, and fucking Rick Scott for chrissakes.  If this pans out he will enter office with more actual corruption than anything Clinton was even accused of.", "Headline 4 months from now:\n\nTrump Was Born In Kenya", "did anybody actually watch the video?  They were literally screaming \"he voted for Trump!\" while beating him up.  ", "Bill Clinton is a smart man. The guy has great political intuition. Hillary not so much. \n", "fuck.", "Trump got less votes than Romney because the voting rights act was gutted.\n\nFunny how you ignore that.\n\n", "Not necessarily. Of voters who identified as having the Economy as their number one issue Clinton got slightly more votes than trump. The motto of this election was, as Bernie pointed out more than a year ago: \"It's the establishment, stupid!\" Of voters who identified a desire for change as their top motivation, Trump absolutely *crushed* Clinton:\n\nhttps://www.washingtonpost.com/news/the-fix/wp/2016/11/10/the-13-most-amazing-things-in-the-2016-exit-poll/", "/r/cascadia\n\nCan we come too?\n\nEdit: messed up the spelling", "And you're 100% allowed to have that opinion. Tim Kaine himself doesn't personally agree with abortion but holds the view that it's not the governments place to legislate women's bodies.", "\"Angry Tweeter Who Spent Eight Years Calling Previous President an Illegal Kenyan Muslim Literally Can't Take the Anonymous Criticism of Citizens Exercising Their Constitution Right on Day Two\"", "The most scary thing he has proposed so far has been weakening the 1st Amendment so he can easily sue people or media he doesn't like. That's the first step to a dictatorship. "], "links": ["5cb7ya", "5cb7ya", "5cah7s", "5cb7ya", "5cb7ya", "5cah7s", "5cas73", "5cah7s", "5cah7s", "5cah7s", "5c96xx", "5cah7s", "5c96xx", "5cah7s", "5cah7s", "5cah7s", "5c96xx", "5cah7s", "5c96xx", "5c96xx", "5cah7s", "5cb5z4", "5c96xx", "5cah7s", "5cah7s", "5c92pw", "5cah7s", "5caugw", "5cah7s", "5cah7s", "5cah7s", "5cavok", "5cah7s", "5caugw", "5caugw", "5c9nkb", "5cauza", "5cb7ya", "5cah7s", "5cah7s", "5c9jq7", "5c92pw", "5cb8qa", "5cas73", "5cb4dt", "5c9jq7", "5cah7s", "5cah7s", "5c96xx", "5cas73", "5c97yq", "5cb3t3", "5caugw", "5cas73", "5cah7s", "5c9jq7", "5cah7s", "5c96xx", "5cb5z4", "5caugw", "5cah7s", "5caugw", "5caugw", "5caugw", "5c95na", "5c9nkb", "5c9nkb", "5c95na", "5c92pw", "5caugw", "5c96xx", "5c9jq7", "5c96xx", "5caugw", "5c8wf8", "5c9jq7", "5c9jq7", "5cah7s", "5cah7s", "5c92pw", "5c96xx", "5c92pw", "5cas73", "5c96xx", "5cb7ya", "5c9jq7", "5c97yq", "5c96xx", "5caywd", "5c92pw", "5cah7s", "5caugw", "5cb8qa", "5c9jq7", "5cas73", "5c92pw", "5caugw", "5c92pw", "5cas73", "5cba24", "5cb7ya", "5cba24", "5cb7ya", "5cba24", "5cbb8c", "5cah7s", "5cba24", "5cba24", "5c96xx", "5cba24", "5cbb8c", "5cba24", "5cah7s", "5cah7s", "5cb7ya", "5cah7s", "5cba24", "5cah7s", "5cbb8c", "5cah7s", "5cba24", "5cah7s", "5cbb8c", "5cb7ya", "5cba24", "5cah7s", "5cba24", "5cbb8c", "5cah7s", "5cbb8c", "5cah7s", "5cah7s", "5cba24", "5cah7s", "5cba24", "5cba24", "5cbh5i", "5cb7ya", "5cah7s", "5c92pw", "5c9d3j", "5cba24", "5cba24", "5cba24", "5cbh5i", "5cah7s", "5cba24", "5cba24", "5cba24", "5cah7s", "5cah7s", "5c95na", "5cba24", "5cah7s", "5cba24", "5cah7s", "5cbb8c", "5cba24", "5cba24", "5cbb8c", "5cb7ya", "5c9jq7", "5cbbum", "5cba24", "5cbh5i", "5cba24", "5cb7ya", "5cba24", "5cb7ya", "5cah7s", "5cb7ya", "5cah7s", "5cba24", "5cba24", "5cah7s", "5cba24", "5cb7ya", "5c95na", "5cah7s", "5caev2", "5cas73", "5cba24", "5c9jq7", "5cbb8c", "5cbgv8", "5cba24", "5cb7ya", "5c9nkb", "5calmo", "5cb7ya", "5cba24", "5cba24", "5cb7ya", "5cah7s", "5cas73", "5cb7ya", "5c9jq7", "5caugw", "5cah7s", "5cb7ya", "5cb7ya", "5cb7ya", "5cb7ya", "5cbnyw", "5cba24", "5cba24", "5cah7s", "5cah7s", "5cbtfa", "5cbb8c", "5cb7ya", "5cah7s", "5cah7s", "5cah7s", "5cba24", "5cba24", "5cba24", "5cbrjv", "5cb7ya", "5cba24", "5cbtfa", "5cbb8c", "5cb7ya", "5cb7ya", "5cas73", "5cah7s", "5cah7s", "5cbtfa", "5cah7s", "5cb7ya", "5cbnyw", "5c96xx", "5cah7s", "5cbtfa", "5cah7s", "5cah7s", "5cb7ya", "5cba24", "5cbb8c", "5cbrjv", "5cah7s", "5cbb8c", "5c96xx", "5cbs4y", "5cbb8c", "5cbrjv", "5cba24", "5cbb8c", "5cb7ya", "5cbb8c", "5cbh5i", "5c96xx", "5cbtfa", "5cbnyw", "5cbrjv", "5cba24", "5cb7ya", "5cbn1a", "5cba24", "5cbrjv", "5cba24", "5cba24", "5cbrjv", "5cb7ya", "5cah7s", "5cbv9z", "5cba24", "5cbvii", "5cb7ya", "5cba24", "5cbrjv", "5cba24", "5cas73", "5cb7ya", "5cbn1a", "5cbrxu", "5cas73", "5cba24", "5cba24", "5cb7ya", "5cba24", "5cba24", "5c92pw", "5cbb8c", "5cbn1a", "5cbrjv", "5cbrjv", "5cba24", "5cba24", "5cbvii", "5cbrjv", "5cbrjv", "5caev2", "5cbs4y", "5cbb8c", "5cbs4y", "5cb7ya", "5cb7ya", "5cah7s", "5cbtfa", "5cah7s", "5cc5j9", "5cah7s", "5cc2x8", "5cbtfa", "5cbrjv", "5cc5nj", "5cb7ya", "5cb7ya", "5cah7s", "5cb7ya", "5cba24", "5cbb8c", "5cba24", "5cc2x8", "5cbtfa", "5cc2x8", "5cbtfa", "5cb7ya", "5cb7ya", "5cbtfa", "5c7n7w", "5cbb8c", "5cc4e7", "5cc2x8", "5cc4e7", "5cc2x8", "5cc4dn", "5cba24", "5cbb8c", "5cc2x8", "5cah7s", "5cb7ya", "5cah7s", "5cc2x8", "5cb7ya", "5cc2x8", "5cc2x8", "5cba24", "5cb7ya", "5cc5nj", "5cb7ya", "5cba24", "5cb7ya", "5cb7ya", "5cah7s", "5cc2x8", "5cbnyw", "5cah7s", "5cah7s", "5cbvii", "5cb7ya", "5cb7ya", "5cbnyw", "5cah7s", "5cb7ya", "5cc4e7", "5cc5j9", "5cba24", "5cc2x8", "5cc2x8", "5cah7s", "5cbtfa", "5cba24", "5cc2x8", "5cbtfa", "5cc2x8", "5cah7s", "5cc2x8", "5cba24", "5cc2x8", "5cc2x8", "5cc79x", "5cc2x8", "5cc5nj", "5cc5nj", "5cb7ya", "5cc2x8", "5cb7ya", "5cba24", "5cba24", "5cc2x8", "5cb7ya", "5cc2x8", "5cc2x8", "5cah7s", "5c96xx", "5cc2x8", "5cbb8c", "5cb7ya", "5cah7s", "5cbtfa", "5cb7ya", "5cbb8c", "5cc2x8", "5cah7s", "5cah7s", "5cb7ya", "5cc4e7", "5cah7s", "5cb7ya", "5cah7s", "5cc5j9", "5cba24", "5cah7s", "5cc5j9", "5cc5nj", "5cba24", "5cba24", "5cah7s", "5cc2x8", "5ccdxh", "5cc4e7", "5cba24", "5cc5nj", "5cbb8c", "5cba24", "5cah7s", "5cc5j9", "5cc4dn", "5cb7ya", "5cba24", "5ccbj8", "5cbb8c", "5cah7s", "5cc5nj", "5cah7s", "5cb7ya", "5cbnyw", "5cb7ya", "5cc2x8", "5cbb8c", "5cbb8c", "5ccbj8", "5cc4dn", "5cb7ya", "5cc79x", "5cc4e7", "5cba24", "5cc5nj", "5ccdxh", "5cbb8c", "5cb7ya", "5cc4dn", "5cba24", "5cc2x8", "5ccbj8", "5cbtfa", "5cah7s", "5cah7s", "5cba24", "5cc5nj", "5cah7s", "5cb7ya", "5ccbj8", "5cc5nj", "5cc4dn", "5cah7s", "5cah7s", "5cb7ya", "5ccaa0", "5cc4dn", "5cah7s", "5cah7s", "5cb7ya", "5cb7ya", "5cc5j9", "5ccbj8", "5cbb8c", "5cba24", "5cba24", "5cc4e7", "5cb7ya", "5cb7ya", "5cah7s", "5calmo", "5cah7s", "5cbnyw", "5cba24", "5cbb8c", "5cah7s", "5cba24", "5cb7ya", "5cbtfa", "5cc4e7", "5cba24", "5cc5nj", "5cb7ya", "5cbtfa", "5cbb8c", "5cb7ya", "5cc2x8", "5cc2x8", "5cc4dn", "5cc2x8", "5ccmct", "5cah7s", "5cah7s", "5cc5j9", "5cbtfa", "5ccmct", "5ccbj8", "5cc5nj", "5cc4dn", "5cbtfa", "5cba24", "5cba24", "5c7n7w", "5ccmct", "5cc2x8", "5cc5j9", "5cah7s", "5cb7ya", "5cba24", "5ccmct", "5cah7s", "5ccmct", "5cbrjv", "5cba24", "5ccow8", "5cah7s", "5cb7ya", "5cbrjv", "5cc5j9", "5cba24", "5ccmct", "5cci64", "5ccbj8", "5cba24", "5cc5j9", "5cah7s", "5cb7ya", "5cc5j9", "5cbrjv", "5cc5nj", "5cba24", "5cc5nj", "5cah7s", "5cbb8c", "5cb7ya", "5cah7s", "5cc5j9", "5cah7s", "5cbb8c", "5cb7ya", "5cc2x8", "5cba24", "5cb7ya", "5cbb8c", "5cb7ya", "5cba24", "5cc5nj", "5ccdxh", "5cbtfa", "5cah7s", "5cba24", "5cc5nj", "5cbb8c", "5cc4e7", "5cc5nj", "5cba24", "5cb7ya", "5cc5j9", "5cc5nj", "5cb7ya", "5cbb8c", "5cb7ya", "5cbnyw", "5cah7s", "5cb7ya", "5cc2x8", "5cbb8c", "5cba24", "5cbb8c", "5ccmct", "5cc2x8", "5ccow8", "5cba24", "5cah7s", "5cc2x8", "5cc5j9", "5cbb8c", "5cc5nj", "5cci64", "5cba24", "5cbb8c", "5cc5nj", "5cba24", "5cc5j9", "5cbtfa", "5cc2x8", "5cc2x8"]}