{"comments": ["**Seriously!!** Oh my goodness Wolf Blitzer seriously just sat there and tried to get an emotional reaction from Bernie about his loss but totally got shut down while Bernie went ahead and brought it back home with his plans on policy and making the government *actually better*\n \nEdit: I feel this exchange perfectly sums how CNN and so much of the news media is focused mostly on entertainment rather than informing people evenhandedly. For goodness sake [CNN hired Buzzfeed writers for crying out loud!](https://www.google.com/url?sa=t&amp;source=web&amp;rct=j&amp;url=/amp/s/www.washingtonpost.com/amphtml/blogs/erik-wemple/wp/2016/10/03/cnn-hires-buzzfeed-scoopsters-for-its-digital-politics-coverage/&amp;ved=0ahUKEwjYzc2ty6DQAhXMy1QKHUOWAMYQFghEMAM&amp;usg=AFQjCNExADSDLKRgu8y4dcfFzTs8yFMSnQ&amp;sig2=IfgwBdi5YV2elMq6VWG3jQ)", "Fuck sending CNN clicks. Here's the article. \n\n&gt; Bernie Sanders said Thursday that he was surprised as anybody by Hillary Clinton's loss saying he felt she had a two-to-one chance of winning before Election Day.\n\n&gt; But Clinton's chief rival for the Democratic nomination was in no mood to question Clinton's campaign or whether he himself could have fared better in a general election. Asked by CNN's Wolf Blitzer whether he would've brought Democrats to the White House, Sanders smiled before bellowing.\n\"What good does it do now?\" Sanders said. \"I don't think it makes a whole lot of sense to do Monday-morning-quarterbacking right now. The election is over. Donald Trump won.\"\nSanders said he felt Clinton was likely to win, but acknowledged that Trump had made a connection with working-class voters that kept him competitive.\nHe said he had not yet phoned Clinton to discuss the race, and acknowledged, \"I owe her a call.\"\nHe promised to work with Trump on several issues that unite them -- a more protectionist trade policy, fixing America's tax code and enacting campaign-finance reform. Sanders said Americans upset with Trump's election have a right to be angry, but called for that anger to be channeled in a positive way.\n\"I hope that on those areas where Trump talked about the needs -- where he was right, the middle class is hurting -- let's work together to improve lives for millions of people who are living in despair and who have the right to do better than they are today,\" Sanders said. \"Trump talked about his concerns about outsourcing, about a bad trade policy. If he is serious about reforming our trade policies and creating jobs, let us work with him.\"\nThe Democratic presidential nominee also declined to rule out even discussing a 2020 bid, saying voters are tired from the last campaign and are no longer interested in diving back into the electoral process.\n\"The last thing in this world in this never-ending campaign we have not even sworn in this president is to talk about 2020,\" Sanders said. \"Let's not go there at all.\"\n", "Don't forget Tulsi.", "The DNC primaries started off very civil but the Hillary campaign went into panic mode when Bernie started to get popular and it began looking like 2008. So they went in guns blazing to destroy him and alienated his supporters. They never recovered. Bernie voters are still bitter. ", "&gt; it ultimately came down to white working class voters rejecting her **because she was a woman**.\n\nHoly shit these people are clueless. It just shows the Clinton camp's disdain for the voting public. To them voters are just numbers, useful only in getting Hillary elected. And if she loses, then blame the voters, never take any responsibility for your own faults, which they refuse to even acknowledge.\n\nR.I.P. Clinton era, you won't be missed.", "Progress is hard. Regression is easy and fast. ", "[July 26 2015 - ABC's 'This Week' panel ridiculing Ellison for suggesting Trump could win nomination and potentially the White House.](https://www.youtube.com/watch?v=FHkPadFK34o)", "For what it's worth:\n\nhttps://twitter.com/megynkelly/status/796939729493168128\n\n&gt; For the record my book \"Settle for More\" does not suggest Trump had any debate Qs in advance, nor do I believe that he did.\n\nI think the disconnect is that someone told Trump that her first question \"was a very pointed question directed at him.\" She doesn't claim that he knew the content of the question itself.\n\nAlso,\n\nhttps://twitter.com/megynkelly/status/796940621160349696\n\n&gt; Also for the record, I believe the reason I got sick the day of the first debate was I contracted a stomach virus, just as Rand Paul did.\n&gt; ", "This is literally one of the best commentaries on the state of the DNC. So spot on it's terrifying.", "There will be blood in the fucking streets before we let him get away with this.\n\nThere's already rumors he's tapping Gowdy for Attorney General.  That slimy puritan fuck will use his position as his own personal witch hunt.  If his performance in the Benghazi circus was any indication there will be kangaroo courts and political persecution all around.   Just like in good old mother Russia.\n\nAn absolute disgrace of our justice system. Remember first they came for Hillary, then they came for the muslims, then they came for whoever the hell he can't smear politically enough to silence their voices.  Tyranny doesn't come overnight, it comes slowly, in degrees.", "She had a conservative streak on many topics including Gay Marriage Abortion, criticism of Obama on the Middle East and Gun Control.\n\nShe has made progressive shift on most topics, there are a couple articles with some constructive criticism you can find through google.  Some of the Hillary camp dislike her for breaking it off with the DNC in support of Bernie, but that almost makes her position look even better these days.", "I understand some people's complaints on Tusli but I honestly wouldn't mind her moderate stance on gun control.", "Taking away shit like abortion freedoms isn't progress it's culturally forcing religion into our laws. It's a policy of regression by design. It takes away freedom.", "Much President. Very healing.", "I will be out there.\n\nJust like people think Hillary didn't understand the anger of blue collar Americans Trump and his supporters have no idea how outraged a lot of Americans are right now. If he does anything wild, it is going to get really ugly. And I can tell you, I am not a particularly violent or vengeful person. I peacefully protested the Iraq war, walking in a peaceful display in DC many years back. That is really the only thing I have ever done. But mark my words, I can feel the anger and hatred towards Trump and the GOP growing, and you'd better believe that it is a powder keg that just needs a spark.", "This needs to be higher. People need to understand that anything Obama rams through without going through Congress can be undone on day 1 of President Trump.", "&gt; Yeah most women, blacks and latinos are default not going to vote for a Republican, let alone Trump.\n\nThe craziest stat of this election was that Trump won the white female vote 53% - 43%", "You don't get to pin this on the young vote. \n\nShe won the vote of those under 45.\n\nShe lost the 45+ vote.", "&gt; in the part of democrats and liberals.\n\nSooo California?", "If he does it the next democrat president that comes in will prosecute him and his people, and it will result in an endless cycle.", "Gave up the Supreme Court and elected a climate change denier who promised to tear up the Paris Agreement at a time when climate scientists are telling us we need to get our shit together right now or it's game over. Anybody who allowed him to get into office gets no right to claim they're progressive.", "One man's progress is another man's regression.", "Man that Glass ceiling venue is one of the greatest most tragic, political ironies in American history", "Dear HRC Shills: most of us actually pulled the trigger while biting our tongues for your queen. And she still lost. Because she was terrible. ", "Some people think it's murder. You might disagree with it but I'm sure you can see their desire to make it illegal if they honestly think it constitutes as murder.", "That was 8-10 years ago.\n\nNow he is a lobbyist for the pharmaceutical industry and one of the many establishment politicians who didn't recognise the issues with a Hillary Clinton candidacy.\n\nHe also famously said \"I don't represent the people\" to the people who elected him.\n", "Our job is to make him regret ever running. We need to reject the legitimacy of his presidency the same way he did to Obama. We need to show him the same disrespect he showed to Obama (and everyone else who isn't a rich white male). Our job is to make sure his legacy as a \"human being\" is being a slimebag and human scum. Trump is the worst sort of human being and we will make sure that no one will ever forget it.", "The funny thing is that Bernie is actually relatively popular in feminist subs which are heavily leftist. The mainstream press pop feminists were the ones doing that shit, and the people who decided to parrot them.\n\nThat doesn't mean there weren't some misogynist \"Bernie bros\" out there, but that's kinda like saying BLM hates white people. Completely missing the point.", "Yeah and fuck them city folk. If they wanted their votes to count as much as country folks' votes count they wouldn't have move to where all the jobs are!", "Feel The Chafee!", "Not for us rich successful liberal states!\n\nBut yes I agree. We shouldn't leave Middle America to rot in its own filth", "Bill Clinton: \"Hey guys there's a lot of voters over here that we haven't even acknowledged yet. Maybe we should do something about that?\"\n\nHuma Abedin: \"Shut up Bill nobody asked you to be here just go back to dicking those bimbos of yours.\"", "FWIW Bernie has support from California and the high tech sector. I know there are buzzwords like \"coastal elites\" that get floated around, but some of us are progressives who donate to Bernie. I just gave him money today because I've been getting so many emails asking for help. I live in a county that is probably one of the most progressive places in the nation. I want to see Bernie become the leader we need right now.", "oh turns out the fight first started because of a traffic related incident THEN they started to beat the shit out of him for voting trump. it's totally okay now guys!! /s", "You also realize that CA Texas, and NY basically received ZERO campaigning other than fundraising visits because of the electoral college, right?  So the largest percent of the populous was effectively ignored due to the current system.  I'm not saying a switch to the popular vote is the end all, be all, but let's not pretend that the current system doesn't skew shit the other way too.   ", "Herding with like minded people is comfortable because you are around those who share your values. I'm in South Dakota on business this week and it is very very lonely to be grieving this election while surrounded by Trump fans. That said, it's not healthy that we are this cloistered as a society. ", "Stop being nice democrats. We don't have time to pretend that Trump will be reasonable or tolerable.", "Howard Dean is the heroine the donkey wants because he's withdrawing. Sanders and Warren actually want the donkey to get better. Don't be a jackass corporate Democrats. \n\n", "&gt; College educated Hispanic here from Florida just wanting to say she did absolutely nothing to grab the vote of me or my African American fiance. \n\nEverybody needs to learn that Clintonism is relying on minority demographics while also taking them for granted. It is the height of elitism. It's thinking your cleaning lady is your friend because you're nice to her and ask about her kids once in a while.\n\n&gt;She poured 80 million into ads for my state but there wasn't a single dime spent on any other election.\n\nRemember when everyone said Clinton and George Clooney were  raising shitloads of money for down-ballot candidates and Bernie was a selfish prick who was doing shit-all for anyone else? And then Bernie said she was actually just laundering money into her own campaign and then was viciously attacked for it?! hahahaha :(\n\n&gt;I'd honestly rather watch the entire system burn to fuck than support that party.\n\nNO! We'll never have another opportunity like this for a hostile takeover. Clinton losing is worse for the country but we can't let the damage that is going to come from that  go to waste. We need rally and organize a hostile takeover of the party while it's at its weakest.", "You know I always felt this way about his campaign from the begging.  I think it was a joke/pub stunt that got out of hand.  He went too deep too far to the point of no return and couldn't back out to save face.\nI bet he was anticipating the relief from the pressure with a loss Tuesday night, but was shocked when he found out he won.\n\nLet's see, who else did this... *cough* Brexit", "I share your sentiments.  I've never protested anything before.  Infact I would decribe myself as wholely apathetic to the entire political process up until this election.   His vile campaign has galvanized an outrage and patriotism in me that I never knew existed.  The Republican party has now made an enemy for life.\n\nHe has awoken a sleeping giant in the American populace who are only barely swallowing his legitimacy as of now.   Just let him try this shit he has no clue how ugly this will get.", "I really hope Lieberman lives a miserable fucking existence for that.", "\"Whoever fights monsters should see to it that in the process he does not become a monster. And if you gaze long enough into an abyss the abyss will gaze back into you.\"\n~Friedrich Nietzsche\n\nYeah yeah, cliche, I know. But apt.\n", "I see people on my facebook just now realizing how bad trump is going to be for them and removing people who support trump. Yet even last week they were posting about how both sides are the same. I don't know what their train of thought was. ", "&gt; The point is they don't want to rebuild the party, because they literally don't know how. \n\nIt's all about the money, Lebowski.  A new party - one that actually works for the 90% - means no jobs for them.   That's what the Clinton machine was for a generation, that's why the Clinton Global Foundation was so important to their political machine, they have to have the resources to pay off the political and journalistic and PR elite to say in her orbit.  They wanted that sweet, sweet Clinton cash, all financed by Qatar and Big Pharma and big banks, the same people that also benefit from having Clinton around.", "Pied Piper for those who have not read it yet\n\nhttps://wikileaks.org/podesta-emails/emailid/1120 (see attached PDF).\n\n&gt;Operationalizing the Strategy\nPied Piper Candidates\nThere are two ways to approach the strategies mentioned above. The first is to use the field as a whole to inflict damage \non itself similar to what happened to Mitt Romney in 2012. The variety of candidates is a positive here, and many of the \nlesser known can serve as a cudgel to move the more established candidates further to the right. In this scenario, we \ndon’t want to marginalize the more extreme candidates, but make them more “Pied Piper” candidates who actually \nrepresent the mainstream of the Republican Party. Pied Piper candidates include, but aren’t limited to: \n\n&gt;• Ted Cruz\n\n&gt;• Donald Trump\n\n&gt;• Ben Carson\n\nThe DNC did this to themselves. They pushed for Trump. Now they have Trump. Every single Democrat that hates Trump needs to ask the DNC heads why they invited destruction to their door steps with a massive amount of hubris in thinking they could control the fire they lit.", "I doubt it is all bernie or busters. they would at least have voted third party. looks like most were the 10 million dems who sat on their asses.", "Do these \"professional protester\" jobs require a degree or is there a certification process or what?", "We need to start a \"Kids of Fox News Watchers\" support group. ", "Ellison should play a role going forward absolutely.  He's a fresh face for the party.      \n\nI'm already getting sick of this anti-Dean stance a lot of people are shucking.  He was a progressive governor in Vermont and campaigned to the left of Kerry, and delivered the Dems some of their greatest electoral gains in decades in 2006 and 2008.  I understand he's an \"insider\" but let's not ignore talent. ", "&gt; Remember first they came for Hillary, then they came for the muslims, then they came for whoever the hell he can't smear politically enough to silence their voices.\n\n\nHuh?\n\nIf the current investigation into the Clinton Foundation turns up criminal activity which Hillary Clinton was involved in, she should be prosecuted in accordance with the law.\n\nIf you disagree with my previous statement in any way, you are advocating for our elected officials to be above the law.\n\nRead my statement. ", "&gt;  I mean the frontpage of /r/poltics had Clinton leading in nearly every single poll for months.\n\nThat's not fair. The frontpage of /r/politics had Clinton leading in nearly every single poll for month because the vast majority of all polls had her leading for months. \n\nThe average of these polls had her leading by around 3-4% in the popular vote near the end. There was a large but still \"normal\" polling error of 3% (same as in Obama v. Romney, it was for Obama that time though), which, if applied to the average leaves Clinton winning the popular vote by ~1%\n\nWhich, coincidentally, is exactly what she won the popular vote by, the votes just weren't distributed in a way that was advantageous in the EC. \n", "Democrats got destroyed. Nothing left to tear apart really. Time to rebuild.", "I remember multiple times when trump refused to debate him because he was scared. Everyone knew he would win the general election in a landslide ", "Also childish is his need to label everyone who protests him a paid shill. Like there's absolutely no reason that regular people would hit the streets to protest him. ", "Whatever it is I'm sure she will quit as soon as there is any hard work for her to do.", "Funny/unfunny how their shit plan went to shit on them and now they turn their heads to side and ignorantly follow same leadership.", "&gt;when he'll be less busy.\n\n...I don't think they understand how this works.", "&gt; The rest of the world can see climate change as a huge deal-- a deal that will kill us all if we don't do anything about it. \n\nIt is pretty insane how people still deny climate change. I'm 30 and I've seen it... Like with my own damn eyes.\n\nI think you've got a swing and a miss, though with your prediction of an extinction event. Don't get me wrong, it'll be devistating and millions/billions may die due to the insuing refugee crisis as the habitable areas of the earth rapidly shift, but the claims that we're going to become Venus soon are very overblown.\n\nI know you're gonna downvote me for tone policing you, but the other side just elected trump so we should learn how to talk to them about this...\n\nOur success as a nation is due in no small part to our natural resources and fertile land. We've plundered one and the other will be durastically reduced, so if we want to remain a 1st world country and not damn our grandchildren to a horrible fate, we've got to get a handle on this shit. \n\nYou need to put it into non-hyperbolic terms or conservatives just shut down. Seriously. ", "We fire missiles that cost more than teachers make in a lifetime to make that regression that much easier. Oh and we make the teachers pay for it.", "&gt;Yeah most women, blacks and latinos are default not going to vote for a Republican, let alone Trump\n\nClinton only got 43% of the white female vote.\n\nAnd Trump got more black and latino vote than Romney got.", "What are the complaints?", "And they smeared Bernie's poor performance among minorities as why he wasn't electable. Even if you suppose that is true Bernie had the potential to make up for it among the working white. Trump only managed to flip a few of those states by a percentage or two. You split the white working vote in half and you're talking about a completely different ball game.\n\nHubris.", "They sure showed us.  The Liberal Elite and their way of thinking lost this election.", "You know why Jamie Dimon was CEO of JP Morgan pre-crash and is still CEO of JP Morgan now? Because JP Morgan was one of the few banks that didn't get caught up in the all the bullshit the other big banks did and was still in a strong financial position despite the crash.  \n  \nThe one thing you could criticize him for is the London Whale shit in 2012. But I doubt you even know what that is.", "I don't get this California secede stuff if they left the Republican Party would always win the presidency that would be absolutely awful", "Dear Hillary Clinton sycophants and shills\n\nWe warned you, but you cheated to subvert the will of the people. Maybe next time you want a woman president find an actual good woman candidate; don't rig the primary to install a criminal with 60% unfavorability ratings. ", "Ironically one of the many factors contributing to HRCs loss was that Hispanics and blacks didn't vote for her in the same proportions as for Obama. The plan quite literally backfired in every conceivable direction.", "I'm looking at Huffington Post's headlines for the past three days and then holding up a chart of the stages of grief.\n\nYou're almost near the bottom HuffPo. It's okay, just a little bit longer now and you can rest.", "Sensationalism my friend. It rarely makes sense. ", "This notion that the guy who couldn't win a majority of liberals was somehow going to be a savior is foolish.\n\nYou decided to not show up.\nStop blaming us ", "Women are told not to accept drinks from *anybody* for a very real and dangerous reason. ", "For what it's worth:\n\nhttps://twitter.com/megynkelly/status/796939729493168128\n\n&gt; For the record my book \"Settle for More\" does not suggest Trump had any debate Qs in advance, nor do I believe that he did.\n\nI think the disconnect is that someone told Trump that her first question \"was a very pointed question directed at him.\" She doesn't claim that he knew the content of the question itself.\n\nAlso,\n\nhttps://twitter.com/megynkelly/status/796940621160349696\n\n&gt; Also for the record, I believe the reason I got sick the day of the first debate was I contracted a stomach virus, just as Rand Paul did.\n&gt; ", "Rural America IS in ruins. Denying that is as dumb as denying that Trump himself is racist. As to whose fault it is you can't honestly expect most people to understand even basic economics. For fucks sake, humanity is mostly idiots that think their phones are magic.", "The fucking pricks. I remember reading those emails and being just amazed at how arrogantly stupid they were. The DNC is trash. Bernie should lead a new organization to wrest control from these idiots and support a New Democratic Party, a strong party. One that compromises only when it is intelligent to do so. One that will champion the working class above all else. Our Revolution is a good try, but i believe it is too weak. There needs to be an event stronger break from these corporate stooges. ", "This is gonna be a fun 4 years. Trump is gonna fuck this country like a normal republican would. Everybody will be conned. ", "My completely idiotic conspiracy theory is that Trump was complaining about rigged debates and rigged voting machines to avoid scrutiny into his own malfeasance much in the same way that a quick-to-blame child is often responsible for the dreaded \"smelled it, dealt it\" scenario.", "Unchecked climate change will have Florida and New Orleans underwater before the end of the century. Those sanctions would be for the betterment of the American future and I fully support them. Time for the combined 1st world to say no to American fuckery.", "FBI concludes its investigation...so what's she getting prosecuted for? ", "We are trying to fix a party that lost at every level.", "\"Feel the Chafe\" surely", "Black too.\n\nTrump did far better with POC than either of the last two republicans", "Estimates were that he saw 500k more faces than Clinton between August and October.", "To be fair voting third party could be a protest of the two-party dominance more than of a particular candidate. \n\nThat said, fuck pretty much everything that's happened in politics over the past fifteen or so months", "No ones trying to tear apart the Democratic Party we're trying to save it. Bernie losing the nomination isn't the problem, and the voters didn't lose Clinton the election. Clinton and the DNC did that. It's on her to excite voters, it's on her to give people a reason to go to the polls to not only vote for her, but vote for Democrats down ballot, and she couldn't do it. Weather you think the damage is legitimate or not, she's is the most damaged candidate in modern politics, and she ran a shitty campaign, and does nothing to speak to anyone that isn't already a blindly loyal Dem. Jesus Christ the FBI investigation alone should have disqualified her. The party establishment practically broke the scale tipping it in her favor, and it cost them big time. \n\nIn 2008 Obama ran as a progressive, and demolished McCain. In 2012 we knew he was less progressive then we liked, but still more then a good number of democrats, and he was well liked, and he destroyed Romney. In the primary this time around an unknown 80 year old socialist ran an insurgent campaign against a massive political machine, as a progressive and populist, and nearly beat her taking 47% of the vote. The Dems keep diving deeper into their corporatist establishment playbook, and they keep getting their asses kicked. They run Tim Kaine or someone similar in 2020 and it'll just be a repeat of this year, and nobody wants that. \n\nI'm saying all this as someone who held my nose and voted for her, because I believed Trump was worse. But this lose is nobodies fault but hers and the DNC. ", "Jim Webb has been waiting his turn for a lot of ten minuteses.", "Yeah it's crazy to think someone would spike a womans drink. Never happened before in history. ", "I suspect he knows deep down that he would have won but instead he's focused on what to do going forward. Like a leader. Classy guy.", "I mean that is the entire reason the Senate and our bicameral legislature exists. The Senate gives power to the states regardless of population while the population gets power in the house of representatives. It's so that the interests of small states don't get drowned out by states like California or Texas. ", "GOP has been the party in power. They've controlled both Houses of Congress for the past 7 years.  ", "Uh technically that is the definition of Federalism: distributing the responsibilities of governing to multiple levels. It would be good to see Democrats get back to treating this country like a Federation of states, and actually working on local and state initiatives again.", "Talk is cheap Liz.\n\nExpressly endorse Ellison or stop pretending to be a Progressive.\n\nTired of your semi-endorsements.\n", "I cannot think of another person in Government with more land mines to walk around on a daily basis.  While the pragmatist in me would tend to agree I cannot imagine what she has to go through.    ", "The word for 2016 should be \"hubris.\"", "I get that they feel left behind.  But what I don't understand is what practical solution has Trump offered to fix their problem?  Besides just \"bringing jobs back\"?  How will he accomplish that?", "The areas that will be the most effected by rising sea levels seem to be voting for candidates that discuss the dangers that come from climate change. Interesting.", "Bernie is honestly the only thing that has kept me from giving in completely to despair. His resolve in the face crushing setbacks is truly inspiring. ", "I'd rather a politician says the same reasonable thing every day than a new insane outburst every week.", "His resolve and that even though he lost the primary, and couldn't deliver a victory that Clinton didn't earn herself, and even though many of his soft supporters abandoned him, there's still a powerful and mobilized movement behind Sanders. \n\nNow is the time to reunite that movement and move forward. Resolve to make this a more perfect union.", "And Massachusetts Maryland, Jersey, CT, and New York. Aka around 50% of the country's economic output.", "I don't think I could ever abandon Bernie.", "And that's because you know Bernie won't ever abandon you. Imagine how important that feeling would have been to white independent voters in the rust belt two days ago.", "I'm perfectly fine with supporting a pro 2A democrat.", "If Trump jails Clinton we are in for a scary ride. I for one will feel unsafe. That is the action of a dictator. I didn't like Clinton either TO ME what she did was sketchy but the FBI tripped up and twice said \"no charges\". If Trump tries to get her I will be appalled.", "I hate comparing everything to Game of Thrones these days but it would be like Joffrey deciding to behead Ned after being counseled not to &amp; starting a massive war.", "I remember when Hillary sent out her surrogate David Brock, to smear Bernie as a racist. That's not politics anymore, that's a knife-fight.", "Ugh I hate his focus and determination. It's so *boring. *", "The progressive party's mascot should be a finch.\n\nThe bird that landed on bernie's podium.", "That would be my dream candidate. Why do the two sides need to oppose each other on absolutely everything?", "Then he tweets out \"Turns out there is a yuge facility with ALIENS in Nevada. Told you so!\"\n\nIn all seriousness how will this guy contain himself?", "Let the DNC know how you feel!\n\nWho's with me in calling and contacting people every day until they clean house and replace all of their officers? I am trying to spread this idea. We NEED to get them to clean house.\n\nPhone: 202-863-8000\n\nContributions Phone: 877-336-7200 (probably more likely to answer)\n\nContact Site: http://my.democrats.org/page/s/contact-the-democrats\n\nLet Donna Brazile know how you feel!\n\nhttp://www.brazileassociates.com/?page_id=26", "There are good people in Texas I swear!\n\nOk, maybe Austin doesn't count, but we don't want to be left behind with the rest of Dumbfuckistan.", "Insulting the Bernie voters and telling them to grow up easily should have brought them in with open arms. I don't know what went wrong. /s", "She doesn't deserve this.  The investigations were always politically motivated to the core.  There's a well financed cottage industry dedicated to hunting the Clintons starting with the Arkansas project and morphing into Judicial watch and they want their denouement.  They want all the scalps hanging from the lodge house poles and they won't be happy until they get it.  Because they have to have some justification for all this.  The most they ever got out of 25 years of incessant investigations of the Clintons was a semen stained blue dress.  To any non-partisan with a brain they all look like assclowns.", "Is it okay now to talk about how shitty a campaign slogan \"I'm with her\" is? Like I'm a Millennial, and hell, ever since Bill's presidency the Clintons have reeked of /r/fellowkids material. I mean, we loved them for it, in the way that we loved the bumbling parental figures in 90s sitcoms—because they tried to relate and ultimately failed.\n\nEvery time one of my friends posted \\#imwithher I just...cringed a little.", "She got so much shit for talking about \"the vast right wing conspiracy\".  Newflash folks it's not just a conspiracy it's a fucking coalition thicker than NATO and they will not rest until they manufacture SOMETHING for her to go down on.  Her electoral loss will not slow that process, in fact now they are like a bunch of sharks in the water who smell blood.  \n\nI'm not saying it's the entire GOP either.  There are many honorable republicans who have stood up for her and vouched for her character and I'm sure they are rightfully outraged as well at this undue persecution.  However their power is limited in scope now.  All the sane ones are in the same boat as the democrats.  Outnumbered and disempowered.  The lunatics are running the asylum now and they want blood.", "Don't laugh. Be afraid. He just said the mass protests against him weren't legitimate and linked them to a \"corrupt media\" setting himself up to muzzle the press. He wants to make the nation 'great'. He wants to jail his political opponent. He says everyone against him is corrupt and rigged. **Fascism has come to America.**\n\nThis is not hyperbole. Historians are quaking in their fucking boots right now and the public just doesn't get what's happening. For fuck's sake, for the rest of the world, WAKE UP!", "But it just factually isn't murder.\n\n\nThat's like defending anti-gay people by pointing out that they think a magical deity is going to be pissed off if gay people are allowed to wed. Sure I can see there clear reasoning for believing gay marriage is a bad thing given what they believe, but they're stupid for believing it and don't deserve to have a say.", "I agree. I don't support all of his political views but I believe Bernie is truly a decent guy. Bernie's obvious love and respect for his country and the way he displays it is absolutely commendable. Seeing a man like him who acts with the utmost respect while looking to the greater future. Lose out to a man who riles the masses into chaos and plays their emotions is devastating.", "Are people legitimately scared for their lives in a 'Trump' presidency? ", "He was saying that objectively a repeal of left-leaning policy and enactment of theocratic policy would be seen as progress by someone who values such things and who thinks the country would do better to move that way.", "How do I stop these existential dread feels guys?", "Nobody is saying that Clinton should be exempt from prosecution if witch hunt #4831 finally turns up evidence of sorcery.\n\nWhat people are saying is that Trump's vow to jail her for daring to oppose him is wrong and such an overtly fascist position that they will react very badly if he follows through on his bluster. Presidents in civilized countries do not unilaterally act as judge and jury and decide who to jail.", "my life? no.\n\nmy economic and job stability? for sure.", "I live in Michigan and you are right.  However, Michigan was a Bernie state and after the collusion was exposed many people voted straight ticket republican. Why? Because the dnc did not represent the people here and  the corruption doesn't fly here.", "But didn't you hear Sanders ~~lied~~ about being invited to go to the vatican and he has ~~zero~~ chance of meeting the Pope. Also he flew out there on a ~~$300K rented aircraft~~! ~~While eating caviar~~!     \n\nTo be honest what makes me mad about the primaries isn't that the Clinton campaign was trying to throw shit at Sanders, that's just normal politics unfortunately. What makes me mad is how unapologetically biased the mainstream media was in general. At least CNN, Washington Post, and NY Daily News may have well have been part of the Clinton campaign for what they wrote and said (much of it utter bullshit).      \n\nSanders is far from perfect, but it was definitely a stacked deck kind of primary. I'd love to know how the Clinton campaign managed to get quite that many media organisations on their team, hopefully someone writes an insider book about it.    ", "Because god forbid Hillary takes responsibility for her own loss. ", "Austin may not matter electorally but it certainly matters economically.", "And to anyone saying Bernie would've won; this coordinated horseshit would have worked against him too. \"Burlington College\" would've been that hypothetical election's \"emails.\" ", "And got 29% of Latino vote !!", "No one is technically \"pro-abortion\". No one is a fan of abortions. The idea is just to leave the option opened for those who need it.", "I always assumed that the comments from people who did \"abandon\" him and called him a sellout were never real supporters just bandwagon jumpers and anarchists. \n\nHope you're part of the political revolution subreddit too. ", "The thing is progressives believe that things like access to healthcare are a **fundamental right** that should not be subject to the whims of a state experiment.  There are certain fundamental rights that should simply be off the table when discussing federalism and state's rights.  That includes all protections afforded under the 14th Amendment and (IMO) healthcare.", "&gt; The initial presentation - to be delivered as early as Thursday - is likely to be **a read-through of the President's Daily Brief the same, highly classified summary of security developments delivered every day to President Barack Obama.**\n\n\n&gt; **\"It's fear of the unknown,\"** said a senior U.S. national security official. **\"We don't know what he's really like under all the talk. . . . How will that play out over the next four years or even the next few months?** I don't know if there is going to be a tidal wave of departures of people who were going to stay around to help Hillary's team but are now going to be, 'I'm out of here.' \"\n\n&gt; **\"I cannot remember another president-elect who has been so dismissive of intelligence received during a campaign or so suspicious of the quality and honesty of the intelligence he was about to receive,\"** Hayden said in a telephone interview Wednesday. The initial meetings with Trump in the coming weeks are likely to be professionally conducted, he said, but characterized by \"a little caution, a little concern.", "It's honestly part of why Trump won. He had a really simple repeatable message. He said it over and over and over. People made fun of his repetitive approach, but it meant it got stuck in everyone's head. Meanwhile, Clinton changed her primary argument and slogan several times.", "Their usefulness was clearly shown Wednesday morning when she didnt even come out to give a speech.\n\nTalk about a slap in the face.", "rest in peace legal weed. cause of death: chris christie mike pence and the DEA busting down legal dispensaries and charging everyone inside with a felony. \n\nsimilarly, RIP gay marriage and roe vs. wade. we're going to be taking some monumental steps backward. I hope that's what the american people really wanted. ", "I admire your ability to project fairly sophisticated thoughts into Your vision of Trump. I tend to believe what he actually said though.", "Late term is self-defense or euthanasia. Anything before that is a question of where to draw the line as a zygote simply isn't a human. Some points are up for argument but there really is no fundamental shift from the status quo that makes scientific sense.", "Trump did not win the popular vote. Never forget that a minority chose a reality TV star to run our country. ", "Well the man is quite old we have to let him be of use now or we've squandered him.", "I voted Bernie. Not even mad.", "Your first job as President is to unite the country\n\nInstead he's further inciting the divide and continuing the \"us vs them\" mentality.\n\nYou're all Americans dipshits", "You only have the one soul to sell. There's no getting your integrity back once you work as a Pfizer lobbyist. He'd be a helpful person but he needs to be kept at arms length", "Nice to know someone gets it.  This kind of incessant hunting of targeted politicians has a chilling effect on democracy that most people don't appreciate.  It's part of the reason why the best and brightest are staying out of politics and saying fuck it I don't need this shit.  So we end up with a constant crop of idealogues and sociopaths.", "Exhibit A of why this man will be the shittiest president of all time:\n\nYou already have the presidency won. The American people have a constitutional right to protest. The fact that you can't let this go and turn off your diarrhea of the mouth proves that this is going to be a terrible 4 years.\n", "&gt; Trump's vow to jail her for daring to oppose him is wrong\n\nThat never fucking happened though.\n\nThis is the shit that pissed me (a Bernie voter) right the fuck off about you guys and ended up with me voting for Trump (in Oregon don't worry) as a protest.\n\n\nHe never said \"I'M GONNA JAIL MY POLITICAL OPPONENTS FUCK YEAH DICTATORSHIPS WEW\"\n\n[Here's what actually happened](https://www.youtube.com/watch?v=Hbh2qXBMjuY) (as a Bernie supporter I like, you know, facts and shit.)\n\n\nHillary said, \n\n&gt; \"It's just awfully good that someone with the temperament of Donald Trump is not in charge of the law in our country.\"\n\nand Donald replied,\n\n&gt; \"Yeah, because you'd be in jail.\"\n\n\nThat was a *very clear* reference to the fact that Donald Trump has asserted that the DOJ pressured the FBI to avoid recommending an indictment of Hillary Clinton, that immunity deals were handed out like candy, that Obama lied about having knowledge of Hillary's server, and that the Attorney General of the United States of America having a private meeting on a plane with the husband of the person who was under two FBI investigations was **wrong**.\n\nIt was a statement meant to convey that Trump would not allow anyone to be above the law if he were in charge.\n\nYour continuous efforts to take shit out of context, to sensationalise every remark that Donald made, and to call anyone who disagreed with you racist, sexist, homophobic, etc, had an undeniable effect on turnout. This is distinctly an issue with Hillary Clinton supporters. I haven't forgotten the hundreds of times I was called a sexist \"Bernie bro\" simply for criticising Hillary's past judgment during the primaries.\n\nI respect the *fuck* out of Bernie, and were it not for the attitude of Hillary Clinton supporters and paid shills alike throughout this process, I may very well have pushed all of the primary nonsense out of my mind and voted for her. \n\nIn the end - it is more important that we protect the integrity of our elections from those who would wish to rig the process than that we elect someone who we agree with.\n\n\nI now look forward to opposing Donald Trump and all of his policies with a fiery passion.\n\nI wish, instead, that I was supporting Bernie Sanders' policies with that same passion. \n\nUnfortunately, the entire nation was duped not once - but twice.", "I work in IT specialized in an area that relies on buying tons of enterprise-level computer equipment (like, tens of millions spent every year on storage arrays, servers, blades, etc)\n\nmy fear is that if Trump starts trade wars in Asia and tariffs get raised to be prohibitively expensive on the import of electronics, companies will invest less in technology and people like me will be out of a job.\n\nI'm at a medical research shop, so we're not talking about replacing the receptionist's desktop here... it's more about the level of high-performance equipment needed to do stuff like genome mapping.", "Don't worry Putin will mansplain it for him.", "The fact that no one sees this is mind boggling. This is Facism rises 101", "Other than the fact she was doing it in 2015 because she was doing it well before then...like, since she stopped being SoS.", "my apartment has never been more clean and well-organized than it is after me looking for stuff to do to occupy my mind.\n\non Monday I could only take about 2 steps into my walk-in closet... now everything is in rows of plastic containers complete with printed-out labels of their contents.", "I mean (effectively at least) that wouldn't be the west coast joining up with Canada it would be Canada joining up with the west coast. Washington, Oregon, and California combined have 40-45% more people than Canada despite the land area gap. California alone has a bit over around 3.5 million more.", "&gt; ↓ Tuition → Free!\n\n*dead.*\n\nI'm right there with you.", "\"Look at the funny angry orange cartoon man! Let's vote for that guy!\"", "Fuck Trump.", "You people really don't get it. You thought you were immune because America is the \"Land of the Free\". Trump is a nationalist populist demagogue. He repeatedly called his opponents corrupt and said he wouldn't accept the results if he lost. He wanted to jail his opponent during the election. Now he just delegitimized popular protests against him and set himself up to muzzle the media. The man didn't campaign on keeping America free or just, his slogan is to make it *great*, and he loves authoritarian rulers.\n\nLook at r/the_donald, his most vocal supporters. Young, conservative, angry men. Spicy memes? Mindless slogans that blast any notion of critical thought out the window in favour of frothing emotion. It's filled with insane conspiracy theorists who *really think* that CNN describing Trump touring the whitehouse was an attempt to get him assassinated. Who want to \"drain the swamp\" of their opponents.\n\nThis is not the time for anger. This is not the time for false hope. This is the time for fear. For terror, and the clarity it brings. America, **you just elected a fascist movement to power**, and it has full control over your government. Fascists aren't cartoonish villains from the 40s, they're a huge danger inherent to democracies. Trump and the New-Right *are fascists*, even if they're not fully aware of it.\n\nHoly shit, I fear for the world.", "Us \"busters\" were pretty clear from the primary... Hillary is not an option. If the Dems would have listened we would be celebrating a dem win... #sorrynotsorry", "Bernie or Buster here - I voted Jill. I also don't live in a swing state or I might have voted Trump. I refuse to be told to vote for a candidate that stole the primary. Period.", "Maybe they got the idea from Donald Trump's Twitter?\n\nRemember on Election Night 2012 when Donald Trump advocated for taking to the streets to protest the election results?\n\nhttp://abcnews.go.com/Politics/donald-trumps-2012-election-tweetstorm-resurfaces-popular-electoral/story?id=43431536", "Get real.  They vote for people who will screw them over every election cycle.  There's no reason to expect them to change.", "I am still pissed she didn't just come out and run herself. Then she sat around with her hands in her pockets forever not endorsing Bernie because I am damn sure she was conflicted. If she endorsed Bernie then why didn't she just run herself? If she endorsed Hillary because it was her turn then was she falling into the establishment trap?\n\nSorry Liz, show me something to get me back. You should have been the first major party female nominee. Then we would have not been in this mess.", "Unbeknownst to Clinton the glass ceiling was reinforced by steel.", "What the DNC forgot is how the story \"Pied Piper of Hamelin\" ends, and where the phrase \"You gotta pay the piper\" comes from.\n\nThis played out exactly like the storybook.", "I do not think Trump would. But I do not think it is about prosecuting the losing opponent. Does anybody agree that laws should apply equally to everybody? If Clintons did do things illegally why they should not be in jail, just because they were his opponent before? We need hold politicians accountable. If FBI Clinton foundation investigation yields overwhelming evidence of breaking laws, why they should walk free? I do not see it. The truth is that if I did anything similar to what Hillary did in the email server thing, I would be in jail for long long time. ", "Take responsibility for your life", "you guys think the Pentagon will brief him on global warming and he'll take it seriously? There's always a 0.001% chance.", "See that's the difference between the new right and new left movements. The new right has it in their mind that America was perfect in the 50s, and want to return to it, while the new left acknowledges the changing nature of the US and want to actually improve it.", "Fuck Hillary and the DNC", "The fact they're talking about Dean or Granholm shows they learned nothing and deserve to lose in future elections. ", "Latinos have always been somewhat conservative that one's not a surprise. And not all of them are pro-immigration (and plenty of us are racist, lol). Just remember even Cesar Chavez was vehemently anti-immigrant. Also, just like plenty of white people in the south, a lot of us Latinos *also* vote against our own interests sometimes.", "That's quite the elaborate and nuanced interpretation of a rather blunt and to the point statement.", "Latinos are a diverse group of people from different countries with different cultures. Why should they all vote the same way?", "I'm not a gerontophobic but I'll be glad when the current generation of lawmakers are out because of how we have mostly computer illiterate people writing the laws that govern our technology. Their sheer ignorance in the field of modern technology makes them particularly suggestible to lobbying from corporations like Comcast.", "A little more reserved about Warren now.", "Or maybe and stay with me on this it will be hard, there are a lot of people in liberal cities who are upset that the person with more votes lost, a person that they really do not like, and are venting that frustration in the form of protests\n\nBut you're right, based of this email we can extrapolate that the DNC hired tens of thousands of people to protest over the country, keeping it secret, all for no real tangible benefit, instead of using it to build up their operations for 2018", "I'm going to Mitchell Tech for the Wind Technology program and it is super conservative. My teacher voted for Trump I was completely baffled, how can you teach renewable energy and vote Trump. I'm getting mocked all the time but I grew up here so I'm used to it. I fucking hate South Dakota. On the bright side having a Wind Degree is a ticket out of this country so that is nice.\n", "The votes Hillary didn't get are her fault and her fault alone.", "It's a mistake the dems made twice now. Instead of running a campaign where they sell their candidate they just pointed at the other guy and said how horrible he is. That's how you ended up with George W Bush and Trump.\n\nIt would also make sense to try to appeal more to people in rural areas, something Bernie is good at, being the senator for Vermont.", "&gt;Clinton only got 43% of the white female vote.\n\nDaaaaaaaaaaaaamn. Oh that's gotta burn. There were rumors of putting her up in 2020 again but hopefully they fucking forget all about that noise.", "Except Florida.\n\nBut they deserve it for fucking the country twice in 16 years.", "\"Get even with people. If they screw you screw them back 10 times as hard. I really believe that.\"\n\n~ Donald J. Trump\n\nGreat job, 'Merica.", "I hope its press secretary. ", "Not mine personally but I have friends and family members with preexisting conditions. So I'm scared for theirs.", "Being nice and acting nice are two different things. Gore saying this is *much* better than saying \"Our top priority is making Trump a one term president.\" McConnell said something along those lines and I doubt that it proved to be a good idea. ", " Just eight years ago Sarah Palin was the politician I was most worried about getting near the White House.\n\nNow looking at Trump's top choices for his cabinet, she is, by far, the person I am least scared of. What a horrific collection of people.", "Taken together with Trump's past statements about Tiananmen Square (which he also called a *riot* in the debate) his willingness to characterize protesters as \"professional\" i.e *fake* should concern Americans. \n\n\"When the students poured into Tiananmen Square, the Chinese government almost blew it. Then they were vicious, they were horrible, but they put it down with strength. That shows you the power of strength. Our country is right now perceived as weak ... as being spit on by the rest of the world—\"", "That shit is now irrelevant. Yeah the system sucks and Bernie should have been the nominee. Yeah, we should get rid of the electoral college and two-party system. All true.\n\nBUT.\n\nThe time came to choose between two unfavorable options, with one being far less destructive. Teaching the DNC a lesson is NOT worth the destruction of our environment, the rise of white supremacy in America, the inevitable failure of the economy, and the regression of social progress for possibly decades. \n\nIt's called safeguarding the future. Bernie understood this. He fought tooth-and-nail for Clinton because he understood that even though he had been fucked by her and the DNC, she didn't pose an existential risk to the Republic.\n\nWill the DNC learn? Will our system get better? Maybe. Who knows? But one thing is certain: we're in for a long period of suffering before we find out.", "Or rape erotica you don't think that would have been hung around his neck?\n\nOr how about the fact that he is as much of an insider as Clinton \n\n\nIf you think there would be a nuance discussion about rape fiction, you are foolish ", "\"we hate the system\"\n\n &lt;trump fills cabinet with washing insiders&gt;\n\n\"the system is great!  squawk!\"", "I know exactly what you meant with those arrows", "A Republican FBI director investigated her and concluded there was no case.\n\nHard to say she's guilty of serious offenses when someone like that finds otherwise.\n\nJailing political opponents is a frightening precedent. It's the kind of thing you see in Dictatorships.", "That was the most fucked up part. They couldn't get over his loss and stopped listening to him. I honestly wonder if that section of his supporters was really all that interested in what his message was or if they were just \"blow up the system\" voters like Trump's base.", "Ehh while Bush wasn't exactly Captain Planet he was still... Relatively normal. Trump and his proposed cabinet take this proud ignorance thing to a be level. ", "It's fucking hilarious how people think that a campaign ran by a GOP insider with help from Rudy Giuliani and Chris Christie can pass off as \"anti-establishment\"", "It still doesn't feel real. ", "Fuck yeah I am scared. How the fuck am i supposed to afford medication that is going to cost me 1500 dollars a month without insurance to stay alive and live a normal functioning life?", "But calling Obama a Kenyan makes him a brave hero that was ready to stick it to the man!", "Oh look at that white voters got sold a bill of goods by a corporate jagoff propped up by the KKK.\n\nHope your protest vote doubles as the pain meds you won't be able to afford anymore without insurance ", "Or a new lie to everyone they see", "You still don't get it.  Scandals in the end were not the decider.  Trump has scandals in spades.  The states Trump flipped were the same states Bernie won or had his narrowest losses.  The rust belt didn't give two shits about scandals obviously.  They voted in the primaries and the general for the person who talked most about trade and jobs.  While Hillary focused on Trump being unqualified and scandalized, Trump hammered on NAFTA and TPP.  Trump won the rust belt and the Presidency as a result.  Exactly what good was Clinton being so dominant in the south in the primaries if we knew all of that was going to the Republicans in the general anyhow?  Apparently Bill Clinton was hollering about exactly this behind the scenes but they just disregarded his opinion.  And now Republicans will dominate all 3 branches.", "Brock also flooded pro-Sanders groups especially those on Facebook, with child pornography to get them shut down. We all still remember that, right?", "You mean Trump lied? Who would have thought...", "&gt; The new right has it in their mind that America was perfect in the 50s\n\nThat's the funny thing. Some of Bernie's ideas that are good (make the top earners pay their goddamn taxes make the CEO:worker pay ratios less fucking insane, reduce inequality) are actually things we had in the 50s. \n\nNot everything old is bad. Not everything old is good. Judge ideas on their merits, not their time period.\n", "We should all aim to be better people.", "mother fuckers healthy tho and especially now Jane's making sure he's healthy as fuck. Plus that congressional health care ain't too bad", "Maybe the FBI should have fucking thought about that.", "http://i.imgur.com/s1NDD6L.jpg", "Don't worry  Something Fantastic Care will have you covered! ", "I believe this is unlikely to happen but Trump should appoint Garland and drop the conservative social issues to bridge some of the divides not only in congress, but across the country. America has probably never been this politically divided since the Civil War. Trump supporters are being harassed in the big cities. Anti-Trump people and minorities are being harassed in conservative, rural areas. As of now, there are anti-Trump protests breaking out in cities all across America. People are refusing to accept Trump as the new president-- could you imagine this happening with Romney or Bush? This isn't just a political disagreement; Trump is absolutely loathed by half the country, and for good reason. Ethnic and religious minorities are legitimately scared of going out in public-- Trump's victory has emboldened racists all across America, and there's already been a few notable attacks. Gay people are worried that their marriages will suddenly become outlawed. Women are scared that they will lose to right to control their own reproductive system, for fuck's sake. What is this, the 1950s? \n\nObama tried to compromise with the GOP by nominating a centrist, yet the GOP continues to be obstructionist pieces of shit by refusing to even *vote* on him. If Trump really wants to \"drain the swamp\" and unify the country, he needs to tell the GOP to fuck off. From the guy who spent the last year and a half insulting just about every minority group in the country, it's the least he can do.\n\nIf Trump does this, I will legitimately start to respect him. ", "I stopped watching the daily show because of that. Everyone on there might as well have been bankrolled by hillary. ", "No wonder wikileaks was shittin on Hillary so hard... they wanted to get the ultimate leaking weapon elected instead", "Same here! As a millennial woman I felt they played the first woman president angle a bit too much. Especially because even though she's worked hard, I still don't believe she would have been in that position had she not been Bill's wife. So it took some of the first woman president struggle admiration away.", "trump supports states rights to legalize weed. He is also pro-medical marijuana. \n\n\n\n", "Because Democrats have been telling them that. ", "This is what enthusiasm and loyalty looks like. The Hillary Dems probably thought they crushed us out or at least the Bernie spirit, but he tapped into something that was there longer than 18 months so it's not going to go away. \n\nRespect just doesn't go away when your guy takes the high road and gets hit for it. ", "And then there's the leaked email from Brad Marshall (Chief Financial Officer of the DNC) suggesting that Sanders be smeared as an atheist: https://wikileaks.org/dnc-emails/emailid/11508", "&gt; The states Trump flipped were the same states Bernie won or had his narrowest losses.\n\nBernie lost NC by 14 points Ohio by 14 points, Florida by 31 points, and Pennsylvania by 12 points.\n\nHe did win Wisconsin by 13.5 ppts and Michigan by 0.5 ppts.\n\nHis narrowest losses were Missouri (0.2 ppts), Iowa (0.2 ppts), Kentucky (0.5 ppts), Massachusetts (1.4 ppts), South Dakota (2 ppts), Illusionist (2 ppts), and New Mexico (3 ppts). Of those, only IA flipped since 2012.\n\nD's winning Wisconsin and Michigan wouldn't have changed anything without NC, OH, FL, and PA, all states he lost badly in the primary. And if you include other battleground states that Sanders lost but Clinton won (VA -30ppts, CO -19ppts, NV -5ppts), it's clear that using primary data to suppose anything about a Sanders nomination is a losing argument for Sanders.", "EPA done ACA done, Dodd Frank done, Roe v Wade done, National Parks done, Marriage Equality done\n\nGod help us all", "The Republican Senate the Republican House, and soon the Supreme court will disagree. You *really* think Trump is going to veto a Republican Senate bill requesting the government to enforce federal laws? You are letting your bias delude you", "I hope California and New York specifically reach out to China on their own and say \"hey just so you know we are so far on board that we promise to mitigate the damage Trump will do and these blue cities in red states (Austin, Atlanta, etc) are doing it too.\"\n\nAustin is going to be 50% renewable by 2050 and is the 10th largest city in America. We cannot allow the world to think the orange cum dumpster represents our opinion on the climate. ", "His one high-profile meeting with Mexico's president ended with him folding then bragging about winning once he got back home, then Mexico's president basically calling him an outright liar.\n\nConservatives elected someone who still can't swim with a floating board underneath him, to be a olympic medal swimmer. They're going to see him fail a whole of a lot during the next year.", "My actual life? No. Progress? Fuck yeah. Legitimizing hatred into the mainstream? Fuck yeah. Putting targets onto people's backs? Fuck yeah. A superiority of the uneducated and philistines? Fuck yeah. Conspiracy theories seeping into the mainstream? Fuck yeah.\n\n But Trump winning has proved that this has already happened.\n\nLook I don't think our empire is going to crumble or I'm going to be put into a gas chamber. But I think progress has stalled, or will go backwards 30+ years because some people have rose-colored glasses of a simpler time that never fucking existed. Cause they were twelve.\n\nEdit: oh, and tax breaks on the top tax bracket and tariffs on Chinese imports are not going to bring manufacturing jobs back. They're gone. It's just going to make shit more expensive and increase our debt. The only way jobs will come back is if we stop buying from Walmart and buy American. And even if they do, theyre prob going to be made by robots.", "A big-money shill in revolutionary clothing!?!  [Inconceivable!](https://flamingbagofpoo.files.wordpress.com/2012/08/inconceivable.jpg)", "Also Chris Christie rumored as Head Of Transportation.\n\nThe RNC knows they're fucking us now and they don't even have to try and hide it.", "&gt;Bruh what is more republican than letting the states decide what they want to do?\n\nExcept they are hypocrites, are you kidding me? The Republican party was trying to crack down on states with marijuana legalization while Obama was in office. Chris Christie has said if he is made Attorney General (Spoiler leaks confirm Trump is considering him for the position) that marijuana is legalized states is gone.\n\n\n", "Yes. My trans friends couldn't go to work yesterday because they were emotionally drained and scared. My black friends fear extreme militarization of the police. As a gay man I believe LGBT progress will be repealed. \n\nThis fear is real.", "Good luck with that.  Republican controlled White House Senate, House and Supreme Court plus likely the nuclear option of removing the fillibuster.  You aren't going to be able to block shit.", "\"Hey guys we can accept the reality that we had a shit candidate.....or we can double down and say sexism and racism more? Yeah fuck it AMERICA IS SO SEXIST\"", "I'm pretty sure Garland wasn't on the list of possible Supreme Court picks that Trump put out.  Protests don't really mean anything people protested the hell out of the Iraq war and here we are.  If anything it'll push the \"LOL TOLERANT LEFT\" crap.\n\nTrump isn't going to drain the swamp, he's bringing Newt \"20 years in the House\" Gingrich into his cabinet.  ", "You don't make zinger's about jailing your political opponents...\n\nbut i guess we live in an age where \"bruh its just a prank! just a prank!\"", "Not just the cringe but it fails as a slogan to confer value. \n\nGood slogans convey what the brand will do for YOU. This one tells the audience what YOU will do for HER. It feeds directly into the preconceived notion that Clinton is power hungry, true or not. \n\nThen \"Love trumps hate.\" Okay, I don't know what kind of thought process went behind \"use the opponent's name as a powerful and positive verb in our slogan\" but it was a huge misstep. ", "&gt;She had a conservative streak on many topics including Gay Marriage Abortion, criticism of Obama on the Middle East and Gun Control.\n\nSo?\n\nWe can't be putting people through an ideological purity test. Not everyone we align with on this journey to take back the DNC has to be a progressive. They can be moderates. They can have mixed views. That's fine. In fact it's desirable. We don't want to breed an ideologically isolated party because that renders us unelectable. We want diversity and exchange of opinions.\n\nThe only thing we cannot compromise on is campaign finance. There will be no mercy for establishment/corporate-aligned politicians. We need to put together a party that is funded by grassroots donations, because that's the only way we're going to have credibility in the general election when we run on a platform of campaign finance reform.\n\nBut outside of that, us progressives absolutely should be willing to build coalitions within the party with Blue Dogs and everything in between. The simple fact is that progressive Berniecrats cannot win senate seats everywhere. We're going to need these moderate Democrats in purple states to gain control of the Congress. And it's totally okay that they're moderate. After all, their constituents are moderate, and Congress is all about representation. What matters is that they're *clean*, genuine public servants actually there to represent the people instead of represent the elite donors.", "Chinese steel.", "The fire only gets stronger and we will burn brightest now...\n\nNow that Winter is Coming.\n\nFight on.\n", "No she's responsible for firing up her base, dickwad. She's the candidate. She's responsible for reaching out to her constituents and giving them a solid, concrete reason to get out to the polls. She has to move them. She has to *connect* with them. She has to get at them in a way that excites them, makes them believe in something. Obama did it. Bill did it. Her? The fact that she lost 9-6% of voters in battleground states vs Obama shows that, no, she did not.", "What Clinton foundation investigation?  The one that was based on a right-wing book that had no evidence to support any of its claims?  The one that due to this complete lack of evidence, they were told that they were not to move forward?\n\nTo go back to this now, barring some new revelation, would reek of political retaliation.  This is not a dictatorship and we do not use the power of our investigative agencies to attack political opponents.", "They decided to try and split the working class vote into \"racist whites\" and \"minorities\". Awesome strategy.", "Just remembering all the shit they said about Bernie makes my blood boil!", "Devoid of policy?\n\nAre you kidding?", "You mean we shouldn't look to our government to be a constant source of entertainment?  That's crazy talk.  ", "_You're still doing it._\n\n", "&gt;Trump will repeal the EPA (but not the regulations they have made) because all they can do now is add red tape.\n\nthe lack of critical thinking skills on display is breathtaking", "what I think a lot of people don't see is that Bernie brought people in to the Dem party that Clinton never would have. I voted in a red state primary -- the middle school where I voted was so crowded and understaffed because they hadn't seen turnout like this in forever. And then to say these people are traitors -- they were never Clintons in the first place ", "Yeah I totally think he was surprised. The look on Trump's face his family's faces, and Pence's and the Pence family's faces -- they were not expecting to win.\n\nTrump was expecting to lose and was prepared to go on a tirade, and maybe reference his next venture, the rumored cable/online TV network, in his concession speach.", "Found two persons who know nothing about Europe (or want to deliberately mislead a mainly American audience). \n\nThe sentiments OP described exist only **only** among hardline nationalists in Europe, and even then only in some countries. In no sense of the word do people Europe as a whole \"loathe\" Germany, nor do they hate Brussels and the EU, nor do they consider EU to be an \"extension\" of Germany. \n\nThe entire comment strongly exaggerates the sentiment that, while it does exist, is blown way out of proportion. The only way to get this particular impression of Europe is by reading parts of the British press, which is for the most part known to be a very poor source on European affairs. ", "&gt; why have white rural voters and white working class voters abandoned the Democrats? \n\nTrump promised them that low-skill high-paying jobs would come back... Hillary offered them job training for new industries.\n\nthey went with the easy answer, even if it's pretty much a lie (even if Trump *does* bring back manufacturing, most of it will be automated)", "You forget the part about the dirty rat jews. Oh you said globalists my bad.", "There are different degrees of \"being suspicious.\"\n\nYou shouldn't trust every thing someone tells on first glance but you also shouldn't let your cautiousness rise to the level of ignorance. ", "The guy inspires a feeling I am completely unaccustomed to in politics: devotion. I sucked up so much anger at having lost friends in Benghazi in order to vote for Hillary like Bernie asked me to do. I trust Bernie to make good on his promises to the best of his ability because he fucking does it. Pride be damned, he does it, and I am faithfully going to support him as long as he keeps on doing that.", "Bernie and Warren both endorsed him...if he is not the new DNC chair the party will be in chaos. ", "Scared for the future of the climate. ", "We'd also be reading the personal correspondences of Jeff Weaver rather than John Podesta presented by an organization that actively pushed the most absurd conspiracy theories like \"John Podesta drinks blood and breast milk in secret ritual.\"", "Americans used to be the motherfucking envy of the world. We used to stand for shit. When did we become just a bunch of fucking sheep?", "Rural America 15% of the nations population, decided the direction in which the country will go. That's depressing", "She's out in the wilds of upstate New York searching for the remains of her political career with a cadaver dog.", "Polling aside they do have platform goals which are at odds with peoples beliefs. Things like climate change denial dismantling of the ACA, net neutrality, etc are things that people are and should be worried about.", "Feel The Bern!", "&gt;It's important to remember that Dean led Democrats to large victories in 2006 and 2008. He's not a bad choice. We really should be satisfied with either.\n\nThe 2004 Dean is not the same as the 2016 Dean.\n\nThe 2004 Dean coming off the heels of a grassroots progressive Presidential campaign, had a great deal of *credibility* in the electorate. That's why he was able to energize the voter base the same way Bernie did this year. And certainly he translated that into a reliable turnout in the midterms time after time. Kudos to him for that.\n\nBut since Dean left the DNC in 2008, he has gone into the private sector and become a lobbyist. He abandoned his principles and became what he fought against. At this junction he's about as establishment as they come. He has no credibility left in this fight for campaign finance reform. If he's chosen as the chair, he's not going to be able to energize voters and rebuild what he had during his first tenure.\n\nI'm not in this to conduct ideological purity tests. I'm entirely okay with moderates. In fact I recognize that progressives must form coalitions with Blue Dog Democrats because we need each other in different kind of states to win our respective Senate and House races in order to take the Congress back.\n\nHowever the one thing that cannot be compromised on is campaign finance. I don't care if an ideological moderate leads the DNC, so long as they're not part of the twisted infusion of corporate money in politics. We cannot put another establishment in charge and expect voters to turn out in the midterms. We need Democratic leadership and Democratic candidates whose campaign finance records are devoid of these types of conflicts of interest.\n\nHoward Dean of 2016 fails that test. That's why I don't want him.", "Trump always seems to sort of forget that his words get recorded. I don't think he remembers having said them himself a lot of the time.", "Big if true. ", "That...would be kind of amazing.", "Appointing climate deniers isn't a good sign.", "The Clintons are well known for crushing dissent and rewarding loyalty.\n\nPeople fell into step with her because they were *afraid* of her. The great irony is that she was only powerful because nobody was willing to ever tell her no.", "we'll see but I'm skeptical at how quickly someone could turn up a factory building cutting-edge hardware from the ground up (not to mention the fact that something like 95% of rare earth elements are in China/Mongolia so that would need to be imported regardless)\n\nit's not exactly the equivalent of making cotton t-shirts in Michigan versus Thailand.", "Bernie would have taken the 1pc from Jill Stein and more millennials would have voted. Bernie would have gotten more than 50pc of the vote s", "A minority would have elected the President no matter who won. Voter turnout was 55.6 percent. That mean slightly more than a quarter of all voters would have determined the outcome.\n", "More unconstitutional than deporting US citizens?\n\nhttps://youtu.be/w69wbCoHZUY?t=308", "fwiw as a fellow gay... I think gay marriage and gays serving in the military are safe.\n\nI fully expect to see religious liberty laws expanded, though, and any kind of new ground on trans rights like bathroom issues is DOA. we can also look forward to another 4+ years of being able to be fired or denied housing purely for being gay, but that's just life as normal.", "No shit. We're pretty much at the mercy of the GOP for the next two years. ", "It breaks my heart that he has to give the reins to a man like Donald Trump. Imagine what Obama is going through. This is a man who has been through a lot of racism throughout his presidency. This is a man whose citizenship was called into question by Trump and the very notion got people so riled up that he had to show his birth certificate. Not to mention that Republicans were very vocal about making sure that Obama would only be a one-term president and that they would oppose him at every turn.", "We should all aim to be better people.", "All it would have taken is one email calling anyone in the Clinton organization a bitch. It would have been a story for 3 weeks ", "Shooting a sprinter in the leg then saying \"Look, he ran slower and didn't win the race!\" isn't exactly what I'd call a genuine loss.", "That's probably going to be done away with in all honesty.", "a minority *of voters.* better?", "Her base came out.\n\nThe voting rights changes that you helped to expand upon with your inaction is what caused the numbers to drop.\n", "I kinda want to gloat about his inevitable failure as well but then I remember it's all of us who'll be on the receiving end... ", "&gt;That's president trump\n\nExactly. Only lower-case for him.", "Upside: If there are aliens among us Trump could never keep it secret. \n\nDownside: They probably declared Earth quarantined after seeing who America elected. ", "Warren would've had the same problems running against Clinton that Sanders did. She wouldn't be able drum up support with African Americans and Latino voters. \n\nThe only states she takes from Clinton that Bernie couldn't are those in New England. However she's a clear favorite if she wants to run in 2012. I don't think we should be demonizing every Democrat just because they are not perfectly pure in their decision making.   ", "Wait until you get really sick then show up at the ER and make a run for it after you get treated.", "Generally people who spout off about biology without knowing anything about biology, probably shouldn't have their opinions about it considered.", "You jest but some of his supporters actually wanted him to gas the Jews! ", "I'm terrified. I'm hispanic queer, muslim and a woman. I feel like I just do not fit in this country anymore. The only thing I chose was my religion, but I'm not even religious more like culturally Muslim or reform or something. \n\n\nMy husband and I have looked into going to Canada. We are eligible because of his job, and other things like we don't need a job prior to immigration, but I'm still scared. What if they say since we're muslim we can't ever return, if we leave? What if they block our ability to fly or cross the border? \n\n\nI also cannot deal with war. I'm a yuppie. The idea of war, especially nuclear, breaching our borders terrifies me. I'm use to harassment, shit healthcare and so forth... But, I don't want my safety compromised. The soonest we can immigrate is in July. :(", "He tried bargaining with congress. They never fucking compromised and constantly filibustered.", "She did.\n\n[Just look at how the DNC elite were treating her after she broke rank to endorse Sanders though.](https://wikileaks.org/podesta-emails/emailid/3609)", "being hip with the kids really paid off", "There are going to be many thousands of \"shills\" protesting very loudly this weekend in cities all around the nation! Join us!", "I did the math. If ALL Jill Stein voters voted for Clinton she would *still* lose in Pennsylvania. She would *still* lose in Florida. She would *still* lose in North Carolina. She would've won Michigan and Wisconsin, in which case she would *STILL* lose if those two flipped in the final standings.", "not that crazy i find that women are good at seeing through other womens bullshit. and hilldawg was certainly full of bullshit. as was trump", "The bigots keep telling me \"relaxeverything will be fine\"", "Some Hillary supporter literally told me that on this very subreddit.", "I would be more sympathetic to the pro-life view if they also supported sex-ed and access to contraception. The pro-life side seems intent on using their anti-abortion views as a punishment for sex rather than as a protections of life.", "&gt; July 26 2015 - ABC's 'This Week' panel ridiculing Ellison for suggesting Trump could win nomination and potentially the White House.\n\nAround the same time they were laughing at Ann Coulter on Bill Maher for the same thing. She said Donald Trump had the best chance of winning the general of any republican candidate, and that Bernie would be a much harder candidate to beat than Hillary.", "He is already talking about putting Muslims in a database said it tonight.\n\nThanks\n\nFor \n\nThe \n\nProtest\n\nVotes\n", "You mean the product of corporate cronyism doesn't want to get rid of corporate cronyism? MY LIFE IS A LIE.", "A lot of us predicted that since Latinos are intensely conservative.  Plus the legal immigrants *really* hate the illegal ones.", "And this is how it will go... Watch as trump fills the swamp with insiders lobbyists, rich people, and \"the establishment\"", "Goldman Sachs is like, totally anti-establishment, dude. They were corporate leeches before it was cool to be one. Like back when my Grandpa Boomer was my age. MAGA!", "President Trump is installing people your Grandpa on Facebook loves and votes for namely anti-secular dominionists who will shove the bible down your throat. Enjoy.", "The worst thing is: in 4 or 8 years they will just vote for the next dumbass that lies and promises them the world.", "&gt;President Obama after he was first elected, instituted rules that prohibited individuals who had served as a registered lobbyist in the prior year from serving as a transition adviser in the areas in which they represented private clients. They were also prohibited, after the administration took power, from lobbying in the parts of the government they helped set up.\n\nAnd now Trump is bringing lobbyists in to work on his transition team in the very areas they represent. I'm so glad they elected this guy so he could be so much less corrupt and really shake things up. ", "If Trump is appointing the same shitty Wall-street insiders and establishment republican who are part of the problem how is that a win for you guys?", "&gt; But yes I agree. We shouldn't leave Middle America to rot in its own filth\n\nWhy the fuck not? They can have Trump, and we'll take the tech sector, our defense contracts and our avocados. Fair fucking trade.\n\n", "That's President Obama mother fucker. You seemed to forget that the past 8 years, don't go pissing now that someone didn't give your guy the honorific you think he deserves.\n\nI hope you're ready for 8 years of unchecked power by a political party with a penchant for fucking over the middle class and poor. If you aren't wealthy or upper middle class, you are about to have a bad time.", "There is no fun anymore.\n\nActually though I'm young, and I feel a crushing responsibility to change my whole career path to get involved with the resistance to Trump. It's just too big an opportunity and too big an issue to ignore. I can't go to my regular do-nothing job every day and care about it while I know my energy would he useful elsewhere.\n\nAfter Bernie lost I thought I could just put my head down, live my life, and let the status-quo Dems take care of business. I thought wrong. They are incompetent and need to be replaced. I would be a hypocrite if I sat back and called for new leadership without offering it myself.", "She'll blame it on them anyway. The usual line is \"not enough turned up\".\n\nMaybe if they weren't working two jobs without vacations they could get out to vote. Or maybe if the DNC allowed a candidate that represents them get a fair shake they might come out.", "Dear lord the contents of this email. I must've missed it when I was combing through the Podesta Leaks.\n\n&gt; From: Darnell Strom \n\n&gt; Sent: **Monday, February 29, 2016 3:13 PM**\n\n&gt; To: Tulsi Gabbard \n\n&gt; Cc: Michael Kives \n\n&gt; Subject: Disappointed\n\n&gt; Representative Gabbard,\n\n&gt; We were very disappointed to hear that you would resign your position with the DNC so you could endorse Bernie Sanders, a man who has never been a Democrat before. When we met over dinner a couple of years ago I was so impressed by your intellect, your passion, and commitment to getting things done on behalf of the American people. For you to endorse a man who has spent almost 40 years in public office with very few accomplishments, doesn't fall in line with what we previously thought of you. **Hillary Clinton will be our party's nominee and you standing on ceremony to support the sinking Bernie Sanders ship is disrespectful to Hillary Clinton.** A woman who has spent the vast majority of her life in public service and working on behalf of women, families, and the underserved [sic].\n\n&gt; You have called both myself and Michael Kives before about helping your campaign raise money, **we no longer trust your judgement so will not be raising money for your campaign.**\n\n&gt; Darnell Strom &amp; Michael Kives\n\n&gt; This e-mail and any files transmitted with it are intended solely for the use of the individual or entity to whom they are addressed. If the reader of this e-mail is not the intended recipient or the employee or agent responsible for delivering the message to the intended recipient, **you are hereby notified that any use dissemination, forwarding, printing or copying of this e-mail is strictly prohibited.**\n\nI laughed at the last part. How unfortunate, really. So. How will CNN attempt to spin this leak, especially since it was sent early during the DNC primaries. \n\nMy rough translation: \n\n&gt; Dear traitorous bitch, \n\n&gt; How dare you get in Queen Hillary's way when it is obviously *her* turn. For your betrayal of the establishment that we have spent decades cultivating, we will no longer trust you nor will we be raising money for your campaign. \n\n&gt; P.S. You are unintelligent and neither passionate nor committed solely because of your failure to support her. \n\n&gt; P.P.S. If anyone else is reading this without it being vetted by CNN first, we will do scary things to you.\n\nThe DNC brought this upon themselves, and I fear they have not learned from their mistakes. They're just going to blame everything and everyone else, elect another establishment candidate spruiced up with a touch of identity politics and McCarthyism and we will be back to square one.", "That last sentence is so tragic...\n\n\"Who's that then?\"\n\n\"Dunno must be king or something.\"\n\n\"How do you know?\"\n\n\"He hasn't got shit all over him.\"", "I don't personally think she betrayed Bernie. I think Hilary (knowing full well she was going to choose Tim Kaine) wooed her for VP and Elizabeth felt that that would be the best possible service she could do to the movement. Elizabeth has always been on the side of the consumer and we shouldn't make a mountain out of a molehill imo\n", "The best comment I saw on there was:\n\n&gt;President Trump will repeal it (Obamacare) and replace it with something better\n\nYea okay. Because that's what the right wants. Universal healthcare. ", "Seeing as they have the House Senate, Presidency and soon Supreme Court then sadly it's not even safe should that happen...\n\nAnything can be put through so long as it's not explicitly unconstitutional ... So long as you can make an argument that (even with full on cognitive dissonance raging) that convinces 5 conservative justices that it may skirt the constitution but doesn't actively cross it then anything can pass.\n\nExpect to see further gutting of the Voters Rights Act in order to cement 2020, diluting the Civil Rights Act wherever possible, explicit discrimination against LGBTQ people (already proposed with the First Amendment Defence Act) and so on", "Don't forget those of us in Dallas! ^someone^save^meeeeee", "Winter is coming.", "Don't forget Paris climate accords done day 1 according to his new staff. And balls to the walls coal mining and oil drilling. ", "Funny I thought Republicans were scumbags for doing this exact thing to Obama.", "Dean lost his chance. His motivations are compromised and he's part of the problem.", "\"Unlikely to follow the advice of experts in the face of hubris.\"\n\nThat's dead on and an underappreciated point.  For all we've always heard about how intelligent Hillary Clinton is, it hasn't often translated into good decision making.  ", "Because when the God Emperor does it it's automatically the right thing. Haven't you been paying attention? ", "I think that she is and that she sees very clearly her error in judgement months ago. That is why she so quickly followed suit in this case. Her way of showing that she is aware of that and won't make the same mistake again.", "Maybe she's pissed at herself too.", "Hilarious that this isn't the top comment right now. People really want to believe Trump made the same mistakes as Hillary even when the source not only 1. hated Trump until he won 2. claimed he poisoned her until she got blowback 3. never even said he had the question handed to him. \n\nPeople really believe what they want to believe.", "That too.\n\nIn fact I want to beat up anyone in the media who dares to call anyone running for politics as \"anti-establishment\".\n\nI'm fucking sick of the word \"anti-establishment\". That word really needs to die in a fucking fire. ", "Which is why they'll continue on the path of demolishing the Voters Rights Act and keep the vote suppressed ", "Chris\"fuck this guy I'm closing the bridge\" Christie?", "Donald Trump has awakened a sense of patriotism that I never really felt because he is SO FUCKING UNAMERICAN in everything he says and does. I am so proud of how Hillary and Barack have comported themselves after his election. It gives me hope that our founder's system will survive his presidency.", "Utter horseshit. You can't even compare Bernie to Trump. Trump was a lying demagogue who built his coalition off of fear and hate. Bernie talked about serious issues facing this country like campaign finance reform wealth &amp; income inequality, social injustice, and investing in our future. Maybe his protectionist rhetoric wasn't always the best, but he never claimed he was going to bring back those factory jobs. He never said \"I alone can fix it.\" \n\nThere's a world of difference between the two.", "I wonder how long before the people who voted for him realize how burned they got.", "Of course they will.\n\nThat's why I find the claims that the DNC needs to court them to be maddening.\n\nIt was a terrible thing for the country for the GOP to go after the disaffected white vote. Doing the same on the disaffected white liberal side is awful. ", "Yea and her base was way way weaker then Obama's 5 million less then 2012.  Trump was less popular then Romney or McCain.\n\nThis type of thinking is exactly why Trump will win in 2020. I swear if they march out another cookie cutter candidate in 2020 it's the last time I'll ever vote Democrat.  They fucked this up and now we have to live in their mess.", "The residents of these states also happen to live in a self sufficient economy and in theory should be capable going without federal funding if need be. California on its own sends out 3 or 4 dollars for every dollar it receives in federal funding. We can manage.", "I am all for a woman president I just don't want her having that title as the first female president. It should go to someone with a bit more honor and political integrity. 30 years doesn't mean shit to me if I think she is a shitty politician - she can have experience, but that doesn't mean I think she is qualified for presidency. I would rather support another woman who I think is more fitting of president. ", "Holy crap this is a real thing and as someone from california I'm..sort of ok with it.....", "I'm not lying this is what happened to my mom who worked as an ER nurse prior to ACA.", "I've seen a lot of this type of attitude on Facebook.  People claiming \"if you're not voting Hillary it's because your sexist\".  Now even if they're right (and I'm sure in a large part, her being a woman put her at a disadvantage in terms of like-ability, which is a huge problem for a politician), it's a dumb thing to say for two reasons:\n\n1) This is not how you convince people they're wrong.\n\n2) It sounds like you're saying \"you should vote for her because she's a woman\", which is dumb because it implies that there weren't *other* much more relevant and compelling reasons to vote for her.", "She did basically no campaigning in WI she abandoned them so they abandoned her.  NC has always been red only Obama managed to turn it blue and it was close every time.  MI is an anomaly and wasn't enough to win her the election even if she got it.  She spent 500 million on her campaign.  Money that could have gone to down ticket candidates then maybe we would at least have the Senate.  Don't you get that? She spent half a billion dollars to lose to Trump.\n\nGet out of your bubble man, she lost, she is the weakest candidate since Mondale.  I voted for her and I still don't think she deserved to win.", "There's a small sliver of hope within me that it was all just a ruse to gain votes from the right. \n\nBut yeah I'm probably wrong. He's going to drain the swamp and fill it with nuclear waste. ", "Despite the fact that the environment is officially fucked beyond repair and we're in damage control now we can now rest easy at night knowing that Florida will never fuck up another presidential election. Because it will be underwater.", "Stop with this feminist victimhood. Hillary didn't lose because she's a woman. She lost because she's a Clinton", "Don't tell me what I know Travis. I'm here to shit post.", "If everyone could only vote again ", "Absolutely no policy platform as long as you ignore the conveniently posted longer-than-Hamlet platform produced by thousands of experts.", "Is this comment for real? You are still doing the same thing. Talking down to us like we are children who didn't come along. Your candidate did not represent all of what Bernie stood for and maybe we could have been swayed to settle for a little less but still similar ideals however it was your attitude that drove us to Trump. Maybe 2020 you might try a different approach or perhaps 2024?", "Anyone that thought any different is niave on a diff level.  \n\nThere was only one man who was against all of this and strong enough to stand up to it. Nobody at the top wants change.  Nobody. \n\n4-8 more yrs of the norm. Buckle up under 150000 earners", "She deployed to Iraq.\n\nThat kind of stuff tends to make an impression.", "No it's not a fucking prank you dumb fuck.\n\nIt is very clear to anyone who doesn't have their head stuck up their ass that some untoward shit occurred from the top of the DOJ down.\n\nIt is not unreasonable to, you know, CALL OUT FUCKING CORRUPTION.\n\nGod you fucks just love your corruption.", "Do you even know what the term American exceptionalism means?\n\nAlso it's President-*Elect* Trump\n\nActually since the electoral college hasn't gone into session yet and voted, he's still just Trump.", "A broken clock is right twice a day...", "&gt;Bernie Holdouts\n\nLmfao so their candidate is cheated out of the nomination and their supposed to just fall in line instead of voting for who they want or choosing to omit their vote entirely. How democratic of you. ", "That's the problem. Trump's stance isn't just \"nah fuck it, we ain't gonna throttle back\" His stance is build the pipeline, fire the torpedoes, make America burn coal again. His stance is literally \"I want two regulations eliminated for every one created.\"\n\nPeople don't understand, he's not just *saying* shit off the top of his head, he's *promising* it, he's written down in his hundred day plan:\n\nhttp://www.opb.org/news/series/election-2016/npr-here-is-what-donald-trump-wants-to-do-in-his-first-100-days/\n\nHis economic plan is a fucking joke, he's going to drop the business tax rate from 35% to 15%, and if that wasn't bad enough, he's going to let them repatriate funds at 10%. Ten fucking percent! He says he's going to create jobs with oil, shale, clean coal, and natural gas, all arguably non-renewable resources that, guess what, don't produce jobs anymore when it's all gone. He wants to make America a boomtown, with all the economic drawbacks the tail end of a boomtown incurs. ", "Oh no. See a normal Republican would at least wallpaper over the racism, sexism, xenophobia, and homophobia with a veneer of respectability like respecting religions freedom or protecting the family.\n\nNo sir, Donald Trump is about to open up a firehose of pure unadulterated shit pumped straight from the septic tank of every dumb fuck that peaked in high school and never made it out of the shitty two stoplight town they grew up in.\n\nWe're talking full on financial apocalypse, rolling society back to the dark ages. We're talking the KKK and neo-Nazis openly claiming territory and race riots in major cities. A major humanitarian crisis on the scale of the Holocaust as Trump orders the deportation of 11 million people.\n\nA normal Republican would have done missionary through a hole in the sheet. Donald J. Trump is not a normal Republican - he's going bareback ass to mouth.", "Or a guy who was a career politician for 30 some years was anti establishment.", "Which part are they lying about? \n\nThat Eisenach was a Verizon lobbyist?\n\nThat he's now helping Trump pick FCC members?\n\nOr that Trump campaigned on reducing the influence of lobbyists?", "You ... you do realize that state borders can't be gerrymandered right?", "Not cheating just an unfair and partial process that violated the DNC's own charter", "Yes opposing opinions are so terrible for our country. How do you suppose why stop all that nonsense?", "I'm not so sure they will do that. They know their days are numbered and need it if they are the minority again", "I'm honestly surprised trump hasn't dropped that tub of lard. What is he bringing that's so important? I don't think he is even popular in his home state. He's a political infection waiting to happen and bloom into a scandal. ", "It's probably a loyalty thing Christe backed Trump before any of the other potential republican nominees. ", "&gt; You mindless sheep\n\nProjecting much? Have you read the article? ", "He might be the new leader of cell block B if   Trump has any backbone.", "And then what?  Spend 8 years cleaning up and once things are starting to get better have the voters put the dipshits back in charge?", "Leaders in the Chinese Communist party have a policy for that. If one of their former premiers does something wrong the successor will not prosecute.\n\nThey're all politicians, there's always something to dig up. This way the country still functions even though the Communist Party is a nest of vipers.", "Millions more people voted for her. There wasn't cheating. ", "No no they were begging for it to be sanders because they wanted a tough fight.\n\nIt's like people cannot remember more than 6 months anymore ", "Don't feed the trolls ", "I was partial to \"A Future To Believe In\" and \"Not Me Us\". But even \"Make America Great Again\" was so much stronger than \"I'm With Her\"", "Yup. To this day I have friends that I very clearly remember crowing about voting for Bush in 2000 and 2004 that look at me like I'm insane when I remind them of it deny it completely, and act like some doppelganger took their place that day.", "You don't have to QUITE go fully west.  Colorado especially the Denver / Boulder / Fort Collins areas, is fairly progressive.  Our cost of living isn't quite as high as the coasts, and we're actually fairly bipartisan here.  You've got the big urban cities AND the rural agricultural areas.", "Weeks prior to election:\n&gt;\"The election system is largely a rigged system.\"  \n\nWhen asked if he'd accept the election results.\n&gt;“You hear so many horrible stories and you see so many things that are wrong. So we’ll take a look.\"", "Such a coincidence Wikileaks only went after one side. ", "&gt; I will be very surprised if Roe v Wade is actually overturned.\n\nWere you surprised that Trump was elected? Get ready for more surprises. ", "I try not to be so pessimistic in my personal life but I'm having a tough time reconciling this one.  Trump campaigned on things like term limits yet Mitch McConnell opposes them and it's laughable to think Congressmen would voluntarily limit their own influence.  He ran as \"anti-establishment\" yet one of his closest allies and likely cabinet members is Newt Gingrich, a guy who spent twenty years in the House and served as Speaker.  He pitched his \"what do you have to lose\" to African Americans yet supports policies that unfairly discriminate against them (I know Trump can't enforce stop-and-frisk as President, but it's easier for state and local officials to push it when the President supports it).\n\nI'm hoping that his supporters won't take too long to figure out he's full of shit and can't deliver on these promises but even then I don't really believe it, when people blame Dems/liberals for every problem in the world.  \"All the high population african american areas have mostly democrat officials and look how nothing has improved.\" Except tax cuts for the wealthy and increased military spending mean spending has to be reduced in other areas, one of the worst being education.  Reagan cut funding to education.  Not renewing the Bush tax cuts could have increased the amount we're spending on education.  But no, the government sucks at spending money and it's all a waste anyways so less federal income is better.  Fucking hell.\n\nI'm sorry for the wall of text, just venting.", "&gt;That's a serious question because without our current system, Oregon wouldn't matter.\n\nIn our current system, only battleground states apparently matter. States considered safe are ignored.", "&gt; I came to the same thought.\n\n...eww", "&gt;how can there be unity?  are minorities supposed to get behind the policies of the bigots?\n\nThey're apparently supposed to acknowledge that there was never any bigotry at all and it was all just a rhetorical tactic by 'the Left' to silence dissent via political correctness.", "This isnt Sarandon's fault. Hillary had 100 celebrities' eendorsements for every pro-Jill celeb. ", "Yes. That's why it's clearly a fuck you from the RNC.", "We have a right to life.", "8 years of stability in the face of the extremist right an island in between two of the worst presidents the US has ever seen.", "Trumpism is a hell of a drug.", "There's no evidence supporting that claim but you do you sugar. ", "Really just anywhere that's responsible for significant portions of GDP. You know no where important. Texas went 46%?blue this year which should be scaring the shit out of the GOP. In no comfortable world does your largest block of reliably republican electoral votes come within 6 points of flipping and it's been inching in that direction every couple of years for a few decades now.", "He won 30 of 50 states. He won what? 306 Electoral votes? Come on let's not be dense now. ", "The whole world's had record heat. Parts of Louisiana were submerged dozens of people died, millions of people lost their homes and livelihoods. Fuck's sake, California is drying up, they'll have no water left in a matter of *years.* Saying you don't believe in climate change with shit like that is like saying you don't believe in terrorism after two planes hit the WTC. ", "As a European I am not directly scared for my life but I do fear th implications a Trump presidency will have for international stability.", "Truth is the Dems don't really oppose it. They do not want to make guns illegal they want background checks.", "There's nothing wrong with rooting for him to do some good. But no one should have blind trust in him. ", "This is absolutely the real truth. Unfortunately a brief perusal of pretty much any right wing talk radio or media outlet will show that they constantly repeat the same tired fear-mongering refrain of \"DEMS WILL TOTALLY ABOLISH THE 2ND AMENDMENT!!!111!!1!\" and their listeners lap that up. It's truth-free propaganda.", "Compare:\n\n\"Yes we can\" = \"No matter how hard it may seem we can change this country for the better.\"\n\n\"Make America great again\" = \"America used to be great; I want to reverse every bad policy decision that led us down the path of losing that greatness.\"\n\n\"I'm with her\" = \"I'm a girl, vote for me.\"", "You know what's awful? Being 1/6 of the US GDP. And being Directly responsible for holding up the economies of 1/3 of red states  \n\nAnd the country elects an all red government and we had no say in it. ", "Thanks Guardian but you were part of the delusional and reckless media that kept feeding us the \"Trump Can Never Win\" bullshit and pushing Hillary down our throats.\n\nI'll pass on taking your advice.  I'll wait and see what Trump does and THEN I'll decide what to do. ", "Trump is going to travel around giving speeches while Mike Pence runs the country. God help us.\n\nReposting this comment from another thread about why Indiana hates Pence\n\n\nPence got the endorsement from the much-liked former Republican governor Mitch Daniels (now president of Purdue) basically with the promise that he wouldn't pursue a social agenda. Mitch Daniels was liked because he focused almost exclusively on the economy and government efficiency. He gave no fucks about social issues and it was implied that Pence, as the successor of Daniels, would set aside the social dogmas that he was known for and govern a state that was on a very good path, economically, after Mitch Daniels' two terms.\n\nHe didn't do that. \n\nFrom day one, Pence didn't govern--he played national GOP politics. Whatever the big firey debate of the day was among the national GOP, he grabbed ahold of it and pretended to be its conservative crusader, even if it had absolutely zero relevance to the state of Indiana. He spent time, money, and resources on championing issues that Hoosiers didn't care about or didn't support, because he wanted to pander to the National GOP's ultra conservative base for his future career. Essentially, he was using Indiana as a stepping stone. He never cared about being governor. He always had higher aspirations, and the governorship was a stepping stone to a higher federal office. Most Hoosiers, left or right on the political spectrum, espouse this opinion about him.\n\nAs I said before, Mitch Daniels literally gave no fucks about social issues. Indiana is generally a conservative state, but it's never been a state particularly hung up on social issues, and it's never been a state that follows the national GOP's social platform. Indiana has, for as long as I've been alive, been a business Republican state--politicians like the Bushes, Mitt Romney, etc. We voted Obama into office, and prior to Mitch Daniels in 2005, we had 16 straight years of Democratic governorship. Indianapolis, the capital and largest city in the state, routinely switched between Republican and Democrat mayors, and it has managed to have long-term plans and continue its momentum regardless of which party is in office.\n\nSo Pence, with his national conservative GOP politics, has been an aberration that has directly harmed Indiana's image and its pocket book. \n\nIn the three years since Pence took office, he:\n\n* Pushed through legislation making harsher penalties for drug crimes against the protests of numerous major legal organizations including the Indiana Bar Association, as well as most Hoosiers\n\n* Inherited a phenomenal state balance sheet from Mitch Daniels and used it as an excuse to push tax cuts so extreme (would have caused a tremendous deficit) that the Republican-controlled Congress shut him down\n\n* Tried and failed to amend the Indiana constitution to ban gay marriage, despite widespread polling that showed that Hoosiers didn't support it, and despite the vociferous condemnation of virtually every major business in the state\n\n* Since his gay marriage amendment failed, he literally, as payback (not exaggerating, the signing ceremony was invite only, no media was allowed or invited, but someone leaked a picture that showed Pence surrounded by well-known anti-LGBT extremists), came back with the Religious Freedom Restoration Act which was a genuine political circus. It humiliated Indiana on the national stage, directly harmed Indianapolis, and was met with, perhaps, the fiercest backlash by the people of any state in the Union. The extraordinary protests of Hoosiers and businesses allowed the state GOP leaders to basically coerce--to his visible chagrin--Pence to amend the law and \"fix it\" (this was actually the [front page](http://media.theindychannel.com/photo/2015/03/31/indy_star_fix_this_now_1427838279029_15914269_ver1.0_640_480.jpg) of the biggest newspaper in Indiana). \n\n* The RFRA was such a debacle that Pence ended up hiring an expensive out-of-state public relations firm to heal Indiana's national image. He couldn't answer why he chose an out-of-state firm. He couldn't answer why he chose such an expensive firm, when there are many firms in Indiana that could have done the job. It was eventually canceled, and was yet another waste of taxpayer money. To date, the RFRA has cost Indianapolis (a city that fought against it, changed the official tourism website to rainbow colors, and hung a huge rainbow banner at the airport) $60 million, and the total cost--to the economy and reputation--to the rest of the state is unknown. \n\n* During the gay marriage supreme court fight, he literally sent the Indiana attorney general to *other states* to advise them on how to craft their laws and fight gay marriage nationally. He did this on the taxpayer dollar. He continued to spend taxpayer money fighting gay marriage in the courts and with lawsuits despite, at the time, everyone knowing what the Supreme Court decision was going to be. It was basically a political stand by Pence; an expensive political stand that Hoosiers didn't support.\n\n* He fought to pass a law preventing cities from passing their own minimum wage statutes. Is this \"small government\"? \n\n* He has acted like a strongman (think Turkey's Erdoğan), doing everything in his power to make Glenda Ritz, the state superintendent **and an elected official**, quit her job, and barring that, stripping her of the power given to her by the Indiana constitute and the Hoosiers that elected her through backroom deals, conspiracy, and highly technical legal challenges. Just Google \"Mike Pence Glenda Ritz.\" You could write a thesis on it. \n\n* Everyone, literally everyone, was on board for receiving a *huge* federal grant for preschool funding. The Indiana Department of Education was literally in the final stages of the application process--and the federal government was happy with Indiana and going to give us an especially large chunk of money--when Pence came in and shut it down for no reason because accepting money from the feds became politically untenable among the national GOP tea partier crowd. And, of course, you can't be elected president--Pence's eyes were always on the future--without support from the GOP's far right base. After shutting down the process, he has recently been opining that it would be a good idea to get federal money to fund preschools... A year after he shit all over the Dept of Education's proposal to do just that. \n\n* The HIV epidemic in southern Indiana is out of control and among the worst in the country. Of course, we could provide free needles for heroin addicts like has been done in many states to curb HIV problems, but that is politically repugnant to Mike Pence. He also managed to get the Planned Parenthoods in that part of the state shut down, eliminating the opportunity for poor people to get tested. The HIV epidemic, which never had to be an epidemic, continues, and Pence gets to push the problem on our future governor as he goes to join Trump on the national stage. \n\n* Speaking of Planned Parenthood, Pence is highly proud of his accomplishment at passing the single most restrictive abortion law since Roe vs Wade. The law, HEA 1337 is far stricter than anything even in the Deep South and is almost certainly unconstitutional. He knows that it's probably unconstitutional. Nevertheless, Indiana taxpayers will spend millions of dollars for our attorney general to fight the law all the way to the Supreme Court, just so Pence could make his political statement. \n\n* He literally tried to make a state-run news agency that he would then give exclusive interviews and access to. I don't even know if that's legal, but he tried to do it and was promptly crucified by the media and even his own party. \n\n* He asserted authority to ban Syrian refugees from being settled in Indiana. He has no authority. No governor has. He knew that, but he was planning to be a GOP presidential candidate, and he needed to show that he was strong and anti-Muslim refugee to appease the national GOP base. He took leadership role in this discriminatory crusade, appearing on national TV to preach his ignorance. This particular event managed to throw multiple refugee settlement organizations into disarray--which, by the way, actually include the Catholic Church of Indiana (the arch bishop of Indianapolis publicly criticized the governor)--and several Syrian refugees which were well into the process of moving to Indiana had to be relocated to another state. Pence didn't back down until the courts affirmed that his order was unconstitutional.\n\n* He shut down a highly successful energy efficiency program--one of the first in the nation, making Indiana a trailblazer--initiated by the Indiana Utility Regulatory Commission with the support of previous governor Mitch Daniels. He did this for no good reason, other than to signal to his far-right constituents that he was fighting against Obama's evil despotic EPA. \n\nThis is all just in his three years in office. He is reviled across the state, and especially so in Indianapolis. There is (was--now that he's the VP nominee, he can no longer be governor) a bipartisan *Pence Must Go* campaign to get rid of him, and there are literally [billboards](http://media1.fdncms.com/nuvo/imager/u/original/3821872/pmg_billboard.jpg) and [yard signs](http://media.theindychannel.com/photo/2015/04/17/16x9/_Fire_Pence__signs_go_up_after_RFRA_2839710000_16967639_ver1.0_640_480.jpg) plastered all over the city. Pence is, by virtually all objective measures, one of the worst governors in recent Indiana history, at least in terms of working for the benefit of the state. He has basically focused on far-right Christian social conservative interests to the clear detriment of all else, most importantly the current and future well-being of the state's reputation and economy. ", "Yeah I was constantly called a white privileged Bernie Bro on reddit. \n\nI'm a Mexican American woman -_-", "\"This isn't what Putin told me.\"", "The lies worked though. That's one of the most depressing parts about this.\n\n\"Clinton would have introduced Sharia Law...glad we got Trump\" is one fb message I recently saw from an old timer.\n\nIgnorance and hate won this election.", "&gt;Fuck sending CNN clicks....\n\nI agree. But I'm stunned this is so close to the top. Especially in /r/politics. Because you know, just a few days ago....", "Just like he isn't going to put a climate denier in charge of the epa\n\nOh wait he is", "If he withdraws from the Paris agreement he can get fucked. ", "So California has a self-sustaining economy pays taxes without getting anything in return, and is ignored by politicians because it's people's votes are only worth a fraction of those in other states.\n\nSo how long until California goes all 1776?  I mean, probably not violently, because let's be real, it's California.  But surely people have got to be thinking if the other kids in the sandbox are just going to throw sand at them all the time, maybe they'll just pick up their ball and leave?", "If that's what they want then the red states should stop taking so much of California's money. We should not be single handed holding up 1/3 of red states with our tax money that we will never see. \n\nIf the right wants to make everything done by the states then they need to stop begging for money from us when they fail there state. ", "Agree but he may surprise us and it would not be the first time. It is a lot easier to antagonize and attack than actually govern. \n\nThere is going to come a point, and I imagine it will be on a dreary February/early March DC day where Trump is going to be sitting in a cabinet meeting being briefed on an impossible humanitarian issue half way around the world in a place he never actually thought existed. He is going to be sitting there thinking I have 4 more years of this shit and I am worth a lot of money and could be playing golf in Mar-a-lago right now, but I am here in a 3-hour meeting trying to figure out a problem I can't solve. This is a completely thankless job and 50% of people will hate me no matter what I do. \n\nI wish I could be there for that moment. ", "The Best Care", "&gt; For all we've always heard about how intelligent Hillary Clinton is it hasn't often translated into good decision making.\n\nYou know... that particular observation of yours is right on the money.  She has made one baffling decision after another throughout the years, hasn't she?\n\nThe Iraq vote, then that very same night she scurried into her limo as reporters tried to approach her for comment.  \nThe credit card companies vote, after preaching the very opposite of what she voted for, some years before (I believe it was on Barbara Walters).  \nThe mixing of Clinton Foundation collaborators and State Department foreign players.  \nThe private email server.  Nuff' said about that, we're all sick and tired of it.  \nThe Wall Street speeches, not releasing them, answering to Bernie in one of their debates \"It's what they paid!\"  \nHer near collapse at the 9/11 memorial, the tacky theater of kissing the child while coming out of Chelsea's apartment.  \nAs stated up the thread, neglecting working-class voters against the warnings of her own politically savvy husband.  \nThe five thousand dollar Armani pantsuits.  Not driving a car for over twenty years.  Trying to project the image as a woman of the people.\n\nThen there's Bill.  Bill Bill Bill.\n\n\"Don't ask, don't tell.\"    \nSigning the bill to deregulate the media industry, allowing the nation to be carpet bombed with the Murdoch and Limbaugh propaganda networks.  \nSigning the bill to revoke Glass-Steagal and setting up the 2008 economic catastrophe.  \n\"I did not have sexual relations with that woman.\"  Then later \"Indeed I had an improper relationship with that woman.\"\n\nThen this year,  \nThat little \"private talk\" with Loretta Lynch with reporters watching but out of earshot at the Phoenix airport.  \nHis angry defense of the \"super predators\" fiasco to a woman while stumping.  \nShitting on Obamacare while also on the stump.\n\nBut particularly with the Loretta Lynch/FBI thing, what the hell, was he actively trying to sabotage his wife's campaign?  Because that was either on purpose or sheer monumental stupidity and hubris.  Yeah, probably the latter.", "Brexit deja-vu.", "We know his climate policy. He's not changing it. All we can do now is root against him.", "I voted for Hillary but I don't think she lost because she was a woman. I honestly think she lost because she didn't listen to those whom were suffering from economic policies and trade agreements from the 80s and 90s. It this just shows they still didn't get it.\n\nThese people seriously need to look past their biases. This should have been a cake walk, but it seems like 4 more years of Obama, which in hindsight and deeply looking back, is not what people wanted. I wasn't enthusiastic about her at all, because of she, technically the DNC, fucked Bernie - a guy people would vote for because he is principled and not owned by the elite. She also alienated the non-racist Trump supporters, which was her biggest mistake. She should have listened to them and I think they would have voted for her, but no in her arrogance she missed that chance and so did many of her supporters.\n\nI too am guilty of not listening. I never new this part of the populace was suffering. I also realized that I had allowed the media to blind me to the fact that not all of the Trump supporters were like their candidate, just people who felt they were being heard by at least someone. Michael Moore's prediction was spot on how Trump would win, because Hillary ignored the old democrats from factory towns that were affected by NAFTA and other policies. These people probably would have voted for her, if she would supported the same changes as Bernie and Trump, but no - she wanted to be a globalist.\n\nFun fact, just about every other country out there in the modern world protects its labor force. America is the only one with trade agreements that are most likely to fuck someone over - who is not already rich. Needless to say, this Bernie supporter was devastated that Trump won, but we as Americans deserve this punishment and so does the establishment. We failed each other, by not listening to each other and making assumptions based off our own biases thanks to our shitty media. ", "But I thought he had evidence all along that the election was being rigged? \n\nI don't understand President Elect The Donald -- was it fair or was it manipulated from day one by shadowy figures with brown skin and prominent noses? \n\nYou're going to be the President of the United States. It's time to stop reacting to the smallest provocation like a spoiled schoolgirl.", "oh cool he is holding a flag. I guess that evens out picking a VP that believes in conversion therapy.", "Seriously. It was very frustrating for them to say if you're not with her you're not with women. I prop up support, and and respect my girlfriend, mom, and females in my life any and every way I can. \n\nFor them to imply if I wasn't with her I wasn't with women wasn't just insulting enough for me to not vote for her, it was insulting enough to some of those aforementioned women to also not.\n\n....its called flip flops, untrustworthy, policy positions, and baggage there HRC. Not no penis no white house.", "I expect we'll be seeing some \"post-Brexit\"-style interviews soon with protest voters who \"didn't think he'd actually win.\"", "Indeed.\n\nBut I don't think that's cause to blame them. She failed to work for them she betrayed them. I don't agree with it(the risks from 4 years of Trump and a conservative supreme court are too big), but you could say \"let her fail, let the DNC that betrayed us fail with her, and then we can finally fix our party\". It's a risky gamble, but while they may be co-complicit in this, it is equally the fault of the DNC and Hillary in failing to work for them, betraying their trust by lying to them and deceiving them.\n\nI don't know what to think. I'm happy the DNC and Hillary got wrecked like they deserved, but I'm very worried about a Trump presidency and everything that includes. If I was an American I'd have voted for Hillary despite how much she and the current DNC disgust me, but I can certainly see why people would refuse to.\n\nObama gave us hope and inspired people. That's why young people came out. Hillary only gave fear of the Trump. She was the not-Trump candidate. Thoroughly dislikable and corrupt, but at least she wasn't Trump. Politics of fear have to stop.", "If there are safeguards against naming a boat \"Boaty McBoatface\" where the fuck are the safeguards against giving a clown the most powerful position on the planet?  A freaking *name* for a freaking *boat*.", "The fact that he's already tweeting again and accusing protesters of being \"paid\" and incited by the media (huh?) proves, without the shadow of a doubt, that Trump is _exactly_ the person he was elected to be.\n\nHe's not going to drain the swamp at all. He's just stirring it with a stick. A racist, sexist, homophobic, xenophobic, bigoted stick.\n\nThe US needs upheaval at this point. Not necessarily revolution (if you're not actually going to revolt, stop using the term, you're only hollowing it out for everyone else who _actually has_ real revolutions), but political tumult out of which can rise an _actually_ progressive side, and a responsible, mature conservative side. Those two sides then have to find a way to rise above the urge to clash together Thunderdome-style, and instead focus on what the US government was originally designed to do: compromise.\n\nThe US government system was formed without parties, with the express opinion that parties were dangerous and would lead to factions and stagnation. Guess what, they were right. You need to abandon party lines and learn to work towards actual goals, compromising as you go until you reach something that is, at least, a step forward for both sides.\n\nThat's what you have to demand of your elected leaders. Not that they be more \"democratic\" or more \"republican\". Those labels are dead now, along with \"liberal\" and \"conservative\". The will of your people transcends binary labels, and your elected officials have to start accepting that and working with that as a premise.", "Politicians always do this. They form alliances that shift and turn direction. That's just how it works. For example Obama ran against Hillary; they were rivals. Eight years later, he and his wife are stumping for Hillary like crazy.", "I think that narrative is way over blown. She withheld her endorsement until the general.", "I guess the Electoral College was supposed to be a \"safeguard\" to some degree but in this case considering Hillary won the popular vote, the safeguard has completely failed democracy. ", "Suspicious isn't so much of a problem. Dismissive is.\n\nLike when Bush was dismissive of repeated intel reports that Osama Bin Laden was about to launch a large scale terrorist attack in the United States ... in August 2001.\n\nTrump being arrogantly unwilling to engage with our intelligence departments is about to make our country a whole lot less safe.", "To be fair that last paragraph is probably in the signature used for every email sent out. Every workplace I've ever been at has something similar.\n\nThey should still eat a bag of dicks tho.\n\nFunniest part about them not raising money for her? She won her re-election with 81% of the vote. HA!", "It shows how keeping large numbers of uninhabited states separate serves to enshrine minority political views in positions of power. Done *correctly* this can be a boon to your country operating smoothly. However *that* political minority is one that wants to actively suppress and stomp on non-political minorities for everything from their ethnicity, religion and sexual orientation. They refuse to accept basic facts about the world, including basic observable science.\n\nTo defend against tyranny of the majority you *must* ensure basic rights and protections for everyone, including minority populations. This put the voting minority in charge crap isn't doing that, it's actually redefining the meaning of majority and putting them in a position to tear down every institution that holds this country together. Knowledge and well-reasoned governance aimed toward broad consensus is the real defense. GOP isn't even pretending, now watch them try to impose their shit nationally without regard for their prior talk of states deciding.", "States cannot negotiate treaties with foreign nations. :/ ", "lol more like wolf dressed as wolf telling sheep \"I'm not a wolf, believe me.\"", "Rigged if I lose fair if I win. He's played that game his whole life. He has a child-like, spoilt brat mentality which will make it interesting to see how the next 4 years play out.", "The thing is CA directly holds up the economy  of 1/3 of all red states with our tax dollars. The right will never let us leave we are paying for their failed states. ", "I'm happy that Jerry Brown has been a good governor. Hardly see any media coverage on him. He did a good job making hard choices and tightening the belt on the budgets to close the debt. Hope he could run for pres ;)", "Trump looked shell-shocked leaving the white house today. The reality has hit him and he does not like it. ", "I'd imagine they'd only pull the nuclear option to get a justice nominated.  They'll leave the filibuster intact otherwise.  It's just damn too damn good of a strategy for them.\n\nRead in between the lines when listening to McConnell:\n\n&gt;\"Nothing is forever in this country. We have an election every two years right on schedule. We have had since 1788. And so I don't think we should act as if we're going to be in the majority forever\" cautioned McConnell. \"Overreaching after an election is, generally speaking, a mistake.\"", "The EU isn't falling apart fiscally because it is not a fiscal union. Never was. It's highest level of integration is a monetary union in the EZ.\n\nThe EU is falling apart because the Euro cannot be sustained. The only way the Euro is sustainable if the EU moves forward with a  fiscal union and political union. And that's just simply not going to happen.\n\nEDIT\nI think the EU will evolve into Eu2.0 with the Germans/Austrians + Scandinavians + Benelux states. That will work, because they are educated, from the same culture and has the motivation to make things better. They will integrate politics, economics and defense succsessfully.", "What about those lower middle class folks that had to decide between paying for rent or their health insurance so they could subsidize your insurance?  They don't matter?", "I'd like to just focus on Bernie moving forward to fix the very obviously broken DNC. Why does it matter what happened in the past during the now very-dead Clinton campaign? Please can we move on and focus on the shit-storm that is a Trump presidency?", "&gt;She may have overestimated how much that matters to Cubans in Florida though\n\nI think she overestimated how much that mattered to anyone. The funny thing is that a lot of immigrants who migrated legally don't take to fondly to those who come illegally. ", "Huuuuuuge care and Bigly", "Well the young vote did turn out considerably less than it did for either of Obama's elections.", "It sells really fucking well.", "Or maybe right when she lost in '08? I think probably that.", "You lot don't even understand what an \"alpha\" man is. Not that it's even a real thing but if this man is your bar for those established principles, you really haven't the first idea.", "Nice tantrum Guardian.", "Wow that was quite the mutual masturbation sesh you folks had there.", "I respect the hell out of him for trying.", "Larger economy too\n\nhttp://sanfrancisco.cbslocal.com/2016/07/05/california-economy-gdp-6th-largest/", "The mistake people made was equating health insurance with health care.\n\nThey are not the same thing.", "Oh god please tell me this is not happening.  The President elect of the United States first attempt to deal with decent is to mock and belittle the protesters on twitter.  \n", "That's honestly the main reason why I can never support Trump. We absolutely need to finalize and carry out the Paris agreement. It still wouldn't be enough but it's a step in the right direction", "I cannot think of a more apt foil to Trumpism than the first Muslim elected to congress.", "\"its rigged with super delegates so outsiders and independents can't hijack the party\" \"Why didn't the outsiders and independents support us? We needed them to support the party to win\" the dnc and their supporters in a nutshell", "Your attitude mirrored in Congress and the White House, is exactly why they want to secede.", "So... he won them then? So that means he won right?\n\nJust making sure, you seem to be under the impression that I am confused but if he won then I am right, correct?\n\nCry about it. \n\nHe won Pennsylvania by over 2%, he won Ohio by 9%, Iowa by 9%, Utah by 20%, AZ by 4% and NC by 4% Not to mention the red states that she was supposed to flip or get close to flipping: Georgia 6%, WV 42%, MO 19% and Texas 9%. ", "I knew and expected it. I'm in Ohio. I work in every type of neighborhood and among every racial group possible.  They all were angry and wanted change. Many saw Trump as the culmination of the American Dream and his rhetoric was what a lot of legal immigrants remember from their studies for citizenship.  They could see just how much he moves this nation. \n\nCombine that with ever increasing disenfranchisement of rural white and black voters, and you have a pot boiling over.\n\nI honestly thought we'd lose up until about a week before the election. When hillarys ABC poll numbers tanked and the narrative changed, I knew we had won. I was one of few at the victory party absolutely sure of our victory. I could see the signs in everyday life. Trump became a meme, part of the American collective. \n\nNow he's our president. It's amazing and insane at the same time. ", "I'm proud of my state. Some things I don't agree with but for the most part the policies align with mine and I'm cool with that.\n\nBut talk of California breaking off isn't productive. I understand people are upset and disappointed in the country (the states that elected Trump at least), but Republicans have been crying about the big bad federal gov't getting into state matters (states not allowing gay people the right to get married for example) and not respecting the rights of the states for a long time. Whatever crazy agenda a GOP gov't tries to force on a federal level, the West Coast and the East Coast won't let it fly. We'll fight it through the means provided by the Constitution. \n\nI would laugh at Texas with their calls to secede, now I'm chuckling at California. It *sounds* good cuz we're all pissed off, but if we secede I can see the GOP invading the state and setting off another Civil War. California would have to supply its own currency and military, two very important things that a nation needs to protect itself and most importantly its citizens.", "17th GDP and is in debt to the tune of $400 billion. Issuing IoU's to state employees in lieu of wages. You're joking surely. ", "In what possible sense was Clinton 'establishment' in a way that Trump isn't? How deeply are he and his entourage invested in interests people apparently don't want to have any clue about and which go directly against the interests of the people (and humanity at large) ?\n\n&gt;America’s environmental agenda will be guided by true specialists in conservation, not those with radical political agendas. \n\nThe dark, sinister gall on this guy. Is that willfully ignorant or evil?", "Now of only that were true for red states they fuck up their own economy and demand California tax dollars to prevent them from falling into a 3rd world country. \n\nRed states are currently the welfare queens of America. Ots about time they took some responsibility for who they elect. Give us back our money so we can actually use it instead of proping up failed economies. ", "Well-meaning somewhat successful, intelligent, classy and articulate?", "Hillary is smart in the book-sense but not the critical thinking sense. She can learn a bunch of stuff, but implementing it is an abyssal failure. Colin Powell was right in saying that anything she touched turned to ashes. Her time as Secretary of State cemented that belief.", "He'll just blame Congress and probably Obama and Clinton too.", "I am pretty far left (certainly in the context of American politics) and I am very very critical of Islam and religion in general", "darn! well I tried but you're just too smart for me. you are smart enough to know that any truth that contradicts your tightly held convictions is a conspiracy organized by \"the liberal media\"\n\nand you are smart enought to not let any information into your hermetically sealed bubble lest any ray of sunshine invade the dark crevices of your brain\n\nyou are intelligent enough to restrict your information diet to Brietbart, Fox and other \"non-biased media\"... you know, the ones that confirm your beliefs and take care to never ever show you anything that may not conform 100% to what you already believe to be true\n\n", "That's because Democrats actually want to help the country.", "He's not a racist yet has publicly denounced all minorities. He has publicly denounced women. And his words go back before his campaign. Stop masking it. The American people do not want this man to represent us nationally nor internationally. \n\nAnd no we do not have to support his atrocious policies that will harm us. And we have all the democratic right to oppose him otherwise we have a totalitarian state. There's an irony in the fact that Obama was opposed at all stops but Trump somehow deserves no criticism? It doesn't work like that.\n", "Yes.\n\nEvery time a demagogue has come to power in a Western country their list of enemies always includes the Jews. Trump's closing argument was straight out of the Protocols of the Elders of Zion, and his supporters have already expressed an antipathy for Jews on the same level as blacks, hispanics, and muslims.\n\nTo put it another way, I don't know in what order they'll come for me, but I know they will.", "It is probably not constructive. But the situation is frustrating. The reality is the west coast states (among others) are subsidizing the anti-science anti-education, anti-worker state governments across the country. Do we not have a moral obligation to put an end to that? And given that it now threatens our way of life, should we not take steps to protect ourselves?", "Help doing what?  Dismantling Medicare and reneging on our international agreements?", "I can't help but feel like with the way this year went it's a case of \"strike me down and I will become more powerful than you could possibly imagine\" for Bernie and the more socialist leaning folks in the country... hard to articulate that further it's mostly a feeling, and the left needs to simmer down over the next while before we can see how the establishment reacts to this all ultimately.... I don't think they can escape the reality that everybody knows though, that Bernie would have won.   A shirt on a stick would have won in either position versus their opponent.", "Kids haven't moved out yet they don't know that memes don't pay bills.", "I think that's the proper perspective.  The only thing that changed overnight was the illusion about the kind of country we live in.  And frankly even if Trump lost we're talking about only a few percentage points difference.  We should have already been horrified.", "There's a lot of insight into this in the 30 for 30 episode about the summer football league. Trump basically destroys the entire experiment and crushes the legacy of its most passionate supporter shortly after his death all in the name of business and genuine indifference. ", "When you're surrounded by yes-men and yes-women the reality distortion field is real.  \n\nI've been watching TYT's post-election coverage, and going back to watch some of their earlier videos, and they're really nailing it. Very informative, without so much bullshit official spin. ", "They're gonna bitch no matter what.", "Hey I'll just adress this as a general sentiment, without specifics:\n\nIt's not required to be an ecological saint in order to criticize wasteful policies and behaviours. Nobody's asking anyone to immediately stop using all fossil fuels.\n\nGradual improvements help too. And systematic changes are most important anyway. If a law of some sort would go into effect forcing the country to reduce carbon emmissions by 5% every year for the next 10 years, the results would be absolutely massive.\n\nOn the other hand, if everybody who has ever posted on reddit immediately stopped all consumption of non-essential or imported goods, that would hardly make any difference.\n\nMaking planes 10% more efficient is a much, much better way to save energy than telling people not to fly.", "Or the same dumbass. Depends on how much power he really has going into his presidency with the Republican majority in Senate AND House AND eventually with SCOTUS I can see his second campaign (cringe) talking about how he was the only one who used the nukes to defeat the enemy when no one else has and now everyone fears and respect the US. Scares me to think about the voters recently who might have voted for him in support of this and if he runs again, how many would do the same thing again in addition to those who would then support him.\n\nWild speculations, I know, but this election has lowered the bar as far as the quality of leaders who run for office. This applies to those who elevate them too - DNC seemed to have burned the bridge between themselves and the voters the moment Bernie dropped out. RNC apparently do not share Trump's values but when votes become anti-Hilary rather than Trump votes, yikes. Someone's not paying attention to the issues voters care about..", "They can have a different opinion from you. Dismissing people's concerns won't help this country operate in this polarized era.", "Are we really going to drill offshore in protected areas?  Are we really going to drill in our wilderness areas?  So much for wide open spaces.", "Well the elite have a chance of surviving Trump Presidency the rural poor won't be as well off.", "The thing is you threw out your ideologies for your values.  You will now have a conservative supreme court which will last decades.  Environmental protections will be eroded at a time where it is critical they be strengthened.  There's really no telling how far the damage will actually go.\n\nAnd what did you do this for? To teach the DNC a lesson about fairness? Are you sure they learned that lesson?  Are you sure they didn't just learn that the progressive left can't be relied upon, and that they should abandon such voters, move further right with their policies and hope to court moderate voters that can be relied upon?\n\nIts great to champion values, but not at the risk of sacrificing everything else you hold dear, and certainly not when it's questionable if your values will even be adhered to.", "Honestly when something hinges on the rights of someone else, yes, it equates to being fucked. Gay people do not hurt the rights of straight people. Straight people removing gay rights DOES hurt gay people though.\n\nClimate change is real. If we don't step up soon, we're  going to fuck up our country, our atmosphere, and this world.\n\nImmigrants are not what's causing issues in our country. But they're the easiest target. It's a lot easier to blame a random Muslim or Mexican immigrant for the economy than the people in power who legitimately do not care for the middle class. I get people are angry, and a lot of middle class white voters especially. But they voted for a man that does not pay his bills. He does not care for the middle class. He is completely a part of the one percent. That being said, the blame is being pointed on immigrants and while I don't think Trump voters are all racist, Trump has a lot of very dangerous plans he says he wants to enact.\n\nDisagreements are fine. Everyone comes from a different background. But things that legitimately hurt other human beings are not \"just differing opinions.\"", "Doubling the military budget while cutting taxes on the rich and corporations?", "Think about what you just posted.  You're finger wagging at me about helping the country operate in a thread titled \"This is no time to be diplomatic.\" ", "Why come out against him now after the Election?", "Leave it man op can't see how shitty of a candidate Hillary was.   While he is pretending Hillary was robbed, liberals living in reality can vote in 2018.  We can still fix this.  And by this I mean the DNC.", "During his presidency? No I feel fairly safe for the next four years. I'm somewhat worried that his thin skin is going to lead to a war, but not to the degree I'm willing to panic just yet.\n\n As a long term result of his presidency? Fuck yes. Climate Change is the most significant problem facing us in the coming years. Famine and war are an inevitable result unless we do something *now*. Under Obama we were finally able to start addressing it. Now all of that progress is going to be lost with four years of disastrous negligence on this issue.", "It is totally fair to call a terrorist attack carried out to further an Islamic cause radical Islamic terrorism it is not bigotry. People aren't morons, just because some politicians refuse to say it people aren't going to not recognize it for what it is. But it is treating the populous this way which is part of the reason why people are so frustrated and distrustful of politicians right now, which is part of the reason why people have turned to Trump. Make it clear that it is not all Muslims, that this is a small subsection of the population, and that a Muslim American is just as American as anyone else, but pretending that radical Islamic terrorism doesn't exist just breeds resentment.", "Vermont tried single-payer and couldn't make the numbers add up. Could California do it with its nation-sized economy? Maybe, but it would become the laughingstock of Trump's America if it fails. ", "Well if we were to go with the libertarian approach looting and rioting is just an expression of free speech and the free market will eventually sort those ruffians out.", "So much weed.", "This makes me consider the fact that Russia might have tampered with votes.\n\nTrump feeds into many of those goals.\n\nAnd Russia has already admitted to working with Wiki Leaks.\n\nAnd internet security teams reported having to fend off Russian hackers on election night. And they suggest we recount and make sure nothing was compromised.\n\nAnd the whole idea that by Trump claiming Hillary would rig the election he would achieve two things. Deniability about his election being rigged and he got her to say America should stand by whoever is elected, cementing an endorsement.\n\nI mean. It's a conspiracy theory. And I'm not going to protest like it is real, but it is one of those things we won't be surprised to learn about in 10 years", "&gt; I peacefully protested the Iraq war walking in a peaceful display in DC many years back. That is really the only thing I have ever done.\n\nSorry you wasted your time and energy on that. Here's a suggestion for what to do next time.... \n\nIt breaks my heart to see good movements expend tons of energy and resources on protests that are not very effective.  Liberals for the most part have been fed and bred on this \"make noise and people will pay attention\" red herring that is not only false, but a story DESIGNED to waste energy in the most inefficient manner. \n\nI wish people would realize that marching does nothing *by itself*. Look at some marches that WERE effective: \n\nMLK: led marches that were intended to get people arrested for blacks hanging out with whites SO THAT HE COULD CHALLENGE THE LAWS IN COURT. The marches were just a means to an end. After being arrested their legal team led by Marshall came in and kicked ass. The strength of what MLK and Marshall did was in boycotts and legal challenges. That was the success strategy of MLK. Not just marches.\n\nGandhi: his \"salt march\" was a boycott convincing people that they could break the law which forced them to buy salt at inflated prices. Kids today think that Gandhi just had people sit around and get beaten. NO. He said it was peaceful activities that had economic and legal impacts. Under his direction British revenues were crippled. Dropped some 40%. That is what got stuff done. Not the marches.\n\nEgypt: Successful: Leverage Point=Economic: Shut down commerce across the country\nNotes: [\"everything but the stock exchange and some other key commerce sectors were down\"](http://www.techedon.com/2011/02/01/web/egypts-government-enacts-complete-internet-blackout/), large impact of [\"$310 million a day, ... tourism could take a hit of up to $1.5 billion....in cities across Egypt banks locked their doors, factories stopped production and large numbers of workers vanished, further straining the economy. EgyptAir said Sunday that it had canceled three-quarters of its flights during the crisis, losing 80 percent of the revenue it expected to collect. \"](http://www.washingtonpost.com/wp-dyn/content/article/2011/02/14/AR2011021405746.html) When Mubarak resigned he said (paraphrasing), \"I'm stepping down so that commerce can return to the area.\" \n\n\nTLDR; Marches by themselves have NEVER been effective. Look what millions of people protests did pre-Iraq war? Nothing. Did the protests stop the GOP in Wisconsin from ramming through their legislation? NO. Did OWS stop or change the objectionable banking practices? No.\n\nIt is activities which drive change directly by economic, legal, or having direct political change (e.g. voter drives, recall petitions, etc) which are effective. Nothing else. Yet the left has been brainwashed to think that making noise by itself is the best way to make an change.  It isn't. ", "“Folks who do not like guns [are] fine. But we have millions of people who are gun owners in this country — 99.9 percent of those people obey the law. I want to see real serious debate and action on guns, but it is not going to take place if we simply have extreme positions on both sides. I think I can bring us to the middle.”\n\nEven Bernie's stance on gun control is somewhat moderate. All he's asking for is a conversation which is a better way to go than to have as he says \"extreme positions\" on the subject.", "With the media calling victory chances as high as 98% and people laughing at Nate Silver's 70-ish% odds... no doubt complacency was a problem (among other things).", "Trump Supporters:\n\nMAGA! YEAHH\n\nSo how's he going to drain the swamp? What does that even mean?\n\nDRAIN THE SWAMP MAGA LADS\n\nOk.. Hows he going to make America great again exactly?\n\nBY MAKING IT GREAT LORD KEK MAGA\n\nRight. Any policy you like inparticular?\n\nPRISONFORHILARY MAGA", "This is the case for a lot of demcorats but Hilary shot herself in the foot by taking the extreme stance that you should be able to sue law abiding gun manufacturers.", "If that goes forward then I think the only American thing for everyone to do will be to loudly and publicly convert to Islam. If he wants to put all Muslims in a database then we should make it the largest database possible. I may not be religious but I'll gladly say I'm a Muslim if it makes Trump put me in his database.", "&gt; I will say this Hillary Clinton has got to go to jail.\n\nand \n\n&gt; Folks, honestly, she's guilty as hell.\n\n[Donald Trump, June 4.](http://www.cnn.com/2016/06/02/politics/donald-trump-hillary-clinton-imprisoned/)\n\nThat doesn't sound like someone who is going to appoint a special prosecutor and defer to their judgment.", "It's my turn I'm basically Obama, I'm a woman. ", "He would never deregulate the banking industry and put the people that caused the crisis of 2008 back in power.\n\nOh wait. ", "\"taxation without representation\" sound familiar?", "Yea all the comedy shows were out of touch and annoying as fuck. Dismissing the concerns and enthusiasm OF THEIR CORE DEMOGRAPHIC. Like how far up your own ass can you be?? ", "Simple.\n\nFrom 1960 to 1980 America went from being the country that had never lost a war and had the strongest economy imaginable to being a country that had to deal with gas lines and several military defeats on end [Vietnam Iran and Pueblo hostages.]\n\nThere were two choices; Jimmy Carter, who asked Americans to think about the future and face tough choices and do hard work, or Ronald Reagan who said that we just had to smile and invade Grenada to get our confidence back.\n\nThe people who voted for Trump really believe that there is a fast and easy way to re-open america's steel mills.\n\nIt isn't going to be pretty when things don't change. ", "This election it's silly for another reason as well.  California was voting to choose between two Democrats for senate.  That means 100% of the votes cast for senate in the largest state in the nation (about 8 million according to NYT) went to a Democrat.  It was the only state that didn't have both parties represented in the race for senate.", "&gt;Run in 2012\n\nSince Trump won time has literally started to regress backwards", "It sucks because the people who voted him because of their states economic issues stand to suffer the most from the the polices he's gutting or enacting. His tax cut ideas aren't helping the struggling dude in Detroit. It's helping the CEO who gave Detroit the finger and bailed out to Mexico for his manufacturing needs.\n\nThe clean air act and the EPA were massively popular Nixon era polices. Do people not remember just how bad things were back then before Nixon forced polluters to clean up their messes? ", "Seriously. I have the paragard which will last 10 years. Fuck taking any chances with the \"war on women\" party.", "Ahaha dude i'm not a trump supporter. Nice assumption though, I thought he was a joke candidate. But it just goes to show man, your reaction of \"all his supporters are stupid racists\" ahahahhahahahhahahha jesus dude. ", "Speaking of trade it would be nice to get a bigger share of all that tech, defense, and avocado money.  Right now California only keeps something like 30% of the money it makes.", "Moderate Left is fine. \n\nMachiavellian Left is not. ", "We can follow the wise advice of Bernie and work with Trump where he falls into line with our values and vision. He can be the president for all Americans if we engage constructively without rioting screaming, or burning his effigies. The poor guy just won, and did his best during his victory speech to be conciliatory. We CAN work with him if he is for real about making America A better country.", "&gt;  but I really wouldnt expect some random reporter to know that\n\nAre you serious about that part? Fucking _I_ know that and I'm a mid-twenty-european with a marginal interest in politics.", "Could have fooled me with California new jersey, etc. Or the pushes for arbitrary bans like assault weapons bans. Honestly pretending the Dems dont hold some egregious positions on gun rights is pretty fucking disingenuous. ", "&gt;  The truth is that if I did anything similar to what Hillary did in the email server thing I would be in jail for long long time. \n\nDid What? The FBI already looked into this and said there was no criminal intent, no evidence of hacking, and no charges should be filed. The \"lock her up\" hoots are as well sourced as the birthers who claimed Obama wasn't born in Hawaii. Enough already of the conspiracy woo with \"evidence\" from conspiracy sites like Alex Jones, Breitbart, Limbaugh, Hannity, etc. If there's actual evidence - that's what the courts, FBI, etc are for. ", "The fact that no one sees this is also fascism 101.", "Or at all.  I think most people who voted for Trump wanted him it's just that Democrats couldn't be bothered to get out there and vote ", "The Clinton campaign had no message whatsoever.  I live in a swing state (that Hillary lost of course) and was subject to the full brunt of campaign messaging.  Do you know what I saw?  Endless tv ads trying to shame me into not voting for Trump because he said some mean things.  I owed it to my nonexistent daughter not to vote for Trump.\n\nA half a billion dollars in shaming commercials!  Treating people like a dog in need a shame sign around its neck if they even consider not granting the ascension of Queen Hillary is not the most effective means of persuasion.", "I live in CA and the conversation of seceding has been coming up a lot since the election. I have no idea how it would be possible legally and what it would realistically lead to but we're already bigger than most countries in size and economy.", "I voted for a guy that spread fake infographics about how murderous back people are but you can't call me racist. \n\nI voted for a guy that that claimed thousands of US muslims were dancing on the street during 9/11 but you can't call me xenophobic.\n\nI voted for a guy that bragged about being free to commit sexual assault on women but you can't call me misogynist. \n\nIn fact you can't criticize me in any way because safe spaces are stupid.\n\nAnd that guy became president because white privilege doesn't exist.", "Trump means most everything he says it's just that most people find what he says unreasonable that they don't believe it. Just watch, we're kinda fucked.", "The problem with this is the DNC is a big tent. It's not just for progressives. I'm moderate left do I no long have a place in the party?", "It'd be different if we'd just delivered ultimatums but we explained why she was unacceptable, clearly, over and over, with hard stats and citations... and the echo chamber just wasn't having it.\n\nOh well. Justice is sweet, if expensive.", "Where have you been since September when he named the most vocal climate change denier to be his EPA transition leader?", "Wikileaks isn't going to touch Moscow's golden boy.", "\"Your arrogance and hubris lost you the election.\"   \n   \n\"I see your point but **more arrogance and hubris**.\"   \n   \nFuck it these assholes deserve Trump.", "If marriage equality gets overturned or even Roe v. Wade, I will be shocked. \n\nThere is absolutely no way it happens. If it does, feel free to save my comment and I'll admit I'm wrong, but there is no way the SCOTUS overturns arguably it's two most famous legacy decision's. ", "There is no clean political spectrum in america this election taught us that.  There is no mythical group of centrist moderates to pivot to.\n\nThat idea has little historical precedent anyway, its a fantasy of the 1990s and early 2000s, the idea of their being some middle of the road, silent majority.  It's just not true.  Sanders did very well among independents in many places, far better then the very moderate and centrist Clinton campaign.", "Despite the \"outsider\" narrative surrounding Dean he is definitely an insider--both a former chair of the DNC and a lobbyist, as well as an avid Clinton supporter.  I don't see any compelling reason to put him at the head of the DNC again.", "Nice job making an ass of yourself on the internet.", "He's sold out since then too, during the course of trying to be politically relevant. The guy doesn't belong anywhere near a position of power.", "The same obstructionist congress that went against their mandate to govern the country and instead stalled on any policy being pushed for over 8 years? \n\nI wouldn't trust those people to run a McDonalds much less the American people. ", "Trump's previous statements his policies and his transition team make it very clear what's going to happen to the environment. You can't fail at climate-denying policy because protecting the environment requires active engagement. They will deregulate, corporations will be allowed to pollute at will and it'll be left to the free market to decide how much carbon gets emitted. The only solution I can think of for the next four years is to beg your friends and neighbours is to not buy power from companies that pollute. \n\nI don't give a shit about the TPP. I actuall think it turned out to be an okayish deal on my country's end. I have a similar dim view of people who are ignorant about the inherent merits of free trade for most industries as I do of people that are skeptics over anthropomorphic climate change. Although at least trade barriers won't destroy the planet, hence I don't give a shit about the TPP. Pass it, reject it, I don't care. It's a non-issue compared to the catastrophe that is coming in the next century. ", "They attempted several times in the past few years to make a huge number of guns illegal. They were literally trying to ban the most popular rifle in the country.\n\nThat needs to end.", "My god thats horrific", "everything about your rhetoric screams over-compensation", "Yeah Bush was problematic on many things but he did at least admit climate change was real and a big deal: https://georgewbush-whitehouse.archives.gov/news/releases/2001/06/20010611-2.html", "And that's how we get State controlled media folks. Trump TV isn't a backup plan for when he loses. It's a power solidification plan if he wins.\n\nThis election and presidency will be a lesson in fascism.", "Which - *gasp* - means higher taxes! Which most Americans would throw an absolute shit fit at", "It wasn't the progressives who self sabotaged. It was the neo-liberals.", "Giving his cabinet pick there is nothing to root for. For people who say \"give him a chance?\" What the fuck for? Him choosing Pence and the other scumbags around him wasn't enough? Why even? It's like giving a child a handgun and saying \"give him a chance\" for what? He already shot himself, it will be too late...damage done.", "[Old video but still relevant](https://www.youtube.com/watch?v=7wC42HgLA4k). I think its fair to say that small states with the EC have a way bigger impact than big states would have with just Popular vote.", "It also depends on what Trump does about legal cannabis.   If he does make someone like Chris Christie or Rudy Giuliani attorney general I think there's a real chance they order the feds to go in and end legal marijuana dispensaries in places like Colorado and arrest everyone involved in the legal marijuana business.  That would really pit the states and the federal government against each other.", "Obama won in 2008 on a combination of personal charisma economic collapse, and general hatred for Bush/the Republican Congress. People lionized him as a progressive when he was always pretty moderate on every issue. \n\nI feel like we're gonna need Trump and the GOP to screw up royally before that same opportunity comes back. ", "/r/raisedbyfoxnews", "&gt;criticism of Obama on the Middle East \n\nThis is conservative?", "see this is my problem with the whole electoral college thing. i really do get why it exists. it's logical, it makes sense, at least at a cursory glance. if it weren't for the electoral college, the big states would have an unbalanced sway. \n\nbut fuck... i fail to see a way to fix this broken-ass system in a way that is fair to everyone. if america were a couple and i was its therapist, right about now is when i'd tell them to get a divorce\n\n", "we need access to their rich potato deposits", "I would define it as \"not a PERSON.\" Personhood comes when a human is independent and a separate entity. Otherwise we'd have to count sperm and eggs as human as they are just that genetically. ", "Brexit hasn't happened yet just like a Trump presidency hasn't happened yet. ", "lol so easy to trigger trumperinas", "Made you cringe too? ", "50% if you count all of a state toward whatever candidate the state went for. If you go by individual counties within states then it is way more than 50% of the economic output went Democrat.\n\nIn Texas, for instance, which is the second biggest state in terms of economic output (California is #1), the counties that Dallas, Houston, Austin, and San Antonio all went Democrat by 27%, 13%, 39%, and 13% margins, respectively. Fort Worth and Corpus Christi went Republican by 9% and 2% margins, respectively.\n\nIn Florida, the counties that include Miami, W. Palm Beach, Orlando, Tampa, and Tallahassee all went Democrat by margins of 30%, 15%, 7%, and 25%, respectively. Jacksonville went Republican, by 2%.", "Good.  Fuck this planet.  After Brownback becomes Secretary of Agriculture plants are going to get the electrolytes they crave, and food was boring anyway.  If I don't need food, I can probably get by without air and water equally well.", "LOL. Republicans are only for states rights when it benefits their causes.", "A lot of democrats criticize our side for not acknowledging the role of Islam in terrorism. The problem is the PC crowd on the left conflates criticism of Islam an ideology, with criticism of Muslim people.", "Trump can't realistically do anything for them either which is super ironic ", "As I recall Petraeus deliberately showed classified info to someone he knew didn't have clearance. He also apparently admitted that he knew that what he did was wrong, which elevated the breach out of the carelessness zone and into the realm of proven intent. \n", "Agreed. [TYTs say it well](https://www.youtube.com/watch?v=LcXCvmtkcg8) this is a ploy. \n\nI don't have anything against moderate Dems - I think we need a big tent. But I do have a problem with leaders who are controlled by corporate interests. ", "You know she actually blamed him for Sandy Hook? Said guns were pouring out of Vermont. ", "So your logic is to \"let him lead\" when in this case he wants to delegate it to each state? So people's rights aren't worthy of being the same across the country?", "Mental gymnastics level...over 9000", "Even Obama himself said Trump will never be president", "We all accept the result of the election. Hillary Clinton conceded without reservations Obama's being gracious in the transition. We're protesting against a man and against the fact he will be President despite our candidate getting more votes. ", "Seriously he is in for a rude awakening.  No more rallies feeding his ego.  Whining its not fair already?  He has no idea how bad this will get.  Wait until there are protests on his international visits.", "As the preeminent shoe-in candidate she had it all and lost it all even though she won the popular vote:\n\n* Experience from a position as Secretary of State set up purely to make a run for president former fist lady, U.S. Senator, member of the Armed Services Committee, that would make her the most experienced candidate since John Quincy Adams.\n* A rigged party structure.\n* A DNC chair from her own staff.\n* Overwhelming volume of predetermined super delegates.\n* Lots of money from her big bank buddies who her husband aided by deregulating the banks.\n* A world wide charity set up to expand her political and corporate influence and power.\n* An outrageous and hated opponent she could demonize.\n* A media in her pocket.\n* Presidential endorsement.\n\nWhat more could a corporatist want?", "He didn't say they were illegal he said they were unreasonable, and they are. The election was won fair and square. Protesting the results isn't going to change that. Anyone protesting Trump's victory is by extension protesting democracy. That is unreasonable. \n\nDid conservatives protest when Obama won TWICE? No they didn't. There weren't crowds of thousands of people roaming the streets screaming at the top of their lungs and waving around cardboard signs. They accepted defeat and went back to the drawing board. It's time for liberals to do the same. These protests are petulant and they need to stop.", "Yeah that was disgusting. I'm okay with background checks but not stuff like this.", "Can confirm I work in an ER and some people bolt after hearing what the doc said was wrong and getting their meds, that they needed at the moment not a full prescription, all the time. Then they hospital hop. What makes it worse is that we don't chase our money back come tax season (another hospital down the road does though) so a lot of these people have multi thousand dollar bills that'll never get paid (and more than likely will get a sponsorship program through us which will erase their bill and they just keep coming back and doing it more.. -sigh-) ", "&gt; I'm sure you can see their desire to make it illegal if they honestly think it constitutes as murder.\n\nThat is a different battle than creating obstacles like rules requiring women to get invasive ultrasounds, insisting that abortion clinics conform to surgery facility specifications, defunding healthcare provided to women by a provider that also performs abortions (not with the government money).\n\nBy all means, if you think it is murder, make that argument, go to court to overturn Roe V Wade, lobby congress, protest in the streets, whatever. We'll bring scientific evidence to show it isn't. ", "People are here talking about making it into a progressive party. That's pretty restrictive.", "This is how it starts. This guy is going to subvert democracy and his followers are going to cheer him on while he does it. Soviet Union 2.0 - Capitalist edition here we come.", "I really don't think you get that much of a choice particularly in a crisis situation. Also, think of the optics if he is \"working\" from the course while shit is going down. Not to mention if it is one of his courses people will question if he is checking on his business or actually tending to the situation? He has to tread very carefully. \n\n", "1. Im a woman\n2. Im a woman\n3. Trump is litteraly hitler", "California has some of the highest levels of poverty in the nation. There is nothing great about that.", "I listened to Hannity a bit the last two days.  He's practically calling for punishment of anyone who didn't support Trump.  ", "Then again he has to face fraud and racketeering charges. ", "We're all already fucked.", "It's not even about abortion. [Very little of what Planned Parenthood actually does is abortion](https://www.plannedparenthood.org/files/4013/9611/7243/Planned_Parenthood_Services.pdf). They also offer pregnancy tests Pap tests, HPV vaccinations, vasectomies, and even UTI screenings.", "On climate change yeah that sucks. Hopefully he fails at all his climate-denying plans. But maybe we can root for him to block TPP until it is more transparent. Or hope he is successful at finding ways to create new jobs. \n\nI'm not just telling Democrats to keep and eye on him. Republicans have that duty too. ", "Lol. A racist misogynist, narcissist who has insulted all the groups in our society and has shown he does not represent the principlese the country was founded, definetly has the the best interests for the people. Just look at his twitter, his response to the protests in this country are reminescent of an authoritarian third world dictator. I honestly asked if it was Mugabe tweeting this tweet, not the future president of the free world. He is an enflamitory divisive figure and he is going to weaken America on the international stage and set us back 50 years.  We have a right to be upset.", "Time will tell.  Meanwhile I'll be ignoring the fear-mongering bs from the MS Media.", "He basically pretended to be against the establishment to just embrace the establishment. Explain that shit trump supporters.", "You didn't learn anything from this election. The electorate doesn't give a shit about personal scandals even the worst ones. they wanted someone who sincerely spoke to their economic problems. Between the two they got, that was Trump, but Bernie would have blown him out of the water.", "In 30 years the view of Hillary will be much different. Yes she made mistakes but 99% of the attacks were nothing more than a sexist witch hunt. \n\nIn four years even many Trump voters will wish they would have voted differently.\n\nIn 10 years no one will admit to voting for that fascist piece of shit. ", "So directly linking to his tweet is dishonest?  The liberal media was totally unfair to Trump through out the entire election.  They kept quoting exactly what he said without giving him a chance to say he never said the things he said.  Sad.", "By that token Trump won the primaries in Michigan and Pennsylvania. What's to say Bernie would've done any better in those states than him? Undecided, nonpolitical voters do not vote for the same reasons that energize a primary base."], "links": ["5cb7ya", "5cb7ya", "5ccmct", "5cba24", "5cba24", "5cb7ya", "5ccmct", "5cc5nj", "5cah7s", "5ccskl", "5ccmct", "5ccmct", "5cb7ya", "5ccxu7", "5ccskl", "5cbtfa", "5cba24", "5cb7ya", "5cc5j9", "5ccskl", "5cb7ya", "5cb7ya", "5cba24", "5ccxla", "5cbtfa", "5ccmct", "5ccskl", "5cb7ya", "5ccbj8", "5cb7ya", "5cc5j9", "5cba24", "5ccmct", "5cci64", "5cc2x8", "5cc5j9", "5ccwpx", "5ccmct", "5cba24", "5cc4dn", "5ccskl", "5cb7ya", "5ccskl", "5cbtfa", "5cah7s", "5cb7ya", "5ccxla", "5ccxu7", "5cbrjv", "5ccmct", "5ccskl", "5cc4e7", "5cb7ya", "5cb7ya", "5cc2x8", "5cbrjv", "5cah7s", "5ccrlg", "5cbnyw", "5cb7ya", "5cba24", "5ccmct", "5cba24", "5cba24", "5cba24", "5cc5j9", "5ccxla", "5cba24", "5ccxla", "5cc4e7", "5cc5nj", "5cc5nj", "5ccow8", "5cba24", "5cah7s", "5cbrjv", "5ccow8", "5cbnyw", "5ccskl", "5cb7ya", "5cb7ya", "5cba24", "5cba24", "5cb7ya", "5cb7ya", "5cb7ya", "5cc5nj", "5cb7ya", "5ccbj8", "5cbh5i", "5cc5j9", "5ccmct", "5ccmct", "5cba24", "5cbb8c", "5cc5j9", "5cb7ya", "5cb7ya", "5cb7ya", "5cc5j9", "5cb7ya", "5cb7ya", "5ccmct", "5ccskl", "5ccskl", "5cba24", "5cb7ya", "5cah7s", "5ccmct", "5cd25j", "5ccmct", "5cc5j9", "5cba24", "5ccskl", "5cb7ya", "5ccskl", "5cc2x8", "5cbtfa", "5cb7ya", "5cd49m", "5cb7ya", "5cd49m", "5ccskl", "5cd49m", "5cba24", "5cba24", "5ccxla", "5cc5j9", "5cc5nj", "5cba24", "5cbtfa", "5cb7ya", "5cc5j9", "5cd25j", "5cb7ya", "5cba24", "5cd49m", "5ccskl", "5cbtfa", "5cd49m", "5cb7ya", "5cb7ya", "5ccxu7", "5ccmct", "5ccskl", "5ccxu7", "5ccskl", "5cd49m", "5cd25j", "5cc2x8", "5cah7s", "5cd49m", "5cc5j9", "5cb7ya", "5cb7ya", "5cd49m", "5cc2x8", "5ccxla", "5ccxla", "5ccxu7", "5cc4dn", "5ccmct", "5cba24", "5cb7ya", "5ccskl", "5cc5nj", "5cd25j", "5cb7ya", "5cd49m", "5ccmct", "5cba24", "5ccskl", "5cba24", "5cc5nj", "5cb7ya", "5ccxu7", "5cc5j9", "5cc5nj", "5cb7ya", "5cba24", "5cc5j9", "5cd2lr", "5cbrjv", "5cd49m", "5ccwpx", "5cc2x8", "5ccxu7", "5cb7ya", "5cc5nj", "5cc4dn", "5cb7ya", "5ccskl", "5cbtfa", "5cbnyw", "5cd9wu", "5cd49m", "5cd49m", "5cd9wu", "5cd9wu", "5cb7ya", "5cc5nj", "5cba24", "5cd9wu", "5cb7ya", "5cd49m", "5cb7ya", "5cd25j", "5cah7s", "5cd49m", "5cd49m", "5cba24", "5cd25j", "5cb7ya", "5cd49m", "5cba24", "5cb7ya", "5cba24", "5cc5nj", "5cd49m", "5cd49m", "5cc5j9", "5cc4dn", "5cd49m", "5cd9wu", "5cbb8c", "5cd49m", "5cd49m", "5cd79w", "5cba24", "5cd49m", "5ccskl", "5cb7ya", "5ccmct", "5cba24", "5cb7ya", "5cc5nj", "5ccskl", "5cba24", "5cba24", "5cc5nj", "5cb7ya", "5cba24", "5cbrjv", "5ccxla", "5cc4dn", "5cc4e7", "5cd49m", "5cd9wu", "5cd25j", "5cb7ya", "5ccmct", "5cd49m", "5cc5nj", "5cd49m", "5cd49m", "5ccxla", "5cd49m", "5cb7ya", "5ccmct", "5cc2x8", "5cd49m", "5cbrjv", "5cd49m", "5cba24", "5cd49m", "5cba24", "5cd49m", "5cc5j9", "5cd49m", "5cd79w", "5cbtfa", "5ccxla", "5cc5nj", "5ccxla", "5cc5j9", "5cd49m", "5cc5nj", "5cc4dn", "5cd9wu", "5cd25j", "5ccmct", "5cd49m", "5cbtfa", "5cd49m", "5cd49m", "5caev2", "5ccmct", "5ccbj8", "5cc2x8", "5ccxla", "5cba24", "5cc2x8", "5cba24", "5cbtfa", "5ccmct", "5ccskl", "5cd9wu", "5cba24", "5cd9wu", "5cd9wu", "5cd9wu", "5cd9wu", "5cd9wu", "5cd9wu", "5cc5j9", "5cd9wu", "5cd49m", "5cb7ya", "5ccmct", "5cb7ya", "5ccmct", "5cbrjv", "5cbtfa", "5cc5j9", "5ccskl", "5cd49m", "5cd79w", "5ccmct", "5cba24", "5cd9wu", "5ccmct", "5ccmct", "5cc5nj", "5cd9wu", "5cc5j9", "5cbb8c", "5ccskl", "5cbb8c", "5cd9wu", "5cd9wu", "5cc5nj", "5cc5j9", "5cb7ya", "5cc5j9", "5cd49m", "5cba24", "5cc5nj", "5cd49m", "5cbrjv", "5cdhlm", "5cd9wu", "5cd49m", "5cc5nj", "5cba24", "5cd9wu", "5ccmct", "5ccskl", "5cd9wu", "5ccmct", "5cc5nj", "5cbnyw", "5cbrjv", "5cd9wu", "5cd9wu", "5ccbj8", "5cc5nj", "5cd9wu", "5cc5j9", "5cc5j9", "5cc5j9", "5cd9wu", "5cc5j9", "5cdhow", "5ccskl", "5cc5nj", "5cc5nj", "5cd9wu", "5cb7ya", "5cbrjv", "5cc5j9", "5ccxu7", "5cc5nj", "5cbtfa", "5cd49m", "5cd49m", "5ccmct", "5cc2x8", "5ccskl", "5cbb8c", "5cc5j9", "5cdeh4", "5cd9wu", "5cd25j", "5cc5j9", "5cba24", "5cbnyw", "5cd49m", "5ccmct", "5cdko9", "5ccmct", "5cb7ya", "5cc5j9", "5cdko9", "5cbrjv", "5cb7ya", "5cd25j", "5cb7ya", "5cb7ya", "5ccskl", "5cdko9", "5cc5j9", "5cc5j9", "5cc4dn", "5cd49m", "5cba24", "5cd49m", "5cdko9", "5cba24", "5cdmyf", "5cd49m", "5cb7ya", "5cd49m", "5cb7ya", "5cd49m", "5cd49m", "5ccmct", "5ccmct", "5cd49m", "5cd25j", "5ccmct", "5ccbj8", "5cc5j9", "5cd9wu", "5cdmyf", "5cc5j9", "5cc5j9", "5cc4dn", "5cc5j9", "5cbnyw", "5cd49m", "5ccmct", "5cba24", "5cd49m", "5cb7ya", "5cd9wu", "5cah7s", "5cc5nj", "5cdko9", "5cc5nj", "5cbtfa", "5cc5j9", "5cd49m", "5ccxu7", "5cd49m", "5ccmct", "5cba24", "5cc5j9", "5cba24", "5cd49m", "5cc5j9", "5ccbj8", "5cdlp4", "5cc5j9", "5cc4dn", "5cba24", "5cc4dn", "5ccmct", "5cc2x8", "5ccwpx", "5cdko9", "5cd49m", "5cc5j9", "5cdko9", "5cb7ya", "5cbtfa", "5cd49m", "5cc2x8", "5cba24", "5ccxla", "5cbnyw", "5cd9wu", "5cdko9", "5cdlp4", "5ccbj8", "5cb7ya", "5cc5j9", "5cdko9", "5cdko9", "5cdpd7", "5cc5nj", "5cd49m", "5ccmct", "5cc5j9", "5cdmyf", "5cd49m", "5b2p5g", "5ccskl", "5ccmct", "5cd49m", "5cbb8c", "5ccmct", "5ccskl", "5ccskl", "5cba24", "5ccskl", "5cc5j9", "5cba24", "5cdlp4", "5ccbj8", "5ccmct", "5cbb8c", "5cdu23", "5cba24", "5cc5j9", "5ccmct", "5cdko9", "5cbtfa", "5ccmct", "5ccskl", "5cc2x8", "5cd49m", "5cba24", "5cc5j9", "5cbtfa", "5ccskl", "5ccmct", "5ccxla", "5cdko9", "5cd25j", "5cba24", "5cd49m", "5ccmct", "5cdurt", "5cba24", "5ccmct", "5cbrjv", "5cdko9", "5ccmct", "5cba24", "5cd49m", "5cbnyw", "5cbb8c", "5cbb8c", "5cba24", "5cdko9", "5cd49m", "5cc5j9", "5ccmct", "5cbrjv", "5ccmct", "5cd49m", "5cc5j9", "5cbtfa", "5cc5j9", "5ccskl", "5ccskl", "5cc5j9", "5cdlp4", "5cd49m", "5ccmct", "5ccskl", "5ccskl", "5cdurt", "5cba24", "5cd49m", "5cdko9", "5cd49m", "5cdrrh", "5ccxu7", "5cbs4y", "5cdko9", "5ccmct", "5cd49m", "5cbtfa", "5ccmct", "5cdmyf", "5cc4dn", "5cba24", "5ccbj8", "5cc4dn", "5ccskl", "5cdko9", "5cbtfa", "5cdko9", "5cd49m", "5cdko9", "5cbb8c", "5cc5nj", "5ccskl", "5cdmyf", "5cc5nj"]}