{"comments": ["As long as Democrats keep thinking they lost because of the bigot vote they'll keep losing. ", "awww poor comander in chief. people don't like him. time to take the the twitter to establish us policy", "This is fucking awesome day 3 and we are already at *1984* level shenanigans. Bigly.", "There are many reasons and that is certainly one of them.  Do you really not think it played a part?\n\nI'm really tired of seeing everyone try to point to one thing that caused the election to go the way it did and pretending it's wrong to bring up any other factor.", "&gt; This makes me consider the fact that Russia might have tampered with votes.\n\n11 different US intelligence agencies reaching that same conclusion didn't tip you off?", "These are such bizarre times. While I'm not a Trump voter I accept the election results and am willing to give him a fair chance to do good for this country if he can.\n\nBut what makes me nervous is that we now have someone who does not take kindly to any criticism entering unknown territory where mistakes are bound happen. And that's understandable. We all make mistakes. But you need to own them, apologize and work to fix things when they happen. Can Trump do that? Is he capable of that? We'll see.\n\nAdd to this the fact that we've got a vulture media that's just been deprived of their main focus (a contentious campaign battle) and are now hungry to scavenge any fresh meat. They will likely be pretty merciless with their criticism any time he stumbles.\n\nThis is not a recipe for good times.\n\n**EDIT:** some interesting responses, thanks. After further reflection I'm inclined to agree with Harry Reid's letter. Your fucking move, Donnie. Ready to put down your twitter and be a statesman or make ANY attempt at humility and national unity? We're waiting.", "Just the bigot vote? No it was the voluminous amount of anti-civil rights stances he holds. Bigot vote is just one ingredient in this shit stew.", "*\"More votes equals a loss...revolution!\"*\n   - Donald Trump the (next) President of United States\n", "You don't think the democrats are pissed at the DNC right now for pushing Clinton?", "And as long as Democrats keep thinking that all these anti-civil rights people cost them the election they'll keep losing as well.\n\nSad, but true.", "What? That doesn't even make sense. Hillary and the DNC cost us the election. The result is now an anti-civil rights pro-dominionist bunch of GOP old establishment running the show. Do you like the idea of no separation of church and state? Because this is how you get no separation of church and state.", "http://imgur.com/4bFIj6n\n\nThat's basically the gist of this election.", "That's because those at the bottom are in it for moral reasons. Those at the top pulling the strings though? They're in it for the systemic oppression of the poor women and minorities by denying them the right to control their circumstances. \n\nDon't have to worry about an educated voting block of women if we're all dropping out of school to have babies. And children born to young impoverished parents are less likely to succeed as well.  It's just another way to punish the poor. ", "So people voted a carnival barker into the highest office in our country because they didn't like people asking them to be nicer to other people when they don't want to be? That's a reasonable reaction. ", "No one is a \"fan\" of abortion. Thats what pro lifers cant seem to grasp. Women who undergo it are often traumatized and have immense guilt about it. But in SPITE of that they realize it was the better choice for everyone. That should tell you something about why we need them.", "How much respect did Hillary and your side gave Trump supporters? And now elements on your side are trying to burn down cities because they are thin skinned and butthurt. This is the constitutional process. If you don't like it nominate a candidate with a shred of integrity next time", "&gt; Also for the record I believe the reason I got sick the day of the first debate was I contracted a stomach virus, just as Rand Paul did.\n\nFunny thing is she tells a different story in the book, one about a mysterious driver who suspiciously forces an unwanted drink into her hands.  \n\nShe's sounding like a bullshitter.\n", "It's an understandable view I know if I were an immigrant and I went through the long arduous process of becoming a citizen in any country and then saw people cutting in line to get theirs I'm not going to be too thrilled about it.", "http://www.snopes.com/2016/04/26/bernie-sanders-facebook-groups-controversy/", "Oh no people hurt my feelings so I'll vote Trump /s \n\nBitch please you was voting for him anyway if you need a safe space because people dislike you then you are no better than SJWs", "You can almost hear his inner monologue. \" you can't curse now you are the president. can't curse now you are the presidentcan't curse now you are the president.\" Very unfair! \"Good job Donald good job\"\n\nEdit:I have the best words", "It's a democracy. We can protest all we want to. I am not surprised that filthy Trumpettes want to infringe on our rights however. ", "Except Hillary is neither honorable or morally good. So that's a shit comparison.", " Actually she was still probably wrong. Most of republican candidates would have probably beaten Hillary. ", "Next question: Senator Sanders if we had given you more than one 256th of the free airtime and coverage we gave Trump, do you think that would have had an effect on the primaries? What if, we didn't \"mysteriously lose signal\" when reporters mentioned your name? What if instead of broadcasting a live feed of an empty podium with Trump's name written on it, we covered your speech which was also live and in progress at the same time with thousands of people in attendance? What if we spent time talking about how truly mind blowing it is to have rally support for a *primary* with 30,000 people in attendance while every other candidate on the field was drawing ~1,000? What about any of that Senator Sanders?\n\n*fuck* CNN ... you fucking fucking fucks.", "It may not be why they voted for him but it also wasn't enough to stop them. ", "&gt; They need to take some blame.\n\n*Some* of the blame? They deserve the largest fucking portion. ", "TLDR; Mike Pence is a repressed closeted gay.\n\nThere is literally no other reason for his unhealthy obsession with homosexuality. ", "Sure KKK members are the only bigots... how could I be so naive.", "Textbook fascism. Decide your opponent is a criminal and then go looking for the crime.", "Half of the GOP thought Obama was born in Kenya. Totally not because they're racist though. ", "Big fat upvote for this. Marches and protests can be very important for bringing attention to a cause but without organized action to bring change they're just a glorified form of group therapy. \n\nI plan on marching, but I also plan on donating, volunteering, boycotting - whatever the hell I can do to help untangle the upcoming clusterfuck.", "I think you mean practical. I got this done 2 years ago and if you had been paying any attention to how the political climate regarding control of fertility had been going, you would know why. A paragard costs a lot of money. Birth control is completely covered under Obamacare. Trump said Obamacare is getting repealed and replaced with something better. Read between the lines. ", "Don't forget what they did to Bernie and his supporters and delegates at the convention.  \nhttps://www.youtube.com/watch?v=MHD_bj5fXO0", "You guys have tuned out to far more than that. ", "And 4. I have a vagina so if you don't vote for me you're a sexist.\n\nAnd 5. Hey, at least I'm not Trump. \n\nAnd 6. That's enough, right? Fuck, you guys actually want a REASON to vote for me?", "CA has a system where the top 2 senate candidates by total votes from party primaries make it to the general ballot.", "i think youll find that policy wise its all very similar.  What people are really concerned about is getting rid of corporate influence and serving donor interests over what is best for the public.", "&gt; coddle racists and those who are tolerant of racists Democrats! White feelings are more important than black (and gay and female and Latinx and disabled) bodies!\n\n(White Supremacy in action)", "I'm okay with Sanders taking on roles in the DNC however, he needs to join the party proper(no more independent) , encourage others to do so, and make sure they stay engaged even if there is a candidate who isn't as pure as they'd like.  Seeing a sharp increase in Democratic party membership is a message that needs to be sent. ", "If we call it a business deal maybe the GOP will look the other way?", "So Bernie? See Vermont. His rationale was that it is what his people wanted and he felt obligated to represent the will of the voters. ", "Anybody who thinks this should be deeply ashamed of their behavior. While many people have grave concerns for what the future has in store we must remember were all still Americans. We all live in the same country, under the same laws. You can't wish our now president ill will. You've probably heard this but its like being on a ship or plane and waiting and hoping for the pilot or captain to screw up. Its childish. Instead you should be hoping for him to somehow prove us wrong and end up being a decent or even a good president. For those of you who want Trump impeached or even assassinated do you really want Pence as president?         \nEdit: It appears that my comment gave the intention that I was encouraging complacency. This was not my intent but to rather encourage peace (as in less violence) and common sense. If you truly believe that the issues facing our country are big enough you have the right to protest and debate peacefully, more power to you..", "[That would be exactly zero by my calculations.](http://www.reactiongifs.com/wp-content/uploads/2012/11/typing.gif)", "I would have voted for Bernie if he was the Democrat candidate.", "You say that like it's a bad thing. Do you think Bush would have been so willing to let the CIA torture prisoners if he knew it might get him hanged for war crimes?", "Values of newly elected President set an example to follow.   \nTrump himself is perfectly willing to dig past  all the way down to birth certificates lol. Moment you hope, expect and request higher standards from random reddit user than what a newly elected POTUS displays is moment where somebody who has been wanting to make a subreddit about building  nuclear shelters prolly has a \"my time is now!\" moment.   \n \nOn bit more serious and far more grim note, the  record of how most powerful man in world  behaves when things don't go his way is consistently terrifying. \n", "Gee paranoid for not wanting to get pregnant. Because she wants to control her own body, she has a mental defect?", "Looks like Hillary's woman card was a bust.\n\n*Deal Me In*", "Literally never going to happen. The civil war basically assured that states (especially those contributing substantially to the economy) have no right to withdraw from the Union.", "If the Republicans rig the congressional districs with gerrymandering there's not much to play with. ", "It was basically at the point where it was basically over and she wanted to unify the party. I'm sure she likes and respects both and it was tough.", "In politics  everything is like Game of Thrones.  Don't hate it.  Embrace it.  ", "I think this situation is different than any other before.\n\nDonald Trump is the first president-elect to have run on a campaign of hatred and sexism. He has called for taking away women's rights gay rights, and more. Hell, the guy doesn't even believe in climate change and that affects all of us!\n\nAlso, to anyone saying that it was only his rhetoric during the campaign that was hateful: I strongly urge you to read up on his past and also on everyone he wants to put in his cabinet. Tell me how those people are going to help the country.\n\nI'm sorry, but do you expect people who are having their rights directly threatened to just sit there and watch?", "Yeah let's ignore what Republicans have done and said for the past 50 years.", "Yeah sorry but past actions are a fair and historically used way of predicting future actions. He was a temperamental fool = he will be a temperamental fool. ", "To be completely honest I don't think Trump himself gives much of a hoot about birth control and such. Like, I can't imagine him *not* having to pay at least one of his past mistresses to get an abortion at least once.\n\nHowever, Mike \"*give aborted fetuses a funeral*\" Pence very much does, and i'm afraid that Trump is going to tolerate his nuttyness in order to pander to Evangelicals, who make up a significant chunk of his base.\n\nThat's pretty much the reason he picked him as his VP, after all.", "the \"logic\" was \"this is how we get the smaller states to agree to ratify the Constitution so that we can form a country.\"\n\nAnd this is what happens. The city of San Jose has more people than the state of Wyoming yet the people in Wyoming get 2 senators and more electoral college representation.", "God can this shit. I dont oppose trump because im paid I oppose him because hes a shithead. Regardless this site has always been left leaning, that didn't change when he won.", "The fact Chris Christie is still a part of this administration should show you nothing is going to change. Trump is just another piece of the establishment puzzle as corrupt and bought and paid for as everybody else.\n\nHe doesn't need Christie, hell Christie is a net negative, a proven fraud and failed governor. So why is he here? Because Trump is not change. Newt fucking Gingrich is being floated for the cabinet. He's the same Republican Party but uses curse words.", "what?  ", "Clinton is still under FBI investigation because of the Foundation play to play as reported by the WSJ correct? So if that investigation simply continues and ends in an indictment and trial, what happens then? \n\nWhat does that have to do with Trump? Wouldn't that be simply the justice system doing its job?", "Don't you see the point your making is exactly what the problem is? When you offer a shit candidate you can't call people not voting for her sexist. That just makes people even less likely to vote for you. ", "I'm sorry but I'm going to be frank and say you have no idea what you're talking about or you're brainwashed by his media.\n\nTrump literally said he wants to overturn Roe vs Wade and ban abortion. He specifically said he wants to make a punishment for abortion. \n\nHe specifically chose a VP who has been anti gay his whole life.\n\nHe specifically called for the banning and documentation of Muslims in this country.\n\nI'm not going to sit here and provide sources of these very well documented Instances. If you're so sure he didn't do any of these then a Google search would obviously prove me wrong, right?", "&gt; Obama on the Middle East \n\nHow the hell is that even a negative? Obama *should* be criticized for his mostly failed Middle East policy.\n\nObama jerking is so annoying in this sub. And it would've been even worse with Clinton as president and all the media and trolls backing her on TV and online as if she's a saint. At least with Trump people are finally ready to face the truth about what America is doing at home and abroad.", "The link you posted has a correction saying that isn't true and that Clinton still won the popular vote.", "Hehehe.\n\nHe actually went there out loud at a rally the week before the election. He was telling himself out loud at the podium mid speech to just keep it together a little longer. So creepy.\n\nHe did send out one ass kissy civil tweet about Obama before that so he probably figured he'd earned the right to tweet a zinger too. Imagine being the aide who has to awkwardly wrestle that phone from a 70 year old man who has just been elected president and who can't understand why he's been bad.", "We HAVE background checks.  And the private sale exemption isn't s loophole it's last year's compromise.\n\nWell, twenty years ago's compromise, but I hope you get the point.  If you want the pro-gun groups to compromise, you need to do so in good faith, and offer something in return.\n\nAlso, Democrats should probably stop shooting down Republican proposals to allow private sellers to run background checks without going through an FFL.", "People don't care about the fact that he's labeled a sexist misogynistic xenophobe. That's what it is. It was also not the reason why people voted for him.", "That's exactly what I liked about him. Wish I had the chance to vote for him twice.", "that conversation has been floating around for a while it just got a big boost in popularity after the election.  It's already going to be on the 2018 ballot in California to see if it's something the people want the state to pursue.\n\nLegally, it would require an amendment to the Constitution.  Basically the whole country would have to agree to let California go.", "I thought we were done trusting the polls...", "The \"left wing media\" is about to be more profitable than ever.\n\nFox News and other right wing media are going to lose a lot of their outrage customers now that their guy is in the White House.\n\nGovernment defense news is less interesting than government criticism news. So left wing is about to get more popular right wing is about to get less popular. It happens every time.\n\nSo no, Trump isn't bad for the media you don't like. It's incredibly good for them. I expect satire shows, news, comedy shows are all about to hit a new golden age with all the material coming out over the next 4 years, just like they did during the Bush years.", "He narrowly lost with educated white women but it was too close too be honest. It really is quite a depressing situation but we must work together to reform and mount a true progressive assault. ", "You're absolutely right but Tulsi Gabbard did what Warren was so obviously scared to do. ", "Like he would never put the Washington and global banking establishment on his cabinet.\n\nOh wait.", "Have you got a source for that? I can't find anything immediately from this year? Not that I don't believe he'd do it just that I want to read up on exactly what all was said. My family voted Trump (well, not me and my generation. We voted either Clinton or Johnson in a red state in \"protest\"), so I'd like some more shit to hold over their heads.", "The US has a rate of gun violence thousands of percent higher than any other Western nation.\n\nIt has a rate of mass shootings which is absolutely insane.\n\nGun control is not \"fine as it is.\"\n\nThere can be argument about **what** specifically is needed to address the problem but to deny that there's even a problem is just ludicrous.", "Get your birth control before Pence and his entire dominionist anti-secular far-right gang in congress turn this motherfucker into a Handmaid's Tale.", "\"Very unfair!\"\n\nSounds like a 5 year old that didn't get a second cookie before nap time at pre school.", "You act like Democrats don't do the same thing.", "Educated white America voted for him as well. It's disgusting.", "I donno but that was a campaign promise Chris Christie made while running for president, that he would \"enforce federal law\" on marijuana in states that have legalized it.    ", "\"Theres always one\" is a dumb argument. Im sure theres pro lifers that beleive womens only purpose is to make a baby for their man but thats not what were arguing here.", "It would be super considerate if this could happen around the same time D.C. Becomes a state. Would save a lot of people the money and hassle of buying a new 51 star flag.", "Si you didnt vote to stop Trump because someone was mean to you in the internet. \n\nI hope you grow up till the next election. \n\nAnd yes I'm being mean to you right now. But I dont care. If your judgement of what's good for the country is that low someone needs to tell it to you. ", "Probably just not smart people. They hate wall street and corporations, so they vote to deregulate wall street and the banking industry and cut taxes on the rich?\n\nSolid logic.", "&gt;Clinton is Wall Street. You guys will soon realize that but until then thanks for setting us back hundreds of years because you guys fail to see anything from outside of your box. \n\nFTFY\n", "I had RomneyCare in 2006-2009 and it was pretty decent at that time. ", "Oh fuck him.  I heard people quote Facebook garbage all election.  It certainly has an impact.", "If you're against abortion you should want to keep PP funded, as they prevent a lot of pregnancies.", "Did you even click the link provided? She's still ahead of him and her lead has only grown since yesterday. I'll believe when I see it but the numbers are there for you. She's still ahead. ", "That's not what a blind trust is...", "What 'facts'? ", "It's disturbing how easy it is to bait this guy into losing his composure. He needs to put his big boy pants on.", "The election is over.  But never let the fact that Trump was elected divert your eyes from who he categorically revealed *himself* to be.  Not who the media tried painting him as.  But as he has revealed *himself* to be ad nauseum.  Absolutely insane levels of doublethink are this idiot's modus operandi and his Twitter feed over the past few years is god damn exhibit A.\n\n[Or watch this.](https://youtu.be/5GYJLjHEDxU?t=5s)\n\n[And then this.](https://youtu.be/Dn1ZK2kcfQ8?t=14s)\n\n[Or watch this.](https://youtu.be/e9geYl9J_Mc?t=6s)\n\n[And then this.](https://youtu.be/FPmWu-zMCOc?t=2s)\n\nThis man is absolutely a danger to the nation.  Clinton can be as corrupt as you like.  Donald Trump is a _maniac_.  The worst part about it is I think Clinton lied in a calculated attempt to further herself.  With Trump, I genuinely think it's possible he doesn't even know or think he's lying when he does it.  ", "62 million people voted for Bush in 2004. 69 million people voted for Obama in 2008.  65 million voted for Obama in 2012.  Trump won with just 59 million people.  And Clinton STILL won the popular vote.  Let that sink in.  We lost because we had a bad candidate. Not because Trump was some revelation to people.\n\nEdit:  this should give everyone hope for next time (and also make you feel better that our country didn't suddenly have this bigot majority come out of the shadows to elect this fucker).  He skated by with the lowest vote total in recent presidential history.  We still have the numbers.  We just need the right person.\n\n--thank you very much for the gold.\n\n", "Hey all you Trump supporters who claim your support isn't racist and that you are against racism--a good place to start would be to join us in shouting these mother fuckers down.\n\nETA: Turns out a *lot* of Trump supporters would rather argue with me about whether they should say the KKK is bad than just say the KKK is bad.", "And these idiots gave him the largest nuclear arsenal on Earth  without any checks on its use.", "Bernie wasn't ignored he was fucked in the ass by the DNC.", "I think that unless they start standing up and *actively and publicly* disowning this behavior they at best are willing to incite it in the name of collecting votes to support [favorable tax policies? anti-abortion Supreme Court justices? uhh...I'm running out of trademark Trump policies that only implicitly rather than explicitly support the stated goals of white supremacists...maybe you can help me out?]\n\nIf you voted for Trump and don't want to be associated with this shit, cooperate with us in holding these mother fuckers accountable and make it clear to Trump that whatever his association with white nationalists has been, his coalition will no longer tolerate even the suggestion of tolerance for bigotry and racist terrorism.", "So...none?", "The entire bench is about to be stolen for the next foreseeable decades. It will packed with conservative judges that will cause so much pain and suffering to countless millions. \n\nRural America fucked us all. And I mean ALL. Including themselves Thank you for that. ", "Do you think the average Republican supports the KKK?\n\n(I'm not conservative but this seems a bit unfair)", "I can't believe it's even legal to deny Obama his right to appoint a Judge... We voted for the guy twice for a reason", "No no, no. The electoral college is problematic enough without a handful of rogue electors trying to change the election now. \n\nMy side lost. The electoral college is crazy and undemocratic, but the solution is to eliminate it, not to corrupt it to steal an election.\n\nI'm a huge Clinton supporter. Check my history. This action would be theft of the election and should be stopped. ", "I hope someone went and archived all of his tweets before this whole thing a long time ago.\n", "\"Very unfair!\" Wow! That just shows you how mature he reacts when confronted with criticism. What's he going to say and do when the heads of other states call him out? Will he call them mean? ", "This fascism is just getting warmed up. ", "This is absolutely pointless speculation. The polls were way off on the election but suddenly now they got it right about Bernie. \n\nLet it go and start taking over your local Democrat's party machinery.", "You won the election yet can't come up with any more articulate a celebration? ", "&gt; Can Trump do that? Is he capable of that? We'll see.\n\nAnybody who has been paying attention HAS seen and knows the answer. America either isn't paying attention or doesn't care. Very possibly both at once.\n\n&gt; They will likely be pretty merciless with their criticism any time he stumbles.\n\nLike they were merciless every one of the countless times they gave him free air play over the last two years? The media adores sensationalism and therefore adores this man. He is a ratings juggernaut. Shit, he's bigger than the [NFL](http://www.theatlantic.com/business/archive/2016/10/nfl-ratings-just-fell-off-a-cliff-why/503666/). They will do nothing to revoke the platform they have given him, even if he starts locking them up for sedition.", "Just like the campaign people don't want to hear that something is complicated.  ”Just tell me it was tremendous or a disaster, and MAGA.”", "Well that sounds like a great way to start Civil War II", "The email case will go nowhere. The foundation case might go somewhere. And if it does why wouldn't she be jailed? There will be outrage for justice? Furthermore, unlike pardons, Trump can't just jail someone because he says so. That's not how our executive branch works. \n\nIf she is tried and found guilty of a crime, she should be treated as anyone else who committed this crime. I would be outraged if she was tried, found guilty, and not punished. That's not right.", "For the sake of all Americans can someone teach DJT how to get made fun of and brush it off ", "Wow...when is the last time the KKK was relevant", "Wait till Rodrigo Duterte starts laying into this guy. Wait till glorious leader Kim Jong Un says America is weak and afraid. Wait till Evo Morales calls him a capitalist pig. \n\nI feel like there's a decent chance Trump will actually launch nuclear weapons before his term is over. This man is not mentally stable or fit to hold the office. He is incapable of letting an insult slide. ", "Clinton's favorability among Democrats is still around 80% ", "President elect ladies and gentlemen.\n\nActing 'presidential' already", "It's so embarrassing to have this orange reality tv moron in our history books as president.", "The emperor will never tolerate getting his fee fee's hurt!", "Voter suppression at this level is election fraud. Chief Justice Roberts is not done with the Voting Rights Act yet.", "It's fallacy to assume someone voting for him was an uneducated white that needs \"saving\" and this attitude, that's endemic among groups with certain political affiliations, is winning them no converts.  You alienate people with language like that, and harden their resolve to oppose you.", "I doubt he'd want it any other way. He doesnt want the job he wants the title.", "Want to know the best way to finish off the already dying KKK? STOP giving them news slots. Stop staging protests against them. Stop caring they exist. \n\nTheir membership is abysmally low with one of the most active chapters having 200 members (wow omfg so much!). You let them do their spiel as is their 1st amendment right as well as peacefully march and protest. But you don't even give them the time of day. \n\nWant to increase their numbers and turn out (more than the election might end up doing out of a temporary surge)? Then keep running news segments, give their 12 people running around in bedsheets attention they crave. Stage Protests and yell at them (negative attention is attention too).", "You're so wrapped up in your own beliefs that you can't understand how a reasonable person might disagree. That's always a sign that you're close-minded and should re-examine your position. \n\nArguing that abortion is or isn't murder is tautological because it depends on how you define \"murder.\" If murder is the intentional killing of a human then the question becomes how you define \"human.\" Obviously you don't consider a fetus a human, but that's your subjective belief.\n\nJust for fun, let's examine when \"human life\" can start. Is it after the baby is born? Everyone would agree yes. Is it 10 seconds before the baby crowns? Most people would agree yes. Is it the moment that the baby is developed enough to live outside of the womb without extensive medical supervision? Maybe. Is it the moment that the baby can survive outside of the womb with extensive medical care? Possibly. At that point, it's no more a parasite and no less a human than an elderly person on life support. \n\nI'm pro-choice, but people with a shallow understanding of the argument, like yourself, who put up a straw man and mischaracterize the opposition as moronic shut down open conversation. If you want to spread your pro-choice beliefs, you should focus on ideas such as an individual's right to agency over their body and the practical society-level effects of abortion. \n\nBogging down the discussion by vilifying your opposition is grade-school level rhetoric, and you can do better. \n\nEdit: Corrected an embarrassing typo.", "As long as the Republican party and Trump campaign are safe places for bigots and anti-civil rights people the country has problems.", "Enjoy it now in 2 months your prize becomes a responsibility and we all know you aren't responsible.", "Media is generally \"bought out\" before the primaries even begin.  \n\nI feel bad for Bernie either way he seems so much more genuine than most people who run, even if I don't agree with all his policies.", "The purpose of the electoral college is to save the ignorant masses from selecting a dangerous demagogue.  If they select Hillary Clinton then they will have served their purpose.", "&gt; That's because those at the bottom are in it for moral reasons.\n\nWhat happens to those morals once the fetus becomes a child? I hear vociferous whining and complaining by the moralizers about government programs that support the children of the poor etc. Furthermore, where is the moral superiority of forcing an in-viable fetus to be carried to term and birthed, only to watch it die shortly thereafter? Anyone who asserts that abortions are *never* the more compassionate choice are deluded, at best. Those who assert that early first term abortions (the *overwhelming majority* when the choice is truly free) constitute 'murder' are delusional, at best. Objection to contraception or the morning after pill is incomprehensibly ignorant, but it exists among the moralizers (just ask a Catholic).", "Not just Rural America - 49% of white women with a college degree voted for Trump.\n\nThink about that.\n\nAll those women voted for a man who is on tape bragging about sexual assault who has been accused of sexual assault by 11 different women, who has cheated on several wives, who has said he will consider *repealing Roe vs Wade and punishing women who do seek abortions* and whose VP has consistently attacked Planned Parenthood. \n\nQuite frankly, I hope Trump passes all that he promised and each and every one of those women need an abortion at some point. Harsh, terrible, upsetting - but clearly explaining has stopped working, and people need some good old fashioned lived experience to open their eyes to the fact that the election isn't reality television. ", "Dare I say hypocrisy from the P-elect? People are very surprised!", "&gt; ass beating \n\nI mean she did get more votes ", "&gt; OH or FL or NC or PA.\n\nAll states he got murdered in.\n\nFace it this was a complicated election.  Bernie wasn't the magic bullet.  This thing goes deep.\n\n", "It's like we are slowly becoming *Idiocracy*. \n\n2020: Kanye West^YEE\n\n2024: LeBron James ^NIKE\n\n2028: Robot Steve Jobs ^APPLE\n\n2032: Jesus Christ of Nazareth \n", "He's going to run our country like he runs his businesses!! MAGA!!!\n\nMe: O_O oh god no", "An eye for an eye leaves the world blind. -Gandhi ", "Would have been nice if she would have supported the stronger candidate against Trump instead of now having to pick up the pieces afterward. ", "He can't just decide to jail her. But if he has her prosecuted and she's found guilty then she deserves jail. ", "Username checks outs. ", "Is that meant to be a joke? Clean coal has been a pipedream and fantasy of the fossil-fuel industry for the last several decades. \n\nIs it possible? Yes. \n\nWill it ever be implemented at scale? Hell no. It's far too costly. ", "I'm a catholic and I fundamentally believe abortion is wrong but I'm also realistic about it and think making it illegal is a terrible idea.  I use the comparison of prohibition when people couldn't get what they wanted/needed it went underground and got messy and dirty and lots of people died as a result and that's what I think would happen if abortion was made illegal.  Also those who are against contraception in my mind are simply ignorant and need to recognize its benefit.  Also I think that some right wing views on abortion are very heartless, I think those who want to get rid of abortion need to look at the underlying reasons why women get abortion. I think we need to make the access to affordable health care so the can safely carry the baby to term and raise it if they choose.  If women don't choose to raise the child themselves we need to make sure that foster care and adoption programs are properly funded so that the child can grow up in a loving home.  Also while I'm on this mini rant I hate when Christian people act intolerant of groups of people (gays, Muslim, etc.) because the Jesus I learned about was a friend and ally to the crippled, the outcasts, and the downtrodden. So those who think being gay might be a sin I believe we need to welcome people with open arms because to discriminate against them is a greater sin.", "Hate I never saw any of this before I'm starting to reach Hitchens levels of disdain for the Clintons and the DNC as well.", "Of course they matter. That's why Hillary Clinton was campaigning on the fact that Obamacare needed massive reform. But coming in and repealing it on day 1 is going to lead to people dying. Many of the people in my family are the middle class folks that you refer to and it's terrible. But somebody is going to have to make some sacrifices while this problem is fixed, and its sad that those sacrifices are going to have to be lives instead of financial struggle.", "&gt;People like you are the reason Trump won\n\nA new parrot-point is born. Prepare to see this line everywhere. It's funny how parrots all use the same words verbatim. They also don't seem to understand that this line proves they voted out of spite and nothing else. ", "Denial of what has been a core element of the conservative platform for years. ", "But you must only protest in that one spot away from everyone where you will not be seen and will not get in the way. \n\nSaid every nearly every person against BLM.", "&gt; Rodrigo Duterte...Kim Jong Un\n\nHe admires them both and may well find a way to rationalise their 'constructive criticism'. \n\nOr he might just nuke Pyongyang. I suppose it'll depend on other factors such as what he had for breakfast or how ~~good~~ he thinks his hair looks at any given moment. \n\nWorse still, his election has given any other world leader with apocalyptic fixations (Trump is not the only crazy person in power) an easy route towards armageddon. Simply insult Trump, and keep insulting him, and before too long a hydrogen bomb will fall on your head, instigating a worldwide nuclear panic. Simples!\n\n", "Trump is most definitely a one term president. No way will they offer up some corporate stooge next time and no way will the minority voters stay home with Trump running as an incumbent. Now we know the severity of his candidacy, we won't be sitting out again.", "No: white supremacists and those willing to tolerate white supremacy in the name of [abortion bans? tax cuts?] are the reason Trump won.", "They had a chance to get the EC to vote for Clinton and they lost.", "Tell me again how his murdering Trayvon Martin had nothing to do with racism reddit.", "\"A good number\". Meaning what 1? 2? 10? 5000? A million? Wake up already.\n\nSo what are you going to do, throw them into concentration camps and ostracize them?", "Just the fact that we frame it as \"pro-life\" and \"pro-choice\" pisses me off as if pro-choice people are somehow anti-life.   We all want less abortions but I feel pro-choice people are just more rational in their belief that banning it won't help, that the decision should be left up to the woman and her doctor instead of, well, anyone else.   You'll never get everyone to agree on when it's considered murder and when it's not but what we can do is tell people that it's not their decision to make for someone else.   Don't like abortion?  Fine, don't have one but you don't get to force the way you feel on other people. ", "To be fair right now it is all about him and how shitty having him is.", "You see Bernie crying? Progressives aren't shocked you dipshit. ", "&gt;  If you don't like it nominate a candidate with a shred of integrity next time\n\nTry telling that to 2012 Trump, who suggested not just this, but, in his own words, *REVOLUTION!*", "He's promising something that won't happen which is bringing back factory jobs. \n\n1. the main reason factory jobs moved overseas was because americans didnt want to pay those high prices.\n\n2. a trade war is going to devastate people and even still people would rather buy smuggled goods than american made goods\n\n3. any manufacturing that comes back will be mostly automated with few being done by workers in a 1920's style production line\n\nhe sold them a false promise and their going to either be very disappointed in four years or blame \"trump not being president for long enough\" as the reason it didnt work.", "Not to most voters... most people didn't vote for him.", "Fuck that. Republicans turn out when the nominee isn't popular Republicans turn out when it's only midterms and there's no rallying figure, Republicans turn out when it's rainy.\n\nDemocrats are the ones with turnout problems and part of it is a pack of commitment from the voters.", "My good man/woman - \n\n&gt;Rural America went and voted for the candidate they prefer to implement the policies they prefer \n\nThis couldn't be farther from the truth. If Obamacare is repealed the most affected will these same Rural folks. Why is this difficult to understand. \n\nIf the economic policies of renegotiating trade deals - midwest farmers wont be able able to export either corn/cotton/produce or their meat/milk/dairy. \n\nThe list goes on. \n\n", "I've never **never** met a Republican at an anti-Klan protest. I've participated in several.", "Leadership by folks from the wealthy coasts who dont know the plight of middle-america Americans is how we got here in the first place.", "Oh I know. I want to see what the atheists and cannabis fans among them have to say about all the religious-right appointments he will make. ", "Not just cutting in line but not paying their fair share into the government system.", "they like his facism still do, can't wait for it. ", "Jeb eats paste but at least the FBI wasn't investigating him for criminal negligence.", "Lol there is no plan. ", "Hard to say really. It's hard enough to work out how many honest to god white supremacists there are, to say nothing of the regular folks who are unaware of their own prejudices. \n\nI don't know what the solution is. Folks have been working out ways to solve intolerance forever. I do know that it starts by talking to these people, trying to find out why they believe what they believe, and show them how they're wrong. \n\nBut it isn't that. Please don't put words in my mouth. ", "It's \"fun\" how Trump himself was complaining that the EC was undemocratic right up until the point where it was advantageous for him.", "This is on him. Day 2.", "Ooooh. They are just fucking idiots. Gotcha. ", "Please remember that \"Sanders after sitting on the sidelines of a campaign\" is not the same person as \"Sanders at the end of a campaign in which he was running.\"\n\nMany of these people would have been flipped by the Republican gaslighting industrial complex.", "There really needs to be some time limit to Advise and Consent.  After so many months of time no Advice from the Senate should just be considered implicit consent.", "I look at it like this: There is ALWAYS an option for abortion. Even when it was illegal. The government can make it illegal if they want but it WILL NOT stop women from doing it. And as a result of women not having a safe, controlled environment for it, many of them will be injured or die as a result of botched procedures.  \n  \nI see it less of a moral issue than I do as a health care issue.", "", "This violence is a symptom of the state of our socioeconomic inequality and the war on drugs.  Address that and you'll see a huge drop in \"gun crime\".  It's common sense", "Please get your representatives to publicly disown them. Get Trump to disown them. Otherwise the labels are going to stick.", "Popular vote doesn't work in America because of having so many different self contained states with individual laws and in a lot of cases virtues. If it was left to popular vote candidates would just campaign in places like Texas New York and California and the rest of the country would go unrepresented.", "&gt; Rural America fucked us all. And I mean ALL. Including themselves Thank you for that.\n\nRural America went and voted for the candidate they prefer to implement the policies they prefer and appoint supreme justices they prefer. \n\nIts the urban youth who fucked themselves. They stayed home because \"They  are the same\" like Kaepernick. ", "&gt; It's amazing and insane at the same time.\n\nI think in four years when Ohio is no better or is in fact worse it'll be even more amazing and insane. :(  Hopefully I'm wrong and all will be well.", "Do we really have to repeat this history lesson?\n\n[\"First they came for the Socialists...\"](https://www.ushmm.org/wlc/en/article.php?ModuleId=10007392)", "Austin San Antonio, Dallas, Houston, El Paso, and south Texas all went blue. But the rest? That's how we ended up with Evil Ted Cruz and Super Evil Lt. Gov. Dan Motherfucker Patrick.", "Yeah nate silver was the only one saying he had a realistic shot.", "One can complain about the rules but still play by them.", "I interviewed with the Clinton campaign and it was one of the most hostile interviews I've ever experienced. I worked on \"getting out the vote\" for successful efforts to pass constitutional amendments in another state, but they were uninterested. It was made pretty clear by the college student that interviewed me that I \"didn't match the demographics\" of the area they were assigned (I'm a working class white male, mid 40s). The arrogance of the staff lead me to believe they had no idea what they were doing, and were assuming they had it in the bag. ", "So the presidency will be both humorous and terrifying.", "&gt;&gt; Hillary said\n\n&gt; \"It's just awfully good that someone with the temperament of Donald Trump is not in charge of the law in our country.\"\n\n&gt;&gt; and Donald replied,\n\n&gt; \"Yeah, because you'd be in jail.\"\n\nHis response to having his temperament criticized was \"yeah, you'll be in prison\"", "And to see post-election progressives blame these \"uneducated angry white men\" for electing Trump shows just how out of touch the Democratic Party is with the working class.  You might think they're uneducated because they lack a college degree but you tried to sell them on a candidate who called the TPP the gold standard of trade deals and only pivoted back because of Bernie and they saw right through her.", "I was totally on board with the title until I read the article...\n\n&gt;Au contraire white man. My black ass doesn’t owe Trump a damn thing. The same goes for anyone else in this country who is not white, straight and male—\n\nAgain, I am categorized based on shit I can't control. I'm automatically aligned with him based on my color, sexual orientation, and gender. Cool. Us. vs. Them is a totally fun game.", "I'm a progressive that believes the fault lies entirely with the Democratic Party establishment picking the wrong candidate. ", "[I wonder how much he'd be complaining had he lost](http://i.imgur.com/loS3eor.jpg)", "Seriously if I tell a trump supporter I am going to act like Donald trump, I feel like they would tell me to calm down and be civil. \n\nCase and point, trump supporters calling these protesters babies who need to suck it up and get in line. You know who said to go out in the streets and protest when a president they didn't like got elected by the electoral college? Donald Trump. So to the people complaining about the protestors, were you just ignorant of this fact or hypocritical?", "I don't fully get this and would be open to some explanations.\n\nWith the given that any xenophobic legislation that gets proposed or comes to his desk should be opposed forcefully and widespread in the streets.\n\nTrump has said conflicting things this entire election. Does anyone have any idea what Trump's actual positions are? I mean he was closer to a Democrat as a private citizen.\n\nAll we really know is that as a person who works a crowd he told voters what they wanted to hear and won the president 'game\".\n\nHas anyone looked at his 100 day plan?\n\nSpending most of his initial political capital banning congressman from becoming Washington lobbyist term limits for congress, and stopping lobbyists from lobbying for foreign governments would be great things.\n\nThings progressives want, but neither party has ever given even a conversation about.\n\nI would be very upset if democrats block this type of legislation just because they want to block any trump agenda.", "The white working class tend to feel resentful when you're constantly calling them racist sexist, homophobic, morons.\n\nEdit: I want to thank all the Dems below who are proving my point. You obviously still don't understand why your candidate lost", "At the very least as much respect as Republicans gave Obama during his two terms. So..... Yeah, none seems about right.", "...and they gave him back his Twitter account. ", "People need to keep a close eye on every single thing he does and says. I am serious when I say he exhibits many authoritarian tendencies and will act upon them in an effort to chip away at democratic institutions. People will say it can't happen here but given the developing defacto one party state partisanship will make for a perfect storm for Trump to enact a more authoritarian state. ", "I've heard my friends say \"they go low we go high\"  don't stoop to their level. Uh, they claimed Obama wasn't a citizen and treated him like he wasn't a human. As long as I stay above that low bar the right wing has set, my conscience is secure. ", "How can we honestly say that this was the cause of bigotry and hatred or a \"whitelash\" when the same people in Wisconsin Michigan and Pennsylvania who voted for Obama also voted for Trump", "Do you really think they would respond? The democrats actually worked with bush when they got the majority. They passed medicare part d, no child left behind and budgets.\n\nThe gop got into congress and PROMISED TO PASS NOTHING to shut obama down.\n\nThe problem is, youre acting like they care when they dont. And you caring about them only gives them more leverage to use against you. Its like dealing with a drug addict and saying \"ok I'll work with you this time and give you a little more drugs, because I dont want to be the bad guy.\" \n\nIt just doesnt work if they dont care.\n", "But when you have leaders that don't believe the science the discussions needed to solve the problem and delayed because the conversations becomes an argument about the legitimacy of the science.  The very nature of science makes this argument absurd.", "What you permit is what you promote. ", "Media ignored him and then attacked him during the primaries. So fuck the DNC and FUCK the MEDIA.", "\"lost the popular vote and still won...revolution!\"   \n- If you insist Mr. President", "\"As a reminder this Subreddit is for civil discussion\"     If this statement is true then why is this hate filled article allowed on Reddit.  The sole purpose of the article is to continue the the misinformation flow from media blacks that all whites are racist .  Reddit!  If the discussion is to be be civil, so should the news articles.", "Dude. Republicans tore down voter rights across the country and STILL do not have a mandate from the masses. Of course people are going to protest - he ran a campaign based entirely on hate and fear and only technically won. ", "Trump will never win the nomination... Trump will never win the general... Trump will never get re-elected...\n\nCome on now.", "This is not possible I was told there's not enough white males to propel Trump to victory in new multi-culturism America.  I guess that's just /r/politics doing what it does best: being wrong.", "Let's all keep treating the other side the same way so that things change... sound good?", " If you're not paying for journalism start.  I just subscribed to the New York Times and the Washington Post. Someone's going to have to pay for people to investigate.\n\n It's very chiq  right now to talk about how \"the media\" gave him airtime and failed to expose him, but those two papers were doing it every single day.  Good journalism, not trash cable news.", "or he took it back...\n\n\"I'M the next president. And I want my Twitter back. NOW.\"\n\nThe next few years are going to be fun fun fun", "Narrative.", "Going low apparently works so here we are.", "This is the only time I'll ever openly agree with Fox News.\n\nThis was seriously a \"No fucking shit\" moment.", "\"If you can convince the lowest white man he's better than the best colored man he won't notice you're picking his pocket. Hell, give him somebody to look down on, and he'll empty his pockets for you.\"\n-LBJ\n\n", "Because the silent majority doesn't exist as long as you continually insult them. See that's why Hillary won the election ^^oh ^^wait.\n\nEDIT: [Read up on what the silent majority is before you try to tell me I'm wrong.](https://en.wikipedia.org/wiki/Silent_majority) ", "Good thing there wasn't a single fucking question about climate change during the debates then huh?", "And the people you are supporting were calling for Civil war if Hillary had won so maybe you'd like to take a step down off that high horse and get a grip of reality. \n\nPeople are pissed off that the system allows the unpopular vote to become president based of rules written up in the 18th century when they were relevant but are hardly relevant in the modern age. ", "The sole purpose of this article was to keep the hate and division strong. Posts like these are why people are still rioting instead of doing something useful. This nonsense only makes them look worse and proves Trumps points. If you hate him good for you! If you love him, GOOD FOR YOU! Now get over it and go back to work.", "Im not optimistic since all eyes have been on him since day 1. However, I do hope investigative journalists stay tenacious on this guy", "Well that does it then. If the Sanders wing wants it and Schumer approves, there is no meaningful opposition.", "Every time I see this argument it pisses me off. Trump's plan is literally to tax companies until they're forced to bring their factories back. That won't work. Those jobs are fucking gone forever and if the Midwest doesn't realize that then they are idiots. It's time to move forward not backward. ", "I woke up today still disgusted that abject ignorance won America. It's not Trump it's what he represents.\n\nThese people want us to feel shame for supporting diversity. They want us to feel shame for valuing intellectualism and education. And these are the people that are now in charge, or feel emboldened by the result. \n\nThey will jeer at us for reading our books, for using our minds to ponder solutions to make a better world. They sneer at our \"elitism\". How dare us \"elitists\" value intelligence and reason!\n\nWe will not apologize for these values. We must fight to make these the values of America once again. Ignorance will not rule forever. It will not stand.\n\nFor so long, conservatives have waged their culture war while liberals mostly laughed it off, or mocked it. Democratic politicians did their best to compromise, to try to find areas of agreement with Republicans, even when they waged war by obstructing the process at every turn. It's time now for the counter offensive. The culture war, the war for values and ideas, is real now. Both sides now recognize it.\n\nThe next 4 years will be a battle to determine what will be the heart of America, what are the values that we represent. Will it be ignorance or will it be reason? Will it be racism or will it be diversity? The stakes are high, but I think this election has galvanized the left more than ever. \n\nPresident Trump and the GOP should prepare for an uncomfortable few years... ", "Fair enough.\n\nBut how much media scandal was there about trump suggesting he would not accept the election results.\n\nIsn't the movement of trying to get electoral college people to faithless elect hashragging not my president, claiming the popular vote is what should have won even those that isn't the agreed upon rules.\n\nAren't all those actions the same not accepting election results.\n\nIt seems this is another case of both sides just using rhetoric to tear down the other side, when their own side would do the exact same thigs in the exact same situations.", "This is Schumer aligning himself with the progressives. He must've seen the writing on the wall. \n\nThis is huge. This is what a power shift looks like.", "Democrats always take the millennial vote. It's hardly noteworthy.", "TLDR: If you voted for Trump you are a racist.\n\nDoes this mean like 10% of African Americans are racist?\n\nEdit: \nI probably worded this badly.  More African Americans voted for Trump than for Romney or McCain and less showed up to vote overall.  If race was their primary motivating factor, I can't imagine you see that demographic shift.", "I live in MO. There was an episode of the NPR podcast Planet Money out here where they asked people from Kansas and MO what they thought about others based on looking at them. One guy said \"you look like you read books\" about one of the participants. It was not meant as a complement.\n\nEver since I moved out here from New England that sentence has haunted me. These are the people in charge of my future. \n\nThis is America now. ", "In no way does voting for a candidate mean you approve of all of their policies.  If that were the case most people would never have a candidate to vote for. ", "I was hoping that the whole \"crooked media\" and \"professional protests\" would die out after the election. But no what a fucking baby.", "Yup. \n\nThere is a similar story about cookies and bankers. \n\n[Found it.](http://metro.co.uk/2016/08/21/a-banker-a-worker-and-an-immigrant-cookie-joke-is-resonating-with-facebook-users-6081944/)\n\nTDLR - \n\n&gt;‘A banker a worker, and an immigrant are sitting at a table with 20 cookies.\n\n&gt;‘The banker takes 19 cookies and warns the worker: “Watch out, the immigrant is going to take your cookie away.”’\n\nMy favorite is from the movie \"Big Short\" (a must watch movie/documentary)\n\n*\"I have a feeling, in a few years people are going to be doing what they always do when the economy tanks. They will be blaming immigrants and poor people.\"*   \n\n                      *- Mark Baum (Steve Carell)*\n\nIts almost eerily prophetic. ", "I fear part of this is outlets know that they may lose access and their credentials if they are critical of a Trump Presidency. His rhetoric during the campaign was \"get in line or get out.\" It looks like the press may be preparing to go full Chamberlain.", "I'm glad you've learned this.  So have I.  So should every other Dem reading this.\n\nTime to get petty entertaining, and disregard the *rules* that got us here.", "Goddamn monsters", "And August 2015 was when Bernie addressed the DNC saying that Democrats would lose the WH governor's races, and would not make gains in Senate/House of Reps, with more politics as usual, and that Dems needed a campaign that generates enthusiasm.\n\n", "Those trade deals are good for this country.\n\nIf the left has to become economically illiterate to win elections there's no point in even trying.\n\nTrade deals are not why manufacturing vanished here factually. Seriously, anyone claiming trade deals at fault, NAFTA mainly, is incorrect in every way possible.\n\nWe could leave NAFTA tomorrow and nothing would change, we'd just be paying more for consumer goods.", "Please don't categorize the protests as riots. This is not Breitbart. You would acknowledge that Trump said some things about rolling back gay rights restricting Muslims, and using stop and frisk in black communities. People getting together to say \"we don't like this\" is FINE. You're already hinting that there's something criminal in this (\"riots\"). You likely love the Second Amendment. Why not the first? ", "&gt;We are on the winning side\n\nWell no no you're not.", "And this guy is going to have his finger on the world's largest nuclear arsenal. I've already checked the fallout maps I'm in a pretty clear area. The rest of yall motherfuckers better find Jesus or whatever. ", "I found this on Reddit last night:  The Trump Tracker\n\nhttps://trumptracker.github.io", "Third Way Democrats held so many of us hostage. If we wanted basic civil and reproductive rights we had to swallow their Reaganomics and corporatism. No more now.", "Three of his top aides announced are a gay man a woman, and a black man. Which is polar opposite to what you are suggesting right now. Peter thiel, openly gay immigrant. Kellyann Conway, a white woman. Ben Carson, a black doctor / politician. \n\nI'm not looking to get in an argument with you, but just share some facts. Take it as you like it. ", "Of course not.  He's a Trump supporter. ", "Well it's also legal for the Democrats in the Senate to filibuster any nominees Trump puts forward.  If he makes the same gesture as Obama and nominates a moderate judge I don't think they should do that.  But if he nominates conservative judges, I hope they do.", "He was just telling it like it isn't. ", "I can't believe idiots in /r/pics think Trump is going to be *progressive.*\n\nPaul Ryan already planning on repealing Obamacare and hasn't said the Republicans prepared any legislation to replace it.\n\nMedicade is about to be gone.\n\nMedicare is next.\n\nSocial Security is about to be gone and privatized. \n\nFederal regulations preventing the banking industry from creating another bubble will be gone. \n\nHis supreme court pick will be a disaster.\n\nHis first year will be a disaster. All the people he rode to power on literally got sold out in three days. The 2018 midterms might just end up turning toward the democrats.", "Yep draining the swamp and filling it with sewage\n\n", "The swamp just got ten feet deeper.", "Neither was Bush and Obama didn't try to have him tried for war crimes.  \n", "Is nobody at all concerned about his constant anti-protest rhetoric? How long til he tries to make protest illegal. You know like a dictator. ", "&gt; They lost because they picked a shitty candidate.\n\nThat and insulting anyone who denied them. Don't follow the party line? Dare to vote for anyone else? You're a sexist, racist nazi.\n\nWow I wonder why that attitude failed? I wonder why people being treated like that didn't vote for you? Who could have foreseen that insulting people, making false claims about them, and just generally being lying little shits could possibly result in failure?", "Trump just loves it when people try to tell him he can't do something ", "Back when they had millions of members less than 100 years ago.", "I really don't get this fair chance shit.  Are you hoping he 180's on all of his policies and campaign promises?  Or he dumps his entire transition team?\n\nHe had his fair chance over the last year and should be held accountable for his actions immediately.", "\"Each presidential elector would exercise independent judgment when voting.\"\n\nIt's actually part of the point. Not happening but that's part ofthe point.", "Liberals are the ones getting angry at people for not voting for Clinton. Progressives aren't and they've known all along what was going to happen if it was Clinton vs Trump.", "Oh something else that wouldn't have happened with clinton in office?\n\nEvery single person who, before and after the election, regurgitated all that \"they're equally evil\" stuff I hope pays close attention to how it feels to lose the advantages of Obamacare, face restricted birth control access, and lose net neutrality perhaps permanently. That shit will just be the tip of the iceberg. Hope frothing continuously about the non-issue of hillary's emails was worth it to you. She might have had some problems but she would never have done any of the insane things trump has done already (promising to repeal Obamacare, appointing someone anti-science in a leadership role in the EPA)\n\nThis will keep getting worse and many of you are partly to blame if you let all the leftover \"Bernie didn't win\" resentment stop you from listening to literally everything Bernie asked for in the last few months (i.e. voting to keep trump out)", "Trump will never pull off a successful murder-suicide.", "Now Salon? Didn't you write those anti-Sanders stories and collude with DNC/Podesta behind our backs to write those anti-Sanders stories? \n\nTrying to appear on the \"right side of history\", huh?", "[Tell that to the Portland PD](https://twitter.com/PortlandPolice/status/796933213008474112)", "Dems don't think they lose because of bigots. But there sure are a lot of people who were able to put aside Donald's bigotry and vote for the guy. While also putting aside his inexperience or even basic understanding of how our government functions.", "You don't have to be a racist to vote for trump but voting for him means you're definitely ok with racism. Your vote is an approval of all of a candidates policies.  \n\nVoting for Hilary would saddle you with her warmongering and corruption and siding with the establishment\n\nVoting for Trump means you gave tacit approval of bigotry. \n\n\nStop making excuses.  Take responsibility. \n\nEdit*** for all the \"butthurt\" posters replying to me.  I'm sorry.  I committed the greatest sin.  I asked reddit to take responsibility.", "Oh wow great job [Bernie supporters](https://www.reddit.com/r/Political_Revolution/comments/5c9nn0/if_we_want_keith_ellison_to_become_the_next_dnc/)!", "This is just such a negative way of looking at why Trump won.\n\nMy parents voted for Trump and they aren't racists.  They are working class people who got fucked by Obamacare.  Sure some people who voted for Trump are probably racists, but to pretend that ALL of them are is stupid.  Some people like his less-hawkishness compared to Clinton, you know, his desire to work with Russia in Syria as opposed to create a no fly zone.\n\nHis economic populism saying he's going to bring GOOD jobs back to America.  That's what got voters out in spades for him.  He galvanized the people and made them believe that out of all the corrupt, bought politicians we have had for the last few decades that this guy was going to be the one to change that.\n\nNow you can not believe him on any of those issues, and that's your right to do so.  But to just say everyone who voted for him is a racist ignores a few fundamental issues he was incredibly strong on and Clinton was weak and dishonest about.\n\nThat's why we have Trump, not because 49.6% of america is racist.  To label the other side like that removes any ability to negotiate with them.\n\nAs for me, I didn't vote for either of these people, but I know that either of them being elected president isn't likely to end the world.  Trump said a lot of crazy shit and won his primary and now that it's over we will see how he steps back and chooses to lead.  If we are lucky he will put the dogmatic religious right in their place which is out of politics and maybe bring the republican party to be something more like the Libertarians, however time will only tell.", "And it really ticks my ticker to think about having a woman who plagiarized the sitting First Lady *become* the next First Lady. That part needs to go in the history books too.", "While it may make Democrats feel better about themselves to go high stuff like that is also why Democrats are seen as losers. Sometimes they should just fight because the fight is worth it. It's not \"might is right\", but instead \"right is right\". Every time the party loses, Dems seem to shrink away for a year until the next election. They don't have the year-round talking heads like Republicans. They don't have year-round media blitzes. The closest Dems ever had was John Stewart, but even he tried to temper some of the more left-wing news with a little right-wing to be fair. Politics are not fair. Left-wing news outlets should not be not fair. Left-wing radio shows shouldn't be fair. \nRight-wing media is strong because its audience tunes in and stays tuned in. Left-wing media hasn't coalesced since its audience is fickle. It's audience are cord cutters. It's audience are Pandora and Spotify listeners, not FM or AM. It's audience reads books or doesn't read. \nThe right-wing base is steady, because they are generally steady in nature-unchanging in temperament, attitudes, habits, etc. \nThe left-wing base (if there was one) is progressive and always looking, willing to change their minds about ideas and how to proceed. \nThis is oversimplification, but an example is why Occupy Wall Street never got anything done. The group had too many ideas and not enough media-capable figureheads with distinct messaging. ", "&gt; And if it does why wouldn't she be jailed?\n\nWho said that she shouldn't? But the first part of your statement is the more important one. None of the people chanting \"lock her up\" have been able to bring up any actual crimes that she has supposedly committed in connection to the Clinton foundation.", "&gt;Check the millennial vote. Guess who is going to die off first Trump supporters, or young people? \n\nPeople have been saying this for decades. And guess what? It's never held true. People tend to skew conservative as they get older, they don't always stay liberal. Sorry to have to be the one to break the news to you.\n\nEDIT: people arguing with this need to reconcile the fact that the young vote went to HRC, and the fact that Trump has been painted as super conservative. If people don't skew conservative as they get older, then who voted for Trump?", "Ok Trump America called your bluff. You're President now fucking act like it. ", "Well actually Hillary did adopt many of the Bernie platform. Bernie was actually successful in dragging Hillary to the left. And Bernie has been repeating that throughout the presidential campaign and begging people to support Clinton. Bernie is a pragmatist. He knows whats good for the country. It's too bad the voters couldn't see his struggle", "This is apparently what the American people want. The election proved that \"they go low so we go high\" is a naive and ineffective political principle.", "There's an argument to be made here about the high-road but most Republicans I know literally spout faleshoods when the topic of politics comes up and they reject any contradictory facts that I state, so I've got a very small pool of respect for them, as it is.", "It's called a \"riot\" when you smash and torch everything in your path. ", "That's kind of how responsibility works. Sorry. Saying you want to protect the environment but voting to dissolve the EPA just makes you a liar.  \n\nNo one gets their dream candidate. It's a compromise. That's why voting is an important decision. If you're not ready to accept responsibility you shouldn't vote.  Sounds like you're not there yet. ", "&gt; and they will believe it.\n\nI. Don't. Care. what the Republicans think at this point. I do not care what their echo chamber will say.\n\nDemocrats have to stand and fight and have to start telling our own narrative.", "\"Liberals\" should really start looking up what Fascism means. I like how the terms \"liberal\" \"socialist\", \"communist\" and \"fascist\" have departed so far from their original meaning. ", "What do you call purposefully bundling toxic assets with good assets paying off ratings agencies to rate the now-ticking time bomb assets as AAA and then betting on them to fail after selling them to their customers? Just immoral?", "What's important is the *order* in which this occured. Sanders and Warren were among the first to suggest it; Schumer came after. \n\nThis means that *the establishment wing is following the lead of the progressive wing.* It may seem like a small thing but it absolutely is not. This is the establishment wing recognizing that it has lost authority and credibility and listening to what the progressive wing has to say. ", "\"Conservatives\" need to start looking up what socialism and communism means. \n\nEveryone needs to be more informed. This election was not an informed debate. ", "&gt;Between Facebook Google, Amazon, Salesforce, Microsoft and Apple, you’d also have data on every movement, click, purchase, desire, taste trend, business deal and bad habit in America. You’d have the data to know exactly what issues to address to get any individual to vote for a candidate, along with the reach to hammer home your message over all the nontraditional media—your WhatsApps and Instagrams and LinkedIns.\n\nWow, certainly doesn't sound ominous or like a corporatocracy.", "Coward in Chief.", "Chapter 1 of the History of Insignificant Events", "It's impossible to be racist towards white people. Duh! Call them back wood sister fucking hicks, you get applauded. Call a black person who beat a Trump voter \"thug\", you're racist. Call an illegal alien \"illegal immigrant\", you're racist. Call a Muslim who supports violence an extremist, you're Islamophobic. It's been the Democrats' and liberals' game plan, which is why half the country turned their back on them. Excuse every minority's actions while blaming everything on white people. As long as the terms racist, sexist, Islamophobic, xenophobic and bigot are the only argument from ignorant SJW and millennials, then Democrats will always be their worse enemy. They've done more at dividing this country than Trump. \n\n\nPeople want to say he got voted because of white racists, I'd like to know how many racist Muslims, African Americans, Latinos, and self loathing Caucasians voted for Hillary. ", "As far he knows he is.\n\nJust let that sink in.", "I treat people as I want to be treated not as they have treated me.  I am good to people because I am good, not because they are.", "As a lone voice of reason nearly lost within this shouting match I am deeply grateful to have found your comment and hope more people will see it also and reflect on it.", "Instead of bitching about the past that is now out of your control how about thinking about the future and recruiting that majority of people that couldn't find the time to **FUCKING VOTE!!!**.", "It's complete bullshit. The Party abandoned them; it wasn't some racially motivated vote.\n\nClinton lost *Macomb County Michigan*, which Obama won in 2008 and 2012 by a 4-6% margin. This is a predominately white middle-class county that helped in handing Obama Michigan just four years ago, and Clinton lost it.\n\nShe also lost 11 other Michigan counties that Obama won. It's because she was a shitty candidate and her message sucked, not because a lot of racists saw an opportunity in Trump.", "Precisely.  They didn't think twice about stacking the deck against Bernie because they knew best.", "Given that there were over 9 million fewer Dem voters in 2016 as opposed to 2008 I'd say they lost more than just a few white guys.  They lost a LOT of almost every damn demographic.", "In that case the media deserves the respect they showed the people. Little to fuck all", "I'm just ready for politics to be about politics again. This shit is just childish", "Trump got between 30% and 40% of the Hispanic vote in an election where building a wall to block off Mexico was a key platform.\n\n\nImagining that the Democrats are somehow going to do better in that demographic in non \"let's just build a wall\" years, is dreaming.\n\n\nTrump also won 40% of the female vote, in an election where he was running against a woman and his quote of \"Just grab them by the pussy\" was talked about a lot.\n\n\nThe problem the Democrats have isn't going to go away with time. If anything, it's getting worse.\n\n\nBILL Clinton was able to carry the rust belt, large parts of the South, and was able to connect with white working class Americans.\n\n\nHILLARY Clinton was able to connect with Goldman Sachs, Saudi Arabia, and whatever spoild shits support globalism.\n\n\nThe Democrats ran a candidate who lost the working class vote to a billionaire.\n\n\nThe Democrats ran a woman candidate who lost the white female vote to a womaniser accused of sexual harrasment.\n\n\nThe Democrats lost the evangelical and religious vote to a three-time divorcee who never attends church.\n\n\nDemocrats need to look deep inside thier party and figure out what the hell they are, and what they're trying to be.\n\n\nIf you want to be the party of globalism, high finance, neoliberalism, \"no fly zones\" over Syria, and the party that cozies up to the Saudis while they commit genocide in Yemen...\n\n\n...then who the hell do you imagine the Democratic base is?", "From the names being floated it's a cabinet of failed political rejects that we would have seen the last of if Clinton had won.  Rudy, Palin, Christie...  Ew.", "It had better be. The next question we need to find out is whether Democrats heed the warning. \n\nSo far the signs look good -- Chuck Schumer has gotten in line behind *Sanders'* preferred DNC chair Keith Ellison. But we need to see more. We have to see that the Democratic establishment understands the significance of their loss. \n\n", "It will be fun to watch Trump crawfish out of all those campaign promises he made that he can't possibly fulfill.", "If Trump honestly were to do the progressive things he said he would do he is in good shape.  If he goes extreme right wing, everybody will say \"I told you so\"", "This is what Black Lives Matter and all of this \"FUCKING WHITE MALE\" hysteria breeds. A destructive Us vs Them mentality and I get very nervous when I think about how this is going to end.", "The media has been failing in its mission to provide the electorate with reliable and factual news for decades and has instead focused on ratings.  It has become a sad and pathetic enterprise.", "Thanks middle america for once again proving yourselves inept", "It's been like 18 months tho...", "They impeached Clinton for lying to congress.\n\nLucky for Honest Don he doesn't have to worry about that.", "Put yourself in the shoes of a factory worker in Michigan PA, or Wisconsin.  The single most important thing to you is your job, or the job you lost because of trade deals.  \n\nBased off that one issue who would you vote for?\n\nYes, when everything is going great for you, you can look at every other factor too like \"oh, Trumps' saying he is against abortion, can't vote for him\"\n\nWhat the hell does an unemployed person care about abortion compared to getting their good paying job back?\n\nThe answer is all these social issues are largely inconsequential to people who need economic relief and Clinton had a track record of choosing corporate interests over the interests of the people.  ", "You can treat someone you don't respect well.", "If you don't calm down though you're going to guarantee Trump 8 years. Rioting is not OK. Beating the shit out of white people while screaming \"he voted for Trump? Get him!\" is NOT OK. This is what drives moderate Republicans and Obama voters who voted Trump squarely in to his camp. And worse it gives cover and more power to white nationalists who now get to say \"see? The blacks are having a total fucking freak-out because they can't control themselves\" and the worst of it is they're kinda right. \n\n[link to video of the attack if anyone doesn't believe me](https://youtu.be/BmljpCj27tk).", "It's fine to have your opinions it's not fine to go onto the streets and destroy the stores and livelihoods of American citizens because you are unhappy that a fair election didn't go the way you wanted it to. These violent protesters are a disgrace. ", "Blatant racism is perfectly acceptable from the left these days. ", "\"Democrats\". \n\nIs this poll from the same people that had Hillary at 90% odds of winning? ", "Don't worry.  A few months of Donald will be the best organizing tool the left ever had.", "Believe me I think Trump is a charlatan but hearing him go after Carrier and Ford was music to the working class ears because nobody on the left or right dared to stand up to them before.  We'll see what happens, I wish Trump luck because I want this country to succeed.  ", "&gt; Has anyone looked at his 100 day plan?\n\nI have and it's terrible. Deportation force is in there banning of all immigration from \"certain regions\" is in there, obliteration of incentives for clean energy is in there, defunding of anything related to climate is in there, the wall is in there, banning visas for *any* citizen from a country that \"doesn't take back their illegal immigrants\" is in there. \n\nIt's everything in his campaign. It's terrible. ", "If you've been on reddit as long as I have you have come to realize that r/politics is pretty much 90% of the time wrong and I'm being generous with 90%.", "Already whitewashing his Twitter. \n\nLMFAO what a tiny fingered vulgarian. \n\nFuck Donald Trump. ", "I'm worried less about Trump and more about what Trump is going to do to the office of the Presidency. Demeaning that is not to be taken lightly. I don't want the President's words to constantly be bullshit and become even less relevant as we move forward. \n\nWhen people stop paying attention that's the scary part. ", "It's actually hilarious at this point. They're not just whistling past the graveyard they're whistling while the zombie horde drags them into an open grave.\n\nI cannot believe *any* political party would look at a loss of this magnitude and conclude \"We're fine, everything's fine, we'll get 'em next time for sure without changing a thing,\" but that seems to be exactly what's happening.", "I've looked at his 100 day plan. As a liberal it is a horror. The only appealing thing in it was the lobbying ban except he's been bringing in actual lobbyists to his campaign these past few days like the head of Altria and Goldman Sachs. My question is have you looked at his full 100 day plan as well? \n\n", "All you need to do to get those yokels to worship you is put on a baseball cap and say something racist. Their hero is Richie Rich from NYC. Hilarious if a little sad.", "Right. And I agree with that.\n\nMy worry though is that Democrats will block progressive legislation just because he's trump.\n\nIn the same way Republicans blocked obamas conservative legislation proposals just cause they came from Obama.\n", "He will after inauguration. Interestingly the administration will hand over the accounts, and all of the followers will be kept, but Obama's tweets will be removed and preserved by NARA. So Trump gets an empty account, but with a ton of followers.", "When he said \"drain the swamp\"  I didn't know he actually meant \"fill it up more\".", "^^ This. Pay for journalism. Support the ACLU (I just started a $20 a month donation). Write your Congress critters if any erosion of rights is proposed. Protest legally and peacefully. Do not let the upcoming 4 years be one that dismantles the freedoms inherent to democracy.", "Yeah well this time, they'll really mean it. The DNC is hiring the best They're going to write Tweets and reblog memes. They've already got 1,000+ bloggers ready to write articles about how Trump is going to personally break down your front door and put you in a death camp for being a minority, or gay, or even really just any color other than pale white or heartthrob orange.\n\nThey spent the last two years doing this, so they've really improved. Just wait. ", "haha 90%... Huffpost had her at 98.4% chance of winning. ", "I hate this sub.  A hugely upvoted article about how america is racist and we need to burn the fucker to the ground.  \n\n\"As a reminder this subreddit is for civil discussion\", pffffft, yeah right.  \n\nThis may come as a suprise but of those 59 million people that voted for Trump, they aren't a showing of racist America making it to the polls this fall.  What they are is a combination of folks that are tired of getting fucked in the ass by establishment politicians that are self serving.  Not that Trump isn't self serving, he probably is but we just don't know yet.  If the democrats didn't run the most openly corrupt party they might not be where they are now.  Hilary Clinton, the DNC and the news media are responsible for doing everything they could to get Trump elected.  Well they got what they wanted, time to stop crying and get behind our new president. ", "Good god. You guys just *want* Trump to fail. You realize that if he fails you go up in flames too?", "I know plenty of highly educated people who are very conservative.  \n\nMuch like any other label \"conservative\" hides more than it shows.  The tech worker sitting next to me who had a poli-sci/history double major has diddly shit in common with my evangelical mom.  Except that label.  \n\nDitto with every other label flung around.  I'm in a middle american swing state, the descriptions the democrats and media used to describe people here are ridiculous and insulting.  ", "That isn't good. Do you really think it has nothing to do with your parties platform? What about the fact that the DNC has become\nAlmost anti-white in some of its rhetoric? The Democrats need to do a Post-Mortem on their party. They have been losing power for a long time. This didn't start with Hillary.", "This shit is pissing me off more every time I see it. Trump supporters do not get to blame the left for insulting and stereotyping people. His entire campaign was insults and stereotypes. No most Trump supporters did not vote out of bigotry but they sure as fuck signed off on it. ", "Which is exactly why we need to keep doing it.  Not a week should go by without a Trump meltdown revealing exactly how unstable he is.  \n\nOn the other hand sometimes I wonder if the left turned around and embraced him if he wouldn't dump the right in a minute.  More than anything he seeks adulation and I think he'd rather find it in popular culture than a bunch of stodgy Evangelicals in Oklahoma.", "The first thing he and congress are going to do is repeal Obamacare (they'll feign a \"replacement\" later) and cut taxes for the rich (also known as themselves).\n\nThen they'll all stand around patting each other on the back for making America great again - and calling anyone that disagrees unpatriotic.", "It goes beyond the political hacks (Rudy Christie, Palin).  The level of incompetence and ignorance that he will bring to leadership positions across the board is terrifying.  To give an example our current secretary of energy is a nuclear physicist. Prior to him we had a physicist that is nobel laureate. Trump's shortlist has an oil and gas tycoon and a venture capitalist.\n\nSome of the most important responsibilities of the department of energy include the nuclear weapons program, building nuclear reactors for the navy and managing radioactive waste disposal. What could go wrong here.\n\nRepublicans are always saying government doesn't work. Well not if you fill it with incompetent people.  This is how you get \"Brownie, you're doing a heckuva job\"\n", "That's what Trump has been saying all along. Of course this article doesn't want to give Trump any respect they were the ones he very rightly disrespected the last 18 months.", "It's amusing to me that the conservative retort lately has been \"aren't you supposed to be better than us?\"", "This is no longer funny. ", "But Clinton herself did accept the results. There would have been protests either way", "Block? How so when the Republicans have a sizeable majority in the House and also have control of the Senate. \n\nEdit: I understand that there is plenty of contention amongst the Republican party and Trump so not all of the legislation he would like to enact might come to fruition. However I was specifically referring to OP's statement.\n\n&gt;My worry though is that Democrats will block progressive legislation just because he's trump.\n\nThe Dems don't have great enough numbers to block legislation without support from Reps. So if legislation is blocked that blame should lie squarely on the disunity of the Republican party. How Fox News will swing it is another story. \n\n\n", "I kind of look forward to the backlash from his supporters as he fails to keep promise after promise.", "I think it had a lot to do with both Clinton and her platform. I also believe the party establishment has strayed a bit from progressive ideals and become too bound to big money donors instead. I also believe that will change with the Clinton political machine exiting the scene.", "Logic I've taken from this post &amp; pretty much the entire campaign.\n\n\"Mexicans are rapists\" - Donald Trump\n\n\"Trump says Mexicans are rapists.\" - NYTIMES\n\n\"OMG NY TIMES WRITES A NEGATIVE ARTICLE ABOUT TRUMP WE'RE SO SHOCCKEED.\" - Trump supporters\n\n\"Lobbyists need to be put in check. Lobbyists bad.\" - Trump\n\n-Puts lobbyists on his team-\n\n\"Trump puts Lobbyists on his team after campaigning against them.\" - NYTIMES\n\n\"WOW NYTIMES SO RELIABLE LOLOL NOT.\" - Trump supporter\n", "The problem with thinking Democrats lost because of the bigot vote is the Bigot vote is always already a shoe-in for the Republicans. There's no point fighting it.\n\nTrump got less votes than Romney or McCain. Democrats didn't lose this year \"due to excessive bigot vote\".\n\nDemocrats lost because a very powerful, boring, \"I say anything to get people to like me\", \"OMG SHES EVOLVING COOL\", candidate shoved her nomination down our throat.\n\nAnd she had like 70% of the DNC helping her do it, basking in her potentialy \"first female presidency\", and about 20% not giving a crap,\n\naround 10%ish gave a crap, and didn't want Democrats to lose. They formed a coalition of largely unusual, some non-democrats, some republican, some super liberal disaffected, and nearly beat her... It wans't enough for Media rigging, perception rigging (via superdelegate announcement), and collusion within the DNC. It also may have simply not been enough given the shitty closed primary system, and due to the Citizen United SCOTUS ruling, but they nearly did it.\n\nIt should have been a clear sign that someone *as weak as Donald Trump* probably will beat her. **But Hillary Clinton didn't even try to win**. She didn't even try to visit the rust belt states that were polling close. *nooooooo*, she wanted to fucking flood Florida with offices.\n\n", "The climate doesn't care how you voted... or if we live or not", "I was listening to a call-in show yesterday and a Trump voter (who believes in climate change) accused the host of being a \"single-issue voter\" on the environment. He said stopping ISIS is more important. This is what we're up against.", "Classic whataboutism. ", "I would probably choose the same thing however your example is hyperbolic.  The world isn't going to end because of Trump.  Even if you want to argue the long term effects of greenhouse gases mean the end of the world, then the world ended under Obama since the point of no return was hit around 6 weeks ago.\n\nAs for automation, I completely agree with you.  Those jobs are going to die anyway, might as well force those companies to pay our people until they finally get automation.  Outsourcing just puts back automation by 5-10 years and I see no value in that.  At some point we need a Universal Basic Income anyway and I think a full shift from workers to robots will be what drives that.  Until then I see no reason to make the american working class suffer for 10 more years because of shipping jobs overseas just so CEO's can add another 0 to their bank account.", "I can't believe this is real. Holy shit that's accurate. \n\nBut it might still be things that would eventually happen and he simply predicted them and suggested using them to Russia's advantage.", "Here's the thing though yes, I completely understand where people are coming from. I didn't respect Trump either, and still don't really yet. But actually give him a chance. Since being elected, he's discussed unifying the country, congratulated Hillary on all the great public service she has done, and said Obama was a very good man and that he would seek his council in the future and that he hopes to meet with Obama again soon. While he's still not quite there yet, President-elect Trump has certainly been more resectable than Candidate Trump. It seems like the things he said when he was running may have just been to get people to vote for him.", "I wonder what percentage will \"unfollow\" on January 20th?", "Anyone who has had to deal with narcissistic types long enough know what the GOP and Trump response is. It's called Gaslighting. They're going to make everyone else seem as unreasonable while they were the craziest fucks around. ", "I mean it is hard to take posts like this seriously when Hillary won the popular vote. Yes, Donald Trump won the election, but saying it was a complete rejection of the left's ideology is absurd. Literally more people voted for the left's ideology than for Trump. \n \nTrump supporters were literally calling for armed protests, grabbing guns, etc. if Hillary won, but people aren't allowed to protest since Trump won? I'm not saying I agree with all of the actions you posted, but there are obviously bad actors on both sides of this. Pretending otherwise is just disingenuous. ", "I like how all of the Trump supporters on my Facebook are mocking the protestors when they are supporting a guy who literally said he wouldn't accept the outcome of the election.", "I agree. We probably should accept that he is now president.\n\nBut understand the fear involved was that *Trump* the presidential candidate, wasn't going to accept the results. We knew the people wouldn't. It was scary their candidate wouldn't.", "Media ignored &amp; attacked him because DNC and DNC's entourage told them to. Any criticism towards Clinton was symbolic at best. I too would be pissed if my justified Anti-Clinton comments got discarded as \"White Berniebro that will still flip to Hillary no need to pay any attention to him\". I am an adult. I can make my own decisions. I don't like being taken for granted.", "They lost the House Senate and Presidency. They lost all branches of government now. It was a complete rejection of their ideology by the American voters at the voting booth. So after going crazy at Trump for merely suggesting he may have a problem with accepting the results, how does the left react to him winning?\n\nIn uber liberal Portland they're going completely insane and rioting, [attacking the police.](http://www.dailymail.co.uk/news/article-3931214/Police-attacked-rocks-bottles-anti-Trump-protests.html)\n\nIn Oakland, unruly protesters smashed windows, set fires and clashed with riot police. [Three police officers were injured.](http://www.nbcbayarea.com/news/local/Three-Oakland-Officers-Injured-30-Arrested-at-NotOurPresident-Protest-400677131.html)\n\nThey're [ganging up to beat up Trump supporters for voting Trump.](http://www.liveleak.com/view?i=27f_1478817574)\n\nThey shut down a major highway in all over [like in California](https://twitter.com/RubinReport/status/796605440079446016)\n\nThey were [throwing rocks and breaking windows all over.](https://mobile.twitter.com/itsmikebivins/status/796946492032450560) \n\nIt's not even just at these \"peaceful protests\", Trump supporters are [getting attacked at schools for merely saying \"I hope he wins\".](http://www.ktvu.com/news/216760384-story)\n\nFor months now they've been coming to Trump rallies and physically beating up people, [literally hitting people on the back of the head with bags full of rocks](https://www.youtube.com/watch?v=svaGiSj8Pdo)\n\nEven on the other side of the planet [in Australia they're attacking Trump supporters](http://www.9news.com.au/national/2016/11/09/23/50/tempers-flare-at-sydney-uni-election-party/?ocid=9newssfb).\n\nAnd all of this because these people can't handle someone having a different political opinion than them. \n\nIf the left wants to know why it lost, it should look in the mirror. If you respond back with \"but she won the popular vote!\" even though the vote hasn't even been counted yet and military absentee votes haven't been added and even though it's only 0.2% difference right now, you're sticking your head in the sand. The left lost complete control of government and until it reforms itself to listen to the working class instead of labelling them racist and out of touch, it will continue to lose. You lost fucking Pennsylvania. You all need to do some soul searching right now instead of lashing out and pretending you did nothing wrong.\n\n\n", "but aren't you morally and intellectually superior to those backwards conservatives? ", "Blue collar unemployment is a real issue but Trump used that fear to his advantage and lied to those voter's face. Those factory jobs are not ever coming back, no more than the textile mills, becuase there have been structural, irreversible changes that we have to adapt to.", "You mean heroes. Best way to get Trump out of office in 2020 or sooner is to let him do his thing as much as humanly possible.", "&gt;accurate \n\nThe polls were a spectacular failure at predicting the election. What about them was accurate?", "On my Facebook page the same people who declared they were being discriminated against because airports and malls were scaling back on their Christmas decorations are telling the people who are legitimately afraid for their lives to grow up.\n\nI can't even. I am so upset that my taxes will go to a government that is dedicated to taking away my rights and the rights of my fellow Americans. ", "Youre buying into their propaganda. They say racist things we say thats not right. They say, \"donald trump just got another vote\"\nThat's not how it really works though, it's not like the racist was saying \"hmm, I'm on the fence until the left didnt love my racist ideas\"\n\nThis is more manipulation from them. You can start agreeing with racists if you want too, but none are going to change party affiliation.\n\nSimple fact is, if you look at the vote, trump got about as many votes as mitt and mccain and bush. Our actions didnt change minds, thats just a victim ideology they push. It's the same people voting for the gop.", "I said ignorant not racist. Ignorance is lack of knowledge or wisdom. Anyone who believed even ONE word that came out of that bloviating buffoon's mouth this year is willfully ignorant. He blurt out a tsunami of lies and bullshit that was readily verifiable and they ignored it all.\n\nThis was all an OBVIOUS con. The man didn't have a single plan! He was nothing more than an orangutan with a megaphone randomly blurting out Sean Hannity and Alex Jones soundbytes. It was clear as fucking day, and they bought that! \n\nSorry, I cannot respect people that are so willing to ignore all reason to support someone who just bullshits crap that they want to hear. He has NO governing experience. He is a noted con artist on trial for FRAUD. His \"policies\" if you can call them that are nothing more than wish fulfillment. If anyone truly believed the president had the power to force companies to manufacture in the US they are flat out DELUSIONAL! Trump ran his campaign like he was running for emperor, not president. \n\nWe just elected a man who was a game show host for the past decade. This isn't Reagan who was the governor of a major state prior to becoming president. This is a reality TV personality who runs fraudulent businesses on the side. That's who we just elected president. \n\nThe sheer insanity of this is almost too much to bear. If someone told you 10 years ago that Donald fucking Trump of the Apprentice would be President in 2016 you would have laughed them right of the stage, and you would have been right to do so. That millions of Americans willfully chose this is absolutely terrifying. The founders would be spinning in their graves to discover that their experiment of Democracy culminated in this... ", "I'm a Trump supporter and I look forward to it. I hope there will be a populist, left-leaning party to oppose the Republican party by the time the midterm race rolls around. I hope it's one that won't rely on identity politics and won't strictly talk past the opposition, and I hope that this new right movement similarly won't simply talk past their new left-leaning counterparts.", "And where's the news about this? Sources on 11? I'd actually like to read this. I had a theory about Evan McMullen \"the mythological candidate,\" pulling those votes out of swing states. He shows up 2 months before the election and pulls nearly identical numbers to Clinton? ", "No see, those don't count because they have the wrong opinions.", "More true than you know... listen to the language of his supporters they even use a kind of newspeak loaded with metaphorical shorthand. ", "&gt;If the left has to become economically illiterate to win elections there's no point in even trying.\n  \nThank you. And honestly this is my greatest concern for the future I can't see myself supporting a party that wants to distance itself away from expert consensus. I don't want a liberal GOP, I want a party that is backed by reason and empirical evidence. \n  \n", "i'm no Republican and not any kind of Trump supporter.\n\nbut there is so much fucking truth in this post that it hurts.  the people dealing with post-traumatic cognitive dissonance this week are perhaps not ready to hear this but MAN do we all need to.\n\nDemocrats need to do what Trump just got done doing in order to eat their lunch:\n\n[Listen to the people in middle America. They are trying to tell you they need help.](https://www.amazon.com/Politics-Resentment-Consciousness-Wisconsin-American/dp/022634911X)\n\ndo it or you will never carry a Midwestern or Rust Belt state outside of Illinois again in my lifetime.", "Well he's already started/promised to gut Dodd Frank and the EPA. So by all accounts he's pushing a conservative agenda. \n\nHell financial stocks soared yesterday on the Dodd Frank news. Get ready for deregulated banks.", "Colin Powell did exactly that shit instructed Hillary on how to do that shit, yet there's been no investigation of him and no talk of jailing him.\n\nAnd that's how it should be, because all they both did was being rather careless with documents that were technically classified but in practice so bland that even all the millions spent on the investigation didn't turn anything up that even corrupt Comey could sell as indictable to the gullible.", "Yeah.  Donald starts his campaign talking about Mexican rapists and then complains about 'identity politics.'  Remember the judge who counldn't try Trump's case because of race?", "The GOP has the majority and controls the Senate's agenda. Garland isn't blocked by a filibuster he's blocked by the Senate leadership refusing to put him on the calendar.\n\nThe majority also has the power to vote to change Senate rules and eliminate filibusters for judicial appointments.\n\nLiberal members of the court thinking of retirement will want to try to hang on till the midterms because winning back the Senate is the only way Democrats have real power to block Trump-branded Pence extremists from taking the bench.", "You know who else cares? *Really* cares? The people that used to work them.\n\nI get it - those jobs aren't coming back and trump is a liar for promising it. But those people are really insecure about their future right now and don't feel either parties are representing. I know that reddit is an echo chamber of mostly college kids and young professionals but there are large swaths of people that aren't being represented. Maybe instead of smugly dismissing them as stupid, you should take some time to understand their concerns and politicians should start addressing them instead of just promising free stuff to young people.", "I gotta agree with you friend. Im genuinely confused as to the purpose of statements like that. When someone punches you in the face, you cannot stop them from a 2nd punch by mentioning to them that you are above the very idea of fighting. We aren't talking about a Bernie-like candidate who actually stays issue focused. We are talking about 2 sleazy, bare knuckled, old-timey boxers.", "Whatever happened to taking the high road? Stop being pretentious assholes and give the man a chance. This is the same shit the GOP did to Obama in 08' and 12' and our country should be better than that.", "&gt;into thinking the republicans are going to take away their social services  \n  \nTo be fair that is exactly what republicans are trying to do", "This will be one of the first of the major let downs coming for Trump supporters. The \"lock her up\" chants were just there to fire up the rubes. Trump has no interest in doing anything of the sort.", "None of the establishment seemed to ever acknowledge this group of people and they swung the election, IMO.   There's a group of progressive people out there, who want government to work for them, but not get in their way and tel them how to think.  They're not liberal in a SJW way, but they are not conservative in an economic way either.  They are live and let live types who aren't worried about gay marriage as much as they are worried about the price of corn.  Identity politics doesn't appeal to them, and neither does the sermonizing of a Cruz.  They want a government that does the right stuff, not just stuff.  With Bernie, they saw a way to get it done with a nice guy, and when that option was removed, they went with a way to get it done with a mean guy.", "I'm a Canadian in Berlin .. so thankfully I don't have to support any of your goons.  Generally I lean more to the left.  I don't like Trump.\n\nBut .. all sides engage in blatant hyperbole.  It just doesn't help anyone.  It gives fuel to the \"other side\" and just opens your argument up to being called out on BS.\n\nFor example ..\n\n&gt;the man who described Mexicans as rapists\n\nIsn't it *more true* to say that he described *some* of the Mexicans *who were coming across the border illegally* as rapists?  Still a bit of a prickly thing to say .. but less radical than \"calling Mexicans rapists\".\n\n&gt;proposed bans on Muslims for no other reason than that their religion gives him the heebie-jeebies\n\nOh reeeeallly?  \"No other reason\"?  You can't think of any other reason?  Nothing else goin' on other than a dislike for Islam? And \"a ban on Muslims\"? Is that really what he wanted?  To \"ban Muslims\"?\n\nI like to stand with the Left, and I think that there are valid points to be made.  But I can't stand with people who use the same shitty tactics of mis-quoting, selective quoting, and \"re-framing\" that I hate to see on the Right. \n\n", "Yep that's pretty much how it's going to go.  There is no plan to \"replace\" Obamacare.  20 million + people are going to lose their health insurance, and then the cost of those uninsured using the medical system are going to be dumped onto those of us who have coverage.  For an area of the country rampant with expensive diseases (i.e. diabetes), the Rust Belt is going to be a miserable place to live.  I hope they enjoy how Trump overturned that Kenyan liberals signature achievement when their fingers and toes are following off because they can't afford insulin.  ", "That's bananas. Neither Trump or Hillary pulled Obama's numbers. \n\nIf they would have they would have voted for Hillary and she would have won. Obama's voters either voted Hillary, wrote in Bernie, went 3rd party or just didn't show up. Period. The amount of people that supported either of Obama's runs AND voted *for Trump* I highly doubt would be a statistical figure to ever matter. \n\nThe fact is—Hillary was an unlikable candidate that didn't pull the numbers Obama did. Not that Obama's voters voted for Trump.", "&gt; There are many reasons and that is certainly one of them. Do you really not think it played a part?\n\nI mean yah bigots voted for him but its not why Democrats lost. We lost because the party was blind to what the people wanted. We lost because Hillary was a terrible choice.", "We don't owe Donald Trump shit. We *do* however, have an obligation to respect the democratic process. Like it or not, he's our president now. I hate it and I will fight him for the next four years, but we must respect the office. And make sure he's only in it for one term.", "I thought Obama would give him the @POTUS username. ", "I find it so ironic how Wisconsin and Michigan the same states where Bernie beat Hillary in the primary are the states that also handed Trump the election. ", "Trump rolled to victory on a wave of spite.  Many people voted for him not because of his bigotry but in spite of it, and to poke the DNC right in the eye for their tampering.  ", "Ignorant of what? Foreign policy? Yep. Macroeconomics? Yep. Climate science? Yep. \n\nHow their personal economic situation has changed in the last 20 years?  Nope. And that's what they voted on. ", "He won because he spoke to a forgotten American working class core that both the GOP and DNC establishment forgot. \n\nReddit didn't want Trump (and will respond with emotional anger to this post).\n\nTumblr didn't want Trump.\n\nThe Bush dynasty didn't want Trump.\n\nThe Clinton dynasty didn't want Trump.\n\nObama didn't want Trump.\n\nHollande didn't want Trump.\n\nMerkel didn't want Trump.\n\nMost EU leaders didn't want Trump.\n\nTrudeau didn't want Trump.\n\nEvery pro-TPP politican in the world didn't want Trump.\n\nCNN didn't want Trump.\n\nABC didn't want Trump.\n\nMSNBC didn't want Trump.\n\nPBS didn't want Trump.\n\n95% of the mainstream media didn't want Trump.\n\nHollywood didn't want Trump.\n\nBlack Lives Matter didn't want Trump.\n\nBlue haired feminists didn't want Trump.\n\nKoch Brothers didn't want Trump.\n\nGeorge Soros didn't want Trump.\n\nKarl Rove didn't want Trump.\n\nMitt Romney didn't want Trump.\n\nThe entire Republican Party establishment didn't want Trump.\n\nThe entire Democratic Party establishment didn't want Trump.\n\nAll of the San Francisco social media companies (Google Facebook, Twitter) didn't want Trump.\n\nApple and other outsourcing corporations didn't want Trump.\n\nLe Epic liberal celebrities like John Oliver, John Stewart and Stephen Colbert didn't want Trump.\n\nPeople that label everything racist/sexist/xenophobic didn't want Trump\n\nGoldman Sachs didn't want Trump.\n\nJP Morgan didn't want Trump. \n\nMorgan Stanley didn't want Trump.\n\nA shit ton of other globalist financiers didn't want Trump.\n\nThe elitist out of touch assholes at the major news networks didn't want Trump.\n\nThe entire globalist establishment of corporate interests didn't want Trump.\n\n......\n\n.......\n\n.......\n\n\nYet the factory worker whose job was being outsourced wanted Trump.\n\nThe forgotten veterans who are left behind to rot wanted Trump.\n\nThe border state citizens watching illegal immigrants stream in wanted Trump.\n\nYour older next door neighbor who is sick and tired of the same corporations putting up the same corrupt politically correct candidates wanted Trump.\n\nThe regular working class people wanted Trump.\n\n# [And the voice of the working class people won.](https://streamable.com/q3s2)", "&gt; How their personal economic situation has changed in the last 20 years? Nope. And that's what they voted on.\n\nYes they know how their lives have changed, but did they vote in a way that will genuinely improve that situation? Or did they just vote for someone who pointed it out and promised to make it better through some vague changes?", "They voted for the guy they think listens to and understands them. \n\nI don't think either of those things will wind up being true but that's how he presented himself. ", "Also lashing out and physically attacking Trump voters and shutting down roads and breaking windows doesn't actually advance your cause. Waving the Mexican flag and holding signs saying \"No Es Mi Presidente\" isn't going to help your cause. [Filling up the TV with this type of whining isn't going to help.](https://youtu.be/8PKhGjpJam8)\n\nThe left needs to confront cold hard reality: You lost the House Senate and Presidency. The Republicans now effectively control our entire government and can basically do whatever they want. They did this by beating you fair and square in the voting booth.\n\nIf you want to implement leftist ideas, you better start selling them to Republicans and convince them of the benefit of your ideas and why they're worthwhile, and do it with discourse and dialogue, because you won't get them otherwise.", "Treating any class of people as a problem to be shunned and derided is a good way to encourage them to vote against you. When you do this with the majority population of the country guess what you're gonna lose.", "Handed it *quite literally* to Trump.\n\nThe emails with the \"Pied Piper\" strategy basically show that they WANTED him to be the candidate because they thought they would have the best chance against her.\n\n**Hillary chose her own opponent and STILL lost**.", "Same. It's like my opinion doesn't matter because I'm a straight white male.\n\nThe identity politics shit needs to stop. This kind of labelling is something I never did or saw as a kid it's propagated by the political world and news media. Everyone judges on color nowadays, but when I was in school/college that was never even a thought. \n\nEdit: Guys I didn't mean discrimination didn't exist and have an affect on my life when I was younger, I specifically meant the DRIVE to LABEL people into identity politics, by a subset of specific orientations.\n\nI live in Japan and I know racism and xenophobia first hand. I just don't understand the whole 'well, you think that because you're an African American Bisexual college-educated Woman making 42,000 in an Urban Area so of course you believe that but you can never understand the life of a Straight Rural White Woman with no opportunity or college education in rural Wisconsin' kinda thing. As a kid I never naturally saw /that/ and in college we learned specifically to not judge people like that. \n\nIt's like racism, sexism, and homophobia is evolving through these labels and looking in from living in the US 5 years ago its like 'why is everyone doing this now!' \n\nIt makes no sense, and it's making me cry that the democratic senators are saying minorities will now suffer like we're not all hella scared or we didn't all lose because they wanna look good for minority voters instead of bringing in action and a plan forward for all of us. \n\nDo you guys ever listen to what Obama says? Poverty. Violence. Corruption. These issues may skew one way due to our history, but they shouldn't be labeled away for votes!!! ;~;) \n\nSome of these messages telling me I don't understand these problems is making literally me cry tonight. This is why we lost! \n\nAmerica, my home, what have you been doing!!! ", "She never talked about the poor white working class Trump talked directly to them. Even though Trump's rhetoric was just empty and all probably bullshit, he talked to these people that Hillary thought don't matter. \n\n", "&gt;\"The previous US presidents (1789 to 2016) came into the White House with an average of 13 years in public office and 5.6 years of military service.\n\n&gt;Donald Trump’s tally: zero — on both counts.\n\n&gt;Zachary Taylor Ulysses S. Grant, and Dwight Eisenhower — the only other presidents with no public office experience — served a combined 100 years in various military roles before taking office. By contrast, Trump received five draft deferments, including one for temporary “bone spurs” on his heels. During the 2016 election, he insulted multiple war veterans, including Sen. John McCain, a Vietnam POW.\"", "Exactly. The story of this election was not people voting for Trump it was people NOT voting for Clinton. \n\nThe numbers prove it. Nobody wanted to stand in line for 6 hours on a work day  to vote for her. Granted it didn't help that the media said she had a 98% chance of winning. But let's face facts, people would have stood in line for 12 hours for Bernie. But not for her. ", "I certainly _begin_ by treating people as I want to be treated and then hope they will do the same for me. However, if they keep disrespecting me and abusing my respect for them, I am going to withhold it.\n\nEveryone is entitled to respect by default, but that respect can be squandered easily, and when that happens, it's gone. Trump squandered my respect a _long_ time ago, and nothing he's said or done has replenished my stock.\n\n-----\n\nHere's what I go by:\n\n- I will always be _civil_ towards someone else\n\n&gt;polite but not friendly : only as polite as a person needs to be in order to not be rude\n\n- I define _respect_ like this\n\n&gt;due regard for the feelings, wishes, or rights of others.\n\nIf you treat me with the same respect and civility, we'll have no problem whatsoever. If you don't, then I feel no particular need to spare your feelings or show you any more respect than I absolutely have to.", "That's the beauty of living in this country we're allowed to dismiss the president. For whatever reason. We don't have to like them. You can even make up bullshit conspiracy theories like they weren't born here or are Socialists to back up your hate. ", "This is what happens when liberal rhetoric is increasingly dominated by identity politics rather than class issues. Looking at the reaction from many on the left they don't seem to realize this and have only doubled down on it. If political discourse is going to be dominated by identity politics it is no surprise that more and more whites especially white men, align themselves with the republicans rather than the side the demonizes them.", "yep Fox News is doing a great job helping that out, too. \n\n", "Please PLEASE double down on insulting Trump supporters.\n\nSurely they'll vote for you in 2 and 4 years after you continue to abuse them.\n\nIt's a can't fail strategy.", "Stole it from Bernie handed it to Trump. ", "Well yeah they did. Doesn't mean shit now sadly. ", "Schumer's backing Ellison? That's a pretty big deal... is this actually going to happen?", "I'll keep following @POTUS to see just how quickly Donnie goes full Duterte. Not even inaugurated yet and he's already pointing fingers and complaining using people's anger as leverage for his own ass backwards agenda.\n\nI'll keep following @FLOTUS so I can reread Michelle's tweets with someone else's avatar.\n\nEdit: clarity", "It's the reason Trump got elected basically. A lot of people that I knew voting for him just said they were sick of being told they're pieces of shit for being born white. Everyone is sick of this regression. We are identifying everyone based on their sexuality race, and gender. A little over a year ago it didn't really seem to matter anymore until SJWs had to start playing victim.", "no they lost cause democrats did not go vote look at the popular votes totals. Trump didn't do better then romney just Clinton did far worse then obama. So the republican base came out, the democratic one did not ", "It's almost like white working class people won't vote for you if you insult them and scapegoat them. Wow!", "Senator Reid is right. Trump winning the election doesn't change the fact that he's a sexual predator.", "&gt;But let's face facts people would have stood in line for 12 hours for Bernie. But not for her. \n\nAnd brought their friends. ", "I would much rather have Trump as President than Pence. ", "That is exactly what I disagree with.  Be good to others as a virtue not as a condition of their behavior towards you.  It works out better in the long run.", "Our 45th President is not a God Emperor.  And he needs to be reminded of that everyday for the next 4 years.", "It kind of annoys me how the Democratic Party just expects votes from Asians. What did they even offer them during the election? Did they even mention that demographic during the primaries and debates? Other segments of the population (Latinos Blacks, Women, Muslims, Whites) had lengthy discussions in the public eye, both in speeches and in debates. Yet, cursory searches of speeches finds 0 mentions of this entire demographic. Oh but only now after the votes are cast do people care!\n \nI have no doubt that Asians probably predominantly voted Democrat. But to expect them to come in greater force despite no direct messaging is simply arrogant.", "&gt; Trump’s victory is the victory of the uninformed. But to be fair, Clinton’s victory would also have been. Democracy is the rule of the people, but the people are in many ways unfit to rule.\n\nI think that's a fair enough assessment. Though the theme of this article is pretty much regurgitated after every election.", "Trump spoke out against the people protesting him not a word against the Klan celebrating him.", "As a European living there too, politically \"generally undecided\" and simply a keen observer of political discussions in the US, I have to agree that - barring ANY partisan opinion - in my experience, the right wing media in the US is INCOMPARABLY more biased, sensationalist and dishonest in its approach of reporting than the rest.", "That's what appealed to the ones who want to watch the world burn so they can live out their survivalist walking dead fantasies.    ", "Democratic voter turnout was about 6 million less than 2012. They don't need to sell it to Republicans they need to get Democrats excited and inspired enough to actually vote.", "On the contrary Trump won because the DNC was ignorant and selfish. They completely ignored the prevailing sentiment of the electorate (anti-establishment populism) and subverted democracy to \"nominate\" a weak candidate who was the antithesis of everything voters wanted.\n\nDoing so only reinforced voters' hatred of the establishment and their belief that it was so broken that it couldn't be fixed, only destroyed. Our broken two-party system gave them one conduit through which they could channel that rage: Donald Trump.", "The fact that a Muslim American will be leading the DNC instead of old blood Howard Dean is a refreshing sign to us and the world that we are not giving in to xenophobia. ", "We PC now?", "Schumer was busy yesterday.  First met with the AFL-CIO then talks about how TPP is dead, now is backing Ellison for DNC chair.  Seems like Schumer knows a way back into the Rust belt, and that's through an aggressive support of organized labor. ", "I mostly agree with you. That said when someone's determined to shovel shit in your face on the basis of who you are, after a while smacking the shovel out of their hands is justified.", "And cnn", "They believe all minorities should be good little, obedient liberals and do as their told. They believe that minorities OWE the democrat party their vote.\n\n\nYou don't owe anyone your vote in America.", "If we're going for showing no respect the Democratic party and Clinton campaign win. \n\nHow do we choose our candidate? Well, it's Hillary's turn so we'll rig the primary for her. (as though being POTUS is something you take a number and queue up for)\n\nHow do we deal with our opposition? Use our media contacts to ensure they pick a poor candidate (as if having an incompetent POTUS candidate is a worthwhile risk if it helps your chances)\n\nWhy should people vote for Clinton?  Well, she's not trump, oh, and she was born with a vagina, so there'll be novelty there I guess. (POTUS isn't a non-job that can be chucked away for a diversity hire)\n\nWhere do we campaign? Fuck the states that would decide the election, let's go to texas and see if we can't rack up a big score! (Clinton was the first major candidate since 1972 not to visit Wisconsin, assuming that it was safe, and lost it.)", "There won't be any backlash. During his campaign he would say something and then walk away from it. He still got his support. When he doesn't keep his promises his supporters will go one of two ways \"he had his reasons\" or \"still better than hillary\". \n\nAlso he has Fox and apparently his own channel coming out to spin for him. His supporters only watch Fox they do not listen, read, or watch anything but right-wing media (liberals are guilty of doing this as well). So whatever is spoon fed to them on those outlets is what they will believe.", "Seriously. Trump has melted down on Twitter more times than I can count. Seeing him do it as president isn't going to suddenly make people rethink his character. \n\nAt this point it's clear Trump isn't going to lose on his weaknesses alone. We need an opposing candidate to win on their strengths.", "Absolutely I honestly believe most white people are no confrontational and respectful. So all this time while everyone else yelled and screamed in our face, most of us just sat by and smiled. Voting for Trump was like a silent punch in the face to this constant abuse. \n\nThe truth is fighting racism and sexism is not about pushing the perceived pendulum the other way, it's about abolishing it in general. ", "The best part is the dumb fucks that voted for him would be some of the first to die in a failed state.", "Get her out...    \n\nShe should have been fired an hour after Clinton lost. She is corrupt feckless, and needs to go *now*. There's no room in the DNC we need to create for her anymore, not in any role or in any capacity. Send her back to being a B-rated correspondent on CNN or she can go work at In-N-Out Burger for all I care...   ", "He's not saying white people suck. Or that they're the same as Trump. He's saying that Trump has disrespected everyone who's not a straight white man and so everyone who's not a straight white man owes Trump zero respect in return.\n\nThat said there are plenty of straight white men who don't owe him anything either. For other reasons. Like for playing off sexual assault as something all straight men do.", "It can be both. The DNC can be ignorant of the pulse of the nation and the people that elected Trump can be ignorant about electing a demagogue. \n\n\nIf they look at a guy like Donald Trump and actually research the things he's said along with the things he's done and yet still think he's got the goods that is ignorant. ", "Right now it's impossible to explain the scope of this to people without sounding overrreactive.  But we are looking at far-right conservative one-party control of government threatening everything from the global warming fight to civil liberties to geopolitical stability.  Banking, environmental, and healthcare regulations are about to be shredded. Free speech and transparency are endangered like never before in recent history.  Trump is already breaking precedent and refusing press access.  This isn't hyperbole, it's all laid out in the platform documents, in Trump's promises, and his cabinet and judge appointments.  The ruling party will shift even farther to the right, and it is going to become beyond partisanship. Politics are not going to just be politics - the dangers are soon to be universal and existential.  You are going to see astounding shifts in this country, and the reaction from progressives and moderates will, hopefully, be immense.  You may even see international intervention.\n\nI'm aware of how crazy this sounds.  The sooner *everyone*, no matter how you voted or didnt, realizes how big this is, the sooner we can try to reintroduce the checks and balances that will soon be missing.", "Did you not just see the election we had?", "\"We like him because he means what he says.\"\n\n\"He didn't mean that.\"", "Then that's it that's all she wrote.  I'm from Minnesota and I've met Ellison before.  He's a good man.  He's a fresh face and a good direction for the party going forward. ", "Wrong. Rust belt voted for Obama. Twice. And would've voted for Sanders.  But HRC/Clintons fucked the Democrats. So Trump won.\n\nPeople voted for change. Obama was change 8 years ago. Trump is change now. ", "Then we would be stuck with Mike \"electrocute the gays and cigarettes won't kill you\" Pence.", "Exactly. The dude ran against a historically unpopular opponent and still lost the popular vote. I overheard someone talking about a mandate yesterday and nearly burst out laughing.", "This election has forever destroyed the idea that America was a \"shining city on a hill\". America will now be ruled by a lying authoritarian strongman, just like Russia, Belarus, and third-world dictatorships.\n\nAmerica will probably continue working as a democracy, but it has lost all moral authority in the world.", "Yep. I'm no accelerationist but fighting for progressive causes under a Clinton presidency would have been four years of more of the same frustrating conversations with the She Can Win brigade. At least this way the left and liberals can present something of a unified front.", "I'm sorry but this depends on your definition of the world fail.  \n\nYes, I want him to fail trying to overturn Roe v Wade.  Yes I want him to fail in trying to deregulate Wall street.  Yes I want him to fail in trying to deregulate gun control.  Yes I want him to fail in trying to repeal the ACA.  Yes I want him to fail in trying to fire I nuke because he literally had to ask \"why can't we\".\n\nSo there are several aspects of him that I want to fail.  Yes.", "There are so many people who talk about how the protests are unconstitutional. They must have forgotten the things America said about President Obama once he was elected. ", "As another straight white, male, I have to ask, what do you expect? Minorities just witnessed the election of a President who actively worked to deny black people housing based on their skin color. I'm disgusted by the people that voted for Trump, and I have nothing to lose. Can you not imagine how they must feel right now?", "&gt;Because the Democratic Party doesn't do shit for people. \n\nThey just clean up after the economic disasters of the Republicans.", "That's the whole irony of it all isn't it? The armchair anarchists who hope to become some sort of Randian ubermensches in a dystopian post-America would fail for the same reasons they fail right now: they're arrogant, anti-social assholes. No one would want to help them because they'd simply refuse to help others.", "We're post-truth. I'm allowed.", "It doesn't matter that Clinton won the popular vote. If the presidency was determined by the popular vote the campaigns and voter turnout would have been completely different.\n\nWhat does it say about the competency of the Democrats when they lose to a pussy grabber? Trump could've slapped Megyn Kelly on the ass after the debate, and he still would have won.\n", "Okay speaking as a straight white male I think it is very important not to get defensive when we hear someone call racism. I despised trump and his hateful rhetoric for the entire campaign and I still do, however I honestly believe his insults may have hit home in a more personal way if I wasn't a straight white male. I don't think the person is saying the only people who are not straight and white and males can be upset but rather that if you are not those things you should be very upset since he personally attacked you. \n\nedit:my first gold, thank you very much random redditor", "I am almost happy for the outcome. Now we have a chance as a nation to do a little soul-searching and maybe start advocating for some real changes in how we get our news and how we vote. ", "In the history of Flip Flopping Presidents Donald Trump will go down as the king of kings. \n\nThe glorious fraudulent leader who flipped every time he saw a new opportunity. ", "[Joe fucking Arpaio is being considered for Secretary of Homeland Security.](http://www.abc15.com/news/state/sheriff-joe-arpaio-touted-as-possible-homeland-security-secretary-candidate)\n\nLet that sink in for a minute.", "Repealing Obamacare care opening up federal land to private investors( i.e. Selling off national park/forest land), making the Supreme Court conservative which should have been obamas pick, places a climate denier head of the EPA, label china as a currency manipulator, cancel all UN climate programs the us supports, suspend immigration from countries he deems dangerous, begin backing out of the Paris agreement, begin mass deportation of illegals, defund public schools in favor of a much worse voucher system. \n\n", "It is a common reaction to take this quote or the Golden Rule, and try and undermine it by thinking strictly about actions and reactions. The simple principle it is trying to advocate for is empathy.\n\nYou have every right to defend yourself from hostility.\n\nThe empathy advocated by the Golden Rule suggests you at least attempt to empathize with your attacker, \"Why would someone do this?\" and further not to use their own actions to justify shoveling shit back unto them.", "This sentence isn't Englished well.", "I want to smack whoever took anything for granted in Clinton Campaign. Night before the election you have her come out in Philly with Obamas a Democratic Strong Hold? Should have been WI or Middle Pennsylvania where she didn't step a foot the whole fucking cycle. Guess what? Trump went to Blue States and took them. Clinton thought she was above and failed to see what Bernie and sadly Trump saw. It is entirely her fault for letting the Democrats down. ", "Blame everyone except Hillary Clinton and her campaign. Interesting.", "You can respect the office all you like.  I will not respect the man.", "Grasping at straws.  Articles of impeachment have to originate in the house of representatives which is controlled by the republicans.  They are tried in the senate, also controlled by the republicans.", "They put out an attack piece on 538 for daring to give trump a 30% chance.", "I just can't jive with that. When people act in a monstrous way I don't see it as a virtue to be complicit in their behavior. The sort of \"work together\" attitude I'm hearing about is rewarding people for being shitty imo.", "http://www.dailykos.com/story/2016/11/11/1596545/-Abbreviated-pundit-roundup-How-Trump-will-affect-your-federal-and-state-taxes-Medicare-and-more\n\n&gt;[I]n a Fox News interview with Bret Baier Ryan said Medicare privatization is on.\n\n&gt;First up, this piece from Laura Sanders at The Wall Street Journal(A center-right newspaper btw) pointing out that Trump’s tax plan will give some tax cuts to average Americans and a whole lot of tax cuts to the richest Americans while ballooning the debt\n\n&gt;\"Trump's proposal to convert Medicaid funding into a block grant program would lead to much lower federal funding to states,\" according to a statement Thursday from Fitch Ratings, which tracks state finances for investors in municipal bonds. [...]\n\n&gt; Zaid Jilani at The Intercept points out, **Trump has made his choice by reportedly filling his transition team with advocates for dismantling Social Security:**\n\n\nMedicare gone, Medicaid gone, Social Security gone, Taxes on wealthy cut.\n\nthese people voted for their own demise because they were sold into believing that they would get their factory jobs back. soon not only will they not have a factory job but no medicare, medicaid, or social security. And just like the reagan and bush tax cuts. It *feels good for a few months* but down the line they screwed themselves over as social programs and infrastructure spending that depended on taxes starts going dry and gets cut.\n", "He told them what they wanted to hear so they voted for him.  There's really no need to deliver on the promises to voters that gullible.", "Lets get back to Hillary's emails please. They are most important. \n\n/s", "Respect? What a sack of shit Trump has zero respect.", "Free trade. Macomb is where more than 10 automotive factories are located and has a large white blue collar population. NAFTA fucked Detroit and Trump's free trade platform appealed to them. These people have seen their wages stagnate and drop, jobs disappear, and their union privileges decrease. Clinton's comments about TPP being the gold standard and wanting that open borders/open market doomed her there. When you're a line worker at Sterling Stamping that has to work 70 hours a week just to make ends meet, hearing someone that charged 250k for a fucking speech isn't gonna make you vote for her. A [Politico article](http://www.politico.com/story/2016/11/hillary-clinton-aides-loss-blame-231215) talks about how Clinton's aides failed in drawing working class whites despite Bill and others begging them to do so. Mook and Podesta pretty much chose to ignore these types of people and they voted in droves in support of Trump. ", "It turns out that repeatedly calling one of your core constituencies racist doesn't help you win elections. Sorry liberals but white people still exist in this country, and it's pretty obvious you don't have their best interests at heart.", "But the right hold others to these standards for example Muslims and terrorism or African Americans and cops shooting. ", "\"Crooked Hillary is a corrupt liar! Lock her up!\"\n\n*\"But what about Trump's Blind Trust?\"*\n\n\"Get over it libs. You lost.\"", "I'm not a conservative but it's amusing to me that the same people who insult the intelligence and morality of anyone who disagrees with them feel entitled to emulate the very behavior they were so ideologically critical of the instant something doesn't go their way. ", "Didn't lose them so much as pushed them out by marginalizing and mocking them during the primaries.", "He's a 70 year old man if he hasn't learned yet then he never will. ", "And they'll still blame Obama", "We could be (hypothetically) goosestepping in two years and the republican's would still blame it all on the democrats.  It is hilariously easy to predict who they'll blame when their own bomb goes off.", "Maybe voters were \"ignorant\" of Republicans' photo id laws voter registration purges, and polling place closures. How much of the 2-5% that Clinton lost battleground states by could those maneuvers account for?", "Instead of protesting and attacking Trump directly we need to organize and clean our own house out first before we do anything with the Republicans. [It's time the establishment steps the fuck aside](http://pac.petitions.moveon.org/sign/appoint-keith-ellison?source=none&amp;fb_test=0) and allow real progressives who care about people to control the party. Keith Ellison has to run the party in order to stop this madness that we saw on Tuesday. \n\nContact your democratic representatives and senators and tell them you want this aswell, they need to know the base is pissed over this.", "I used to think the only strength of a democracy was to keep the absolute worst options out not because it elevated the best.\n\nMy countrymen failed even that low bar.", "Bernie must be the face of the new democratic revolution.", "He looked like a scared little bitch trying to talk to those reporters while he sat next to Obama.", "Whatever your political views are just take a moment to marvel at the fact that Hillary Clinton was less relatable to working class people in the rust belt than a man who lives in a golden skyscraper emblazoned with his name in the middle of Manhattan ", "I don't think it has anything to do with bigotry. Many of the voters that Trump won over in PA WI, MI, OH, and IA voted for Obama last time around by pretty large margins.\n\nEdit: adding a source because many have asked\n\nhttps://www.washingtonpost.com/politics/how-voters-who-heavily-supported-obama-switched-over-to-trump/2016/11/10/65019658-a77a-11e6-ba59-a7d93165c6d4_story.html\n\nEdit 2: Take a look at this map and click on \"Change From 2012\". A huge amount of counties shifted towards GOP, especially in the Rust Belt states that carried Trump to victory.\nhttp://www.nytimes.com/elections/results/president", "The only positive that's going to come from this disaster over the next 4 years is watching the Trumpers slowly come to the realization that they dun goofed.  ", "What people don't seem to understand is that the people's power is in their right to vote not that they will automatically vote along party lines. It's quite simple, if you don't give me anything, I won't vote for you. I might choose to exercise my right NOT to vote.\n\nHillary choose to ignore a lot of her base and they didn't show up. People who are saying \"But how can they do that? It's worse to hand the election to Trump!\". No, that is short sighted thinking. There will be more elections to come, but next time they are not going to be ignored.\n\nIt's simple game theory. If you are going to go out and vote along your party line regardless, you will eventually be ignored by both parties. Your vote can't be changed so they don't have to cater to you. Obama got huge turnout because he was able to cater to his base. Those people didn't show up when Hillary ignored them. They won't be ignored by the Democrats next time around.", "And slow it will be.", "It'll be a lot like the last time they got duped. After a few years suddenly no one in this country ever supported the Iraq War despite its popularlity around 80% when it was launched.", "[JD  Vance summed this up really well](http://www.theamericanconservative.com/dreher/trump-us-politics-poor-whites/).\n\n&gt;A lot of it is pure disconnect–many elites just don’t know a member of the white working class. A professor once told me that Yale Law shouldn’t accept students who attended state universities for their undergraduate studies.  (A bit of background: Yale Law takes well over half of its student body from very elite private schools.)  “We don’t do remedial education here” he said.  Keep in mind that this guy was very progressive and cared a lot about income inequality and opportunity.  But he just didn’t realize that for a kid like me, Ohio State was my only chance–the one opportunity I had to do well in a good school.  If you removed that path from my life, there was nothing else to give me a shot at Yale.  When I explained that to him, he was actually really receptive.  He may have even changed his mind.\n\n&gt;What does it mean for our politics?  To me, this condescension is a big part of Trump’s appeal.  He’s the one politician who actively fights elite sensibilities, whether they’re good or bad.  I remember when Hillary Clinton casually talked about putting coal miners out of work, or when Obama years ago discussed working class whites clinging to their guns and religion.  Each time someone talks like this, I’m reminded of Mamaw’s feeling that hillbillies are the one group you don’t have to be ashamed to look down upon.  The people back home carry that condescension like a badge of honor, but it also hurts, and they’ve been looking for someone for a while who will declare war on the condescenders.  If nothing else, Trump does that.  \n", "They voted for an outsider. And since they are no longer following what is happening they don't know that their outsider is currently surrounding himself with insiders and typical Republican establishment like the Heritage Foundation. They were sold out within days.\n\nHaving said all that, this article came off pretty condescending.", "Trump has profited too much his whole life from those he threw under the bus during the campaign (first and foremost his buddies the Clintons) in order to paint himself as the \"maverick\", \"outsider\", and \"underdog\" to really do anything to alienate or hurt them. \n\nPrimary indicator: Wall Street is happy as a clam (in swamp water) with him being president. \n\nAfter Trump, \"the swamp\" will look like a corporatist, reagenomics, revolving-door all-you-can-eat brunch buffett that fell prey to a bunch of fattest-cat-in-the-world contestants. Who also used it as a toilet afterwards. \n\nThis will probably be the saddest and most ironic incidents (even before electing Reagen president) of poor and middle class people radically voting against their own interests once again. \n\nThe global working classes watch in horror and cringing as one of their largest subsidiaries keeps shooting themselves in the foot over and over and over without even realizing it in the slightest.", "He drained the swamp. Then picked the scum at the bottom for Cabinet shortlist.", "Trump was honestly a genius in that regard. He even held speeches at closed factories that shipped jobs off to Mexico. He knew exactly who he was talking to where to meet them, and how to appeal to them.\n\nHillary's campaigning was a disaster by comparison.", "Now the real question is was it all a ruse? Did an entertainer just \"know his audience\"?", "Yes likely to both.  But others knew this audience, too.  Sanders knew these people needed recognition, he knows they need help.  *Bill Clinton* knew this as well, but he was told to sit down and shut the fuck up by Joel Benenson, HRC's chief strategist and pollster.  ", "they will find a way blame the democrats ", "That's the spirit! Keep doubling down on this tactic I'm sure they'll see your point now.\n\nEdit: it is absolutely unreal how many of you really can't seem to grasp that people are not going to listen to you if you call them a bigoted racist xenophope. Insanity is doing the same thing over again and expecting a different result. Come up with a new way to win back support because name calling is clearly not working. All that does is fuel your own sense of self righteousness ", "Republicans decided Barack Obama only gets 3/5 of a presidential term.", "It's looking good. Schumer will be the most powerful dem in the country starting after the inauguration. I think most of the party establishment has to be pretty disgusted with the DNC now. These guys want to win and the DNC and that entire DWS/Clinton/Brazile faction delivered a truly catastrophic defeat, based around empty identity politics and outright condescension.\n\nIn retrospect it's pretty apparent the Dems threw away a visionary candidate and a legit grassroots movement in their hobbling Bernie. There's really nothing else to say. The progressive wing is the only choice to inherit the ruins. ", "well considering in ohio i saw zero ads about how hillary was going to bring more jobs or take care of unions i can see why she lost it. all it was was trump does this and trump said that shame shame shame!  but nothing on why we should've voted FOR you", "Wow fuck that headline. Totally different part of Seattle than the protests, on a corner notorious for drug violence. Literally had NOTHING to do with trump.", "That exist to push back against the the groups that promote hatred toward minorities.\n\nIf there was no widespread hatred or discrimination against various minorities these reactionary groups wouldn't exist in the first place.", "How do you not sound condescending when talking to someone who doesn't understand basic concepts of the economy world politics, or the government. Yet they act like they know it all and everyone else is dumb because they don't see the obvious simple fix to make everything better. \n\nIt's like arguing with 50 year old teenagers. They complain about PC language, so I'm dropping it. There's a lot of fucking dumb people who didn't bother to research things and challenge their own assumptions. Because of that, many will now die once the ACA is repealed and they lose their insurance. Ignorance will directly lead to people dying. Sorry if that was condescending though. (Actually I am sorry, I'm pissed that ignorance will lead to death and with all my research and time I dedicated to investigating the issues, it just means I have a better seat to watch people suffer.)", "Sanders and Obama went to mid western states with sleeves rolled up and addressed their concerns. Even if Hillary were to have meaningful policy that helps this demographic she couldn't connect with them. You cant roll around in $10K jackets, not visit a midwestern state since March and expect to win. As a Hillary supporter, she fucked up here. I was hopeful that the Obama coalition would maintain support for the democratic party, but not surprised at all that this happened. ", "&gt; Bullshit he hasnt picked anyone yet. \n\nT_D", "To be fair the Bush administration lied to and/or misled the public about the whole WMD thing, so some of them get a pass.\n\nTrump's already at record low approval ratings, his most ardent supporters are the ones who have seen who Trump is for over a year and still support him. ", "Actually I know quite a few people who, despite voting for Obama in 2008 and 2012, decided to go with Trump this go around.\n\nOne of those people is my grandfather, a 70yo black/Latino army veteran who is pro-feminism and LGBT rights; he despises Hillary and what she seems to stand for. He was pissed when Bernie lost the nomination, and said that he wasn't gonna vote for a \"war hawk\" who could force his grandchildren to go to war like he was back in Vietnam. \n\nI haven't spoken to him in a week. I wonder if he's having buyers remorse.\n\n**Edit:** \n\nFor the record, I'm a Bernie/Hillary supporter. My abuelo is also a lifelong Democrat, but Hillary managed to piss him off. He lives in a state that Trump won anyway, but he couldn't bring himself not to vote, and he refused to vote for Hillary. He thinks Gary Johnson is a jackass and the Green Party is too \"liberal\" for him. He's a conservative that thinks equal rights = common sense. In his words, he \"initially fought because he was forced to, but chose to serve in order to keep this nation free.\"\n\nAnd I haven't cut off contact with my grandfather; he's my biggest role model, a war hero, and the one who inspired my interest in politics in the first place. I just mentioned that I haven't spoken to him since the election, so I don't know about his opinion on the aftermath.", "(one of) Their mistake(s) was thinking those who voted for Obama and Sanders were Democrats.\n\nThose voters were actually people and needed to be appealed to like anyone else.  Republicans won because they let the people talk while the Democrats shut them up.  The DNC was wrong to think that it could decide what issues people should care about.", "I'm sure some voters did switch but the final results mostly show Trump getting a \"normal\" partisan vote, while a non-insignificant margin of Obama voters just didn't vote for either. I don't see a lot of evidence that many people switched. If you have specific polls or something I'd be interested in seeing them, but I couldn't find any.", "Huge news. We are going left folks. They go low we go far left.", "\"When I cherry pick out of date and misleading statistics about African Americans or Muslim Americans those are facts. When you repeat things a specific person has been recorded saying, that's being smug and divisive.\"", "I mean how they can expect Hillary to solve their problems when she blatantly and completely ignores all of their problems essentially laughs about it, won't even visit their states during election season, and then says \"oh you're only thinking of voting for trump because you're all racist homophobes xenophobic bigots\". News flash: they aren't those things, they're regular working class Americans who want their problems to be addressed, not be called a million things that they aren't. The people who got Trump into office are literally the ones who voted for Obama 8 years ago.", "Because she's a terrible person and the American people see through her lies. \n\nMostly", "So much this.\n\nDemocrats need to stop hand wringing and learn there lessons from the last 50 years. This election turned out depressingly familiar.\n\nRepublicans turn out and vote Republican no matter what. Day in day out. Year in, year out.\n\nDemocrats only vote when they feel really enthusiastic about their candidate. ", "According to the national exit polls just 27% of voters said their personal economic situation is worse now than it was 4 years ago.  More people said it was better today (31%) or about the same (41%).\n\nOf voters who said the economy was their primary issue, Clinton beat Trump 52-42.  \n\n", "Because with military experience you are serving the country you then lead.  With buisiness experience you only serve yourself and those who serve to profit.  There is nothing positive or endearing about putting profit before everything else.\n\nIf America does that it will be a disaster plain and simple.  A country is not a buisiness.", "\"They're exactly what I'd expect to find at the bottom of a drained swamp” - Stephen Colbert ", "Its not about \"most\" its really never about \"most\" its all about small chunks.\n\n\"Most\" voters are straight party ticket voters and were completely unaffected by the election but Hilary lost voters on the margins in a number of ways:\n\n1. Progressives not coming out because she wasn't offering much\n2. Bernie supporters not voting for her because of how he was treated\n2. Bernie supporters actively voting against her to stick it to the DNC\n3. Conservatives coming out to stick it to Washington\n4. Conservatives coming out to stick it to her in particular\n5. etc...\n\nIn a close election you can blame any number of small groups of motivated people for pushing the result over the edge in one direction or another.\n\nThe DNC lost because of how Bernie was treated and because of how it ignored the middle states for years, and because of the emails, and because of the Goldman Sachs speech, and because of racism, and because of Comey, and because a lot of things.\n\nOne common element to most (but not all) of those reasons is Hilary. She was just a terrible candidate.", "Bernie is the most powerful opposition force and arguably dem, in this country. I think this is beyond doubt at this point.", "[Since qualifications are no longer necessary this is the ticket I want in 2020](http://assets-s3.usmagazine.com/uploads/assets/articles/57312-jon-stewart-and-stephen-colberts-best-2012-presidential-election-one-liners/1351792827_stephen-colbert-jon-stewart-467.jpg)", "\"Democrats fall in love.  Republicans fall in line.\"", "I'm with you. But I think the Trumpists just woke up and are infesting the sub. Saving this.", "Remember Obama got record voter turnout in 2008. He got slightly less in 2012. You are seeing the voter turnout returning to normal levels, partly. Also, Clinton seems to not have excited huge swaths of the populace. A lot of working class midwesterners flipped to trump. These folks typically vote democrat because they are union workers, but only trump and bernie courted these voters this time. Hillary was leaving them out in the cold.", "The Titanic was a technical marvel and a great feat of engineering. To blame its demise on those who built it betrays a profound misunderstanding of history. The real lesson is not to collide with unseen dangers as you rush to get where you're going. It's a hasty decision like voting for an outsider without figuring out what his character is or refraining from voting because of a shallow judgement of equivalence. And that hasty decision has now betrayed an iceberg that they missed, and one which it is too late to avoid.", "Except that Schumer will literally be the highest ranking Dem as minority leader of the senate. We still have a government in this country after all.\n\nBernie wields huge power as a king maker and figurehead, and he was promised a baller committee chairmanship when the Dems inevitably took the senate, but alas...\n\nNow, he's just an independent senator from Vermont in terms of his governmental power. \n\nSchumer is a good egg, though.", "[From Brexit to Trump NY Review of Books, July.](http://www.nybooks.com/daily/2016/06/25/from-brexit-to-trump/)\n\n&gt; The approach was distilled when Leave’s Michael Gove, an Oxford-educated newspaper columnist turned government minister, declared, “the people of this country have had enough of experts.” Indeed, “expert” became a dirty word, its currency more soiled the more experts warned of the instability and mayhem that Brexit would bring. **One caller to a radio talk show captured the spirit of the time—a distrust that has been brewing for years—when she said she was done listening to those with specialist knowledge. After all, “Experts built the Titanic.”**\n\nOne wants to ask that lady whether, given her contempt for experts, she'd get on an airplane built by her mates down at the pub.\n\n", "Trump is the same guy outsourcing those jobs. \n\nSo he's basically been duping these people all along. \n\nKeep falling for it though I'm sure it will work out. ", "Tl;dr\n\nWe're fucked.", "She is a war hawk though.", "FYI: this is a right-wing journalist paid by Trump's son-in-law. Not saying he is wrong but context is important.\n\nSee his past articles: http://observer.com/author/michael-sainato/page/8/", "https://imgur.com/a/Bh4rU", "It's strange too - My **entire childhood** I was taught to be color blind. To not judge someone on their skin or their gender. In just the last 3-4 years this has gone a complete 180 and now I'm literally told I should hate myself.\n\n\nHence why my friends &amp; I voted for Trump. ", "This. \n\nMillennials respond to passion honesty, and a short but purposeful stump speech. Obama in 08 was very charismatic and all about hope and change, plus we were motivated by the long war the GOP had been dragging us through. Hillary's speeches are like she's written down a list of talking points and she wants to check off every single box about every issue. \n\nThe DNC should have seen the signs and been willing to give the reigns to Bernie. When we have caucuses giving close races to Hillary by a \"yay\" or \"nay\" vote which they then claim is all yays for Hillary, and when it comes out that they supported her all along, you can see why she doesn't exactly motivate people to get out and vote.\n\nAdd on the fact that the media was polling her 10 points ahead a few weeks ago and claiming trump didn't have a chance. This all encourages trump supporters to get to the polls and democrats to be lazy because she's \"going to win anyway...\" ", "The Senate decided they wanted to steal the SCOTUS appointment. The American people voted to let them.", "I'm pretty sure most Trump voters don't care about the DNC at all.", "They shouldn't forget it. Push for a compromise justice similar to Garland and if the Court is truly stacked by the end of Trump's term, dems should increase the number of justices when they regain control. ", "Why is the author criticizing Obama for treating Trump respectfully during their meeting? Does he not realize that the President has the responsibility to provide a sense of calm and reassurance to the American people? ", "Even his business experience is pretty pathetic. ", "yep. Trump gave peoples problems recognition and they gave him the vote.", "Don't forget she threatened to attack the second amendment. It literally helped her gain 0 votes and lost her hundreds of thousands. It's not like anti-gun voters were suddenly going to up and vote for Trump because she had a neutral stance on gun ownership. I guarantee plenty of people in swing states voted for Trump simply because he was endorsed by the NRA and she wasn't.", "I looks as though the people of WI MI, and PA are losing their states to fear and hatred. I hope the good people of those states read the writing on the wall and realize that they are the frontline of the battle for this country to become accepting of all people. ", "Nice links. It's shit like that that absolutely blows my mine. Blatant contradiction hypocrisy, pathological lies. How does anyone defend that? (And I know you only posted 2 of countless examples...)", "Start the hashtag now. NotMyGodEmperor", "Trump got 3% more of the latino vote than Romney after all his bullshit about wall building.\n\nHillary also saw lower women vote than Obama. \n\nMillenials that did show up gave Clinton fewer votes compared to Obama. The also had much lower turn out, 19% compared to 50% for Obama's rgun. \n\nThe voter difference between Obama and Clinton were nearly 6 million... This is what happens you chose a \"fall in line\" candidate instead of a \"fall in love\" candidate.\n\nEdit - Obama -&gt; Romney concerning Latinos", "If you want to be fatalistic go ahead. The Trump Presidency offers the best opportunity to push the country far left, ever. He will fail, and we will be there to pick up the pieces.", "Bernie plans on submitting signatures to the DNC:    \nhttps://go.berniesanders.com/page/s/keith-ellison-dnc?source=em161110      \n    \nI signed last night and they had 16000+ signatures (out of 20,000).    \n\nKeith Ellison has a podcast if you'd like to get to know him better.    \nWe the Podcast     \nhttp://wethepodcast.podomatic.com.   \n    ", "And yet the establishment still win Trump is already filling his cabinet with lobbyists. If you voted for him to say you wanted money out of Washington you fucked up.", "No pc bad! Unless it's about me then I need a safe space MAGa", "I'm convinced a lot of people who voted for him are rolling the dice knowing full well he could just perpetuate the same BS that's screwed them over all along. Many could be hoping he'll be so incredibly bad that the US is plunged into a real depression and we'll all have no choice but to make changes.", "The question is if you want evil done poorly or evil done well", "Your explanation is too complicated.  The simple answer is because the president is the commander-in-chief of the United States Armed Forces.  It's good to have military experience when you are the leader of the military.", "Ellison is a Muslim.\n\nWhat a delightfully massive middle finger to Trump.", "They are crucifying Hillary for not being electable enough when the other candidate is a proto-fascist. At some point it ***is*** the fault of the voters.", "Well let's hope that hindsight is 2020.", "Most of the Americans did not want Trump either according to the election; but I think Clinton is one of the few candidates that could have lost to Trump. She definitely is not liked and I still do not understand why the DNC went with her. ", "[Democrats: On what grounds should you be DNC chair? Ellison:](https://twitter.com/dorseyshaw/status/796895466675912708)", "even better he's a *competent progressive leader*.\n\nWe are done with identity politics. Time for just identity without the politics. ", "It can be a tough line to walk. It's can be hard enough to tell someone you think they're wrong without coming off as insulting let alone that they were tricked.", "The difference is that with Hillary we *know* she would just perpetuate the same BS.  At least with Trump, we have a slight chance of something different.  ", "But...Obama won the popular vote!", "In all likelihood the Russians merely foresaw several key issues. The '90s were rife with discussion about race relations following the riots in LA and Rodney King (Spike Lee made his career with films exploring racial issues in the '90s) and until 9/11 there was a resurgent and militant right wing incensed over the handling of Waco and Ruby Ridge.\n\nBritain has never been a \"full member\" of the EU retaining a lot more autonomy than other states.\n\nAnd Ukraine had only been independent a few years at that point and had taken Crimea with it which a lot of Russians felt should have stayed with Russia.\n\nThis isn't indicative of any grand Russian espionage as it is an acknowledgement of long standing issues in the west.", "Trump has no skin in the game when it comes to America. He's just in office to fleece the rubes.", "I think that's the first time he realized it wasn't just a popularity contest and he now has to steer the most powerful country in the history of the world that is currently divided and partisan in levels not seen since it was legal to own other human beings. \n\nAnd still trying recover from the second worst recession in its history. \n\nAnd he just remembered that he once bankrupted a casino. \n\n", "Considering much of the country doesn't even know how the government actually works I'm sure it won't.", "I'm thinking a Clinton victory this year would merely have delayed by four years the election of a fascist.  There was no sign that she planned to address the grotesque inequalities in our economy.", "The Americans who didn't vote regardless of their supposed \"affiliations\" did not help the other side. You don't get to count votes as being automatically in your column and then shame people for making the choice to withhold those votes. Every single vote must be earned. \n\nA Democrat is under no obligation to vote for either party. They chose to be a Democrat, signaling they are likely to vote for Democrats, when they choose to vote. That choice does not mean you get to count on them to vote for you no matter what, and it does not mean that if they choose not to vote they are somehow assisting the other side. For all you know, they could have actually voted for the other side if they chose to vote.", "&gt;A little too late if you ask me\n\nNever too late, IMO and the damage isn't irreparable. The 2016 election may just be the major wake up call the establishment Dems needed to finally stop f-ing around and start to strongly acknowledge the growing progressive base.", "I'm sure the GOP controlled house and senate will be impartial and seek justice against president Trum-BAHAHAHA ... oh man. I almost said the whole thing.", "Ive seen both sides and what I'm stunned about frankly is the average education and information level of the us population. Sorry, but from a personal standpoint, I'm flabbergasted.\n\nI'm observing as someone who is lucky enough in reading 12 languages, being fluent in 6 (I don't code, I don't do magic, thats my shtick) and who particularly enjoys confronting national vs international press to see discrepancies, posturing, etc. I just find this interesting, nothing new there.\n\nHowever, this is how I justify by saying \"nope, you absolutely cannot compare right wing media with the rest - it's in its own universe of lying/crazy\". I'm not being partisan, I don't have any bias, I just share what I observed.", "Bernie could have split the working class with Trump and beaten him. Fox News has spent years calling everyone a socialist so calling Bernie one would not have done much damage.", "The GOP only leaked his picks duh. He has to be coronated first!", "It turned out that they produce more hatred aggressively pushing back against normal people. Noise machines, fire alarms, bullying professors, witch hunting - enjoy the result, I hope they feel better now.", "Maybe noone in your state political machine was trying to actively supress the vote in your area by limiting the number of voting points and placing them in hard to reach places?", "Mr. Trump has a hard time with numbers. He thought the opposite.", "If muslims have to stand up and disavow \"radical islamic terrorism\" which they never fucking supported in the first place I think white conservatives have to stand up and disavow the KKK publicly.", "People are drowning in healthcare childcare, and education expenses. I haven't seen a single Republican policy to really address those issues and certainly not one that follows other successful examples around the world. At least the Democrats were pushing for policies like paid sick leave and expanding healthcare to all.\n\nI don't understand how anyone looks at Republican policies and sees tangible improvements in their life or for their families. I'd love to hear from a Trump supporter what actual improvements they expect from Trump other than vague \"more jobs\" or \"more money to spend on consumer goods\".", "&gt;It kind of annoys me how the Democratic Party just expects votes from Asians. What did they even offer them during the election?\n\nReading stuff like this I always wonder: why should a major political party be in the business of doing favors for different racial groups? Is it really the government's job to \"offer\" concessions to asian people, white people, black people, etc?\n\nIf our objective is to be a unified nation - one people, an American people - why are we putting people in groups based on race and then offering them shit? Why not ask \"what is good for all Americans\" rather than \"what is good for Asians?\" \n\nIn my opinion that's a dangerous and cynical way of looking at politics. Because - if we are going to go down that road - white people will demand that politicians pander to *them,* too. Game theory dictates that in such a paradigm *all* racial groups *must* unify to work against one another else they will be at a disadvantage. \n\nThat is no way to run a country. We must reject the identity politics and cynical race baiting of the left wing if we are to survive as a country. I hope and pray that DJT realizes this and acts accordingly.\n\nAm I making sense or no?", "Yeah I find it hilarious that democrats are taking solace in the fact that Hillary won the popular vote. Are they forgetting what she was up against?\n\nBeating Trump by 0.3% in the popular vote is like beating Stephen Hawking by 1 point in a game of basketball. \n\n", "\nBernie plans on submitting signatures to the DNC:\nhttps://go.berniesanders.com/page/s/keith-ellison-dnc?source=em161110     \n    \nI signed last night and they had 16000+ signatures (out of 20,000).     \n     \n\nKeith Ellison has a podcast if you'd like to get to know him better.     \n     \n\nWe the Podcast\nhttp://wethepodcast.podomatic.com\n"], "links": ["5cdypf", "5ce234", "5ce234", "5cdypf", "5b2p5g", "5ce234", "5cdypf", "5cdyer", "5cdypf", "5cdypf", "5cdypf", "5cd49m", "5cbtfa", "5cdypf", "5cbtfa", "5cdypf", "5cc5nj", "5cba24", "5cba24", "5cdypf", "5ce10i", "5cdypf", "5ccskl", "5ccmct", "5cb7ya", "5cdypf", "5cba24", "5cbrjv", "5cdypf", "5ccskl", "5cdypf", "5ccskl", "5cdu23", "5cba24", "5cdyer", "5cba24", "5ccbj8", "5ccmct", "5cdypf", "5ccmct", "5cc5j9", "5ccmct", "5cdko9", "5cdypf", "5ce4cn", "5ccskl", "5cdyer", "5cdu23", "5cdypf", "5cc5j9", "5ccbj8", "5ccmct", "5ccskl", "5ccxu7", "5cdu23", "5cdyer", "5cdu23", "5ccbj8", "5cdypf", "5cc4dn", "5cba24", "5ccskl", "5cba24", "5ccxu7", "5ccmct", "5cdypf", "5ce10i", "5ccmct", "5cdypf", "5ccmct", "5cc5j9", "5ce4cn", "5ce10i", "5cdypf", "5ccmct", "5ccskl", "5ccskl", "5ccmct", "5cdu23", "5ce10i", "5ccbj8", "5cdypf", "5cc5j9", "5cbtfa", "5cc5j9", "5ccskl", "5ce4cn", "5cba24", "5cc5j9", "5ce36a", "5cbtfa", "5cdypf", "5cdv23", "5cba24", "5ce234", "5ce234", "5cdypf", "5ce4qe", "5ce234", "5cdypf", "5ce4qe", "5cdypf", "5ce83s", "5ce4qe", "5ce83s", "5ce7au", "5ce234", "5ce234", "5ce234", "5ce4cn", "5ce234", "5ce234", "5cdypf", "5ce7au", "5ccskl", "5ce10i", "5ce4qe", "5ce234", "5cdypf", "5ce10i", "5cdypf", "5ce234", "5ce4qe", "5cdypf", "5cdypf", "5ce4qe", "5cbtfa", "5cdypf", "5ce234", "5cdypf", "5ce7au", "5cbtfa", "5ce83s", "5ce234", "5ccskl", "5cc5nj", "5cdypf", "5cbb8c", "5cdypf", "5ce7fx", "5ccskl", "5cdyer", "5cc5j9", "5cbtfa", "5cba24", "5cd49m", "5cdypf", "5cdu23", "5ccskl", "5ce234", "5cdypf", "5cdypf", "5ce7au", "5ce5c8", "5cdypf", "5cbtfa", "5ce10i", "5ce234", "5cdypf", "5cd49m", "5cdypf", "5ce76b", "5ce83s", "5ce4qe", "5cebls", "5cdypf", "5cba24", "5cdypf", "5ccmct", "5ce234", "5cdypf", "5ce7au", "5ce234", "5cdypf", "5ce4cn", "5ce83s", "5cbtfa", "5cdypf", "5ccmct", "5ce4qe", "5cec7n", "5ce83s", "5cd49m", "5ccskl", "5cc5j9", "5cd49m", "5ce7au", "5cba24", "5ce10i", "5ccskl", "5cegka", "5cdypf", "5cegka", "5ce234", "5cdypf", "5cdypf", "5cegka", "5cdypf", "5ce234", "5ce234", "5cdypf", "5cdypf", "5cdypf", "5cejof", "5ce4qe", "5cdypf", "5cdyer", "5cdypf", "5ce234", "5cdypf", "5cegka", "5cdypf", "5ce234", "5ce234", "5cdypf", "5cdypf", "5cegka", "5ce83s", "5cdypf", "5cejof", "5ce234", "5cdypf", "5ce234", "5ceccn", "5cegka", "5cdypf", "5cdypf", "5ceccn", "5cdypf", "5cdypf", "5cdypf", "5cdypf", "5ce234", "5ce83s", "5cei2j", "5cdypf", "5ce234", "5ccmct", "5cegka", "5cdypf", "5cdypf", "5ce234", "5ce234", "5cegka", "5cdypf", "5ce234", "5ce83s", "5cd9wu", "5ce83s", "5cd9wu", "5cd9wu", "5ccskl", "5ce10i", "5cdypf", "5cdypf", "5ce4qe", "5ce234", "5ce7au", "5cegka", "5ce83s", "5cdypf", "5cejbj", "5cdypf", "5cdypf", "5cdypf", "5ceccn", "5cdypf", "5cdypf", "5cdypf", "5ccskl", "5cdypf", "5ce234", "5ce83s", "5cdypf", "5cdypf", "5cdypf", "5cdypf", "5cdypf", "5cdypf", "5cd9wu", "5ceccn", "5cdypf", "5cebls", "5ce234", "5cdypf", "5cdypf", "5ce234", "5cdypf", "5cdypf", "5cdypf", "5cegka", "5cegka", "5cegka", "5cdypf", "5cdypf", "5cdypf", "5cep0p", "5cegka", "5ces2l", "5cdypf", "5cdypf", "5cei2j", "5cep0p", "5cdypf", "5ce234", "5cdypf", "5cdypf", "5cdypf", "5cdypf", "5cdypf", "5cdypf", "5cdypf", "5cegka", "5cdypf", "5cegka", "5ce234", "5ce234", "5cdypf", "5cdypf", "5cep0p", "5cdypf", "5ce234", "5cep0p", "5ce234", "5cdypf", "5cdypf", "5cdypf", "5cegka", "5cegka", "5cegka", "5cdypf", "5ce234", "5cdypf", "5cep0p", "5cdypf", "5cegka", "5cep0p", "5cdypf", "5cdypf", "5ces2l", "5cegka", "5cd9wu", "5cdypf", "5cejof", "5cejof", "5ce234", "5cdypf", "5b2p5g", "5cdypf", "5ce234", "5cdypf", "5cdypf", "5ce234", "5cdypf", "5cdypf", "5cdypf", "5cegka", "5cdypf", "5ce234", "5cegka", "5cdypf", "5cdypf", "5cdypf", "5cdypf", "5b2p5g", "5cdypf", "5ce234", "5cegka", "5cdypf", "5cdypf", "5ccskl", "5cdypf", "5ce83s", "5cdypf", "5cdypf", "5cdypf", "5cegka", "5ces2l", "5ce4cn", "5cdypf", "5cdypf", "5cdypf", "5cdypf", "5cdypf", "5ce234", "5cegka", "5cegka", "5cexjq", "5cegka", "5cexjq", "5cexjq", "5cdypf", "5cegka", "5cegka", "5cdypf", "5cegka", "5cf6mz", "5cegka", "5cdypf", "5cez4p", "5cegka", "5b2p5g", "5cexjq", "5cegka", "5cf2r9", "5cezvn", "5ce234", "5cdypf", "5cexjq", "5cegka", "5cez4p", "5cegka", "5cf4kk", "5cdypf", "5cez4p", "5cegka", "5cexjq", "5ce4qe", "5b2p5g", "5ce234", "5cdypf", "5cexjq", "5cezvn", "5cexjq", "5cew2t", "5cdypf", "5b2p5g", "5cegka", "5cdypf", "5ces2l", "5ce234", "5cdypf", "5ce234", "5cezun", "5cdypf", "5cexjq", "5cdypf", "5ce234", "5ce234", "5cezvn", "5cegka", "5ce234", "5ce234", "5cez4p", "5cegka", "5cegka", "5cdyer", "5cdypf", "5cegka", "5ce234", "5ce234", "5cez4p", "5cdypf", "5cegka", "5cexyd", "5cep0p", "5cdypf", "5cdypf", "5cdypf", "5cegka", "5cexjq", "5cdypf", "5cf4kk", "5cdypf", "5cdypf", "5cep0p", "5cf1bu", "5ce234", "5ce234", "5cegka", "5cegka", "5ce4qe", "5ce234", "5cegka", "5cegka", "5ce10i", "5cep0p", "5ce234", "5cexjq", "5cegka", "5cexjq", "5cezvn", "5ce234", "5cegka", "5cegka", "5cf4js", "5cegka", "5cf4js", "5cf4js", "5cegka", "5cexjq", "5cf4js", "5cf4js", "5cegka", "5cegka", "5cegka", "5cf4js", "5cegka", "5cf2r9", "5cezvn", "5cegka", "5ce234", "5b2p5g", "5cexjq", "5cegka", "5cf4js", "5cf4js", "5cegka", "5cdypf", "5cegka", "5cf7a4", "5cez4p", "5cegka", "5cegka", "5cegka", "5cexjq", "5cf6mz", "5cep0p", "5cegka", "5cezvn", "5cf6mz", "5cegka", "5cf6mz", "5cegka", "5cexjq", "5cezvn", "5cexjq", "5cegka", "5cejof", "5cegka", "5cf9rn", "5ce234", "5cdypf", "5cdypf", "5cf2r9", "5cegka", "5cf2r9", "5cei2j", "5cf6mz", "5cegka", "5cegka", "5cfh77", "5ce234", "5cez4p", "5cegka", "5cf7a4", "5cezvn", "5cegka", "5cexjq", "5cegka", "5cf4kk", "5cf6mz", "5cf7a4", "5ces2l", "5cdypf", "5cegka", "5cezvn", "5cf7a4", "5cexjq", "5cegka", "5cdyer", "5b2p5g", "5cf6mz", "5ce234", "5cf2r9", "5cegka", "5cegka", "5cf7a4", "5ce234", "5b2p5g", "5cegka", "5cf4js", "5b2p5g", "5cegka", "5cdyer", "5ce4qe", "5cegka", "5cegka", "5cez4p", "5cf7a4"]}