{"comments": ["The swamp won't be drained. He's just going to stick his name on it and say how fine of a luxury resort swamp this is. ", "&gt; They won't be ignored by the Democrats next time around.\n\nDon't underestimate the ability for the DNC to fuck that up", "Peter Thiel donated a couple million dollars and immediately gets offered a cabinet spot.\n\nEnjoy your shitshow. These are worse cronies than the Democrats associate with.", "I hope not. Pence is a nightmare.", "It'll be Republicans that do it. They just won every branch of government (inc. SCOTUS) by letting Trump shit all over them for an entire campaign. They don't need him anymore. At the first sign of trouble they'll toss him out on his ass.", "Like the the people who voted for the Brexit Trump supporters are about to find out how a lot of things they voted Trump for will now not happen", "It's not about what you have rather what makes people think about you. It's about how you act and what you say. Trump said he wants to punish those who took their jobs and outsourced. Bernie sourced the same frustration Hillary didn't. \n\n\nTrump got his money from \"daddy\" but was a business man so he earned (more or less) his money. Hillary was caught stealing White House furniture (grossly in debt) then somehow became a multimillionaire without starting a business by selling influence. ", "seemed like everytime Trump was talking at factories or in towns like you said there was a story of Clinton at a $5000-a-plate fundraiser.", "That's exactly why the Republicans have every incentive to try to impeach Trump. Trump is in way over his head. The political appointments that he makes now is absolutely vital to his survival in Washington D.C. Does his subordinates have his best interest at heart or will be it people who secretly have no respect for him and will screw at the first sign of trouble for their own benefit? Can't wait to see how it all plays out.", "All these swamp comparisons are great because now we can preface every white house press conference or rose garden speech with \"MEANWHILE!  AT THE LEGION OF DOOM!\"", "Ya hopefully it's a wake up call for them that people won't just vote for them because they are democrat. After hearing some of the initial statements from them after the loss however I'm not holding my breath. Pretty sure I heard on the news yesterday Hillary's VP selection blaming the loss on the fact that she was a woman!", "Simply allowing Donna Brazile to continue to be involved in the DNC at all shows they have no clue what the problems are and have no plans to change.", "Trump won for 2 reasons...\n\n1. The Dems alienated a large part of their traditional voting base by completely ignoring their concerns. These people were Bernie votes in the Midwest who went Trump during the election\n\n2. While I wholeheartedly agree that most Republican voters are among our uneducated citizens you illustrate the 2nd point...the Dems and their newfound holier-than-thou PC attitude alienated even more people from them. \"If you don't like Hillary you are a misogynist\" \"if you don't like Obama you are a racist\", \"if you think we need to overhaul immigration and should put a halt on letting some people into the country you are a xenophobe\". That shit alienated even more traditional Democratic voters such as myself...", "They made it taboo to like Trump. A social crime even. And then acted surprised when a bunch of silent Trump voters emerged and CRUSHED them. ", "Unfortunately that professor isn't an isolated asshole. A lot of them think that way. The elitism in academia is unmatched even by Hollywood.\n\nI went to a state school and had a sociology professor that taught at NYU and USC. Any time she presented a concept that the students took issue with, she would belittle them and say, \"Well when I taught at NYU and USC no one had an issue with these concepts.\"...basically implying that we weren't smart enough to agree with her.", "Wake up should have happened after they lost the senate in 2014.  Two houses of congress they were voted out of.  ", "Yes Bush definitely misled the public on WMDs and we had to listen to Republicans (the very same that voted for Trump - make no mistake) tell us we need to live in a fantasy world where the Iraq War was a great idea and anyone who didn't support it was a traitor. Suddenly in 2008 these authoritarians became True American Patriots, stockpiled weapons, and openly called for armed insurrection every time Obama held a press conference about a school shooting or climate change. Now these idiots voted in another dipshit Republican, this one more accurately representing their attitudes, and are telling us we need to \"respect the democratic process.\" \n\nAt every step of the way, these people have been wrong, willfully so, and they will not change. \n\nThe very best part about this time around though, is these people voted for a 4chan shitpost. 4chan literally shitposted its way to the White House, carried on the backs of low-information Republicans.", "chuck schumer is a fucking knife-fighting bar-brawling rough rider compared to Harry Reid.\n\nMy favorite story of him is back in 2012 he made a deal with Scott Brown, a pretty moderate republican as he was from Massachusetts, that if Brown worked with the Dems on a crucial bill, they wouldn't seriously challenge him for re-election.\n\nWell, Brown backed out and Schumer called him up, cursed him out, and said he would recruit someone who would beat him so bad he'd run back to Massachusetts tail between his legs.\n\nSchumer put down the phone and guess who his next call was to? Elizabeth Warren.\n\nIf Schumer and Bernie are the opposition, Trump and the Senate have MUCH to fear the next two years. ", "This behavior is unprecedented. The seat does not \"belong\" to a conservative as some Republicans have stated. \n\nIn 1991 H W Bush replaced Thurgood Marshall, a liberal civil rights attorney who literally argued Brown v. Board before the Supreme Court, with Clarence Thomas, a conservative who has been no friend to minorities. \n\nI think Obama should use a recess appointment for Garland, and the dems should fight fire with fire by filibustering any replacement until the mid-terms, when Garland could no longer serve per the Constitution. ", "She literally never went to Michigan after the primaries and would disappear for days at at time. In the days before the electron trump was having 6 stops a day. He worked for it and won. ", "He's literally the celebrity apprentice ", "&gt; “I'm going to make another prediction” he said. “This one is not based on a system, it's just my gut.\n\nOh, so nothing to see here then.\n\nYou can't raise the man on a pedestal because of his \"system\" and then just listen to him when he gives predictions out of his \"gut\".", "whoever that professor was was a complete asshole. Plenty of incredibly brilliant people come from all walks of life including from the poorest of neighborhoods  and have made something of themselves at those very elite private schools \n\n\nhell here's one example: Barack Obama ", "Trump the candidate was terrible because of what 60000,000  people voting for him means about our society.\n\nAs actual president sitting in the oval office, I and many other progressives would take Trump over Pence in a heartbeat. \n\nElecting Trump was an embarrassment. Impeaching him and replacing him with Mike Pence with a Republican controlled house, senate, and possibly Supreme Court would be the true disaster.", "&gt;But Lichtman counters by saying that the system has correctly predicted every election since 1984 (specifically his predictions have picked the next president correctly in all of those elections but 2000, when he picked Al Gore, who won the popular vote).\n\nSo by his own standards he didn't predict this election?", "Fox News has probably been one of if not the best network covering this election.  Every other network attempted to sway voters by censoring the Clinton's and the corruption within the DNC.  They also tried make it clear that the election would be a landslide victory for Clinton.  Oh how the lying caught up with them.", "No but he's totally an ally guys! /s\n\nI'm not going to be fucking gaslighted by Trump supporters. Trump may not bear any ill will towards the LGBT community, but his administration does.\n\nI'll be damned if my rights are taken away while I stand idly by.", "Reddit doubling down on calling their political opposition uneducated dumbasses I see.  \n\nHow's that been working out for you so far by the way?", "Trumpets got duped. They honestly thought the *politically active billionaire* gave a fuck about them!\n\nHe knew he could abuse populism. It works every time. The desperate and ignorant masses eat up populism like its a Golden Corral. They always have since the time of the Caesars and Napoleon, Lenin, Hitler, Mussolini, and now Berlusconi, Duterte, Putin, Erdoğan, Chavez, and Trump.\n\nThe people are their own worst enemy.", "I wish more people would just admit that they voted for Trump based on the fact that he trolls people they don't like.  He really is the embodiment of a 4chan shitpost.", "[Choosing Donna Brazile as the interim leader of the DNC](http://www.huffingtonpost.com/entry/donna-brazile-democratic-national-committee_us_5824cb95e4b0ddd4fe7954e8?f019736x1ofscerk9) doesn't sound like good news to me.  Shit like this is the reason people don't trust the democratic establishment.", "Please lets also not forget that the GOP's strategy of completely sandbagging Obama for 8 years worked marvelously. People were tired of the dysfunction and inaction in Washington but other than Trump they reelected the very people responsible for it both in 2012 and 2016. ", "I'm seeing quite a few people (on both sides) who keep crediting some silent bigoted majority that came out of the shadows to carry Trump to victory... but the fact that he got less votes than Romney did in 2012 is very telling.", "Exactly I saw the writing in the wall then. Dems lack morale. They need a message to rally behind. Forcing Clinton on us only hurt them.", "Hillary tried to sit around in her 10000 dollar jacket and win off Trump's faults while she had the charisma of a dead squirrel. Trump went to the Rust Belt, stood in front of the abandoned factories and talked to the very people the Democrats had in the bag not too long ago ", " I look at the debates and how she just sort of laughed her way through. If she had spent less time laughing at Trump and more time convincing us to vote for her maybe things would be different. There was too much \"Look at Trump! Ha!\". This all literally led to the \"lesser of two evils\" we were all hearing about before nov 8 and it wasnt enough. 800 mil and too much went to directing attention toward Trump instead of herself. ", "This needs to be an idea that gets out there more.   The dems amplified him into a giant monster to try and make him more monstrous than her crookedness.   \n\nNow here we are with the mess that  is a bunch of leftist kool-aid drinkers thinking literally rape-hitler was elected.\n\n", "\"playing back video of Trump saying things in the full context he said them is media bias and unfair! The media spending more time covering Clinton's emails than on any other issue is just good journalism!\" ", "Ellison took his Congressional oath on a Quran from Thomas Jefferson's personal library", "safe to say the african american turnout wasn't nearly as high as it was for Obama", "&gt;  If we tried to speak about any of his policy you'd call us racist sexist, or xenophobic.\n\nThen say something about his policy.  Most discussions I have attempted (that included differing points of view on what he has said)  generally got the response the response \"email\", or \"both candidates are bad\".\n\nSo let's give this a try:\n\nHow do you feel about his policy with regards to Russian expansion?\n\nHow do you feel about his policy with regards to climate change?\n\nHow do you feel about his policy with regards to the environment?\n\nHow do you feel about his policy with regards to immigration, specifically banning Muslims from entering the country, deportation squads, and building a wall and declaring a trade war against Mexico to fund it?\n\nHow do you feel about his stated intention to weaken the second amendment?\n\nHow do you feel about his stated intention to institute \"stop and frisk\"?\n\nHow do you feel about his strategic and tactical awareness to navigate complex issues in the middle east, especially in light of his claim that our military leadership are losers and that he has a better plan to stop ISIS?\n\nHow do you feel about trump's stated position on vaccines?\n\nHow do you feel about Trump's statement that he will triple the number of private prisons?\n\nHow do you feel about Trump's plan to privatize roads and bridges?\n\n", "Honest question here what/who do you mean by \"normal people?\"", "&gt; I'll keep following @FLOTUS so I can reread Michelle's tweets with someone else's avatar.\n\nHahahahaha that gave me a good start to my day", "From what I see here at r/politics, many Trump supporters are saying that. I've read \"keep saying that, that's why you lost\" or something similar a bunch of times over the past few days.\n\nI don't think every Trump supporter is motivated purely by spite - I've also come to conclude that he is the \"hope and change\" candidate for some people - but the ones who are motivated by spite will let you know.", "But he waved the lgbtq+++ flag guys!! This is media propoganda!!!!!! Trump is a lgbt hero! ", "This is why the Democrats failed (miserably). We needed someone we were passionate about and could rally behind. We had that someone. Instead they (the DNC) ran Hillary. It should be so fucking obvious right now.", "They won't. They'll blame it on Obama and that Trump had nothing to do with it.", "and yet Donna Brazile is still head of the DNC.  after being caught not once not twice but now three times feeding debate questions to hillary.  fuck the DNC they brought this upon themselves", "Climate change helped create ISIS. An ongoing drought the worst in 900 years, has destroyed 80% of Syria's agriculture. No food leads to unrest leads to civil war.", "Trump looked at economic data and determined he could take the rust belt.  He then used his skill as world class salesmen to win the presidency.  All wall being mocked and called an idiot at every step of the way.  I can only imagine the satisfaction he must feel from laughing at all the smug condescending people who doubted him.", "&gt; Oh they will when the policies start affecting them.\n\nAt which point they'll blame liberals, minorities, gays, and whatever other scapegoat The Donald and his crew offer up.", "This really has been a strange election cycle. Fox News was the most trustworthy big media and the Republican Party with a proto-fascist running, was the actual democratic party while the Democrats rigged the system and suppressed the votes.\n\nYou can't make this stuff up.", "Calling them names like racists is even worse.  The same people who voted twice in Ohio Pennsylvania, Michigan, Wisconsin and Iowa for Barrack Obama are the ones who voted for Trump.  They voted twice for a black man with the middle name Hussein.  They are not racists.  ", "Anti-bullying initiatives have lost steam now that the biggest bully in America was just elected president.", "I don't care what gender or race you are I just want to know about your policies and what you are going to do for us.   I hate that the last two elections the DNC has focused so much on 'historic votes'.  I would hope at this point we could just ignore that she is a woman.  I'd love to see Warren run next time and just focus on her policies and not the whole 'it's time for a woman' crap.", "Literally anyone who isn't a racist dick. Like hey I don't think of myself as racist, I work with a diverse group of people.and we all get along very well. I try to be a good person, and generally am more than willing to give someone a chance to prove the content of their character. Screaming at me in the street becomes kinda old real fast. I am pro what BLM stands for, 100%, and I actually empathize with WHY some of the protests go so overboard, but I don't have to condone that behavior. I am very anti how BLM has gone about a great many things. ", "The thing I want to know is why is it freaking wrong for someone without a college degree to vote?\n\nI'm a black person with a college degree and that's what has left me a bad taste in my mouth from liberals.  They think your voice doesn't matter if you don't have a college degree, when there are many great careers that can be had without it.  They then wonder why those same people don't vote for Hillary.", "He also won because people are sick of this sort of intellectual elitism. The way with which rural whites are looked down upon is also borderline racist.", "Nailed it. My personal experience is not an uncommon one - I'm a white guy in my 20s I have a degree (electrical engineering), voted for Obama in 2012, and I voted for Trump in 2016. The Democratic Party successfully alienated the largest voting demographic in the United States, but they're so wrapped up in identity politics that they've decided to double down on blaming the election results on the *evil white man*.", "Also media appears to be defining \"working class\" this election as those w/o college degrees. Except working class is more typically defined by income. \n\nIn the primary Trump voter median income was $72K, not working class. Exit polls in the general show Clinton winning brackets below $50K which would include working class. \n\nThese latter voters just didn't show up to the polls the way they did for Obama.", "This election exposed a lot of liberal arrogance like that.", "Honestly even as a veteran I think the whole military experience thing is way overblown. If a President served, hey great, more power to them. If not, then that's why they have military advisors and top military brass to help POTUS. A lot of President's didn't serve in the military. I was a huge Obama supporter and didn't hold it against him. I'd be a hypocrite to hold it against Trump simply because I don't like him or because he's a republican.", "Well they have to say something, and it isn't going to be some, \"HEY GUISE WE CHEATED, OK? BUT WE REEEEEELY SORRY. WE WONT DO IT AGAIN, PORMISE!\"\n\nBut yeah, fuck 'em. Kaine can eat a fat one for lying.", "Never seen a Presidential candidate work so hard as Trump.  The man was non-stop.  I'm apprehensively excited to see how much he gets done in the next 4 years.", "\"the tolerant right\" I say sarcastically as if proving a point.", "&gt; \"Well when I taught at NYU and USC no one had an issue with these concepts.\"\n\nI'd have asked her why she's not teaching at those prestigious schools anymore. If I'm a second rate student for attending a state school surely that means she's a second rate professor.\n\n\n\n", "My soon to be father in law in more educated than me. He's objectively *smarter* than me. He's also conservative and voted Trump.  \n  \nI'm a far left socialist that listens to Ben Shapiro. Why? Because he's *fucking smart*. I rarely agree with him but he always challenges my beliefs, and that's a good thing.\n  \nIt takes a real idiot to think that Trump voters are stupid. There's plenty of stupid on both sides.  \n  \nIt's like the cherry-picked Trump rally attendee interviews the media kept playing. All that did was alienate that *entire demographic* from the media. Is it any wonder why they stopped trusting it?  \n  \nThe left (edit: myself included) *really* needs to learn that the right is *not stupid*. How are we smarter than the right when they just took *all three branches of government*?  \n  \nSorry for the rant. I'm just so frustrated with the left in this country. Especially when it calls people I respect stupid.", "Love him or hate him. He has won at just about every level whether it be business or now politics. It's honestly funny how many people didn't give him a chance, yet here he is, the president-elect of the united states.", "Wait didn't Obama win the popular vote both times??", "Except that they didn't even try to walk that line.  They started with the premise that dumb people vote for Trump and didn't even try to think of reasoned arguments for Trump; on issues such as trade and immigration, Trump said current policy is bad for workers, and HRC never presented a coherent counter-argument as to why the policies are good (there is a good argument to be made, but she didn't make it).     ", "She played prevent defense with a slim lead (and now as it turns out wasn't really a lead at all). ", "70 years on this earth sucking up as much money as possible at the expense of those around him with no charitable giving. But I'm sure he's changed now /s", "I really love being called ignorant for having opposing views.  ", "&gt; It's quite simple if you don't give me anything, I won't vote for you. I might choose to exercise my right NOT to vote.\n\nPlease explain how the GOP continues to get the same people to vote for them despite the GOP not giving them anything. I feel really bad for the blue collar people that voted for Trump on the promise that he will bring manufacturing jobs back to the US. \n\nThey're never coming back. I have serious doubts that he will do anything to actually help change their lives for the better, but they will ***still*** vote for him or for the GOP because they hate the DNC that much more. \n\nAnd that's really what this election boiled down to. \"I really don't like Trump, but damnit I hate Hillary more.\" ", "I am growing increasingly disturbed by the \"war on experts\" we've seen this political cycle. Professional politicians and professional journalists have been vilified in favor of political outsiders and fringe journalism. Would these same people be in favor of taking professional doctors out of hospitals professional teachers out of our schools or professional lawyers out of our courts?  Why did having a career become such a negative thing all of a sudden?", "Took Republicans 8 years to figure out Bush sucked.\n\nAnd Republicans were brighter back then.", "right or wrong it was vote for the guy that might do it or vote for clinton who wont.", "There are still people who support the Iraq War and there are still people who think there were WMDs.\n\nDo not underestimate the power of propaganda.", "We knew 6 months back how they stacked up. Favorability goes a long way. If I recall there was no more than one poll that had Clinton more liked than Trump. \n\nI voted for Hillary but still had a smile creep across my face as I realized she was going to lose. For me it was just the, \"It's her time\" \"Most qualified candidate ever\" \"She deserves this\" bullshit that I absolutely could not stand. No one fucking *deserves* a presidency. Fuck that. ", "&gt; The simple answer is because the president is the commander-in-chief of the United States Armed Forces. \n\nAs usual the simple answer is entirely wrong.  As someone who spent 7 years in the military I can tell you that the commander in chief position is far, far more symbolic than anything else.  The military experience required to be a truly good general takes decades and likely no one aside from a handful ever had that kind of real experience.  \n\nIMHO apple-nuggets explanation was spot on. Government is *not* a business.  Diplomacy is *not* a deal.  God help us all.", "Schumer is trying to fucking help us. Don't be this stupid please. We need to learn to work together. \n\nDon't contribute to a fracturing of this party, help rebuild it. He's not \"bending the knee\", he's supporting a good candidate. Jesus christ. ", "It's so true. The clearest takeaway from this election should be that the liberal networks are just as shady as Fox News. Too many democrats think their media is unbiased.", "Hard to believe bullying is wrong when you see half the country reward that behavior with the highest office in the land. ", "The same is true in the swing states Clinton lost.\n\nIn [Michigan](http://www.cnn.com/election/results/exit-polls/michigan/president) for example:\n\n* 37% said they were better off financially today than 4 years ago, compared to just 25% who said they were worse off\n* 39% said the local job market is better than it was 4 years ago, compared to 25% who said it's worse\n* 49% said Clinton would better handle the economy, while 47% said Trump would be better\n* Of people who said the economy was their top issue, Clinton won 51-43", "Irony", "48% of white voters age 18-29 voted for Trump. 9% voted third party. \n\nYeah, that's you reddit, stop trying to pawn this crap off on other voting blocks", "The thing is these tweets exist and people aren't talking about them. At this point no one gives a shit what this man says or does. It's beyond me...can you even IMAGINE what the country would be like right now if Trump won the popular vote but lost the electoral college?? ", "A justice requires 60 votes. Democrats should withhold consent.", "God this sub is so out of touch. Maybe you should look inside your own party to see what a disastrous candidate you had and how everything was slanted in her favor. Now you got burned and are playing the blame-game. ", "He was attacked on Sunday so let us not jump to the conclusion that this is politics. I have a friend who's white brother was jumped in similar fashion not 30 miles from this location. ", "If you want to win white working class votes stop treating them like idiots.  A guy and gal in Michigan making $34K a year whose income has stagnated for the last 15 years and is struggling financially does not need to be told that he has white privilege.  The utter disdain the liberals have for poor whites is one of the reason why they increasingly keep voting against liberalism.  ", "I myself was surprised at how things turned out. I honestly couldn't understand how people could think Trump is anywhere near a qualified human being let alone candidate. However, upon reflection and seeing where the votes fell, it's not hard to see why it happened. \n\n* The DNC did this to themselves. The cronyism inherent at the upper levels of the party and the process of nomination in that party is fundamentally broken. We all watched as the RNC did everything it could to prevent a Trump nomination, stopping short of hijacking the convention. They didn't do that because they knew overriding their base would mean the immediate end to the party. The DNC had a kill switch built in with the Super Delegates, and they exercised it. They took the one person outside of Obama that has fired up young voters for their cause and tossed him aside for Clinton. That alone doomed them.\n\n* The DNC has been ignoring and dismissing what used to be their bread and butter. Working class white families. And they have been doing it for years. You cannot embrace a movement like BLM without reconciling their indiscriminate charges of institutional racism with the working class white families. Yes, there is institutional racism, and yes there is racism inherent in a lot of our society. You cannot embrace and support a movement that tells a guy who has been laid off from three jobs because the plant was moved overseas and there just wasn't enough work, working two part time jobs while his wife doing the same as they are trying to pay to feed their two kids and has his medical premiums required by Obamacare that they are privileged because they are white. It doesn't matter that in a clinical and logical view that that this white family has more advantages than the black family down the road...If you tell him that he is privileged because he is white he is going to look at being 2 months behind on rent, working 14 hours a day to feed his kids who he never sees, and he will legitimately tell you to fuck off. It doesn't matter that you can reason all of this out and that any logical person would see it.....a group people are calling uneducated white males (which is frankly a bit insulting) has been told by the party that supposedly represents them that they are inherently racist and they are privileged. And neither the DNC, Hillary or anyone else even attempted to engage that part of what was the base.\n\n* Hillary did nothing to even attempt to energize the black voting base beyond having the Obamas stump for her a handful of times and got on stage with Jay Z and Beyonce. A group of people who showed up in force for Obama just wasn't engaged by her and wasn't enthusiastic about voting for an old white woman. \n\n* Donald Trump, for all of his faults (and honestly that is really all he has) talked to those voters. Yes, he spoke to their base motivations and stoked their fears....but he spoke to them and listened. \n\nThat's not to say that the Republican Party has been given new life. Too many republicans turned their back on Trump (for legitimate reasons) and he has shown that he is nothing if not vindictive. He will be looking for payback and he will end up fighting his own party before the midpoint of his presidency.", "&gt; Senator Reid is right. Trump winning the election doesn't change the fact that he's a sexual predator.\n\nWhat it changed is that the ***media*** and ***the political establishment*** - the two forces that are Trump's greatest enemies in his own self-spun myth - stopped *treating him like one*. \n\nEvery **fact** uncovered about Donald by real investigative journalism - from using his \"charity\" to cover his own legal fees while lying about donations, to the fact that he bragged about committing assault - all down the memory hole in one day. Who cares? The election is over - he's the President!\n\nEvery **statement** he's ever made against our Constitutional and democratic traditions, from torture to war crimes to tearing down mosques - water under the bridge. We have to wish him well now - he's the President!\n\nEvery **accusation** and pending court case against him - wiped from the news. Those women don't matter anymore - he's the President!\n\n As if this entire election was a public trial and the fact that 47% of Americans voted for Trump constitutes an acquittal. Whereas if he got 2% less of the vote, he'd be a pariah.\n\nThe Presidency is already conferring its aura of legitimacy onto the man who poses a greater danger of destroying it than any other person to ever hold that office.", "It's becoming a tough choice between wanting to stay and fight it or give up and move away. Anti-intellectualism has a stranglehold on our state government. If Walker isn't given a cabinet position the tipping point for me will be if he gets re-elected in 2018 for a fourth time. He and his buddies in the state legislature have done possibly irrevocable harm to our university system, school districts, state debt, and environment.", "When white folks wanna protest it's the most American thing that a person can do when black folks wanna protest it's inconvenient and they should just be happy they're not still in chains.  Gotcha.", "Is there nothing we can do to remove her from her position as citizens?\n\nPeople keep getting outraged but we can easily boil this down to the three letters D N and C to explain why the nation has Trump as a president right now.  If the country wants change it has to start with the people who directly caused the problem first.\n", "Bernie may not be a democrat in name but he certainly is a de facto social democrat.\n\nEdit: changed verb tense", "Wow it's almost like he conned people.  No one saw that coming.", "Bernie had / has the profile of an FDR New Deal populist Democrat. Clinton operated like a moderate Republican. The Democratic party rallied around her conspired against Bernie and dismissed his voting bloc, and now wonders why it lost. You gotta be kidding.", "Yeah except for...\n\n- Lower taxes on the wealthy\n- Abolishment of the Estate Tax, which is great for those leaving an estate of 5milion or so or more\n- Abolishment of ACA, leaving 21 million Americans uninsured\n- Abolishment of the EPA\n- Paris Climate Change Accord demolished...\n\nIt's not the doing.  It's the undoing.", "Trump's cabinet is truly a thing of nightmares: Ben Carson Rudy Guliani, Chris Christie, Sarah Palin, and Newt Gingrich.\n\nDrain the swamp? Trump is about to fill it with toxic waste. ", "He's assuming it's the same people. It's not.\n\nDemocratic turnout was low. People didn't necessarily flip. Some did but not most of them. Romney had more votes than Trump. That steady base of Republicans showed up like they normally do. Hillary couldn't get democrats out to vote for her--that's why she lost Obama states.", "You think that's bad.  She was supposed to attend a large public event during her campaign where people waited for hours to see her.  She instead decided to go to a private fundraiser filled with millionaires stopping by the public gathering to give a short 5 minute speech.\n\nHillary couldn't even be bothered to pretend to give a fuck when it mattered the most to her.  What makes anyone think she'd have changed for the better once she didn't need the support of the little people?", "The turnout that surprised me was the number of Muslims who votes for Trump but after reading a WaPo editorial by one I can see why: many American Muslims who immigrated here did so to get away from fundamentalists like the Saudi government. They're not offended by people who call radical Islamic terror what it is they're worried about a candidate who would let it fester and has the money of the world's largest sponsor of it in her pockets.", "to add to your point about how you act hillary didn't give a concession speech until the day after, she probably didn't even have one ready. im solidly to the left on the political spectrum but thats a perfect snapshot of how she lost the blue collar union vote. ", "Hillary Clinton is a CRIMINAL! She is so corrupt. - Trump in every speeech\n\nI can't vote for Hillary Clinton she is a liar and she is corrupt and she is a criminal - A LOT of trump voters\n\nNow Trump is going to appoint Chris Christie to something. Nevermind HIS accusations of sexual assault and Christie's shutting down bridges for political payback and denying he had anything to do with it while his staff gets convicted on felonies. Hypocrites. Such hypocrites. How did you not see that coming republicans?", "The fact that Glenn Beck is one of the voices of reason is even more evidence of just how crazy this whole ride has been.", "Plus they have a huge hard on for Pence.", "Well she DOES have the charisma of a mosquito", "relevant username", "You got fucking played.", "Poor whites have made a habit of voting against their own self-interests repeatedly for the simple reason that if you went door to door in any trailer park in America you'd find a whole lot of temporarily disadvantaged future millionaires, and they'll be damned if the government is going to get their hands on any of that future unearned income.", "For all of her flaws she was more than qualified for the WH and does genuinely  care about helping children around the world. Rural America got the President they deserve. ", "This election just keeps getting weirder...Michael Moore is one of the few media figures actually making sense of what's going on in the country right now.", "It's almost like a man who has a long-established career of selling out ripping off and defrauding his business partners and investors should've been regarded with a bit more skepticism.\n\nBut hey, at least \"Crooked Hillary\" won't get the chance to work with Congress to select a cabinet who could appeal to both sides. Populism!", "We live as I've said numerous times, in a post-facts society ", "No. No fuck that. Mike \"zap the gay outta ya\" Pence would do everything in his power to establish a theocracy.\n\nFuck. that. guy.", "\"Anti-establishment election\" indeed.", "that's interesting and makes a lot of sense. It's crazy the amount of assumptions made by Hillary's campaign and the dems in general that turned out to be wrong. \n\nI think moving forward campaigns and the media will think twice before demonizing a candidate to the extent they did with Trump. Same thing happened with Brexit. By creating a climate where people are socially ostracized and ridiculed for voicing any support for Trump, it made it entirely impossible to accurately poll Trump support which made it equally impossible for HRC to know what demographics she needed to reach out to. \n\n", "# FOR THE BILLIONTH TIME:\n\nIf the presidency was determined by the popular vote voter turnout would have been completely different. The campaigns would have focused on the most populous states as well. The popular vote in this election is completely irrelevant.", "Unfortunately that decision was made a few months ago, when they thought that they had sufficiently covered up their transgressions, and before she was fired from CNN for her conspiratorial behavior. The actual opening for the non-interim position isn't available until next March, iirc.\n\nThe best thing we can do right now is publicly shame her into resigning and give the interim position to Ellison, so they can get to work immediately. But something tells me that the rats won't leave the ship until we've pierced its hull, sent it to the ocean floor, and salvaged the few important pieces.", "On this Veteran’s Day let’s not forgot that we just elected a man to the presidency who has said he doesn’t like prisoners of war because they were captured by the enemy. Fuck this election. You cannot convince me that middle America is in such a dire situation that we should abandon all human decency and elect a fascist. If this election was mainly about the economy then the midwest would have done their research and elected the qualified candidate who actually had a plan to improve their situation. This election was about bigotry, fear, and hatred.", "Gore did win the election.  He was right.  He couldn't have possibly predicted the fraud that occurred in florida.  ", "She was trying to let Trump hang himself. She didn't realize she came off as elitist and apathetic. Probably because she was surrounded by yes people", "&gt;I'm curious when the admins will do something about brigading and vote manipulation.\n\n\nThey sat idly by for the last 4 months.\n\nI'm no Trump fan nor do I even care to hear the arguments advanced by the alt-right (not saying you're not welcome to post here, but I'll probably just scroll past whatever you have to say) \n\n\nbut this is some pretty mind-blowing hypocrisy.", "Only if you work in some manufacturing sector that lost jobs to other countries. If you're any other middle class or impoverished person then fuck you here's some higher prices on consumer goods to help subsidize American manufacturing again.\n\nThanks Trump.", "I think most of the supporters you see here on the internet are 4chan types from /r/t_d. they're the vocal minority and absolutely are awful bigots and damn proud of it.\n\nthe silent majority of people who voted for him think he's actually going to help them. he's absolutely not, but they think he is.", "We all knew he was a con man. Well everyone aside from his supporters, apparently.", "Now I get it. He wanted to drain the swamp to run a sewage pipe instead. ", "Anyone that decides that someone is fit for presidency based on that person's genitalia is an idiot", "Clinton brought it up unwarranted during every single debate. It's the people you should be mad at; they're the ones who simply don't care. Every person here in Alabama that I've talked to about the subject quickly says \"I don't believe in it. God will take care of everything.\" \n\nIf I am making this up I ask to be struck down by lightening. You will hear these responses from the community in the south quite often. ", "He will also be the only US president to have publicly declared that he will be so good at the military that your head will spin. Surely that counts for something!?", "It's somewhat relevant. \n\nTrump does not have a mandate. \n\nIt is evidence not proof, that most in the country do not agree with him or his policies. ", "You mean a tree?", "He's recovering from mental illness and at the height of his notoriety he was legitimately insane. It's not hard to come across as reasonable in comparison with how he used to be.", "Yeah Gore would have won the electoral college too but for SCOTUS stopping the recount.", "why should he when Puppetmaster Pence is actually calling the shots?", "Um you are being smug right now.", "This was the funniest shit I've seen all election cycle.\n\n\"Hey guys we cheated Bernie out of the nomination and forced Queen Hillary on you, and we promise not to do it next time, but in the meantime please vote for Clinton and legitimize all of our cheating.\"", "Trump was literally PREPPING his base to do this same shit. But when it happens against him......it's fucking Bizzaro world.", "BLM is an open hashtag. There is no organisation no political leadership and no common ideology within the group. There is no common way of spreading the message so eventually some bored youths will end up using that as a pretext to riot. It doesn't mean that the message is bad. There are extremist sides to every political group, especially with one that is so disorganised, and it is likely the worst can be seen in riots. BLM is not a normal political group, and so it is natural their behaviour and opinions vary wildly throughout. ", "Why does everyone think that just because certain geographic locations have more people they should be counted as less? Like, that literally should not matter. Everyone should have an equal say. ", "Why is it I keep seeing \"uneducated whites\" but have never seen \"uneducated (any other race)\"? ", "Your #2 point is the reason the recent episodes of The Daily Show on Comedy Central have been completely unwatchable to me.  I end up yelling every few seconds.", "I'm curious when the admins will do something about brigading and vote manipulation.  \n\nOh well.", "Give Trump supporters a break these are new names to them.", "The fact that Glenn Beck and Micheal Moore are sounding like voices of reason is truly strange to me.", "&gt;But don’t fear Donald Trump the way I feared Barack Obama.\n\nYou were afraid of a made-up boogieman of your own design. I'm afraid of the things Trump *has actually promised to do*.\n\nNot the same thing buddy.", "That's pretty fuckin dope", "hope for the best prepare for the worst.", "Every night I will say my own little prayer to the universe for the health of Justices Ginsburg Breyer, Sotomayor, and Kagan.  And even Kennedy.", "Hillary tasked people in her policy office to [develop a plan](https://www.hillaryclinton.com/briefing/factsheets/2016/04/01/hillary-clintons-strategy-to-make-it-in-america/) to revitalize the Rust Belt. Trump told them he felt their pain and that he knew who to blame.\n\nOne way is good for being president.  One way is good for becoming president.", "And literally NO ONE is surprised. \n\nWe just laid back and took it like the slaves that we are. ", "Electoral map is stupid. Trump said it himself. ", "Maybe you should have tried giving them something to vote FOR rather than AGAINST. This shit works great for Republicans not so much for Democrats.", "My new favorite saying for the next four years:\n\nYou got fucking played.", "Here's the thing: The DNC watched Trump tear through every single political establishment candidate the GOP put up against him and then decided to put up a political establishment candidate against him.\n\nOh, Trump beat the political establishment candidate? Well fuckin' A tweety, *nobody* could've seen that one coming.", "The Democrats keep making the mistake of watching statistics instead of emotions. It doesn't matter that unemployment is down and wages are up; if people are unhappy *fucking listen to them and appeal to what they want.* Don't tell them they're wrong and racist to boot for voting for the guy who does listen. It doesn't matter that none of Trump's policies will help the people who voted for him - at least he fucking listened. The Dems didn't even do that much.", "I LOL Every time people say Hillary's attack ads were harsh this campaign cycle.", "A plurality of us sure didn't. ", "&gt;retreating into his shell\n\nIs this a subtle \"McConnell looks like a turtle\" reference? Because he definitely does ", "They willingly voted for a con artist. A guy who became famous for being a con artist. A guy everyone who worked with called a con artist and told people not to elect him the president. They willingly ignored it all. They ARE ignorant and if they believe this guy with no experience a history of serving himself, and no one to vouch for him would \"fix\" their problems, then they ARE stupid and now EVERYONE has to pay for it. Apathy is why we're in this situation. American citizens shouldn't have been apathetic towards their democratic process and kept letting the same ineffective congress get reelected but we also shouldn't be apathetic to this blatant ignorance and stupidity. You leave your child in the care of a child predator, you're called an idiot. You leave your country in the hands of corporate predators, you're called an idiot", "I'm already hearing from Trumpies that Bush wasn't in any way responsible for the financial meltdown of 2008 it was all Clinton's fault!  War never hurt an economy!\n\nWhile I would never make excuses for NeoCon Bill, the positives the Trumpies attach to everyone who makes them feel like Super Hero Big Man, areso funny, if it weren't all so ultimately very sad.  Maybe Hollywood should quit giving them shitty stupid Super Hero movies to identify with?\n\nI expect we will see such laughable excuses for years to come - Thanks Obama!", "I seriously wish that the democrats would just drop the gun issue. It is completely turning off the rural population. People do not get motivated to vote for someone who wants more gun restrictions.", "The article says one of the staffer who was actually brave enough to stand up to her got booed and shunned by other staffers so you are probably right.  These people choose to live in a bubble and they will fight tooth and nail to stay on that sinking ship... so it might take some time to drain this swamp.", "RIP the American economy ", "They voted for change in 2008.  Change didn't come.  So they voted for change in 2016.  ", "I'll say it right now. I'm as guilty as everyone else. I did not think Trump could win. Moore was right. Ellison was right. We should listen to them now.", "Trump will be lucky to last four years. He's already involved in two trials for fraud and racketeering and he is still plagued by the scandal of all the women who have accused him of sexual assault, and his foundation is dirty as hell. What will happen if those Apprentice tapes get leaked where he said things much worse than \"grab her by the pussy\"? What happens if Trump is forced to release his taxes? What about the Russian connection to Trump's campaign? Trump's administration is going to be a complete shitshow.", "&gt;Anyone that decides that someone is fit for presidency based on that person's genitalia is ~~an idiot~~ a sexist\n\nFTFY", "Seriously...this. I wish people would stop using the election results as a definition for what everyone is in the country. From what I can tell the Republican base stayed as strong as it has for decades. The wavering Democrat base is what decides elections. Dems show up, dems win. This time, HRC couldn't turn out the votes so she lost. It doesn't get more deep than that. ", "There will be no filibuster going forward.  Filibusters are artificial.  They only exist if voted into the rules on the first day of the session.\n\nRepublicans are not stupid they are going to remove the filibuster.  Otherwise dems could block them in the same way they blocked dems.", "Sure. He generated all of that money on his own. He didn't get anything from his father at all. Ok.", "As awful as Trump is a lot of people just wanted to stick it to Washington, just like the Brits wanted to stick it to London. I mean,  2016 has been a year of anti-establishment and Washington tried to give the American people Jeb Bush vs Hillary. Hopefully this will be a wake-up call and not a complete disaster.", "She did the same thing against Obama which is why she collapsed against him as well. She never sticks to her strengths. She focuses on the opponent ", "Yeah I call bullshit on that. So they voted for Obama policies, and then voted by the guy who says he's going to undo all the Obama policies? All because they want some amorphous \"change\" whatever that is? Bull-freaking-shit.", "Not all trump supporters are racists but all racists are trump supporters", "Mar-a-Pantano", "Reminder: Pence made it a _felony_ for gay people to simply ask for a marriage license.  He also moved AIDS funding to gay camps...  Beyond that he agrees with nearly every trump policy.   If you think pence is an improvement over trump, think again. ", "Instead of blaming this on people not voting let's talk about the real problem. Over 800 polling stations closed down for this years election. Blatant voter suppression around the country carried out by the Republicans. Disgusting. ", "Educated white males voted for trump.  ", "Yup don't dismiss the \"fuck it lets just burn the whole fucking thing down\" voters.", "Indeed. It is absolute drivel right now. Out of all the late night shows I watched (Colbert Daily Show, Fallon, Meyers, Kimmel and Conan), Daily Show was the only one that seems to NOT HAVE A CLUE AT ALL what happened. They are still toeing the Clinton line.\n\nThey need to cancel Daily Show if they don't change, the same as CNN.", "Lawful evil or chaotic evil. Honestly it's a tough choice. The lawful evil you at least know exactly what's coming. ", "This is consistent with how he ran his company.  Trump doesn't actually do deals and hasn't for a long time.  He's relied on others like his kids to develop the strategy and negotiate the details.  Once that is done Trump comes in and closes - shakes hands, promotes the golf course, gives a speech - and then goes onto the next thing.  \n\nThat is sort of why none of the scandals (Trump U) were really his \"fault.\" Trump didn't say one day \"hey wouldn't it be cool if I created a scam university built around my real estate business?\"  Someone with a background in the seminar business pitched him the opportunity and did the leg work and Trump posed for some photos and commercials/videos. That's it.  \n\nWhoever he picks to run his Cabinet is going to make the deals with Congress, who will probably design most of the laws. Trump will sell them to the people after they are passed, but he will not be involved in designing policy. He's just not that kind of CEO. ", "Stop pushing this narrative. Trump and Romney got the same number of votes. Clinton got 5 million fewer votes than Obama. Crazies didn't come out Democrats stayed home. ", "This is so sad. LGBT's shouldn't be afraid of losing their rights but alas here we are.", "Post-facts society. ", "One of the MSNBC commentators used the analogy of chemotherapy to describe Trump. It may kill the cancer but it could just as well kill all the good stuff too.", "&gt;Activist journalist Shaun King has been posting numerous stories to his Twitter and Facebook pages.\n\nIt makes it hard to take this seriously when you're citing [known liars](http://www.nytimes.com/2015/08/20/us/activist-shaun-king-denies-claims-he-lied-about-race-and-assault.html) and plagiarizers who have repeatedly demonstrated they'll say anything in the service of sensationalizing themselves and their politics.\n\nI know -- you'll say \"that's only one guy there are numerous stories\". The point is that if your bullshit detector isn't good enough to start beeping when Shaun King shows up, I have no reason to think any of the rest are more credible than that.", "I think they would impeach him.  They get president Pence.  ", "I hope so.  Pence won't win a reelection as easily.  ", "Trump's supporters are going to realize that you need people to run the government. Who did they expect Trump to pick honestly?", "LOL we need an outsider who can come in and shake things up.\n\nLadies and gentlemen, Here's everyone you've hated since 2002!", "And the world collectively said no shit.", "It's 2016 and working class people still get grifted by a fast talking New Yorker lol.", "Friendly reminder - the guy who called the system rigged won the election with nearly half a million fewer votes", "\"her hubris ruins everything she touches\" -colin powell", "Yeah but half of them are saying it in Hindsight.\n\nThose of us that voted for him knew it from day 1 when they polls kept showing he would do better.", "Exit polling indicates that about 10% of Trump voters approved of Obama's job performance. That may not sound like a lot but it is, in this partisan era. More than enough to flip the election.\n\nOf course the *majority* of people who voted for Trump did not vote for Obama. That isn't how parties work. However, a significant number did, and whatever racism drove the Republican vote in '08 and '12, it was already \"baked in\" to the 2016 numbers.\n\nThe big takeaway is, whatever you think about the racism of Republicans in general, it is objectively untrue that a sudden tidal wave of it swept Trump to the presidency.", "&gt;It does need to be better than to just slow the rate of acceleration by a few months if you want to persuade the Americans like myself. We will need to adapt as well.\n\nBy the very *nature* of climate change we *cannot* do better than slowing the acceleration. There is no one surgery that will solve the problem with immediacy. \n\n&gt;There is no real hope for American support if climate change remains a progressive religious catechism. President Trump might do what President Obama could never do he could unite and lead our nation on this issue.\n\nYou keep saying this - a little bit later you take issue with my citing rhetoric. *This* is exactly what rhetoric is; the wishful thinking that your candidate will unite us all under an anti-climate-change philosophy. None of this is steeped in fact - it'd be just as simple to say any other politician ever *could* do the same. It's a totally pointless anecdote that drives home your predisposed bias towards a singular candidate. Who says we needed Trump to do what you say could be done? Who says Obama wasn't already doing that? People are not very split on climate change - I think you're digesting the wrong media outlet. \n\n&gt;As for the climate scientists like myself that recognize the potentially dire issues here, there needs to be some coherent realistic plan as well.\n\nYou're a climate scientist who was totally unaware of Obama's MATS, Green Power Plan, and the Paris Promise? \n\n&gt;You may not realize it but many scientists have long ago abandoned the idea that humanity will make significant changes. Only two small nations kept their Kyoto commitment. Germany for one example has massive immigration-related unrest and the German coal miners will likely reverse the German coal reduction commitment.\nWere we on a track** to prevent climate change with President Obama? Nope.** Might we under President Trump? Maybe.\n\nThis is how I know you're waist-high in willful ignorance and the claim that you - yourself - are a climate scientist is outrageous; *everyone already KNOWS climate change cannot be prevented - it's already fucking occurring.*\n\nBeyond that - what do other nation's commitments, or lack thereof, have to do with America doing what's objectively correct? \n\n&gt;I have made no claim that \"is false and plain rhetoric\". I don't know what our new President will do. Only you made this claim.\n\nSince it obviously isn't clear, this is what rhetoric looks like:\n\n&gt;Might we under President Trump? Maybe.\n\n&gt;**He is going to tear up all of the worthless treaties, so don't wail and gnash your teeth then.** Wait for the next phase. **Stand and help unite our nation to make progress**, to create binding treaties on Climate Change.\n\n&gt;**Trump may unify America behind climate change**. He also might not. **Obama actually reduced public support by making it a progressive's only issue**, so can Trump do better?\n\nWhat you seem to confused on is that we were already doing all of these things. The idea that you, and whoever you consider your constituents to be, are against some party of \"progressives\" is so outrageously inane it's hard to even find a starting point - I guess I'm supposed to ask: \"what's wrong with wanting progress?\"\n\n&gt;Trump is a very smart president who will have a very smart and informed climate change staff. I presume that while his approach will likely be different, that it will be both smart and informed.\n\nPresume is where you've finally nailed it. Instead of objectively looking at evidence, you continue to try and force feed this narrative (and still don't know where the rhetoric is?). Let's tackle this objectively:\n\n1) Why do you believe Trump is a smart president? What has lead you to that belief, beyond someone else simply telling you that's the case?\n\n2) Trump has appointed a renowned climate-denier has head of the EPA. This is an objective fact - what you're suggesting has already come to pass and he's chosen a willfully ignorant politician whose largest contributor are the Koch's. Are you interested in changing this claim, or do you still believe the head of the EPA need not believe *climate change is a real thing* in order to make progress on climate change?\n\n&gt;As a climate scientist I have looked for a plan that might reverse the warming process and I have not found one. You presume that we can do this. Why?\n\nYou aren't a climate scientist. No climate scientist would ever even form this sentence *because it is flat common knowledge* that there is no path to totally reversing what's *already set in motion.* This has effectively been common knowledge for nearly a decade and nowhere in our thread have I \"presumed\" there to be such a \"cure.\" In fact, many times over I've pushed for maintaining a *slowing down climate change* because there *is no cure* - while you've continued to insist there is some other option than slowing the acceleration of climate change. In case you've forgot:\n\n&gt;Remember that none of the plans and agreements would have stopped climate change, at best they would slow the rate of acceleration.\n\n&gt;So the key question is if Clinton's election would have resolved anything important other than slowing the rate of acceleration?\n\nIt's absurd to form this argument - because climate scientists *already know* there is no other current solution than slowing the rate of acceleration. There's no time to sit around and wait for a miraculous cure-all to be invented. Further, there's no reason to believe we cannot do BOTH as we move forward to tackle this imminent global catastrophe. \n\n&gt;If there are \"deniers\" then their also must be \"believers\".\n\nThis is purely the logical fallacy of false dichotomy. Your claim here is flatly false - those are NOT the only two options. \n\n&gt;You are a believer? Fine, I respect this. \n\nYou've extrapolated something bordering the insane; nowhere have I suggested any of my claims are steeped in some 'belief' system. One does not *believe* that evidence exists. \n\n&gt;President Trump may not be a \"believer\" in your religious catechism but he likely will take some significant actions based upon the science.\n\nAgain, this is wholly derived from your first logical fallacy that there's this dichotomy at all. Further, again, this is purely rhetoric - the facts we have are what Trump has put down on paper in his 100-day plan and his appointment of a known climate denier; that he will bolster fossil fuels to boost working class economy, reverse 30b in renewable spending. None of which are actions based upon the science - so again, your position here is purely a narrative you wish to convey. What you're saying is the opposite of what is happening in reality. The idea that you'd attempt to portray my stance as a religious 'belief' is break-neck asinine. \n\n*You* can continue to *believe* Trump will essentially do the opposite of what he's promised. *I'll* continue to look at the evidence and pass on fact-based claims - as a \"scientist\" surely you're familiar with the practice. ", "&gt; they will find a way blame the ~~democrats~~ minorities\n\n\n\n\n\n", "Hypotheticals aside what the hell else is she supposed to say?", "I can't wait until Trump supporters realize that his government doesnt give two shits about stopping muslim immigration and kicking out illegals. You'll get a few violent illegals deported and a couple of minor inconveniences for muslims coming here but you'll look at the numbers in 5 years and there'll be more illegals and muslims here.", "Can't forget about pulling out of the Iran deal too!", "He just offered the job of homeland security to a REAL criminal Joe Arpaio. Let that sink in for a minute, to all you moral Trump crusaders who thought Hillary was a criminal because of emails. This guy wasted 150 million of taxpayer money in Arizona so that he could go after political opponents and his agenda instead of doing his job. To all you \"conservatives\" who claim to be fiscally responsible let that one sink in too. ", "Combating climate change costs big businesses money. Buying people in Congress to deny climate change is cheaper. That's why.", "He won the fucking unions. A republican winning the unions in the wake of Reagan and 30 years of conservative policies is one of the most shocking political results in American history. \n\nClinton blew it so fucking hard in that regard. ", "10 former nuclear launch officers wrote a short [letter](https://app.box.com/s/kr72cgar4d0b5j5qpwgrhvcjme3ynr43) in October to express their horror at the thought of Trump being the commander-in-chief. Here's the entire letter (emphasis is mine):\n\n&gt; Scores of leaders and experts from both political parties have questioned whether Donald Trump has the experience temperament and judgment to have his finger on the proverbial “Red Button.” We share their concern – and we see the issue from a unique perspective.\n\n&gt; We are former nuclear launch control officers, or “missileers.” We sat nuclear alert in underground missile launch centers. It was our job to turn keys to fire nuclear-armed missiles if the president so ordered us. Once we began alert duty, we took orders from the president and no one else.\n\n&gt; Only the president can order a nuclear launch. **That order cannot be vetoed and once the missiles have been launched, they cannot be called back. The consequences of miscalculation, impulsive decision-making or poor judgment on the part of the president could be catastrophic.** \n\n&gt; The pressures the system places on that one person are staggering and require enormous composure, judgment, restraint and diplomatic skill. Donald Trump does not have these leadership qualities. On the contrary, he has shown himself time and again to be easily baited and quick to lash out, dismissive of expert consultation and ill-informed of even basic military and international affairs – including, most especially, nuclear weapons. \n\n&gt; Donald Trump should not be the nation’s commander-in-chief. He should not be entrusted with the nuclear launch codes. He should not have his finger on the button.", "&gt; *It’s important to note that votes are still being tabulated around the country*\n\nThe margin will be even bigger. She is on track to win the popular vote by 1.4 million. The most outstanding votes are from California and Washington. ", "Manufacturing has been going up in the US for 20 years while manufacturing jobs have been going down.  We haven't lost that many jobs to China we lost them to robots.  Moving a factory back from China is just going to mean more work for robots.", "Guess they should have listened to us when we called it over a year ago.", "Exactly the Trump protest blocking highways is embarrassing, they are only harming other poor Americans. I wish they'd all go to the DNC and protest them shackling the party to the worst possible candidate. Don't protest Trump winning, protest the cause. ", "So much.  So many things occurred to me after I submitted the post. But I knew that would happen - thus the ellipsis.\n\n- Deregulating - everything\n\n- Dismantling the Consumer Protection Agency  ", "Bill \"still dicking bimbos\" Clinton - also Colin Powell.", "Why is this a partisan issue??  ", "Like when they all initially denied he'd pick a guy like Pence.", "&gt; Trump is in way over his head.\n\nYes: the dilemma is that we needed a \"political outsider\" - - but Trump is a political lightweight. ", "It's usually cognitive dissonance. They are collecting food stamps now because they fell on hard times but most of the food stamps go to lazy welfare queens just trying to game the system. ", "And say what you want about the man but he was grinding hard on the campaign trail. It was impressive. ", "This \"drain the swamp\" and opposition to Washington insiders outrage it complete bullshit. All they wanted were THEIR insiders to be put back into power. It's really that simple. They won't give two shits about anyone pointing out this blatant hypocrisy. ", "No they'll blame it on Clinton for making them vote for him. I'm already seeing a lot of that. There is already a lot of buyer's remorse going on in Trump voters  ", "What frustrates me too is the message that Clinton lost because of the \"forgotten white blue collar worker\". How are they forgotten we're constantly being reminded of their existence and importance in EVERYTHING!\n\nIf a poor person of color talks about not being able to find work the response is: \"Maybe you should work harder instead of complaining and get an education so you can get a better job\" \nIf a poor white person talks about not being able to find work the response is: \"The government shouldn't have passed those trade deals. The need to roll them back or provide us with job training programs! Bring back our jobs!\"\n\nTo white workers it's the government's fault the immigrant's fault, and anyone but them... until it's someone else complaining and then you hear the \"bootstrap\" work harder and stop complaining message. ", "God damn leave the Jews alone. ", "He did but he was declared the winner (by electoral votes) while losing the popular vote. Once all votes were counted however, Obama had won.", "You mean it continues. ", "The scapegoating of Jews begins.", "Its a great swamp the best swamp.", "If republicans remove the filibuster then they remove their ability to use it when they're not in power.\n\nThey're not likely to do this. This is why democrats didn't remove it either.\n\nThe problem isn't the existence of filibusters, it's how Republicans have used it over Obama's presidency. In this case, turnabout is fair play.", "At least where I am from the blame is always on Democrats. Sometimes they specifically blame godless Democrats", "Yeah while I'm sure all the straight people telling me that I shouldn't be worried about the consequences of a GOP with total control over the entire federal government, a president who has made homophobic campaign pledges, and a notoriously homophobic VP are sincere, I'm going to remain skeptical.", "Anyone who thought Trump was anti-establishment is the stupidest fucking person.", "Confirmation bias and general ignorance/stupidity. They are dumb and unaware. There is no meddling around it.\n\nEdit: see https://en.wikipedia.org/wiki/Rational_irrationality\n\n&gt; when the costs of having erroneous beliefs are low people relax their intellectual standards and allow themselves to be more easily influenced by fallacious reasoning, cognitive biases, and emotional appeals. In other words, people do not deliberately seek to believe false things but stop putting in the intellectual effort to be open to evidence that may contradict their beliefs.", "It's almost like a man who used his charity to by a painting of himself shouldn't be president.  ", "Or admitted openly to sexual assaulting a woman. Or sexually harassing other women. Or openly gloated about his tactic of using bankruptcy to get out of business debts. Or refused to release his taxes. Or defended and promised torture. Or or, or...\n\nBut, like I said, hey, at least Crooked Hillary isn't able to help people afford college and improve health care.", "No they just want someone to at least pretend to offer a solution that sounds like it could do something.", "I'm not American I'm Canadian, but I would like to offer thanks and respect to the Americans who fought, and the ones who lost their lives fighting alongside my countrymen in the many horrible wars of the last century. \n\nLest we forget.", "Well those security experts shouldn't have been so pretentious! \n\n/s\n\n", "There was months of obvious vote manipulation on this website clearly using the super-exploitable Reddit API. This subreddit was brigaded hard. Any dissent of Clinton's campaign or the DNC (from all sides, not just the right) was crushed.\n\nI would bet my last dollar you voiced no complaints then.", "I've seen it from 800 thousand to 2 million. Anyway you put it doesn't matter simply this is not acceptable. The system is broken and its time we fix it. ", "I actually disagree. I'd love to talk about why I feel the way I do and listen to people's arguments as well since this post is probably going to the front page.", "You clearly still don't understand how dire it is and how desperate people are for change. Listen to Michael Moore talk about parents in Flint whose children have been poisoned. The status quo was literally killing people.\n\nRacism and bigotry was a subplot here. Of course there are racist elements exploiting this moment and people who were racist are still racist. Millions of people didn't suddenly become racist this year. These people are not irredeemable they just believe that the status quo is.", "Peter Thiel donated bigly to Trump and immediately got a seat at the table.\n\nHow is that for pay-to-play.", "My worry is that Trump doesn't really seem to demonstrate a willingness to listen to advisors.", "I really wish I hadn't read this. That is legitimately terrifying. ", "That's only speculation we'll never know for sure. I personally don't think Bernie would've done much better. He's far too left for most Americans", "The Trump voters who won him the election (i.e. the ones in the Rust Belt) are indeed the people who voted for Obama twice.", "You Redditors can deny it all you want but this trump effect of minority students getting bullied has been visibly undeniable this week. ", "It's hard to imagine that they will considering the Republicans control all three branches plus the court. I'm sure they'll find a way to blame Hillary's emails anyway.", "&gt; They're not likely to do this. This is why democrats didn't remove it either.\n\nThat's exactly right but I don't trust this bunch of Republicans to be so forward-thinking or fair-minded. ", "Why do I feel like none of that will matter to some people? :( I have family members who have excused all these things like it's nothing.... What's to say the American people who support him won't just do the same?  And if Trump is impeached we get Mike Pence... ", "It's a good thing CRT crew is not here anymore.  ... lol.", "Cue Trumplings calling us \"pussies\" and f words. The next Vice President supports conversion therapy aka institutional mental abuse but we're supposed to think nothing of it. ", "On one hand I'm hoping this means the administration is distancing itself from Christie Kreme and we won't have to see his sweaty angry face anymore.\n\nOn the other hand, fuck Mike Pence. Hope Trump voters enjoy their swamp. ", "The funniest part is he warned them himself. But the thing with most republicans is that they don't actually have empathy, unless they or someone they know is affected by it.", "Oh my god. That article. Wow. That is arrogance beyond belief. Wow guys the ageing president who won the exact votes you're worried trump will get who balanced the budget, won two elections, first very similar to this one, a guy who managed and dealt with and got away with a ton of scandals like the ones you're dealing with now, so much so that his nickname is 'Slick' tells you that you're focusing on the wrong places, not campaigning enough and presenting a bad image, and they dissmiss him by saying (and I quote)\n\n&gt;\"But in general, Bill Clinton’s viewpoint of fighting for the working class white voters was often dismissed with a hand wave by senior members of the team as a personal vendetta to win back the voters who elected him, from a talented but aging politician who simply refused to accept the new Democratic map. ...\"\n\n??????\n\nThat is arrogance. ", "Exactly at least Trump was willing to say there was a problem.\n\nWhat did the Democrats offer them: retraining for jobs that don't exist, more trade deals, pandering to minorities (who they hardly do squat for anyway), and lectures about privilege given by millionaires.  Should it really be a surprise that they lost the rust belt?", "&gt; The Trump supporters are right in that the swamp needs to be drained.\n\nThey absolutely are right. The only problem is that Trump is probably the least likely person in the world to actually do this.", "Well at least there is one thing you and Trump can agree on. Maybe some progress can be made!\n\nhttps://twitter.com/realDonaldTrump/status/266038556504494082", "And most of them will still vote for him in 2020. \n\nBush had an approval of 28% but 60 million of the 62 million that voted for Bush in 2004. Turned out to vote for McCain.  And they've gotten 60 million in 2012 and 2016.\n\nThey wont give a crap when his promises turns out to be a bunch of farts. Just have him rambling about muslims and immigrants and i swear you even with a recession. He will get 60 million in 2020 just as the GOP did in 2008 2012 and 2016.\n\n", "He MAY have done better. We will never know and to claim you do is foolish. We will never know the effect of Trump repeating Socialism. We will never know the effect of Trump repeating One Trillion in new Taxes. We will never know how people would perceive the meeker Sanders compared to the Strong Man Trump. \n\nWe do know that progressive causes lost this election by a greater margin than Clinton. I personally believe Sanders would have as well. It's not like he's an outsider. He's been in politics as long as Clinton and in Washington as a policy maker for far longer. Trump's most effective attack against her in the debates was that she has been there and hasn't changed anything. Same can be said for Sanders. ", "Screw that excuse. I was 25 when we invaded Iraq. It was as clear as day to me that Iraq didn't have WMDs or have anything to do with 9/11. Most people on here might be too young to remember Hans Blix the UN weapon inspector, who pleaded George Bush for more time to complete his work in Iraq. Saddam, realizing the writing on the wall, was allowing Hans Blix unfettered access anywhere in his country at the time. But Bushy had to have his war, so he ignored Blix and launched a new era of instability in the world.\n\nIt was all right there on CNN, if you took the time to watch it and connect the dots. But nobody wanted to hear anything like that at the time. **They** had to pay for 9/11, nevermind who \"they\" was. You say Bush misled the public, and I say the majority of the public *wanted* to be misled. People wanted blood.", "I tuned in to AM radio yesterday and heard a Republican talk show host say \"it's time for Democrats to start coming to terms with the choice of the American people and let Trump lead\" \n\nFuck that. I hope every Dem politician is just as obstructionist as the Republican politicians have been the past 6 years. You want to run the most divisive candidate in modern history then sit on your high horse and say Dems need to be conciliatory? Fuck you random talk show host. ", "They weren't even calling for peaceful protests. They we prepping for insurrection. And very few of them even remember it. (Some of them) are zealots at this point. They've become so conditioned to defend Trump from so many indefensible positions for so long that they have forgotten how to disagree with him about *anything*.\n\nEDIT: added a little on the top.", "Pretty sure Democrats are pissed at their representatives for not digging in and fighting for them like the Republicans do for their constituents. ", "We've only been saying it for.....8 months now!\n\nI love that Jane says whats on her mind most of the time.", "It's ironic actually. The article is supposedly about how the media has failed WHILE being failed media. The author is absolutely clueless. ", "Obama lost the popular vote in the primaries 2008 to Hillary. \n\nWhy does anyone arguing the popular vote now never bring this up? It doesn't fit their narrative. That's why. ", "LMAO They thought an openly corrupt \"billionaire\" businessman from NYC who was friends with the Clintons was gonna start a populist revolution for white trash in rural America! Bawahahaha! \n\nDONT BE SUCKERS! ", "Votes should count period. If Texas gets 51% trump and 47% hillary and 3% Johnson... they should get that percentage of electoral votes towards the candidate.\n", "He drained the swamp to make room for a garbage dump", "I wonder what they'll do when they find out that Ivanka is Jewish. Probably won't be pleased.\n\nEDIT And now the discussion has shifted to challenging Ivanka's Jewishness or treating her as a \"token Jew\". There is a bunch of anti-semitism here but I don't think its among Trump supporters.", "no worries if the donald pushes the button, he's just kidding around.  why can't you people take a joke?  lighten up!", "&gt; People don't actually want a right wing direction. The right didn't win the left lost. \n\nBut let's not forget that we gave the right wing a rubber stamp. So they can actually do whatever the fuck they want, with only the courts standing in the way. \n", "Why take a salary when he can just cut his taxes and give his family a billion dollar windfall? Good thing we didn't elect crooked Hillary right?", "Odd how they pulled a 180 after the massive walk-outs during the Democratic National Convention. Even odder that they started posting copy-paste from brand-new accounts and ones that were inactive for years started posting exclusively in /r/politcs...\n\nIt's almost like all those countless registered democrats that felt upset and were posting about it on Reddit didn't turn out to vote this year... But their opinions did change, after all. We do have President Clinton in the White House.", "Not after the system got him elected I'm sure he's fine with it now. Trump has demonstrated he has no real principles and will flip flop on anything he wants.", "Can't argue with the president.  \n(Oh god I threw up)", "But emails.", "Sorry when did we come for your guns? I am pretty sure we never did that.", "Yeah But Trump knows more than the generals. He says so himself and he has a very good brain, somebody said that about him once.\n\n/S", "If he grows that beard back it's Colbear ", "&gt;  without the electoral college everyone wouldn't have an equal say thats the point.\n\nOne person, one vote. That's as equal as it gets.", "With a coupe key exceptions- Bush for all of his faults was a man of government- he had been governor of Texas. Cheney was a neocon that loved DC politics...and knew how to manipulate everything and everyone. trump has no experience with government- NONE.\nPence is a flaming rightie with serious policy flaws and weird religous beliefs. IMO - they are both in so far over their head they will fail miserably - and the rest of the country along with it.\n\nI have a neighbor down the street from me with a Trump/Pence sign the size of some Manhattan apartments. I talked with him at the hardware store the day after the election. I asked him if was happy with the election outcome - and he said exactly this to me\n\"well my wife and I have been hoarding food and ammo for three years just in case the world goes to hell, and it might now that Trump is President. At least we will get a chance to utilize my investments...HAHAHAHAHA\". SMH.", "You know how much that means?  Absolutely nothing.\n\nThe Democrats will continue to lose until they start playing the game in reality as opposed to the one they want to be playing.", "I like to follow my adversaries so I've heard him talk a lot. In doing so over the years it's extremely apparent that his radio/tv persona is an intentionally exaggerated, sensationalist act. If you recall, Colbert cited Beck calling HIMSELF a \"rodeo clown\".\n\nOutside of that persona, he's actually a surprisingly smart, rational, calm person.", "In 2020 he won't be able to run on a platform of \"point at everything and say it's a disaster.\" He will actually have to defend tangible decisions that he has made, tangible bills that he has signed, tangible policies that he has enacted. He will have to own the state of the country.\n\nProgressives will be fired up like never before. You think 2008 was a revolution? Imagine how screamingly pissed we'll be to kick out the fascist idiot. Hopefully we start in 2018, and hopefully we pick someone legitimately inspirational to a coalition that extends beyond middle-aged center-left suburban white women.\n\nBy 2020, it will be clear exactly what \"great again\" always meant, and he will have to own the results. I think it's unlikely he runs again, anyway. There's no way he ends up actually enjoying the crushing drudgery of actually *being* President.\n\nThen again? We've been constantly wrong this far. So who the hell knows.", "Trump said he was going to appoint people we've never heard of who are better than all the people we've heard of.  Yeah ok..", "But Trump held up a rainbow flag and promised to protect you from those evil muslims!!", "\"Find that terrible actor that played me in the campaign ads and sue him!\"\n\n\"That's...that's you Mr. Trump.\"", "I agree with 2012 Trump the electoral college is trash and ruins our country. ", "This was a big part of what he and Obama discussed in the oval office. Guarantee it. ", "Imagine voting for a well known con man and being shocked that he lied to you.", "Just hope climate change gets included in that.", "Holy hell we're going on a flipflop extravaganza for the next 3 months! /s", "But they are not shocked. They are cheering it. They are THAT stupid.", "and Pence will be one of the only evolution denying leaders. \n\nGood times!", "HAHAHAHAHAHAHAHAHAHAHA.....my god this is gold.", "Don't worry. Trump supporters have had a year long training in mental kung-fu. They are now all black belts in bending anything to fit the narrative. ", "Big surprise!  The man who had to resign as Speaker of the House in disgrace because he was committing adultery while screaming Family Values and trying to impeach Bill Clinton is a hypocrite.", "Newt fucking Gingrich and Rudy fucking Giuliani?\n\nfml", "Christ.  Wouldn't that be the biggest fucking irony in political history.  The Dems band together to save Trump from the GOP!  Who the fuck is writing this utter bullshit lmao.", "This administration is literally filled with crazy people. If you were writing a political satire this is the cabinet you would envision:\n\n* Chief of Staff: White Supremacist Propagandist Steve Bannon\n* Department of Education: Young Earth Creationist Ben Carson\n* Attorney General: Militant Rage Boner Rudy Giuliani\n* Environmental Protection Agency: Climate Change Denier\n\nIt's the stuff of nightmares. How we survive this, I don't know...\n", "If you're pointing a finger at any individual thing you're missing the point. It's EVERYONE playing into this. The media the activists on the left and the right, everyone.\n\nThe strategy isn't about any one cause, it's about fomenting a breakdown in the norms of discourse that allow various elements of society to negotiate their differences peaceably and constructively. \n\nWhen you say \"Fox News is doing this!\" or \"BLM is doing this!\" you're not necessarily wrong, but you're also not helping. Ironically, you are making the problem worse. Quite the double-bind we've got ourselves in huh?", "\"To make America great again I thought I had to drain the swamp. I had planned on running a white/red office only, but some very smart people are telling me that in order to cast the spells we need, we're going to need black mana. Where else are you gonna get black mana? You try getting black mana from a drained swamp, it'll be a disaster, believe me. And we can't do it all, folks. Have you tried fitting more than 5 cards into your hand at a time? It's impossible!\"", "Yay establishment... FOR MORE YEARS!  FOR MORE YEARS!  (not a typo)", "No no no. You've got it all wrong! The trump supporters are tired of \"pay for play\" Clinton! ", "Almost all his cabinet picks have been covered in the news alongside trump. They've all supported trump. It's classic favor for favor.", "4D Chess. Dow Jones Pinball.", "the funny thing is Trump supporters are already saying \"Well yeah that is totally what we expected him to do!\"\n\nSeriously 50% of the country is THAT stupid.", "Everyone else is scared by the thought of a Pence administration.   So if it gets to that point, the democrats may be the ones fighting in his corner.   ", "Newt Gingrich is the perfect fit for Trump considering he's a whiny baby who shutdown congress because Clinton slighted him on AF1", "Did I misread this? He says nothing of the sort the only thing it actually cites is -\n\n&gt; After the meeting at the White House, Mr Trump said that he and Mr Obama had discussed \"some of the difficulties\" the country faced but also \"some of the really great things that have been achieved\". Some took that latter remark as a reference to Obamacare and perhaps other policies, and a potential suggestion that Mr Trump may be won around on what has become one of Barack Obama's flagship policies but also one hated by much of the Republican party.\n\nThis article seems like pure bullshit.\n", "You guys who have been claiming that \"SJW\" talk is doublespeak: *this* is actually doublespeak.", "\"2016: This was only the beginning of the weird.\"", "Hi Shoden - he talked about Obamacare specifically in an interview reported in the Wall Street Journal\n\nhttp://www.wsj.com/articles/donald-trump-willing-to-keep-parts-of-health-law-1478895339", "But both candidates were totally the same....", "Seriously fuck anyone who said Hillary was too corrupt so they'd vote for Trump.", "Pretty much this. I was stuck on a bus for over thirty minutes yesterday trying to get home from work (ended up getting off the bus and taking an Uber) because protestors blocked traffic and prevented people getting on the freeway.\n\nIt's their right to protest and all but the entire time all I could think is, \"You're protesting a democratically elected president. Where the FUCK was all this passion and outrage when the DNC was jobbing Bernie Sanders?\"", "Them Southerners bought themselves some snake oil from a doggone carpet baggin' yankee!!", "Well first off America simply isn't as liberal as people here think it is. If it was, how did Trump even beat Hillary? There was a ballot measure in Colorado (a fairly young, liberal state mind you) that literally allowed people to vote whether they wanted a universal health care system like the one for which Bernie advocates. It lost 79-21. *California* rejected a death penalty ban. The country just is not ripe for a left-wing movement, as much as r/politics would like it to be.\n\nBernie had good favorability ratings, sure, but those were before literally any attacks on him. Hillary took a huge early delegate lead and didn't want to alienate too far Bernie or his supporters. Republicans wanted to compliment Bernie so he'd be a bigger challenge to Hillary and create a fractured left. No one had a reason to attack Bernie. \n\nOnce he got the nomination all hell would've broken loose. His Soviet flag his mayor's office. His honeymoon in the Soviet Union. His consistent praise of the Castros (which would've played *real* well with Cubans in the swing state of Florida, I'm sure.) His visits with left-wing dictators in South America. Subtle attacks on his lack of (at bare minimum, Christian) faith. Republicans have long sought to blur the line between democratic socialism and communism. Bernie would do a lot of that for them. They would've united better against him than even Hillary Clinton.\n\nNever forget that the Internet is not real life. The two types of people Americans say they would least likely elect President are athiests and socialists ([source](http://www.gallup.com/poll/183713/socialist-presidential-candidates-least-appealing.aspx)) Bernie openly admits he's one and is pretty easily characterized as the other. \n\nBernie is a nice guy, but he's  pretty easily caricatured. Republicans would've driven him into the ground immediately. Moderates (many of whom did break for Hillary, by the way) would've been very skittish to vote for a guy openly advocating for a revolution. Plus Trump's overwhelmingly personality honestly could've overpowered Bernie in debates. Remember: Hillary beat Trump in all three debates and still lost. Could Bernie have done the same? I doubt it.\n\nPerhaps the biggest concern with Bernie would be turning out black voters. Even Hillary Clinton, the wife of \"the first black President\" couldn't get the African American turnout Obama did. Bernie got absolutely slaughtered in the primaries among African Americans. That's indisputable, and I don't think blaming the DNC can explain that one away. How does he get them to turnout? Maybe he could make better inroads with rural whites in states like Michigan, Wisconsin, and Pennsylvania (which I would question, considering their likely aversion to a socialist candidate), but those gains would be wiped out and then some by lower African American turnout in Detroit, the Twin Cities, and Philadelphia. If a Democrat doesn't turn out African Americans, they lose. I think that would be a major major struggle for Sanders.\n\nEdit: Taxes would be a huge problem for Sanders, especially given his background as a career politician. Imagine the speeches from Trump: \"Crazy Bernie [an epithet that would slowly morph into Commie Bernie, I'm sure] wants to hike taxes for everyone! Maybe if he had ever had a real job instead of spending 30 years doing nothing in Washington, he'd understand why the AMERICAN PEOPLE can't handle MORE taxes.\"\n\nI'll add more as I think of them, this is off the top of my head.\n\nEdit (Again, I've fixed a lot of grammar and whatnot): Lots of people saying \"well my friends loved Bernie but didn't like Hillary.\" I get that, but those are the people who could very well be persuaded against Bernie with time. People's opinion of politicians really do change; they're not static. I live in Indiana and Evan Bayh went from a literal 20 point lead with great favorability ratings to a 10 point loss with negative favorability in like 4 months. And Bayh was a known quantity: a former governor and Senator of Indiana. A relatively unknown Sanders could be defined even more easily by the Republican machine.", "With Secretaury of Education Ben Carson and 2/3 Republican Governors? I doubt it.", "So wait... the guy heading up the EPA wants funding so that he can use it to convince people that the environment doesn't need protection?", "February 2017\n\nDear diary,  \nIt all went downhill so fast, I'm still not even sure what happened", "Most Americans believe climate change is real.  So he may struggle with this issue especially if we get a few hurricanes during his term.", "This is what I've been saying - the 'old' manufacturing jobs are never coming back. \n\nThere will likely be a new generation of American manufacturing but it will require a different skillset and education which will leave most of his blue-collar supporters out in the cold. It won't employ the masses. ", "That's the worst part. Most of the Republicans I respect were against his candidacy so now we're getting all of the loons like Palin and Ghouliani and Carson that stuck with him. ", "Yeah I thought that George Washingtons seemed a little light until I realized that it was years of service *to the United States* prior to becoming president. Really his number should be closer to 30 if you include service to British colonies that would become the US", "He also thinks giving women the right to vote might have been a mistake. Thiel is batshit insane.", "With a climate change denying Congress to pass fossil fuel friendly laws. what could go wrong...", "Gingrich is my second most despised after McConnell.  I thought I'd never have to look at Gingrich ever again, that fucker.", "Barely though. It is like 52%.", "similar to that: a large section of Hispanic-Americans voted for Trump too. it turns out that they're also not offended by the whole \"deport illegals\" thing. that's actually what they want. all the hispanics who took the difficult expensive legal route into the US feel that illegal hispanic immigrants give the legal ones a bad rap.", "Thanks Trump supporters. You've fucked us all. Another big round of thanks to those who thought both the  candidates were equally bad. ", "Kids are being taught climate change now at every pass. That number will continue to grow as the boomers drop off. ", "Hey don't be condescending! It's okay to call Mexican rapists and to call for Muslims to be put on a registry but saying the white working class is ignorant is SO MEAN AND HURTFUL. ", "I'd say malaria is polling slightly ahead of Hillary right about now.", "So he wants money to spread false propaganda about why climate change isn't happening?\n\nCool. Good job America.", "No you misheard them, they said they were tired of \"GAY for pay\". Why should they have to pay for it?!", "Zero public service experience. Baffling.", "they do this all the time. \n\nRepublicans run on a campaign of \"government doesn't work\".  Then they get elected and fuck up the government.  And when the democrats run against them in 4 years they will pass it off as \"both sides are the same\".  \n\nmakes me sick.", "I haven't seen any. They keep calling me a baby and saying that my \"fee fees\" are getting hurt when all I am saying is goddam we ded. ", "Trump still wearing flip flops in November. ", "Wow. I'm ok with this. Its annoying Congress refused to work out of spite towards the President but if they will actually do the job of adjusting and checking insurance/pharma then thats ok with me", "Why not? Obama threw out 2.5 million illegals and he was a Democrat. Now imagine our President-elect who's been running his entire campaign on deporting illegals that number needs to be yuuuuuge.", "It's amazing that this is actually the emerging narrative.", "I think the very first president gets a little bit of a pass. Like you said he can't have been in service to a country that didn't yet exist. Yet, his leadership and military experience were undeniable.\n\nHe also didn't really want the presidency. He wanted to go back to his farm if I recall my history correctly.", "Population growth makes this a somewhat less impressive statistic. \n\n There are 40 million more people now than there were in 2000.", "What will be the best about all this is if he goes back on enough to cause his voters to lose their minds.", "They spent years and millions trying to find the corruption of Hillary Clinton. ", "Bring up ANYTHING suggesting that Trump's win has caused fear or uncertainty in people and you get \"sore loser\" and \"safe space DERP\" memes.  Show any minority group that has experienced hateful rhetoric from emboldened Trump supporters and you'll get a spuriously sourced (and frequently debunked) story of a Trump supporter being attacked.  All protests of Trump become \"organized rioters orchestrated by professional agitators.\"  \n\nIt's the most hopeless I've ever been for my country.", "25k goes a long way eh", "Now if only Trump supporters would acknowledge that pro-Trump violence exists and not everything has to be a false flag", "So telling. I ask these guys to say \"The KKK is bad\" and I get tons of arguments about how unfair I am for reducing their support to the issue of race.\n\nYou offer literally an open forum to discuss any of Trump's plans besides racism...and you get crickets.", "&gt;Clinton brought it up unwarranted during every single debate.\n\nYea but her emails and I don't trust her and she doesn't *excite* me enough to vote for her.", "How many Republicans blamed Obama for Katrina again? They'll find a way to say this is all the fault of Obama and the Democrats. I want to hope that people won't buy it but hope and faith in the voting public seems to be in short supply these days.", "I hope Stein voters in Michigan Wisconsin, and Pennsylvania are fucking happy with their decisions.  ", "Putin is also a climate denier. Or at least he was up until recent Paris talks. Even then he only admitted climate change was a threat. Russia's commitments to international climate action remains laughably insignificant. ", "Lol at these three comments. \"Russia is trying to exploit divisions\"\n \n\"Yea and these guys are helping them\"\n\n\"No it's these guys\"\n\n\"Nuh uhh it's these activist groups\" \n\nJesus the war's out there man out there!", "I've sent handwritten letters to the DNC my DSC, and my Senator, Cory Booker.\n\nOur representatives *do* act when they hear from us. They do almost every time we speak out to them in masses (Net Neutrality, anybody?). We just have to take the 5, 10, 15 minutes to do it. \n\n\nEdit: For anybody curious, I told Senator Booker that he could very well be on a Presidential ticket one day if he takes advantage of this moment to shift to a truly progressive agenda. I hope he takes my suggestion.", "And it shows an important message from our Founding Fathers: don't speak about shit you are completely ignorant about.\n\nI cannot tell you all the shit people have told me the Quran says.\n\nI fucking read it this year and it is surprisingly benign. The Old Testament is worse.", "Yea anybody who is willing to prevent a nuclear war even if it means treason(i think?) should probably go down in history as a hero.", "look how shocked I am.\nhttp://i1.kym-cdn.com/photos/images/newsfeed/000/873/492/df8.gif", "It is pretty fucking obvious to everyone that he didn't know what the ACA was until yesterday when he met with Obama. \"Oh gee that sounds kinda okay actually\"", "&gt; Ben Carson Rudy Guliani, Chris Christie, Sarah Palin, and Newt Gingrich.\n\nWay to stick it to the man!", "\"But... emails! And... you shouldn't have called us bigots for voting for a bigot! This is *your fault!* :(\"", "Is this fucking true? \n\nArpaio? The guy who's literally running the closest thing possible to death camps in modern Americam", "I have a hard on for Pence at this point.  He's a nutjob on homosexuality and apparently doesn't think the science on cigerettes and cancer is settled but I'd put the probability of a nuclear strike during his 4 years at pretty close to zero. \n\n**This is the most important thing** and the real risk of a Trump presidency.  He's ambiguous about what countries we'll actually defend from invasion, has talked casually about defecting on internationally treaties and doesn't give any impression that he understands the implications of this (this is type of stuff that caused WWI and WWII).  Former Republican foreign policy advisors are so horrified by this they flocked to Hillary Clinton.  There is no precedent for that and they understand the implications better than anyone.  Seriously this isn't funny anymore.\n\nPaul Ryan looked like he had seen a ghost on Wednesday.  Sure it's all shits and giggles when no one thinks he's gonna win but we're in the rehelm of real civilizations consequences now.  I sincerely hope he and his fellow Republicans are as terrified as I am and are working as we speak to put together a plan to get him out within days of taking office.\n\nHis favor ability ratings are lower than most congressmen in their district and Republicans in general outperformed him in the down ballot.  His core supporters are probably less than 20% of the electorate.  Most people who voted for him held their nose while doing so and he still couldn't get a majority in the general election.  There is no reason to be afraid to do this and it's terrifying to consider not doing it.", "Clinton was polling better than Trump as well. She was given like a 90% of victory by these same polls so it is impossible to tell. ", "So this asshat is going to try to fight against overwhelming evidence? Good luck \n\nHe has absolutely no qualifications to speak on any science  let alone climate science, since he studied philosophy and political theory ", "&gt;Paris Climate Change Accord demolished...\n\nThe Red states will be the first to go from a changing climate. It's poetic justice.", "It's not about the degree of Liberalness it's about the connection to voters. Sanders and Trump appealed to the same types of voters: middle-class/low-income average citizens who were fed up with establishment politics and corporate greed. Hillary was immensely un-inspirational, the less-charismatic and less-successful version of Obama trying to follow Obama's 8-year presidency that people were already tired of.\n\nSanders had no investigations on him, no decades of republican grudges, NO establishment ties, no Wall Street influences; he spoke the same message as Trump (but from a liberal perspective), appealed to the same people, and was inspirational. \n\nHe wasn't bulletproof, you could certainly sling mud at him, but honestly -- the Russia \"connections\"? Trump had those too. The Castro comments? Easily explained everywhere except Florida which Clinton lost anyway. \n\nThis election wasn't about winning debates, it wasn't about experience, it wasn't about thorough policy - it was about smashing the establishment and forcing the elite to realize the middleclass still existed; it was about demanding a voice - and both Bernie and Trump fit that perfectly, while Clinton did not.\n\nSanders would have had every Clinton voter, and he also would've retained all the voters who abandoned ship when Clinton got the Nom. He would've pulled more independents and he actually would have inspired people to be excited about voting for him. There wouldn't be any last-minute FBI interference or month-long Wikileak assault. He would've performed significantly better than Clinton in the rust belt. \n\nWould he have beaten Trump? I dunno. But would he have performed better than Clinton? I believe the answer is a resounding yes.", "Wow the two biggest points of Obamacare are being kept everyone knew the rest of it needed work", "You're fine with Chris Christie(Bridgegate) Sarah Pain(actual idiot and crazy person), and Newt Gingrich(went after Bill Clinton for cheating at the same time cheating on his own wife who was dying from cancer).\n\nedit:Looks like Christie [just got fired too.](http://www.cnbc.com/2016/11/11/vp-elect-mike-pence-to-take-over-trump-transition-team-from-chris-christie-nyt.html)", "Is that terrifying? I hope they do say no.", "Like a liquor salesman heading an AA meeting.", "Then why was he polling better vs. Trump?  He had the same enthusiasm numbers that Obama had in 08.  Clinton did worse than Romney 2012.  That is the effect of enthusiasm.  Sanders had it Clinton did not, and the DNC prioritized winning a primary over winning a GE.", "Lmao. I thought that was a joke but wasn't sure. Looked it up and he actually said it.", "I always thought that Michael Moore was a pretty perceptive and intelligent person...\n", "Oh the next four years are going to be GLORIOUS.  I can already smell the corruption wafting in like a freshly baking apple pie.  Oh my god, this is going to be absolutely Nixonian.", "The only job he applied to was president ", "Political novice. ", "&gt;Clinton was polling better than Trump as well.  \n\nOnly barely and even then the results were mixed.  Sanders was polling with double digits gaps against every single national poll taken.  Clinton's victory scenario from these polls relied on likely outcome models which are obviously not reliable and are in need of an overhaul.  Sanders was the better candidate.  His campaign had enthusiasm, his voters were incredibly involved, and his popularity was broad.  Clinton's favorability ratings alone showed how likely her campaign was to fail, and her voter turnout was a direct result.  ", "They spent decades running a propaganda campaign against the Clintons.", "There were plenty of articles and interviews over the last four years with Tea Party/conservative types quite clearly expressing disappointment in the Obama administration for refusing to prosecute the banks.\n\nIt was all ignored and drowned out by simply calling them racist.", "Without appealing to how bad Clinton is they have nothing.  Trump and the alt-right exist solely in opposition to things not for things.  They hate PC college students and know they don't want to be leftists because of that, but have no real politics of their own beyond this reaction.  The few that actually do articulate their beliefs, like Peter Thiel, offer horrifying visions of society.\n\nOver the next 4 years they'll realize they've been conned.  Maybe not Trump's nazi pepe online army, but real people.", "Repeat a lie often enough and it becomes truth in people's minds. Even \"progressives\" couldn't stop talking about the corruption of Clinton. Watching Bernie flounder during the debate to back up his insinuation that Clinton was corrupt was pure gold but his followers believed it and it lost her the election. \n\nFuck this post factual world. ", "Ya nothing has changed at all regarding populist beliefs since those guys lost /s. \n\nYour applying 3 decade old thinking 5o a modern election. That is the mistake a lot of people have made in the last year. ", "Which is pretty much the public reaction when they become informed on the subject.", "I'm happy to see this and people owning up to the mistakes that have been made.", "&gt; Would these same people be in favor of taking professional doctors out of hospitals\n\nWell some people already think they know better than doctors and medical scientists. See: The anti-vaccination movement.", "Guys calm down for a moment.\n\nRemember, Trump always says/does exactly what the *last person he spoke to tells him*. So yeah, this was Obama's effect, but it will only be what he says until the next conversation that he has with Pence, Ryan, and McConnell, whereupon he will be right back on the other foot.\n\nRemember the immigration \"softening\" that he told his Hispanic advisors about, right before a fiery speech of the \"deport 'em all\" variety?\n\nHe has few actual convictions or principles that go beyond self-love, and certainly no idea how to legislate. He's about to become President without ever once having to go on the record by making an actual, undeniable policy decision.\n\nThis is pretty meaningless, I'm afraid. It's just Trump trying to be on both sides of every issue for as long as he possibly can, until he finally has to actually *do* something.\n\nThe most that it really suggests is that he'll end up as a puppet of the people who are talking to him the most -- the people around him.\n\nI'd love to be wrong, but that would be in line with the pattern we've seen so far.", "All he actually said was: I will take a look at Obama's recommendations out of respect for him. This headline is super click bait. ", "Great so we just elected a Markov chain as president. Now we have to perform a daily ablution of Trump's brain just to be sure he doesn't do something too stupid.", "Next headline: Trump calls for Single Payer option.\n\nOne can dream right?", "I noticed during the meeting with Obama he looked slightly shell shocked. Left me wondering if that's why he kept saying Obama was a good man. Like maybe he found out some of the biggest secrets/threats and is like well crap maybe you are a good president", "Just do nothing but call it Trumpcare and a quarter of Americans won't know the difference.", "That's what the original WSJ article claimed.", "This is one of the reasons that I have some hope for this presidency. He has the power to bring these people back to reason without them even knowing it. Like an orange Pied Piper.", "I've said this in other threads but I'm really wondering if we'll have an \"Only Nixon could go to China\" situation with Trump/Republicans and single payer/public option to \"fix\" the ACA.\n\nedit: make a throwaway comment on a thread 3 pages deep before going to class and come back to this geez", "Secretary of Being The President.\n\nI'd be down with that.", "Even if they didn't discuss it I don't believe for a second that the GOP would have really just repealed it. It's really easy to vote to repeal it dozens of times when you know that the president would never sign it. To actually repeal it and leaves tens of millions of people without health insurance? Not gonna happen. And although Obamacare is flawed, the main tenets of it--the mandate, coverage for pre-existing conditions--you really have to keep unless you're just going to join the rest of the civilized world and go single payer. So whatever they \"replaced\" it with would look pretty damn similar to what we have now. Better to just try to work on it and fix the problems. \n\nOf course this line of reasoning implies that the GOP is just a tiny bit sensible and practical. So who the fuck knows.", "The line about \"the media takes Trump literally but not seriously his supporters take him seriously but not literally\" comes to mind.\n\nThis is just *swell.* We elected a person who is a total motormouth President, and we will never have a fucking clue whether he actually means any individual sweeping, superlative-laden pronouncement he makes.", "Look at the rising post about his choice for the head of the EPA a staunch climate change denier is in charge of our environment.  \n\nI hope you didn't plan on having children. ", "Trump met with Obama a couple of days ago. Trump's team has hinted that he tends to repeat the words of the last person he talked to:\n\nhttp://www.vox.com/2016/8/29/12691276/trump-believe-flop-flop\n\nHow insane would be if Obama got a place in his cabinet?", "Probably no deal Obama probably just sat him down and explained a tiny bit of how things actually work.", "Literally says he's considering keeping the best parts of the ACA and fixing the broken parts. Nothing wrong with that to me.", "&gt; It's gonna be great browsing /r/The_Donald throughout all these flipflops.\n\nthe_donald is more about simply hating the left they don't care what he does. \n\n", "Like a matador waving a Confederate flag.", "\"So here's the deal Donny the people on Obamacare with diabetes and other diseases that would prevent them from getting insurance in the past.... they're all in middle and rural america.\"", "I've been standing really close to the microwave and hoping for kids with gills.", "They will chip away at it and purposefully make it far worse, and fail \"naturally\".  They'd come away looking like it wasn't their fault.\n", "As a non-American this is the only thing I care about. Please Trump, don't fucking back out of the Paris Agreement. Too much is on the line. We don't have the time for a setback of at least a decade..", "Trump wanted to repeal \"all of it\" and Clinton wanted to fix the problematic parts. Trump now is adopting Clinton's approach. ", "Like when trump got his base cheering for LGBT rights at the convention and cheering for Hillary in his concession speech...a bit of twilight zone here.", "Obama supreme court. Holy fuck I would lose my shit. ", "i think a lot of them were depending on it.  like 'fuck no not hillary but please donald don't go full republican'", "It's Trump. Tomorrows news may come out that he is considering gore to lead the EPA only to eventually choose David Duke before firing him and declaring he will do it himself. ", "I'd be surprised if he completely flips but if a Trump supporter did any research(which they obviously don't) they'd know how left wing he really used to be \n", "~ OK Mr. President-Elect, over the past several weeks we've worked out all the steps necessary for us to dismantle the ACA.   (drops four-inch thick binder on his desk) Shall we walk through it?  \n~ (tentatively opens cover of binder) OK, um, let me ask you first, if we *don't* dismantle Obamacare, we don't have to do *any* this, right?  \n~ Well, no.  \n~ Well, tell you what, (closes binder, adds it to a pile of other thick binders) let me take some time, look through it, and I'll get back to you. Y'know, make some notes and stuff.   \n~ Um, OK. No problem sir.  \n~ Close the door behind you please. (door closes. Trump's head drops onto the desk) Oh, jeezzzz...", "&gt;Climate change is both a science and it is also a religious catechism a creed if you will. Scientists do not take climate change on faith, but many people are either \"believers\" or are \"deniers\". Anyone who describes someone as a \"denier\" is in my experience likely a \"believer\". You used this word and I apologize if you are not.\n\nI wholly disagree - don't just extrapolate this whole thing because I used the word \"denier.\" The problem is beliefs are irrelevant when facing *empirical evidence*. In most topics, it IS true that the antithesis of a \"denier\" is often a \"believer,\" but NOT when discussing science. Though, you've made an interesting point on what the liberal rhetoric of \"climate deniers from the right\" does to damage discussion. \n\n&gt;Climate Change is for many a religious end of the world prophesy where the sinners are cast into fire for their sins.\n\nHow sad, don't you think? Many times over, across many different civilizations, across many different centuries, people have sad similar things and paid greatly for it. Of course, prior to industrialization, the topic wasn't something as abstract as climate change.\n\nFrom Gallup:\n\n&gt;Results for this Gallup poll are based on telephone interviews conducted March 6-9, 2014, with a random sample of 1,048 adults, aged 18 and older, living in all 50 U.S. states and the District of Columbia.\n\nOh, please. I shouldn't even have to say how flimsy this is. \n\n&gt;Obama leaves office with about two thirds of Americans disinterested in climate change. Why isn't this a failure of the Obama Administration?\n\nStatistics aside, based on your cited article then American interest has been hovering around 30% +/-10% since 2000. It appears, then, Obama is exactly on par for \"getting Americans interested.\" That said - 'failure' is probably a strong word, maybe because it's an impossible task to unify a populace whose citizenry also contains swaths of the uneducated and the old. \n\n&gt;No one can do much before the People are persuaded.\n\nNot so. As I've said a few times before, even with what you're citing as a failure in support from the people - Obama was able to pass 30bil in green spending, oversee and approve the Paris Agreement, and pushing MATS (Mercury and Air Toxics Standards) through the EPA (the EPA who is now headed by someone who says climate change is a hoax), and enacting the Green Power Plan via the EPA (again, now headed by a climate change denier). \n\nFor your review:\nhttps://www.epa.gov/mats/basic-information-about-mercury-and-air-toxics-standards\n\nhttp://unfccc.int/paris_agreement/items/9485.php\n\nhttps://www.epa.gov/cleanpowerplan/clean-power-plan-existing-power-plants\n\nThis is me spending *just a few moments* quickly gathering evidence for what Obama DID accomplish, regardless of whether or not you say he did anything. You can disagree with the content and insist there are better avenues, but to suggest Obama hasn't done anything is ignorant of the facts. \n\n\n", "Knowing him he might just do that just to get the \"Trump\" name enshrined in history forever. Tweak a little things around and change the name. Take credit for what Obama did.", "He's so malleable he'll completely turn from an 18 month campaign promise from an hour discussion with Obama. I don't know if that's a promising or utterly scary prospect for the next 4 years. Who he ends up being surrounded by and therefore who has his ear will be very telling. \n\n**Edit:** Turns out this is just a clickbait title. Trump never actually said he won't repeal Obamacare. As others have said Trump, as with every other Republican, have never wanted to get rid of certain items like denial of coverage based on pre-existing conditions. It's political suicide to do so. \n\nThat said, I still believe Trump is a blank slate... a \"useful idiot\" to whomever has his ear the moment. Right now it's the establishment Republicans and lobbyists clamoring to take ahold of the new President. ", "&gt;##**He deflected a question on whether he would follow up on a campaign vow to appoint a special prosecutor to investigate his election opponent Democratic nominee Hillary Clinton**, over her use of a private email server while secretary of state: “**It’s not something I’ve given a lot of thought**, because I want to solve health care, jobs, border control, tax reform.”\n\nThis is just as big a quote as the Obamacare one.", "\"Look Donald I wanted to do this and this and it would have worked and driven down costs but it got blocked. Why don't you take it, amend it with those \"revisions\" and claim that as yours?\"\n\nTrump \"Fucking brilliant\"", "I wouldn't be at all surprised if Trump never really knew even the cursory details of the ACA until the last few days.  This guy is a know nothing.  His cabinet appointments show it.", "The irony is everyone saw it coming except Trump supporters who drank that sweet kool-aid.", "Yeah. The ACA being repealed will effect me immediately. (The Medicaid expansion is the only reason I was able to go back to school.)\n\nWithdrawing from the Paris Accords and a climate change denier as head of the EPA is civilization-ending stuff. :(", "He also got run out of congress for running a [fake charity for political contribution money laundering/tax evasion](http://www.motherjones.com/politics/2011/12/gingrich-congressional-ethics-scandal-explained-newt-inc).", "Boy good thing we don't have that corrupt Hillary in charge then. /s", "So is he just draining the swamp straight into the White House?\n\nYou picked a real winner, Trumpettes. ", "There is no Obamacare.  There never was Obamacare.  There is only Trumpcare.", "That hive of shit doesn't give a damn what he does. ", "Republicans right now.\n\n&gt;\"\"You want to know the saddest thing I ever saw?\n\n&gt;When I was a boy my brother and I wanted a dog, so our father took in an old greyhound. You've never seen a greyhound, have you, Bill? ...A greyhound is a racing dog. Spends its life running in circles, chasing a bit of felt made up like a rabbit.\n\n&gt;One day, we took it to the park. Our dad had warned us how fast that dog was, but... we couldn't resist. So, my brother took off the leash, and in that instant, the dog spotted a cat. I imagine it must have looked just like that piece of felt. \n\n&gt;He ran. Never saw a thing as beautiful as that old dog... running. Until, at last, he finally caught it. And to the horror of everyone, he killed that little cat. Tore it to pieces. Then he just sat there, confused. That dog had spent its whole life trying to catch that... thing. Now it had no idea what to do.\"\"\n\n", "It's going to be the \"Pence and Putin Puppet Show\" with Trump.", "It's gonna be great browsing /r/The_Donald throughout all these flipflops.", "I don't mind this flipflopping in fact, I hope there's gonna be much more.", "Yep yep yep. \n\nCongressional Republicans are sitting pretty right now: they can let Trump barge ahead and do things that they all want but don't want to do because of the political repercussions (e.g. kick millions off of their insurance) wait for his approval ratings to go toxic (I expect low 20s within a year), and then cut him the fuck loose by starting a slow but steady leak of information about this investigation or that one. Wait for him to reach peak toxicity, allow the calls for impeachment to build, and then impeach him, insert their boy Pence in his place, and act like they were supremely patriotic by impeaching one of their own party. \n\nTrump is already on an island like no president in my lifetime.\n\nEdit: I think we'll get a very good idea of Trump's survival instincts very quickly. His infrastructure proposal is the one element of his 100 day plan that would have widespread popular support, but Congressional Republicans oppose it. By making it his first priority, he could drive up his approval ratings, soften Dem opposition, establish his independent credentials, and put the Repubs in a tight spot politically. In contrast, if he goes whole hog after something that is going to end up being deeply unpopular - eg gutting Obamacare, privatizing parks, etc. - he'll weaken himself, and he's going to find that the Congressional Repubs won't be there to help him up from the mat. ", "I would not be surprised if that happens on some issues. \n\nI'm mostly concerned about all the others.", "Trump supporters will be tying their brains in knots going from \"Obamacare sucks!\" to \"Obamacare is pretty great!\" in one fucking day.", "Honestly if it takes doublethink to get single payer I'm doubleplus on board.", "He's a very bad person and for the sake of the country shouldn't be allowed anywhere near the levers of power.  He's an instigator who enjoys causing tumult.", "haha there are no doctors in waterthunderdomeworld.", "https://media.giphy.com/media/7yTqXVALy7Fwk/giphy.gif", "Most people do. When you take the president's name out of it most people support it. I think he was only half joking when he offered to let Republicans change the name to \"Reagancare\" if that would help their members accept it.", "Still not real clear how putting a Speaker of the House - who resigned in disgrace almost twenty years ago after eighty-four ethics charges were filed against him - in the cabinet is draining the swamp.", "Ballsy move. Gotta hope at this point that this transition team is just for show. ", "Let's not forget it was an illegal donation.", "&gt; not the evil guy that everyone makes him out to be\n\nThe dude admitted to sexually assaulting women and then bragged about it. He also wholeheartedly supported murdering civilians in the Middle East. He made himself out to be evil.\n", "\"Have I mentioned what a nice piece of ass Ivanka is?\"", "&gt; Deregulating - everything\n\nMe and a Trump voter just today: \n\nTV: \"I like a lot of his ideas.  The deregulation that will be good, and bring back jobs to this country.\"\n\nMe: \"Deregulation of banking is what led to the 2008 collapse.  Both democrats and republicans were to blame for that.\"\n\nTV: shrugs\n", "\"Sick people can't golf at one of your resorts\"", "This tweak and rename is exactly what the head of California's market proposed on NPR 60-minutes ago", "I say a flip flop, the flippy, to the flip flip flop and you don't stop ", "\"But if I can't make money off of them why should I care?\"", "Next hour \"I'm going to repeal the disastrous Obamacare my first day, folks!\"", "Better hope they don't get any malignancies or chronic illnesses because it will be a fortune to pay for their treatments...", "As they say Trump supporters take him seriously but not literally.  Trump detractors take him literally but not seriously.  ", "I love it! The next 4 years are going to be nonstop entertainment. He found out that repealing Obamacare without a replacement will fuck over millions with preexisting conditions. ", "Anti establishment in the house!!!! This is how you battle a corrupt government!!!!", "Not only does Trump deny climate change he also doesn't like alternate and renewable energy", "Trump is Schrodinger's candidate. He simultaneously supports one position while opposing it as well. You'll only know what he's going to do once you observe it.", "I think most of the republicans are afraid of having to actually repeal the ACA. They don't have an alternative that wouldn't be a disaster. They love scoring points with their side by threatening it but like a lot of things, they don't want to own the results of the policies they advocate. That may limit the damage they do the next few years slightly.", "Raper's Delight ", "The liberal elite east coast, wall Street hating Republicans just nominated a Manhattan billionaire, along with a wealthy new jersey man, and maybe an AG from new York as well in Giuliani. \n\nI cannot even begin to piece together the irony. Trump is the fucking epitome of everything they hate about liberal elitism, except he also dislikes minorities so that makes him a Republican. ", "I wonder what kind of deal Obama could have made in order to make this happen.", "Appeal to Trump's ego and he'll do anything or say anything that you want. Obama probably just complimented Trump's tie and told him that he owned several himself and Trump was putty in his hands.", "Awesome. So we're all in bi-partisan agreement that the next election should use a popular (ranked choice) voting system?\n\nGreat. Let's make it happen then. Everyone unite to push for a popular vote-elected president in 2020! I can't wait to hear from all the Mother Jones WashPost, and NYTimes of the world how much they want a popular vote election in four years.\n\nNo, really, let's do this, I'm all for it! I'm ecstatic that people are finally noticing what a sham the electoral system is in the US and are finally willing to do something about it.\n\n(But no, obviously this won't affect Trump's win, since you don't change the rules mid-game, but for the next election).", "I really suspect this is the case. Trump surrounds himself with people who just reinforce each other - it's easy to find yourself swayed into thinking something ridiculous if it's the only thing you expose yourself to. They probably all made really compelling arguments. \n\nI suspect Obama mentioned a few key facts which Trump's advisers had all been conveniently ignoring in order to convince him of various things. \n\nIf it is true who knows if it would have any impact - I just hope Trump actually keeps in touch with Obama for a little perspective once in a while.", "It was her turn!", "Listen we have to protect all those birds that hit wind turbines.\n\nBigly problem", "whats an easy way to repay people... without keeping them. You put them on the transition team then replace them with more competent people. Hell they did that on the west wing.", "I'm not a Trump supporter and don't mean to contribute to the mental gymnastics at work here but I don't think Trump is being as hypocritical here as it looks. Here's why:\n\nThe reason this is arguably expected is Trump's [healthcare reform proposal](https://www.donaldjtrump.com/positions/healthcare-reform) starts with \"Repeal Obamacare\".\n\nImmediately after that, 4 of the 6 total reform goals were already implemented via Obamacare to the furthest extent that was legislatively possible at the time.\n\nThe fifth point is \"Block-grant Medicaid to the states.\", which per numerous studies is an awful idea.\n\nThe sixth point is \"Remove barriers to entry into free markets for drug providers that offer safe, reliable and cheaper products.\", which is an amazing idea that Sanders also held, but incredibly unlikely to make its way through a Congress flooded with pharmaceutical industry lobbyists and campaign contributions.\n\n-----\n\nIn short, the healthcare reform Trump campaigned on was: \n\n1. \"Completely repeal Obamacare\"\n2. Reinstate key parts of Obamacare\n3. Implement a policy that healthcare policy experts have concluded time and time again won't work well for patients.\n4. Fail to implement a good idea on pharmaceutical policy due to corruption.\n\nThe far more logical step would be to repeal the parts he wants to repeal and keep the parts he wants to keep. His initial proposal was flat out idiotic and it's unsurprising that he's making modifications to it. He can stick to his healthcare reform goals (however much I disagree with them) while still not completely repealing Obamacare, and honestly that's the far more streamlined and reasonable way to do it.", "It goes something like that for sure.\n\nObama knew leaving office that the ACA needed some reform/help. You don't have the premium increases we are seeing now without getting some reform.\n\nA large part of the reason premiums are on the rise is because of the exceptionally sick people who cannot be denied. The money losses on them have to be made up somewhere, and well, it's coming out of the relatively healthier people. \n\nWhat will likely happen is Medicaid will take on more unhealthy/expensive people, thereby reducing premiums for people getting private insurance.", "they may hate obamacare but in general i think they want him to be far more moderate than he seemed during the elections.  especially on many social issues - well, as far as repubs and mike pence are concerned.  \n\nbut at least now you know he's open to reconsidering things.", "You know he didn't. He ran his campaign on sound bites he heard elsewhere. ", "Just in it for the memes. ", "Can it not be Michael Moore?  Can it be like literally any one else? ", "Honestly the majority of citizens who want the ACA repealed only do because it's attached to Obama's name. The everyday person doesn't know shit about ObamaCare.", "Cute sayings aren't worth shit.", "That was Clinton's position though. Trump said we needed to repeal it.", "You're forgetting Mike fucking Pence.\n\nGreat VP pick for our new \"LGBT-friendly\" administration.", "Sam Harris did a podcast this week about the election of Trump and basically said that the best we can hope for is that he really is a con man and doesn't actually believe most of what he said to get elected.", "This is what honestly bothers me the most about the election results. That the Republicans' tactics paid off. It worked. They get to be right they get to be vindicated. All the obstructionism, the abdication of duty, the holding of government hostage, the absolute refusal of compromise. IT WORKED. \n\nTrump may be a dangerous buffoon but this right here, the fact that McConnell and Priebus and Ryan and all the others dickheads whose only strategy was to do nothing and pray for an eventual victory, the fact that their risky and completely irresponsible gamble paid off, THIS is the biggest tragedy here. I just...I just don't have the words.  Every time they pulled this shit these past few years, every time they stonewalled Obama or threatened to shutdown the gov't, I consoled myself by thinking \"ok guys, have fun never winning the general again\". But along comes this smooth talking snake oil salesman who dupes the American public into voting for him and boom, they're back in business. Admittedly they set the table for him nicely with their years of courting anger and misinformation, but it's ironic in hindsight how strongly they initially opposed Trump because he's turned into a fucking godsend for them. ", "&gt; TV: shrugs\n\nElection 2016: The Shrug Heard 'Round the World", "Novice would imply a modicum of experience. Trump is a Political Virgin.", "Seriously. I think Obama is the kind of guy that wouldn't give two shits if the name were changed and he did not get any credit for it so long as Americans were still being covered.", "Dial that backwards a few more years for Gingrich's sake. ", "That's too late  pence is already the president just like cheyney was the real president under bush ", "You know I've noticed that every president elect I can remember got a heaping smack of reality after talking to the outgoing president, which tells me that whatever that office holder knows that the rest of us don't is some pretty sobering shit.\n\nThen again, leaving 20 million people without the ability to get health insurance would be a pretty stupid move anyway, and I'm sure Obama took the time to warn him about all the shit he dealt with that didn't make the right wing blogs. Obama has every reason to make sure Trump succeeds (and so does every other American), and so he's going to use that opportunity to persuade Trump in any way he can.", "He never met Obama before. He accuses others of judging him when he never met them before only to do the same thing. I'm not mad or anything. I hope Trump flip flops a lot on his campaign promises. I'm giving him a chance and I think others should too.", "As someone with \"preexisting conditions\" IDGAF if it's called Trumpcare in the future. Getting to live is a nice bonus", "He said he had never met him before (well he saw him across the room at the White house ~~correspondence~~ correspondents' dinner), but he's absolutely never talked to him in person, much less in a setting where there wasn't a bunch of cameras around he'd have to play uptoo.\n\nI hope in a few years we'll get a detailed story from Obama or someone else about what was exchanged, and how much Obama ended up grounding him in reality.", "/r/SubredditSimulator 2020", "I'm pretty hyped for Donald to accidentally tell us whats in area 51.", "Misleading title....\n\n\"Either Obamacare will be amended or repealed and replaced,\" Trump told the newspaper. \"I told him I will look at his suggestions, and out of respect, I will do that.\"", "I think he offered support for single payer a few times.\n\nYup found it: http://ijr.com/2016/02/537107-5-times-donald-trump-praised-socialized-healthcare/", "hope he tweets presidential shit at 3 in the morning\n", "And Obama's sticking around in DC. Obama: \"Hey Donald, call me whenever you need me. I know the job's lonely at the top and everyone wants something from you all the time. I'm hear to talk to you and provide any advice / help I can give. By the way, I love that tie.\"\n\nThat would be gold.", "He used to be super liberal. How nuts would it be if he ended up being a really liberal president? ", "Basically this.  Obama is charismatic AF.  He could probably talk Trump into just about anything.  This excerpt from a Foreign Policy article is one of the most concise readings I've seen yet on Trump.\n\nChina no longer faces the prospect of Hillary Clinton a tough, experienced opponent with a record of standing up to bullies. Instead, it faces a know-nothing reality TV star who barely seems aware that China has nuclear weapons, has promised to extort money from U.S. allies around China like South Korea and Japan, and has repeatedly undercut U.S. credibility as a defense partner. **Trump is also exactly the kind of businessman who is most easily taken in by China — credulous, focused on the externalities of wealth, and massively susceptible to flattery.** A single trip, with Chinese laying on the charm, could leave him as fond of China’s strongmen as he is of Russia’s Putin.", "They just told him about what we really discovered at Roswell.", "It sounds like a joke at first but I honestly believe Trump did not start this journey intending to actually be President. Now that he's won, I'm not sure he wants it as much as he thought he did. \n\nI'm sure he will step up and put in his four years, but I bet he's coming face to face with the gravity of *being the fucking President* right now, and I'm sure that's really scary for someone with no government experience.", "I have really bad news for you.  His transition team is stocking the federal cabinet with climate deniers and oil tycoons as I type this sentence.\n\nhttp://www.vox.com/2016/11/9/13571318/donald-trump-disaster-climate\n\nTrump has said straight up, he wants to scrap all the major regulations that President Obama painstakingly put in place to reduce US carbon dioxide emissions, including the Clean Power Plan. If Trump wants to rewrite these rules through executive action, he can. Or **Republicans in Congress could try to pass a law forbidding the EPA from ever regulating CO2 again.**", "he has zero experience plus he's 70 years old.... he's gonna have to carry that weight and I just hope he doesn't die because I think pence is insane", "He used to be for universal healthcare! And immigration! And abortion! \n\nhttps://youtu.be/3tzlpArJVgs\n\nI would be so happy if he says haha suckers this is how I'm really going to be now. Oh well one can dream indeed. ", "Damn always different feeling when reading about a single person that this affects than just numbers. Hope you keep your coverage. Coming from Germany I can't comprehend such fears...", "&gt; so we just elected a Markov chain as president\n\nlol that's awesome and hilarious (except, of course, it's not)", "Voters are fickle. There's evidence many of those Rust Belt folks who tipped the scale this time were once Obama voters.\n\nIf the GOP was dumb enough to fuck things up and those people found themselves without coverage or with even higher premiums than the hit many of them just took the mid-terms would be disastrous for the GOP in some areas.\n\nI know, I know, mid-terms usually favor Republicans because the turnout for Dems is low. But this election proved the old rules are out the window, especially since a lot of those voters - who were once union or rural Dems, who then turned into Republicans - might again decide to go blue.\n\nEDIT: I'm aware the 2018 U.S. Congress election favors the GOP, but there are tons of state legislature seats up for grabs, and this might be an opportunity for the Dems to reclaim control in some states that the Republicans flipped in the past decade, like North Carolina. ", "I honestly don't believe that Trump is a \"puppet\". The guy is a shapeshifter with no real convictions in any ideology. He will adjust and change his opinions if it somehow benefits him personally. He is also a political novice and now that he is receiving classified information and learning the ins and outs of the government he is going to be the face of, I would have to assume (given his history in public life) that he will change his positions often (or at least is open to it).\n\nI would imagine that he has an invested interest in not pissing off the collective and radically dividing this country since he's going to be president. The language and persona he used in an attempt to get elected might not be the same persona that he uses as President. I don't know how many times I heard people in the media say \"this is not the Donald Trump I know\"...even Hillary Clinton stated that early on in an interview.\n\nHowever it is a possibility that he really is a fascist and is hellbent on carrying out everything he campaigned on in the primaries. No one knows what the hell he is going to do. I think we'll all just have to wait and see. \n\nFrom my observation, he acts primarily on his instincts. That's what makes him so unpredictable. ", "&gt;  He used to be super liberal.\n\nI think his politics have remained consistent.  He used to gripe about the Japanese not paying for their defense back in the 1980s and that he wanted to take Kuwait's oil.  He's definitely on the right side of the spectrum.  ", "He's going to be an aladeen President...", "Some Republican voters think he's some sort of elitist disconnected from reality.\n\nWhat they don't get is that the dude is a biracial guy raised by a single mom who started his career as a community organizer in Chicago. What that means is that early on he learned to get the ear and convince people from all walks of life from ministers to cops to business owners to politicians to gang members. The guy can play a game of pickup basketball *and* be a smooth diplomat. ", "Seriously. What don't people understand about the instability of this man? Pundits can't predict what he'll do. His detractors can't predict it. His supporters can't predict it. And I've had a sneaking suspicion for the better part of a year now that HE HIMSELF cannot predict even the next word that comes after the next word that will come out of his mouth. Let alone his plan for complex policy positions. ", "Omfg that's what he should be! A late-night radio call-in host!\n\n\"Now we have Don on the line...again. Hi Don.\"", "I wouldn't be surprised if Obama started getting a lot of late night calls.", "I'm keeping this on my clipboard and will be updating often in the next week.\n\n~~Repeal Obamacare~~\n\n~~Big Beautiful, Impenetrable Wall. Like, no wall you've ever seen. Believe me.~~\n\n??~~Muslim Immigration Ban~~??\n\nRenegotiate Nafta\n\nTear up TPP\n\nTear up Iran deal\n\nNukes in Japan and So. Korea\n\n~~Bring Coal Jobs back to Pennsylvania~~\n\nDeportation Task Force\n\n~~Lock Her Up~~\n\nNo Vacations\n\nCut top tax rate to 10%\n\nIncrease Military Spending\n\nPay down national debt \"big league\"\n\nTarriffs against US companies that export jobs\n\nName China a currency manipulator (or start a trade war)\n\nMake NATO pay it's fair share\n\nMake allies pay for military protection\n\nBring back manufacturing jobs\n\nEconomic growth of 4+%\n\nEliminate Common Core (even though it's not a federal program)\n\nWe're all going to say Merry Christmas\n\nForce Nabisco to make Oreos in the US again\n\n~~No Lobbyists~~\n\nCongressional term limits\n\nedit:  Thanks for crowdsourcing the Contract with the American People.\n", "I wish the government would really Crack down on the Healthcare industry. The ACA would be spectacular if hospitals weren't able to mark everything up 1000% and drug companies weren't allowed to jack up prices all the time.", "When I watched the footage of him meeting with Obama Trump looked for all the world to me like somebody walking into a class they've been skipping for the last month, and realizing with horror that they no longer understand anything being discussed.", "Those two parts will cause the cost of insurance to **skyrocket** if they remain intact but they interfere with other parts of the law. You can't have those without the government funding and larger pool of insured people to offset the extra cost to insurers.", "Polls also said that Hillary would beat Trump. Yet here we are. ", "It's the best way to be.  He can simultaneously endorse and denounce every single issue that comes across his desk for the next 4 years. ", "*Donald*: Barack! You gotta help me! I know nothing about any of this I've made a grave mista-*click* \n\n*Barack, with a shit-eating grin*: Gotta love Donald. Always a pleasure having him on.\n", "That was the fatal flaw in her candidacy.  Her positions were exactly those she could reasonably get done.  There is nothing flashy or exciting about that.\n\nIf she had come out big on single payer she would have rallied the progressive wing, boosted excitement and turnout, and probably won.\n\nObviously, an R house would never do single payer, but they would then compromise and fix Obamacare  to avoid the prospect of single payer.  She would end up with her exact position.\n\nWhen incremental fixes is your starting point, it is easy for the opposition to just say no.", "I'm going to put on my neoliberal shill hat and note that we really do need to introduce transparency and price competition into the marketplace.  \n\nAt a minimum require doctors and hospitals to provide post complete cost information before a procedure or visit.  Maybe require them to adopt and abide by cost packages  (no more charging for Tylenol -- just charge for the heart bypass).  Convert standard medical supplies into overhead.  Etc.", "No Pence! No Pence! You're the Pence!", "To lose. Again. 😔", "WTF is wrong with them.", "I mean I guess it's better to be open to reason than to shut down everything. I still think he wants Obamacare repealed but rebranded Great American Care or something.", "Privatizing profit and socializing loss.", "Do you want the Aladeen news or the Aladeen news?\n\n*The Aladeen news'?*\n\nYou are HIV-Aladeen", "ELI5: what does \"only Nixon could go to China\" mean?", "Well he promised he wouldn't try to kill all humans...", "I\"m all for capitalism for markets that have the proper mechanisms to function freely. The way healthcare works is in complete opposition to all the market forces that makes capitalism work.", "It would be hilarious if Obama ended up in Trump's Cabinet.", "The sad thing on the Democratic radio shows they have been blaming facebook and sexism lmao", "&gt;we just elected a Markov chain as president\n\nLet's dispel once and for all with the fiction that Donald Trump doesn't know what he is doing he knows exactly what he is doing. It's a systematic effort to benefit the 1% at the expense of the working class.", "So *this* is how it feels to live under the Targaryens.", "I am starting to love his complete insanity. The thing he mentioned non-stop is now something he hasn't given a lot of thought to?\n\nHe's going to make so many comedians so much money.", "Trump is whatever his audience wants him to be. As a tv show host that was democrat to win the election he went completely the other way. We'll see who this narcissistic sociopath perceives his audience to be now.", "\"Can't I get the Secret Service to make them?\"\n\n\"No.\"\n\n\"What's the point of being President then?\"", "He had him at \"I love that tie\"", "As soon as Schumer came on board earlier it became clear he's going to get the post ", "But remember Hillary was the corrupt one.", "Im so glad I wasnt the only one to notice this. He just looks uncomfortable. His arms tucked in his hands together. ", "Obama as sec of health and human services\n\nBernie as sec of the treasury\n\nIt would never happen but it would be hilarious.\n\nEdit: even better: Bernie for sec of labor. They both wanted to work on that particular end of bringing jobs to rural areas, and Bernie at least had a plan for it.", "You're forgetting the most important thing. We don't have a president that's sloppy with emails. Win win.\n\n\n^^/s", "Dodge the question. She didn't she answered plainly. She has dodge tough questions before she knows how too. It's even more of a signal that Bernie is setting up to take control of the party.\n", "No no, no... DNC staff cost Bernie the election, then Hillary failed to impress the American people.", "Can you imagine that America is the wealthiest nation on earth too? A beacon of hope for the world? It's ludicrous.\n\n*Edit: yes I agree that America is a former beacon of hope.*", "What is amazing is that to me he has the appearance of a guy completely overwhelmed by the gravity of what's currently happening. I swear the look on his face and body language during that white House meeting was him saying \"what the fuck am I doing here? Is this shit really happening?\"", "Yes when you have normal sized hands.", "Trump: \"Turns out I won't repeal Obamacare after all.\"\nSupporters: \"What a brilliant leader! MAGA!\"\nTrump: \"Yeah and we're not going to deport any immigrants either.\"\nSupporters: \"Anything you say, boss!\"\nTrump: \"And yeah, no wall either.\"\nSupporters: \"Yeah! That's...yeah!\"\nTrump: \"And I'm tapping Sanders and Warren to lead our budgetary and environmental committees.\"\nSupporters: \"Oh...I just...oh.\"\n \n4\nD\nChess, motherfuckers.\n\n(Yeah, it won't happen, but hope is all I have at this point)", "I don't get why enforcement of the law is deemed to be so negative. \n\nWe have immigration rules that are far more liberal than Canada's but Canada isn't given guff about their immigration policy so why the USA, particularly given the US hasn't stringently enforced its laws?\n\nYou don't get 11-18 million illegal immigrants by stringently enforcing the law. ", "As long as they don't chip away the parts about preeexisting conditions and staying on your parents' plan until you're 26 that's not the end of the world.", "[Obama: Call it 'Reagancare…Ryancare…I don't care'](http://www.msnbc.com/msnbc-quick-cuts/watch/obama-call-it-regancare-ryancare-i-don-t-care-790326851893)\n\nObama is already two steps ahead of you....4D CHESS", "\"Either Obamacare will be amended or repealed and replaced.\" This is what he actually said in the interview. No matter what, it's going to be CHANGED. He has consistently said he will keep some \"good\" parts of Obamacare such as the \"preexisting condition\" thing. \n\nThis is from primary debate:\n\nQ: Senator Rubio, you said that Mr. Trump thinks part of ObamaCare is pretty good. Which part?\n\nRUBIO: The individual mandate. He said he likes the individual mandate portion of it; I don't believe that should remain there. We need to repeal ObamaCare completely and replace it with a system that puts Americans in charge of their health care money again.\n\nTRUMP: I agree with that 100%, except pre-existing conditions, I would absolutely get rid of ObamaCare. I want to keep pre- existing conditions. It's a modern age, and I think we have to have it.\n\nQ: The insurance companies say is that the only way that they can cover people with pre-existing conditions is to have a mandate requiring everybody purchase health insurance. Are they wrong?\n\nTRUMP: I think they're wrong 100%. Look, the insurance companies take care of the politicians [and vice-versa]. The insurance companies are making an absolute fortune. Yes, they will keep preexisting conditions, and that would be a great thing.", "Around the time Florida announced it was considering investigating Trump's school after other state's were doing the same he sent an organization that was supporting Bondi's reelection $25k from his charity, which is illegal as charities can't give political donations.\n\nAnother interesting case was in texas\n\nhttp://www.cbsnews.com/news/former-texas-official-says-he-was-told-to-drop-trump-university-probe/\n\n&gt;Republican Texas Attorney General Ken Paxton moved to muzzle a former state regulator who says he was ordered in 2010 to drop a fraud investigation into Trump University for political reasons.\n\n-\n\n&gt;Paxton's office issued a cease and desist letter to former Deputy Chief of Consumer Protection John Owens after he made public copies of a 14-page internal summary of the state's case against Donald Trump for scamming millions from students of his now-defunct real estate seminar.\n\n-\n\n&gt;Owens, now retired, said his team had built a solid case against the now-presumptive Republican presidential nominee, but was told to drop it after Trump's company agreed to cease operations in Texas.\n\n-\n\n&gt;The former state regulator told The Associated Press on Friday that decision was highly unusual and left the bilked students on their own to attempt to recover their tuition money from the celebrity businessman.\n\n-\n\n&gt;\"It had to be political in my mind because Donald Trump was treated differently than any other similarly situated scam artist in the 16 years I was at the consumer protection office,\" said Owens, who lives in Houston.", "Obama must have told him how much larger his hands look since he became President. ", "National polling was off by a very small margin in Hillary vs. Trump. They dropped the ball in the Rust Belt but unless you think they dropped it by 10 points (they didn't), Sanders clearly would have won.\n\nThe truly bizarre thing about all this is that *Clinton ran on her electability*. Somehow, the candidate who consistently polled even or barely ahead of the GOP nominee was considered more \"electable\" than the candidate who trounced him by double digits.", "Trump adores Bills presidency. Obama has been nearly the same. Why wouldn't he like it? ", "Left his second wife on her deathbed for his third then assailed Bill Clinton for having an affair.", "Yes. What people seem to conveniently forget is that the ACA simply grew on top of a very broken expensive healthcare system. You take it away, surprise! It's still the same thing.", "Polls showed Sanders had a better shot of beating Trump when half the country knew only one thing about him: *he was a self-professed Socialist*.\n\nThis is what they knew about him. And a lot of them still wanted to vote for him over Trump or Hillary.\n\nPundits wouldn't stop telling us, \"They're gonna attack him! They're gonna call him a Socialist!\"\n\nWell, you forgot to check, that Bernie had already called himself that. So it was a fucking dud. \"Socialist\" was all they had against him and it had all the effectiveness against his general election poll numbers as throwing a banana cream pie.", "So unlikely but that would be the fucking funniest thing ever", "Because that's the line the GOP sells them on every democratic president ever ", "isn't that just the fact democrats didn't get out and vote..\n\nClinton got 6 million less votes than Obama while Trump got roughly the same votes as Romney ", "Yup if there's a chance for the progressive wing of the party to take it back, now is the time. Neo-liberals had their shot.", "Lweandowski gives me the creeps.  He's a total nut on CNN and is more off his meds than Trump is.", "Which is the Trumpolitically Correct way of saying \"it's not going to happen, mostly because I couldn't even make it happen if I wanted to.\"", "Say what you want about Hillary not addressing the concerns of the rust belt. At least she didn't lie to their faces like Rapin' Don did.", "Nope! Millennials are uneducated idiots and it's their first election! It doesn't matter that they're everyone from ages 18-40 and that they were completely right about this entire election! WE KNOW BETTER!\n/s", "Would be hilarious if they push Hillary just one more time. ", "And then have at least half the republican party turn on him while even the most conservative of supreme courts strike it down as soon as it is challenged\n\nI really doubt that Trump cares enough to do that. He wasnt anti muslim immigration right after 9/11. He only became anti muslim when it became politically expedient. You really think he's going to draw all that outrage and tarnish his legacy for something he barely cares about? ", "&gt; If the GOP was dumb enough to fuck things up and they find themselves without coverage or with even higher premiums than the hit many of them just took the mid-terms would be disastrous for the GOP in some areas.\n\nBut there's a flipside. If they're going into the midterms having not done anything meaningful about Obamacare, there's a chance that another \"Tea Party\" style movement challenges a bunch of do-nothing Republicans in the primaries, with the promise of getting rid of it.\n\nThey have a fine needle to thread. Don't piss of their base in the primaries, but don't piss off the broader electorate, either.", "May I add a few:   \n\nTarriffs against US companies that export jobs\n\nName China a currency manipulator (or start a trade war)\n\nMake NATO pay it's fair share\n\nMake allies pay for military protection\n\nBring back manufacturing jobs\n\nEconomic growth of 4+%\n\nYuge numbers of jobs\n\nEliminate Common Core (even though it's not a federal program)\n\n-----------------------\n\nOn a personal note the repeal the ACA might be premature.  The new GOP congress hasn't had their say yet.", "That's why I shipped all my kids to Somalia. You're welcome Earth. ", "Depends on who the Dems run and if the party can unfuck itself.  Incumbents have an enormous advantage.  If the Dems run some standard-issue pro-corporate asshat like Schumer or Cuomo its a toss-up.  If they run someone that energizes young progressives like Sanders did, then yes Pence will get worked over hard.", "That's how every new president looks and feels when they first start the job.  When the new president first gets their full security briefing that's the day they really wake up and realize the weight of the presidency.", "*That's* the simile we were seeking.", "It's probably just the fact that Obama won Ohio Michigan, Pennsylvania etc but Hillary did not.\n\nI don't think you can get any more specific than that (like, person x voted Obama in 2008 but then Trump now).", "Just imagine that these people who threatened to take back their country from Hillary Clinton may in the future have to threaten to take back their country from Donald Trump.\n\nI can't wait to see Alex Jones when he finally puts it together.", "The title of this post is still complete fucking bullshit and a perfect example of biased /r/politics. All Trump is saying and has been saying for a year, is that they will never go back to pre-existing conditions adjusting your premium, and maybe a couple other good aspects of Obamacare.  He has never and will never keep obamacare and OP is going to cause a lot of drama for no reason.  Good going /u/FatDil ", "Look at how much being a president has aged each one who has taken the job. I sure as hell would not want that. I think he is in for a world of shock and surprise at what the job is really like. ", "Least likely title of 2016 has been confirmed. Nothing will beat this one. ", "You got fucking played.", "Go ahead Trump supporters try to defend this. "], "links": ["5cf4js", "5cegka", "5cf4js", "5cfnsq", "5cfnsq", "5cf4js", "5cegka", "5cegka", "5cfnsq", "5cf4js", "5cegka", "5cegka", "5cexjq", "5cegka", "5cegka", "5cegka", "5cf4js", "5cezvn", "5cf2r9", "5cegka", "5cf6mz", "5cfnsq", "5cegka", "5cfnsq", "5cfnsq", "5cegka", "5cfonz", "5cexjq", "5cf4js", "5cf4js", "5cegka", "5cegka", "5cegka", "5cegka", "5cegka", "5cegka", "5cegka", "5cez4p", "5cezvn", "5cegka", "5ce4qe", "5b2p5g", "5ce234", "5cf4js", "5cfonz", "5cegka", "5cf4js", "5cegka", "5cejof", "5cegka", "5cf4js", "5cegka", "5cegka", "5cfq33", "5cegka", "5b2p5g", "5cegka", "5cexjq", "5cexjq", "5cegka", "5cegka", "5cf6mz", "5cegka", "5cegka", "5cfh77", "5cegka", "5cegka", "5cegka", "5ce234", "5cexjq", "5cegka", "5cf6mz", "5cexjq", "5cegka", "5cf6mz", "5cf4js", "5cegka", "5cf4js", "5cegka", "5cf6mz", "5cezvn", "5cegka", "5cfq33", "5cexjq", "5cegka", "5cexjq", "5ce234", "5cf2r9", "5cexjq", "5cfh77", "5cegka", "5cegka", "5cez4p", "5cfh77", "5b2p5g", "5cegka", "5cegka", "5cf4js", "5cegka", "5cf4js", "5cf4js", "5cfx2d", "5cegka", "5cegka", "5cegka", "5cf4js", "5cg35g", "5cfnsq", "5cegka", "5cegka", "5cfzbc", "5cf4js", "5cf4js", "5cfx2d", "5cfzbc", "5ce234", "5cfnsq", "5cfzbc", "5cegka", "5cfyvl", "5cegka", "5cfx2d", "5cfnsq", "5cegka", "5cf6mz", "5cf4js", "5cf4js", "5cfzbc", "5cfzbc", "5cegka", "5cejof", "5cf6mz", "5cfyvl", "5cejof", "5cg35g", "5cfnsq", "5cf4js", "5cf6mz", "5cegka", "5ce234", "5b2p5g", "5cfyvl", "5cexjq", "5cexjq", "5cf6mz", "5cf4js", "5cg35g", "5cg35g", "5cezvn", "5cftwi", "5cf4js", "5cegka", "5cf2r9", "5cfyvl", "5cg0by", "5cf4js", "5cegka", "5cegka", "5cez4p", "5cf2r9", "5cfnsq", "5cexjq", "5cf4js", "5cegka", "5cegka", "5cfx6l", "5cfx2d", "5cezvn", "5cf4js", "5cegka", "5cfx2d", "5cf2r9", "5cf6mz", "5cf4js", "5cegka", "5cfx2d", "5cfx2d", "5cf4js", "5cfnsq", "5cfrq2", "5cexjq", "5cf4js", "5cexjq", "5cf4kk", "5cf4js", "5cfnsq", "5cg3dx", "5ce234", "5cf4js", "5cfq33", "5ce234", "5cfnsq", "5cfzbc", "5cf4js", "5cgbiu", "5cf4js", "5cfyvl", "5cegka", "5cgbiu", "5cfx2d", "5c7n7w", "5cf4js", "5cgbiu", "5cgao3", "5cf4js", "5cf4js", "5cgdwk", "5cegka", "5cgadj", "5cfyvl", "5cf4js", "5cgbiu", "5cegka", "5cf4js", "5cegka", "5cgdwk", "5cf4js", "5cfnsq", "5cf4js", "5cegka", "5cf4js", "5cf4js", "5cf4js", "5cg90c", "5ce234", "5cg90c", "5cg90c", "5cf4js", "5cf2r9", "5cf4js", "5cgame", "5cfzbc", "5cf4js", "5cfzbc", "5cfzbc", "5cegka", "5cgb5l", "5cgadj", "5cf6mz", "5cfyvl", "5cgbiu", "5cfx2d", "5cfzbc", "5cf6mz", "5cgadj", "5cgbiu", "5cfx2d", "5cfq33", "5cf4js", "5cf2r9", "5cf4js", "5cegka", "5cg3dx", "5cgbog", "5cf4js", "5cegka", "5cegka", "5cf4js", "5cfyvl", "5cfzbc", "5cgbiu", "5cf4js", "5cf4js", "5ce234", "5cf2r9", "5cgbiu", "5cei2j", "5cez4p", "5cf4js", "5cfyvl", "5cf4js", "5cg90c", "5cgadj", "5cgao3", "5cgcda", "5cf6mz", "5cfyvl", "5cfyvl", "5cf4js", "5cgh8u", "5cgdwk", "5cf6mz", "5cfyvl", "5cf4js", "5cf2r9", "5cg35g", "5cf4js", "5cfzbc", "5cgame", "5cez4p", "5cfyvl", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgh8u", "5cgswr", "5cgswr", "5cgso6", "5cf4js", "5cfnsq", "5cgh8u", "5b2p5g", "5cf4js", "5cf4js", "5cf4js", "5cf4js", "5cgswr", "5cgswr", "5cfnsq", "5cf4js", "5cgswr", "5cgn7z", "5cfnsq", "5cgswr", "5cgn7z", "5cgme1", "5cegka", "5cf4js", "5cgbiu", "5cgh8u", "5cgn7z", "5cfnsq", "5cgh8u", "5cf4js", "5cf4js", "5cf6mz", "5cf4js", "5cgh8u", "5cf4js", "5cgh8u", "5cegka", "5cgn7z", "5cgh8u", "5cf4js", "5cegka", "5cgn7z", "5cf4js", "5cf6mz", "5cf4js", "5cf4js", "5cgswr", "5cgswr", "5cgao3", "5cgadj", "5cf6mz", "5cgfzx", "5cgswr", "5cgme1", "5ce234", "5cgme1", "5cgp6b", "5ce4qe", "5cejof", "5cf4js", "5cgn7z", "5cgh8u", "5b2p5g", "5cgbiu", "5cezvn", "5cgadj", "5cf4js", "5cgt9i", "5cf4js", "5cgn7z", "5cf4js", "5cfnsq", "5cgbiu", "5cgn7z", "5cf4js", "5cgbiu", "5cgswr", "5cf4js", "5cgadj", "5cgn7z", "5cgbiu", "5cegka", "5cfx2d", "5cgme1", "5cf6mz", "5cfnsq", "5cgbiu", "5cgme1", "5cfx2d", "5ce4qe", "5cgme1", "5cgbiu", "5cgt9i", "5cgp6b", "5cf6mz", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5c7n7w", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cf4js", "5cgswr", "5cf4js", "5cf4js", "5cgw6a", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cfnsq", "5cgswr", "5cgswr", "5cgswr", "5cgso6", "5cgswr", "5cgswr", "5cgwn2", "5cgso6", "5cgswr", "5cgw6a", "5cgswr", "5cgswr", "5cf4js", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgw6a", "5cgh8u", "5cgswr", "5cgswr", "5cgswr", "5cf4js", "5cgswr", "5cgswr", "5cgso6", "5cgswr", "5cgbiu", "5cgh8u", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5ch3gp", "5cgswr", "5cgswr", "5cgswr", "5cf4js", "5cgwn2", "5cf2r9", "5cf4js", "5cfnsq", "5cgwn2", "5cf4js", "5cfnsq", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5chd4u", "5cgswr", "5cgswr", "5cgswr", "5chcm7", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgbiu", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cegka", "5cgswr", "5cgswr", "5chd4u", "5cgswr", "5cgswr", "5cgswr", "5ch8rd", "5cgw6a", "5cgswr", "5cgswr", "5cgswr", "5cgbiu", "5chegv", "5cgswr", "5cgswr", "5cf4js", "5cgswr", "5cgao3", "5cgswr", "5cgwn2", "5cgswr", "5cgw6a", "5cgswr", "5chcm7", "5cgswr", "5cf4js", "5cgswr", "5chcm7", "5cgswr", "5cgswr", "5cgswr", "5ch8rd", "5chcoe", "5chd4u", "5chem4", "5cgbiu", "5cfnsq", "5cgao3", "5cgswr", "5chd4u", "5cgswr", "5cfnsq", "5cgswr", "5cgswr", "5cgswr", "5chem4", "5cgswr", "5cgswr", "5ch89p", "5chd4u", "5cgw6a"]}