{"comments": ["Twitch plays president", "Their vote for Trump was the equivalent of taking a shit on the living room floor. They didn't really have a *plan* or think that it would have any positive result. They just wanted to shit on the floor and make other people react to it. \n\nEdit: I love you guys.", "This is the part I will *never* understand.\n\nHow could people vote for a guy who is a **Wall Street Billionaire** as a big fuck you to *Wall Street*?\n\nEdit: Just woke up to see a gazillion comments trying to argue that Cheeto isn't a \"Wall Street Billionaire\".\n\nOMFG! Are you all for real? No wonder he won!\n\nWhere the fuck do you think he got the money to buy and build his properties? Where do you think he keeps his alleged billions of dollars in assets? Didn't any of you bother to read any of the articles detailing how he made and lost billions of dollars without going personally bankrupt? \n\n#YOU'VE BEEN TRUMPED!^^®", "\"PHILLIPS: Health care?\n\nMr. TRUMP: [I'm] liberal on health care we have to take care of people that are sick.\n\nPHILLIPS: Universal health coverage?\n\nMr. TRUMP: I like universal, we have to take care, there's nothing else. What's the country all about if we're not going to take care of our sick?\n\nPHILLIPS: Abortion?\n\nMr. TRUMP: I hate the concept of abortion. I hate anything about abortion, and yet, I'm totally for choice. I think you have no alternative.\"\n\n-Donald J. Trump and Stone Phillips, NBC October 1998", "The white house scheduler just became the most powerful person in the world. ", "They don't care. r/politics will keep only reading the headlines unskeptically forever.", "I'm totally behind the Bernie coup. This is the only way to clean up the Democratic party.", "Holy shit perfect.", "There's gonna be some serious power struggles here. Pence Bannon, Ailes, Rinse Penis, Newt. Flynn, Ghouliani, Kushner? Conway? Lots of people competing for access to him because he's so easy to influence.\n\nSomebody's gonna end up being his Martin Bormann.", "&gt; I hope in a few years we'll get a detailed story from Obama or someone else about what was exchanged and how much Obama ended up grounding him in reality.\n\nTruth.\nImagine Trump, always surrounded by like-minded people/groups, who all dislike Obama, for whatever the reason.\n\nNow imagine him finally sitting down 1 on 1 with Obama, and realizing that he's not only very reasonable, but willing to hear both sides and work from there. The guy has had 8 years in office, and truly wants the best for the country. Not even Trump can look at such a real, down to earth guy like that and not take his words into consideration.", "\"Well YOU try to put together comprehensive healthcare reform while fighting a secret war against Zetan shock troops on the dark side of the Moon for the past 47 years... you did read the briefing right?\"", "Stop running Republican-lites.\n\nStop running pussies.\n\nStop running darlings of donors.\n\nChange your policies to include working people who are struggling run Democrats who are genuinely interested in public service, and get your progressive message out there.", "Rinse Penis? Wut? What have you been training your auto correct with? ", "Perhaps the greatest con in political history. Trump convinced people to rail against the 1 percent by voting him into office a member of the 1 percent for decades. It's like using a flamethrower to put out a fire. He must be laughing his ass off. ", "It was never a fuck you to Wall Street it was a fuck you to political correctness and racial equality.\n\nHe didn't start his campaign on the bailouts, he started it on Mexicans and how the Starbucks Holiday cup was killing the country.\n\nThe anti-establishment stuff was just cover. All the GOP incumbents in Congress reelected.", "&gt; I noticed during the meeting with Obama he looked slightly shell shocked.\n\nIt finally hit him that he is going to actually have to be President and not just have rallies and be on TV.", "So what you're saying is that we need to hire Obama as Babysitter in Chief?\n\nI'm down. I'll kick in $15 but someone else needs to buy the pizza.", "If a Democratic president had gone to visit and start negotiating normalising relations with China in the 70s they'd have been lambasted by their opponents as colluding with communists and generally being an unpatriotic crazy leftie socialist commie traitor. \n\nBut no-one could accuse Nixon of that - he already had his credentials established as *not that*, so he could go and visit China and have it be trusted by his own 'side' (and everyone else) that he hadn't turned on them.\n\nIn general it became a metaphor for \"Only someone with a long proven track record of being NOT-X can do the thing that would, if anyone else did it, draw accusations of them being X\". ", "Holy shit! The man is truly a wildcard", "And stop this \"reach across the aisle\" bullshit.  It only pushes us further and further right.  The GOP does not fucking care *at all* about your cooperation or your opinion.", "good new for you that is one of the things trump said he likes about obamacare.\n\n\n&gt;Mr Trump said that he may well keep at least two of the main provisions of the healthcare bill. He said that he is favouring retaining a key part of Obamacare that stops insurers from refusing to cover people because they have existing conditions, and another that lets parents add coverage for their children to their own policies.", "Did Crooked Kennedy help disgusting  (check out probe tape) space alien become a U.S. citizen so he could use its technology for NASA?", "Trump's campaign (his son especially) was pulling stuff from 4chan and t_d did y'all not know that we were all playing an MMORPG getting Trump elected?", "No one speaks to the working class like a guy who has a tower in Manhattan with his name on it and who once literally bought a yacht from the Sultan of Brunei.", "People voted for a well known professional con man and are gonna be surprised when they realize they've been duped.", "You'd have thought they would have learned from the election not to do that.", "Imagine Obama offers Obamacare(a Republican plan) and Republicans tell him to eat shit. \n\nNow imagine Paul Ryan offers obamacare.... Now it ain't so bad. \n\nBasically it means people are more willing to work with someone from their own team than the opposition. \n\nIf a Democrat had tried to talk to Chairman Mao they'd be a pinko commie piece of red shit, but since it was Nixon, it's all good. ", "I want to see more leadership from the Bernie wing of the party. Push out the Donna Braziles and Howard Dean's of the party and embrace progressive economic populism. Don't suck up to Trumpism and call him out for the fascist that he is. Embrace people like Tulsi Gabbard and Keith Ellison instead of Tim Kaine and Cory Booker. ", "&gt;Unfortunately the enthusiasm that she generated by threatening to shatter that glass ceiling was tempered by the fact that she’d failed in 2008, that she’d been dogged by scandal for so long, and that she was, despite her gender, seen as the establishment personified.\n\nThis is what's funny to me about the people who want to blame 2016 on misogyny. Clinton was the *ultimate* insider candidate. It *was* her turn. No one had any trouble imagining her as president. The glass ceiling was already shattered, quietly, and perhaps even long ago. She didn't lose because voters just couldn't wrap their heads around a woman president. She lost because they didn't want *this woman* as president. In a strange way, that's the ultimate victory for feminism (although I'm sure it doesn't feel like it).", "These are things that were *never* talked about at length in public until after he was elected. \n\nPeople will be discovering what their stupid fucking meme vote was actually about for the next 4 years. ", "I \"voted for Trump\" one time in the middle of a gas station convenience store because the guy wouldn't let me use it and I couldn't hold it in much longer.", "Oh man, Trump might actually love that. The cool, charismatic black guy everyone likes being his friend/hype/wingman?\n\nSounds like a deal to me.", "Yes. He wants Sarah Palin for Secretary of The Interior. Not joking.", "We need to find a way to make him think universal healthcare is his idea. If he can call it Trumpcare we may just have a winner", "More importantly it means he won't have the time or ability to be The Donald™, president of the Trump Organization.", "\"Stop using electability argument\" - Clinton camp used this all along during primaries \n\n\"Stop saying she/he is tested\"", "&gt; I just hope he doesn't die because I think pence is insane\n\nFrom Indiana can confirm.", "His autocorrect is working.", "Behind closed doors no press. the press was only there for the photo op at the end when they gave brief statements about their discussion.", "\"I know the human being and dinosaurs can coexist peacefully.\"", "He's not a Wall Street Billionaire for one. He's a real estate developer and serial entrepreneur. ", "I will call it Trumpcare loudly and proudly if it means single-payer gets through. He would have the undying support of soooo many people...", "One of the things that's the most baffling to me is the level of science denying in America. Like Europe is very, very far from being an utopia, but if you tried to force kids to learn creationism in schools while preaching about the evils of vaccines, you'd be laughed out of office pretty much everywhere.\n\nWhat the fuck is up with America that they just eat up this bullshit? ", "&gt;The Independent", "Did you just say Sarah Palin...", "It's funny because Obama actually mentioned something along those lines in an interview a few weeks ago. \n\n&gt;\"Make a tweak or too and call it Reagancare if you want I don't care\"", "But like most politicians, he promised more than he could deliver.", "I would literally buy a pizza and send it to the White House every single day if it meant Obama could oversee the next four years.", "Not only was there no press but there were no aides either. Just Trump and Obama.", "It won't affect them so they don't care. I was freaking out to my dad the other day about it, and he dismissively said, \"Oh, you'll be long gone before any of that stuff happens.\"\n\nI told him, \"No, dad. *You'll* be long gone, but I'll still be here, and your potential grandchildren, who will be alive a hundred years from now, will have it even worse.\"\n\nGod, the look on his face. It was like the thought had literally never crossed his mind.\n\n", "They fucking laughed. We warned them that during the primaries Sanders was winning the important states while Clinton was winning the southern states. They said the Dem states would of course vote for Hillary so it doesn't matter.\n\n-_-", "Cause he's a fucking genius \n\nThe man has SO MUCH fucking leverage at this point and I truly believe he will use it for good and will go down in history ", "Which is a valuable skill for a President.  Can you imagine if George W. Bush gave a rousing speech after Katrina where he vilified the government for standing by while poor citizens suffered?", "Secret Service man standing outside door to other Secret Service man: \"Is that ... is he ...\"\n\n\"... crying?\" says the other man wincing. \"I think so.\"\n\nThey place their ears to the door and hear a gurgling, \"No puppet, *no puppet*, *you're* the puppet ...\"", "Because they think he's the epitome of success when the guy's too afraid to release his tax returns.", "see it is literally infinite.", "Obviously. Hell Trump himself admitted he was an \"insider\" yet voters kept saying he wasn't.", "No. Nononono. Oh god no this can't happen.", "He just beat Trump with a sack of oranges. ", "Dude insanely misleading. Why do people put up with the sub? Why?", "*failed real estate developer. \n\nThe guy is a face and a name. He played a  business man on TV. ", "Yes because capitalism doesn't care if broke people die. Americans need to grow up about things that must be socialized in a civilized country. Education health care, elder care, workers compensation etc.", "And everyone commenting here are being idiots. Seriously not one of them are interested in what actually happened? They've literally created an alternate universe, and no one is interested in fact checking. And yet they continue to slam Trump supporters for blindly following...Hypocrisy and madness.", "Bush never would have given Sarah Palin or Steve Bannon a seat at the table. \n\nI hated Bush and I'd give my left nut for a Condeleeza Rice/Colin Powell-level appointee here. ", "He didn't make his money on Wall St though. Can't argue this. ", "So you're just an idiot. Gotcha.", "jokes on you i voted for trump because i wanted infinite liberal butthurt for some years, and a mad man tweeting shitposts at all hours.\n\n", "He's doing a good thing. The country is extremely divided and **the majority of the media are perpetuating that division**.  Michael Moore is one figure who is working to ease the division.\n\nI am right wing and no he is not my favorite. But this is good.", "Then they impeach Trump. All looks lost until Bernie Sanders steps out of the shadows offering his support.\n\nMan i love the bargaining phase of grief.", "I do think there was significant arrogance on the part of the Clinton campaign and the DNC.\n\nThere was also complacency. Some of that is on the party; they assumed victory long before achieving it and refused to organize around a populous candidate. Some of that is on voters who also became complacent because they assumed a Clinton victory.\n\nDisclaimer: voted for Clinton still prefer her to Trump, but I always felt she had these weaknesses and did have fears about them.", "\"And replace it with Trumpcare a Universal Health Care system that the Democrats were never *brave* enough to pass.\"", "https://i.redd.it/u1v0yuutsjwx.png", "Ifaik he hasn't changed his opinion on those and he can still very well hold his left ideologies. Again I believe the crazy nutjob act was a pandering tool for the right. He needed a platform, so he took the right.", "Well it is closer to his base.  The government needs to keep its hands off my Medicare and all that.  \n\nBottom line is that a sufficient number of American people knowingly elected a con man.  Now you could say that all politicians are ultimately con men, I get that, but I don't see why this would be a personality quirk you want to be sure of.  \n\nSo now we can never know what Trump will ultimately do when required to make a decision.  He could be conning any group of people at any time.  I'm sure he told Obama I'm willing to keep the ACA mostly intact, while he then told Ryan, yeah let's repeal that motherfucker.  What Trump will most likely do is select the option that is considered the most rewarding to him at the time, after being suitably flattered and praised by all groups that will benefit from Trump's decision.  I hope we're ready for Trump's America, we're going to be living it for the next four years.  We're now all apprentices on Trump's ongoing gameshow called the USA where he can tell us if we can outplease him from all the other contestants we'll be rewarded with riches from heaven.", "Lots of blaming. They are acting like clinton would have been the liberal savior that obama promised to be.  I listened to the pantsuit podcast to see what hillary supporters thought. They sounded like they were in a parallel universe where bernie sanders not margaret thatcher, lost to trump.", "You can't say Sanders clearly would've won. The truth is nobody fuckin knows. ", "His militia supporters must be seething now that [he walked back the promise to repeal Obamacare](http://www.reuters.com/article/us-usa-election-trump-promises-idUSKBN1362AC?il=0)", "I'll call it IWannaSuckTrumpsDickCare if thats what it takes. ", "Trump actually got less than Romney.\n\nBut yes it's because the DNC failed to mobilize/energize Dems in the rust belt, since they just assumed it would be theirs. I recall a comment a few days before the election about how awful the Dem GOTV campaign and polling were in Michigan. There was just no money put into it, while they put money into Texas and Arizona.", "Remember when Republicans complained about Obama being inexperienced back in 2007...", "Shut your mouth please. ", "I am become Google Calendar destroyer of worlds.", "Amen. Democrats need to move away from passionless centrist politics. People like Ellison, Sanders, and Warren need to be the new face of the party.", "Well that's the problem though. Trump has softened/changed his stances on all sorts of things depending on who he's talked to most recently and who he's addressing at the moment. It's hard to know what he actually believes or intends to do and whether what he believes right now might change again down the road.", "Think about it... After one hour with Obama face to face Trump softened his position considerably. If he had an hour with a clear concise scientific authority on the subject of climate change who knows what he would do.... ", "But isn't it Bernie's turn next?", "We the public probably won't get to know the details of this but part of the transition process is a \"war game\" where the president-elect and the president sit side by side and go through how they would respond to a hypothetical major terrorist attack, or similar major catastrophe. Bush and Obama did it before Obama took office, and Obama and Trump are scheduled to do it twice. I would give anything to be a fly on the wall when it happens. ", "Additionally the whole \"only one person can save us\" is the kind of cult of personality bullshit Trump ran on. I support Bernie and want him to be a leader of this movement, but enough with the hero worship. ", "All those \"Hillary for Prison\" signs are gonna look pretty silly.", "Nope you should look into his business history. He squandered his fortune in the 70s and 80s on ridiculous hotels that no one stayed in and casinos that competed with each other. At the end of it all the lenders took everything, but they realized he had made such a name for himself as a rich dude that the buildings were more lucrative with his name on them then without. So they literally paid him a salary so that they could keep his name on all of the buildings that they seized from him. ", "\"Everything Hillary touches she screws up with hubris\" - Colin Powell", "Was the 1.5 hr meeting behind closed doors or was it all in front of the press?", "Start9", "Classic. Chuck Schumer would like to fly low not to get under Trump's skin too much. So Bernie taking the leadership could suffice.", "Does it not concern you that practically (if not literally) every distinguished Economist in the US disagrees with all that?\n\nEdit: with the exception of over regulation I'll admit that economists are divided about it (as they are about almost anything except the kind of trade and immigration policies proposed by trumo)", "That's an awfully big risk to take. Let's be honest historically Trump has only done things that benefit Trump. To say that will magically change is quite the leap of faith... hmm, on the other hand I guess it all makes sense...", "Anti-Trump from WaPo? WOAH SHOCKER!", "Middle America's fuck you to the liberal coastal elites is to vote for a power structure led by an NYC billionaire NYC mayor, and NJ governor...", "Someone tried to calculate the number of times he changed his stances on issues. He died trying. Don't try. ", "&gt; They just wanted to shit on the floor and make other people react to it.\n\nPretty much.\n\nTheir politicians did everything they could to make sure the government was ground to a halt over the past 8 years and then they hollered and screamed about how Obama didn't accomplish anything. \n\nThey scream about how they don't want the New York elite telling them what to do, and then vote for one.\n\nThey complained about how their jobs have been exported and no longer exist, and voted for a guy who *literally exports manufacturing of his products* and *hires illegal immigrants to construct his buildings*.\n\nThey said he would drain the swamp and get rid of the insiders, and *the first thing he does* is start recruiting the worst of the worst insiders.\n\nI understand their frustration. I understand not liking Hillary. But I *DON'T* understand how they couldn't see through his paper-thin smokescreen of rhetoric and complete BS. \n\nEDIT: Thank you for the gold kind stranger. I wish  I had earned it under better circumstances.", "He literally took three different stands in 30 seconds on the minimum wage this year. He changes positions from sentence to sentence.", "You're right. Even Candidate Obama is completely different from President Obama.\n\nHowever it's not from getting a heaping smack of reality from the previous president, it's actually more from getting daily reports on the status of foreign affairs, economics, and domestic issues. Once you actually know the truth about things, you can't keep the same promises you made when you were campaigning.\n\nObama campaigned to pull out US troops from the Middle East ASAP... but just look at how long it took him to do it. President Obama knew A LOT more than Candidate Obama on the importance of foreign affairs. He couldn't just simply pull out the troops like he said he was going to do. It has to be a strategic move, and even then, after years of planning, we still created ISIS.\n", "Working class middle class folks wanted someone to represent them so they voted for a New York Billionaire.\nGo figure.", "&gt;reince priebus\n\nNow subtract the vowels\n\nRNC PR BS\n====\nThe lizard people are hardly even trying anymore...", "Ok so nobody understands this but:\n\nIf you allow pre-existing conditions it requires a mandate. Because without a mandate -- healthy young people drop out. And the system crumbles on itself.\n\nSo Trump will need a mandate.\n\nWhich is literally the definition of Obamacare ", "[My God!  He's just like us!!](http://hbu.h-cdn.co/assets/16/19/980x639/gallery-1462816039-donald-trump-1.jpg)", "Judging by the ever present wisdom of the blue collar working class you can lie, cheat, and steal as long as you're not a politician. That's truly \"anti-establishment\" and \"outside the beltway thinking\".", "HOWEVER you are also forgetting he's going to be surrounded by those same Obama hating people very soon. He could easily change his tune again and likely will.", "TIL my dog is an avid Trump supporter.", "You're missing the optics. The Republican establishment tried to oust him and failed. Hence he became an anti establishment candidate. The Democrat establishment tried to oust Bernie in favor of an elite, and succeeded, thus making her very much establishment, even showing the corrupt effects of said establishment. \n\nYou can argue legitimacy and merit all you want, but this was an anti establishment year and he was far away the image of that when placed next to her. Any 3rd hand accounts of racism and sexism fell on deaf ears because they came from the scripted side.", "Trump has said for months he like the clause in the ACA about preexisting conditions ", "He wanted to win not to do the job.", "&gt; Judging by the ever present wisdom of the blue collar working class you can lie, cheat, and steal as long as you're not a politician. That's truly \"anti-establishment\" and \"outside the beltway thinking\".\n\nYou know, you say this snarkily, but I grew up in a rural, blue collar, working class area, and you're not as far off as you might think. There's a reason I headed for the cities young and never looked back; I find people in them to be quite a bit more ethically and morally acceptable.", "The NRA should give Obama salesman of the decade recognition.", "Thank you. Either everyone must join or the costs will be absurd. ", "He turned into a lobbyist for the health care industry against single payer for one (he was once for single payer).  He's just your classic sellout.  Not really atypical of most politicians though.", "This is what scares me any progress with Trump is extremely temporary. ", "His official plan has aspects of liberal healthcare reform within. It's a good read! https://www.donaldjtrump.com/positions/healthcare-reform", "&gt; Bernie is setting up to take control of the party.\n\n^*unzips* ^*pants*", "I would say something but apparently I'm a elitist for believing in climate change and evolution.", "It was the \"yes there are aliens and yes they're really in charge\" talk that every new president gets.", "Once again /r/politics shows that it doesn't know what anti-establishment means.\n\n\"We were wrong all year today we're right though!\" - Democrats/SJWs\n\nDownvote all you want; i've learned from experience that downvotes in this sub just mean you're right.", "More pressingly; He didn't want to lose.", "To be frank. I'm really really glad the first female pres isn't her. Like unreasonably happy. I'm super pissed the trade off for this is pence. Ugh. Trump is trump i honestly don't know what he's gonna do about women's rights but pence man. \n\nI'm so mixed feelings about this election result. I would have preferred hrc as the pres over all and I'm upser about the overall results. But I'm also relieved. ", "The electability argument is fine they just got what constitutes electable horribly wrong.", "Anti-intellectualism is a plague here", "Lol! Do you know why he never personally went bankrupt even though most of his bad loans were backed by him personally? Because he packaged a few of his casinos and buildings together and then made them public: ie- Wall Street stock.\n\nThe people bought the stock and then Trump paid off the personal loans with their money. But he never bothered to pay back the non personal loans he took out on the same buildings and then they went bankrupt. \n\nBut my favorite Trump fact is that if he had taken the loan he got from his father and put it in a regular spyder account he would be 10 times richer than he is now! ", "It honestly makes better business sense because healthy people are more productive people ", "You don't get to complain about the disenfranchisement of African Americans and then willingly disenfranchise yourself. I say this as a liberal and a 49ers fan. ", "47% of *voting* Americans.  Fewer than 1 in 5 actual Americans. \n\nIncluding children who are going to suffer the most for this travesty. \n\n", "There's a video of Pence essentially arguing that evolution should not be taught as fact because it is \"only a theory\" and because science is a continuous process that may result in the theory of evolution changing or being disproven. \n\n¯\\\\\\_(ツ)_/¯", "But that's why premiums are going up. Healthy people aren't signing up as much as the sick people because the individual mandate is really more of a penalty than anything else that some people just prefer to pay. If there's NO individual mandate but you keep the clause about pre-existing conditions you make costs grow much more. \n\nEDIT: I'm not arguing to allow insurance companies to deny people with pre-existing conditions. I'm saying that not enough healthy people are signing up because the individual mandate doesn't go far enough. ", "Might go badly. \n\n\"HOLOCAUST\" \n\n\"HOLOCAUST\"\n\nDon't trust internet trolls to pick something.", "It seems blatantly obvious to me over the last 2 days...he seems scared like \"I just wanted to prove I could be president if I wanted to, and I did it, so now...umm...well.\" And how he talked about \"after 2 years\" he hoped to prove something, like he's thinking 2 years max then he's outta there. [edit typo]", "Why?  Ellison could have won the post without the support of major players like Schumer but the fact that he signed on and endorsed instead shows that even the Democratic Establishment is ready to turn the page on a more grassroots, progressive approach to 2018 and beyond.  If anything, I think this was the best scenario for the future of the DNC.", "I don't get why people would be freaking out about this.\n\nIt's only human lives.", "Donald Trump is the greatest con man of all time.  Getting 47% of Americans to believe him is the task that no conmen would even dream of.", "It should scare you that you can only *hope* that Trump if he does in fact turn out to be a strong leader, will lead you somewhere you want to go. I see this throughout the thread, and in optimism about the upcoming presidential term all over the place from his supportser: a vague feeling of optimism, that he'll do-it-right, that is somehow disconnected, separated completely, from the fact that he's said he'll do it *completely wrong*.\n\nThe former hopeful sentiment drives his supporters; the latter *terrifies* everyone else, doubly so because the supporters don't seem to *care*. \n\nThis is exemplified by your earlier statement: \n&gt; You base this upon his 100 day plan, and while I accept this I really doubt that he has yet focused on this issue and \n&gt; that his present plan is the blueprint for the next eight years. Your view however is informed by his plan and mine is by hope..\n\nWhere does that doubt come from? How is it justified? Hope is fine for issues he hasn't spoken on, but this one he *has*, and what he's said is disastrous. The only hope is that he'll... change his mind? Shouldn't we able to hold the president to a slightly higher standard than that? If he doesn't change his mind, we may well accelerate (or ensure) our doom. If he does - well, great. You'll have to forgive everyone who's not quite so hopeful - if one hasn't bought into that hope, things look very bleak. It is going to be very difficult for anyone to accept this guy as a leader if they have to assume he knows best *despite* what he says.", "Goddammit. Sometimes I really hate learning.", "I'm curious about Dean. Why does he inspire so much hate? He seemed like a perfectly decent Liberal in 2004 if a bit on the right regarding guns, and he led the party to victory when he was chair of the party.", "I don't get why no one I understands this", "Yes.\n\nI've disagreed with Republicans for years but it wasn't until John McCain introduced Sarah Palin to the world did I think that the GOP was the crazy party. Her in public office is a goddamn nightmare. ", "Biden's been living that dream for the last eight years", "It also takes healthcare costs away from the businesses themselves.", "Shhhhhhhhh........ no tears... only dreams now.... http://imgur.com/RXQhTsw", "or at the very least try not to run a candidate under an FBI investigation.", "IIRC Congress stopped him from shutting it down. Anyone recall? ", "I think that was one thing I actually liked about Hillary. She actually knew what was up to some extent so there was less a possibility of her being unrealistic. ", "&gt; A nice example of this was when the whole racism accusations first started Hillary supporters were using the fact that a KKK member supported Trump to prove he's racist while overlooking the fact that there's a picture of Hillary literally kissing a former KKK leader.\n\nFalse equivalence.  Byrrd was a *former* member of the KKK, who repented enough to satisfy the NAACP (for what that's worth), and publicly repudiated the Klan and its ideals.  Giving Duke the benefit of the doubt as to his current affiliation with the Klan, his campaign for Senate shows he still holds the same white nationalist views, and to my knowledge he has never spoken out against the KKK.\n\nPeople can change.  Duke has chosen not to.", "Yeah that Rinse Penis guy is a dirty dick.", "I voted against this because VA is already a right to work state and has been for some time. This was just a ploy to get it enshrined in our state constitution to make it harder to overturn in the future. Barring some major shift in ideology in the state, that's not changing any time soon", "&gt; I would imagine that he has an invested interest in not pissing off the collective and radically dividing this country since he going to be president. \n\n\n\n\nSo were you in Mars the last 12 months?", "considering the mere election result vaporized the TPP I'm not really sure where you're headed with this.", "Don't worry it's just economic anxiety.", "*Trump is a strong leader. *\n\nNo. \n\nTrump is a bully used to getting his way by throwing tantrums and insults and pink slips around. \n\nThat may have some effect in business (or in Kindergarten), but that's just not how the modern political system works. \n\nTrump himself will learn that he wields little actual power, and will accomplish almost nothing. \n\nThe problem is that he's filling the government with people just as backward and misguided as he is, except that those people know how to work the system to get what they want. \n\nTrump is a puppet, meant only to distract and obfuscate while the old guard systematically dismantles all the progress made over the last two terms, just as W did for the two terms preceding him. And once again, the old guard will implement countless policies and procedures meant to line their own pockets, force everyone into their own outdated belief systems, and ensure their everlasting supremacy on earth and in heaven. \n\nIf that doesn't scare the pants off of every reasonable person, then y'all really haven't been paying much attention. \n\nWhich is exactly what they want...", "He's done everything in his power to shut it down. Congress has hamstrung him with a prohibition on spending so much as a penny in the process of closing it and even then, he's reduced the number of prisoners from 711 to 60. ", "True. He wanted the title of president and the glory that comes with it, but not the actual work of being president. He'll farm out as much as he can to other people and then take credit for their successes (or blame them when they fail).", "&gt; \"Oh you'll be long gone before any of that stuff happens.\"\n\nI use to have a co-worker say this same shit all the time when he would come in my office, we would talk about things, he would then toss his plastic coke bottle in the trash when we have recycling bins right down in the break room. He would openly say, \"I'll be dead so who cares, I don't.\" Meanwhile he has an 18 year old daughter who definitely will. Not to mention any kids she might have. \n\nIt's this, \"well we are old and going to be gone we don't give a shit\" attitude that overwhelms the climate deniers or people who just don't want to do anything about it that is frustrating. You just want to shake them and say \"you know the world doesn't just stop turning when you are gone, do you understand that your family and friends and their family and friends will live on.\" The GOP has embraced this short sightedness and abused it to harvest votes for years. That needs to end people need to be aware and care about the world around them not just what is on their smartphone or TV that day. ", "I understand what you're saying.  He shape shifts.  It's been a long time  since he was a registered Dem ('87) and even then he didn't sound like ANY democrat I've ever known.", "Not for long just look at the shit we had to go through with Pence over this in Indiana. You think Paul Ryan isn't chomping at the bit over taking down unions? ", "Right there with you. Funny thing my ex-wife said exactly the same. A woman president would be good, but not HRC.\n\nI voted for her in the end, but I wasn't happy about it. My ex voted for Stein.", "It looks like there's a groundswell of support for Ellison which is a very good thing.  We need someone heading the DNC who can remove the taint of corruption and venality that DWS and her cronies left behind (i.e. Brazile).\n\nAs for Howard Dean, I supported him for president in 2004 and I think he did a great job as DNC chair before Obama removed him and installed Kaine.  That said, Dean lost all credibility when he trashed Sanders and the Unions while acting as a surrogate for Clinton.  He sold us out to the Clintons for some reason and that makes him part of the problem when we desperately need a solution.\n\n", "[Is this the face of a man who is enthusiastic about what position he just got?](https://i.imgur.com/IKpbqO4.jpg)", "Lemme add one more from 2008 where she insinuated that she's staying in the race in case Obama gets assassinated \n\nhttps://youtu.be/DLNFsl130_Y", "I thought of it as more of an ARG", "Trump is not who you think he is. He was a Manhattan liberal just two years ago. He supported universal health care since 2000 for instance. This election he played the role of a showman, a reality TV star. He said outrageous things purely to manipulate media attention and to buck political correctness. He destroyed the GOP, defeated the neo-cons, and got a room full of Republicans to cheer by expressing support for LGBT. No other Republican candidate could have done that. He is not a fascist by any stretch, he has and will move the Republican Party to the LEFT.\n\nThe Left's conditioned knee-jerk responses to non-PC speech and their hatred of all Republicans have blinded them to the fact that they should have celebrated what Trump has and will do to the conservative movement.", "Agreed. If you dont vote fuck all the way off. ", "Nobody knows for sure but regardless of who would've ended up winning, they shouldn't have stopped the recount.", "&gt;Either Obamacare will be amended or repealed and replaced\n\nWait, how does that not say \"I may not repeal Obamacare\"? He literally said he *may* repeal and replace it, or he *may* amend it. So it seems to me that maybe not repealing it is certainly an option that he claims to be looking into, right?", "He's also being made into a caricature right now. Dean became a lobbyist for the health care industry but still represented progressive values (there are progressive lobbyists too btw). He supported a public option but not single payer, not a corporate sellout position.\n\nHoward Dean is still a good progressive, but I agree we need some change in leadership to move the party forward. However, this attitude of wanting to throw everyone out now who wasn't fully Sanders is not going to help out party", "Her favorability has always gone up when she's _not_ in the news. She had pretty decent approval ratings during her time as Secretary of State before Benghazi anyway.", "Pretty sure Sanders never advocated for jailing his political opponents.  Don't try to insinuate that allowing that kind of rhetoric to fester isn't fucking despicable.  ", "Bill was the first black president Obama was the first gay president.  It remains to be seen but Trump may be the first female president", "A DMV employee has more experience than Trump.", "&gt; The problem with the popular vote and reason for the Electoral College is that a popular vote puts less importance on regions that aren't as heavily populated\n\nExcept now every single part of the federal government now favors rural areas despite them being emptier than ever. The Senate is built exactly for those rural states. And due to an arbitary cap on Reps based on the size of a 200 year old building, and the need that every state needs at least one Rep, the house of representatives gives more representation to rural areas than they deserve based on population. Then you factor in gerrymandered splitting and packing to further limit urban population representation. ", "I think he wanted to get really close to winning so when he lost he could start his new Trump TV network with a huge angry audience.", "This is bs. \n\nTwo years ago Trump was on the \"Obama is a secret Kenyan Muslim trying to destroy this country.\" He threw his support of LGBT rights away when he chose Mike Pence as his running mate. \n\nDeep down we all know that Trump voted for Kerry in 2004 and doesn't really give a shit about abortion or cultural values but now he has to play the part. ", "Did people seriously think we'd stop calling them racist after the election? \n\nThey really think it was a strategy to shame them into voting for Hillary Clinton. It's not. *We think they're racists and we said so*.", "The Comey letter may have cost her enough votes to change the result of the election but it should have never been that close to begin with. Clinton lost because she was a weak candidate from the start. ", "I'm well aware that Mike Pence is a shitty human being but does he really deny evolution?", "We tried to warn you but all anyone heard was EMAILS!!1!\n\nTrump was somehow viewed as more honest than Hillary Clinton. Facts don't matter. This is the result.", "The election is over. No one gives a shit about optics. We're scared about what's going to happen.", "Didn't Obama win the popular vote by a full 5 million votes? I don't think he really needed the electoral college. ", "Haha damn. You're right people are acting like Sanders deserves 2020.", "Half of Americans don't believe it. I swear even when Florida is under water they will still think it's some Chinese conspiracy and once everything has gone to extreme shit they will blame it on the apocalypse or something. And now Ben Carson will indoctrinate our children with more climate denying and religion what the fuck is wrong with America?", "So Guys..... I'm not entirely convinced that a few more hangouts with Obama that Trump may not decide to nominate Obama to replace Scalia.   ESPECIALLY if Obama puts a bug in his ear like:   \"You know what would REALLY piss off Paul Ryan and Marco Rubio?   Like more than anything?......\"", "The idea is valid but at the same time the largest turnout in an election was Obama's first term, and even then only 57% of the country voted, that means that only 30% of the population actively voted for Obama.\n\nSo I'm ok if /u/SingularityStarter wants to say 75% of the country doesn't want him as long as he's ok knowing that 70% of the country didn't want Obama either.\n\nIt's a bit disingenuous though. 25% of the country doesn't want him (we know this for sure), the other 50% apparently either disliked both candidates equally or didn't care (either way it's the same).", "He was so much in love with Wall Street he threw Barack Obama under the bus on Meet the Press in 2012 like a month before the election day... Also while holding an office in New Jersey (he was already a beloved media personality with great prospects in national politics) he had a start-up business in Silicon Valley that went nowhere but still made him a lot of money, which makes people suspect it was a sham set up to funnel the Silicon Valley money directly into his pocket...", "It's like being a rational and intelligent human being is far left now.", "Except imagine that in addition to not attending class the student also tried to get the professor fired for the last 8 years straight.  ", "Is everyone here too lazy to read the article? Here's the actual quote:  \n  \n&gt; \"Either Obamacare will be amended or repealed and replaced,\" Trump told the newspaper. \"I told him I will look at his suggestions, and out of respect, I will do that.\"  \n  \nThat's actually a very sensible thing to say if he's trying to bring the opposition to negotiations. The only thing Trump is experiencing now is the same that Bush and Obama have experienced: the opposing party will hate and demonize every move he makes. Nothing new to see here.", "No. Bernie won't run again. He was a precarious choice because of his age already. Tack another 4 years on and he knows his chances of living through it run short.", "I think you've pretty much got it bang on. He's probably not a fascist  (well let's hope not anyway) but it'll be a few a months before we really know for sure.\n\nThe other big question is has he unleashed forces (eg hatred racism) that he can't control? If he starts to back out of some of his promises - the wall is the big one - some people are going to be pretty upset.", "Well we will find out let's count his vacation days.", "&gt;I will keep an open mind to see what ideas Mr. Trump offers and when and how we can work together. Having lost the nationwide popular vote however, he would do well to heed the views of progressives. If the president-elect is serious about pursuing policies that improve the lives of working families, I’m going to present some very real opportunities for him to earn my support.\n\n&gt;Let’s rebuild our crumbling infrastructure and create millions of well-paying jobs. Let’s raise the minimum wage to a living wage, help students afford to go to college, provide paid family and medical leave and expand Social Security. Let’s reform an economic system that enables billionaires like Mr. Trump not to pay a nickel in federal income taxes. And most important, let’s end the ability of wealthy campaign contributors to buy elections.\n\n&gt;In the coming days, I will also provide a series of reforms to reinvigorate the Democratic Party. I believe strongly that the party must break loose from its corporate establishment ties and, once again, become a grass-roots party of working people, the elderly and the poor. We must open the doors of the party to welcome in the idealism and energy of young people and all Americans who are fighting for economic, social, racial and environmental justice. We must have the courage to take on the greed and power of Wall Street, the drug companies, the insurance companies and the fossil fuel industry.\n\n&gt;When my presidential campaign came to an end, I pledged to my supporters that the political revolution would continue. And now, more than ever, that must happen. We are the wealthiest nation in the history of the world. When we stand together and don’t let demagogues divide us up by race, gender or national origin, there is nothing we cannot accomplish. We must go forward, not backward.\n\nedit: PSA for [/r/political_revolution](https://www.reddit.com/r/political_revolution);\n\n[/r/wayofthebern](https://www.reddit.com/r/wayofthebern);\n\n [/r/BernieSanders](https://www.reddit.com/r/BernieSanders);\n\n [Brand New Congress](https://brandnewcongress.org/home); \n\n [Our Revolution](http://www.ourrevolution.com/)\n\n", "Now plug back in a bunch of O's and K's:\n\n&gt;RookNookCook Pork Books\n\nOkay rook, rook, that's a piece on a chess board. So replace it with the strongest chess piece, the queen. And there are 64 squares on a chessboard, so take the square root of that, 8, and divide it by 2 to get 4.\n\nA nook is a place you can hide. Where else can you hide? The statue of liberty. What's beneath the statue of liberty's robe? Famously, nothing at all. That gives us the words naked, nude, and disrobed. But only *one* of those is 4 letters long! Nude. Nude rhymes with dude. Coincidence? Of course not. We'll come back to this.\n\nNow, Cook. This one confused my brains for a long time. But then I remembered the Cook Islands. They are owned by New Zealand, which is where the Lord of the Rings was filmed. Aragorn. He's tall, dark and handsome, well-educated (he's one of the only humans that speaks more than two languages), and he's going to be king some day. *Just like a young Barack Obama*.\n\nPork. This one is just obvious. Pork barrels. Aka NOT Muslims. What's the one place in New York City a Muslim would never go. That's right. Ground Zero. Way too dangerous for them to practice their religion there! *Especially* under a President Trump. \n\nTrump. Trump rhymes with Rump, Dump, Clump, Penis Pump, Male Chest Lumps, Frump, Crump, and Mump. That isn't important to the puzzle, I just wanted to point it out.\n\nBooks. These are things that you can read which will make you smarter. Being smarter is the *only* way you could possibly solve the puzzle of Reince Priebus. What's smarter than a human? A dolphin. Break that word into its Latin roots and translate them back into English: Doll + Fin. Fin is French for the ending. A puppet is a kind of doll that adults are allowed to play with in public.\n\nWhen we put all the clues together we get the following:\n\n&gt;Queen for Dude Barack Obama Ground Zero Puppet Ending.\n\nNow. This sounds like gibberish, but if we run it through google translate over and over again in the following order:\n\n&gt; Arabic\n\n&gt;\n\n&gt; Russian\n\n&gt;\n\n&gt; Vietnamese\n\n&gt; \n\n&gt; Korean\n\n&gt;\n\n&gt; German\n\n&gt;\n\n&gt; English\n\n(That's right: all of the major wars that U.S. has fought in that I can remember in *reverse* order!)\n\nThen we get the following solution to the puzzle:\n\n&gt;He said the epicenter of the brid[g]e [is] Obama['s] Queen.\n\nThat's right. Michelle Obama.\n\nShe's the key to all of this. She always has been. *Always.*", "It would be funny if it wasn't scary.\n\n&gt;An organizational chart of Trump’s transition team shows it to be crawling with corporate lobbyists representing such clients as Altria, Visa, Coca-Cola, General Electric, Verizon, HSBC, Pfizer, Dow Chemical, and Duke Energy. And K Street is positively salivating over all the new opportunities they’ll have to deliver goodies to their clients in the Trump era. Who could possibly have predicted such a thing?", "&gt;Their politicians did everything they could to make sure the government was ground to a halt over the past 8 years and then they hollered and screamed about how Obama didn't accomplish anything.\n\ndon't forget, they *overwhelmingly* sent those politicians back. ", "Like this gem:\n\n&gt;“There can be no discrimination against gays. I’m against gay marriage.”", "Fuck he's awesome", "Paraphrasing another redditor whose username I do not remember (sorry) but this is truer now more than ever: Bernie Sanders is the face of the Democratic Party. There is no other choice. Republicans went through their identity crisis with the Tea Party and then veered towards the fierce and fearful populism of Trump, and now Democrats have to do the same. Bernie may not be a Democrat in name, but Democrats are going to have to be more like him if they want to take this country back. ", "I hope he's this way with climate change too.", "Me too but I think we need to remember something. We need moderate Democrats to have the DNC's backing in red states. We are not going to win control of congress with ALL progressives. That's the only thing I fear about a shift to the left, and I'm about as liberal as it gets. ", "Here's what terrifies me. \n\nIn Clinton's wake we have literally billions of dollars in lobbying money that now needs a new home. Money that will likely go to Dems who otherwise wouldn't have seen it. Right at this moment there is battle between the Sanders wing of the party and corporate funded wing which is looking for new placeholders.\n\nPutting someone like Keith Ellison at the head of the DNC and reinstating bylaws against lobbyist funding should be priority #1. ", "That'll show those east coast fat cats!", "Can we call Trump voters stupid yet?  Or are we still trying to walk a mile in their shoes and understand their \"economic anxiety\" and assorted bullshit?", "You can call them whatever you want.  Just like the left have been doing for the last 18 months with their bully tactics.  It hasn't worked.  Both sides need to look at each other and use reason. Everybody wants progress name-calling and talking past an issue instead of about n issue will not get anyone anywhere.\n\nReddit has lived in an echo chamber of calling Trump supporters stupid.  When did you start coming to this sub?  How could you claim otherwise?  ", "Trump was widely considered a liberal before he joined the Republican party too. \n\nAnd CLinton seen as more conservative.\n\nSo who knows what the hell we've just elected. o.O ", "We found Dan Brown's throwaway.", "You should be scared about every election for the next 20 years going the exact same way should we fail to reflect and understand why it happened. Emotions during this time are understandable. ", "Please don't hate me. I supported Hillary. I have always respected Bernie. This fills my heart with the most possible joy right now... please Bernie, fight on! I'm sorry I didn't fully support you from the get go.. it was the obstruction in the current government that worried me regarding any of your progressive agenda getting passed. Also, please, forgive me, reddit.\n\nEdit: Also, just fyi, Bernie has my utmost support and I will work for the next two+ years to engage that same support among my Hillary-supporting friends.", "This was too well thought out.\n\nHow do you know this. WHO ARE YOU. ", "Careful talking like that might offend their fragile egos", "Better be careful they'll call you an \"elite\" and a \"snob\" now.", "Not even the 1% just shy of the top 0.0001%.", "We got conned when no one bothered to come out to vote. Their hatred of Hillary and her emails overcame their hatred of Trump and his long history of lying and bad business decisions. And now we have President Trump.", "My Trump-supporting mom was telling me on the phone just a few minutes ago that the one thing she could count on was that Trump would leave guns alone and get rid of Obamacare. I told her to look at the top story in the New York Times because he just said he wouldn't repeal Obamacare. And she got really quiet.", "He also espouses protectionism but bought Chinese steel for his buildings", "We got conned when we were told Hillary was going to sweep the floor with Trump by the Washington Post and Co. ", "Bernie Sanders is the defacto leader of the Democratic Party.  With the destruction of the Clinton Political War Machine and catastrophic failures of the 2016 election this is now the time to allow Bernie and all progressive politicians like Bernie to take over the Democrats/DNC.  It is the *only* way the Democratic Party can survive at this point.  Placing Keith Ellison on as DNC Chair with the support of Sanders, Warren, and Schumer (so far), would be a very good first step.  We must get started *now* and continue moving forward by making it loud and clear: only with a huge organic grassroots movement funded and supported by millions of ordinary working Americans can the Political Revolution with its promise of fulfilling progressive policies and legislation can become a reality.  We must re-build and strengthen the progressive coalition from the local, to the state, to the national level.  This time, if we can re-create the movement that was built in 2015-2016, then we can succeed in 2018 midterm elections and beyond.\n\nObligatory: [Bernie Sanders - 30 years of Speeches](https://www.youtube.com/watch?v=RU3NKvvxcSs).", "I'm afraid we'll need to define also what *discrimination* means to these people. \n", "well those are the same kind of people that think that televangelists are genuine Christians so we shouldn't be that surprised. \n\nTrump is a stupid person's idea of what a smart person looks like ", "One may hate him or not but Obama is one funny guy.", "I \"voted for trump\" one time walking back to my camp site from the messhall at summer camp because I finished an entire box of croutons. ", "I look back now at the contortions I and other Clinton supporters twisted ourselves into back then. Sorry.\n\nNext time I am supporting whoever draws the biggest crowds and enthusiasm and that would have been sanders this time. I have learned my lesson and hope others do as well. ", "Very much so. Not the smartest people on earth. ", "Nah they just thought that if they repeated it enough, it would become true.", "I've reached the point where half of me is terrified but the other half hopes this is true just for the comedy.", "Oh this is going to make an excellent meme.", "I mean I hate Trump, but I see these arguments from your guy's side and think you're a bunch of hyperventilating bozos...  \n\nIf you think the majority of his supporters are fueled by rape then you claim at least 1/4th of the voting populace shares that sentiment.  Sorry, I don't agree, I think you've been brainwashed by your camp into thinking that just like the Trump camp has been brainwashed in their own ways.", "It's 'Nixon Going to China'\n\nhttp://blog.dilbert.com/post/145160928141/climate-change-and-trump\n\nThe Republicans may have accidentally elected a liberal.", "Also the wisdom of those same workers that tells them a New York billionaire who's never applied for a job in his life didn't pay many blue collar working men who helped him build his buildings, would actually be on their side when he got power. ", "The thing is Trump was/is used to having money. The one thing he never had was the power of a politican. Now he will know what it will feel like to command the most powerful position in the world.", "we clearly shouldn't build computers any more because theories of computer science and eletrical engineering might eventually be disproven I see no problem with this logic", "Nah they'll thank Obama or claim Hillary forced Trump to make the promises he did.", "Trump is really really, trying to hand this entire country to dems in 2020.", "Secretary of Homeland Security:  Governor Chris Christie Sheriff David Clarke\n\nAgriculture Secretary: Kansas Governor Sam Brownback\n\n\nThose are some laughable choices.  ", "&gt;Downvote all you want; i've learned from experience that downvotes in this sub just mean you're right.\n\n\nNow these are some of the most upvote worthy words I've ever seen in this sub. ", "&gt;Health and Human Services: Former presidential candidate Dr. Ben Carson Florida governor Rick Scott, former House speaker Newt Gingrich\n\nI want to die", "He's so mad people are protesting in front of his tower.", "The NRA will have to scare up a new boogeyman now that Obama didn't take our guns. \n\nWatch out for ISIS they're behind every bush. Better arm up!", "Oooh shit Bernie's back! Wubba Lubba Dub-Dub!", "I mean if people are talking about marriage in the religious sense, and their religion doesn't agree with homosexuality, I can kind of understand the thought process? But if you mean marriage in the legal sense, it seems bizarre to deny them a process everyone else has access to. I guess we need to define what marriage means to these people.", "People said he was trying to lose when he was running.\n\nI'm not sure you get it. Trump can call her a genius and 50 million people will believe it.", "The full quote is even funnier I think.  \"Call it reagancare, call it Paul Ryan-care.  I don't care... about the name.\"", "She needs to address why she didn't endorse Bernie Sanders to win his faithful back. A Warren endorsement would likely have given Sanders MA and gotten the media talking about him differently.", "It's so strange. One of the problems of the American public. Not doing research into the issues but they think they know enough to not like it.\n\nYou cannot keep the good parts of Obamacare without the bad parts. It simply won't work.", "hahahaha I was thinking this same thing - We get to see baby trump grow up and be forced to be an adult for once.", "The DNC cost democrats every branch of federal government.\n\nDon't sell yourselves short you deluded, incompetent, undeservedly righteous snobs.", "&gt; Where the Democrats go from Here\n\n&gt;  Bernie Sanders\n\nAs Beyonce once sang...\n\nThe the left to the left\n\n\n\n", "It would also spur entrepreneurship. How many people are too afraid to pursue the great business idea they have because it would mean quitting a job that at least gives them shitty insurance in case of a medical emergency.", "According to a [WSJ poll](http://blogs.wsj.com/washwire/2013/01/17/wsjnbc-poll-hillary-clinton-exits-with-69-approval-rating/) she left office with a 69% approval rating and just a 25% disapproval rating. *Decent* is an understatement. ", "Conservatives don't believe in facts. ", "The fact that his meeting with Obama lasted so long speaks volumes to me.", "There has been a huge smear campaign against Moore by the right for decades.  Yeah he's done and said some looney far-out shit, but his heart is clearly in the right place and he proudly stands up for American liberalism.", "He's not up there because he was made fun of in 2011.... Numerous interviews in the 90's showed that he had considered running but didn't wish to at the time but believed if the time ever necessitated for him to, by his determination, he would. Back then he repeatedly stated he didn't like the direction the country was going financially, and if it ever got so bad he'd want to do something ", "Don't forget that he's the guy who took most of the credit for passing NAFTA through the House.", "Hillary was arguably the best candidate in every single policy position. Trump's policy ideas had no basis in reality and Sanders' plans sounded the best but were a long shot at reaching. Hillary was realistic about what she could accomplish.\n\nShe just totally failed at courting a large demographic in working class whites and was/is extremely uncharismatic so she didn't fire up voters to hit the polls.", "*Passes lotion*", "There's a lot of evangelicals in America and a lot of them are creationists and climate change deniers. I went to a private religious school for most of kindergarten-senior year, and looking back it was brainwashing by the brainwashed. There's a few verses in the Bible that talk about how Christians will be mocked, persecuted and tested, and some think these issues are those tests and persecutions. \n\nEvolution? There's no proof of that, but there's tons of proof that the Earth is 6000 years old, those dastardly scientists just don't want you to see it because they hate God! \n\nClimate change? That's not real either,  and even if it was God's in control of the Earth. We just have to trust him. Those evil liberals are trying to take the place of God by taking the earth's climate into their own hands. \n\nI could go on about how weird the political beliefs were. Did a rich person once ask Jesus how could he follow him, and did Jesus tell him to give all of his possessions and wealth to the poor? Sure, but socialized healthcare is Satan weaving his communist magic on Americans and trying to force God out of the country. Was this nation founded on the principles of freedom of religion and speech? Sure, but everybody knows that we're really a Christian nation, and gay marriage is against the Bible so it wouldn't be fitting for a Christian nation to legalize that. Also fuck Muslims. \n\nAlbeit, most American Christians are not that radical. Hell, several of my teachers believed in evolution and were self-proclaimed socialists. But a lot of them genuinely believe that their faith is under attack by scientists and liberal ideologies like evolution and socialized healthcare, and that's why they respond so strongly to certain political parties that feed them these sentiments. ", "First it is physically impossible to deport 11 million people. To provide each and every undocumented immigrant in this country with the due process they are entitled to would grind the justice system to a halt. There are not enough judges and lawyers to process that many people. We do not having enough prisons and prison staff. We do not have spare police officers to round them up.\n\nAttempting to deport 11 million people would be a *massive* expense that would cost hundreds of millions, if not billions of dollars. And the pay off? You just eliminated the largest menial labor workforce, caused massive civil unrest by breaking up families and neighborhoods, and send many states into recession by removing hundreds of thousands to millions of consumers who spend almost every dollar they earn with local businesses.\n\nSecond, it would not stick. The majority of undocumented immigrants enter the country by overstaying their visa. They are entering the country legally. Harsher immigration laws also would not reduce the rate at which immigrants enter the country illegally. The rate at which immigrants cross from Mexico into the US depends on social and economic factors in Mexico, not the US. People desperate enough to find work for themselves or a new life for their family will attempt the crossing no matter how challenging you make the journey or how quickly you deport them. Mass deportation does not reduce the number of immigrants, just how fast we cycle through them.\n\nDemocrats do not oppose extreme measures on deportation because they are \"pro illegal immigrant.\" They oppose them because they are expensive, inhuman, and **DO NOT WORK!** You are proposing a feel good policy that accomplishes absolutely nothing besides wrack up the national debt.\n\nA path to residency and citizenship allows people who are going to be here, no matter what we do, to be safe and productive. \"Just enforce the law\" does not work because the immigration system was designed with no understanding of modern immigration issues. The immigration system does not work, and if you just \"enforce the law\" it makes the problem worse.", "You have to understand  what corvidspirit is saying in the proper context. He's arguing Trump shapeshifted/flipflopped his positions pragmatically in anyway he needed to attain 270. In his case  maximizing his chances of 270 happened to also result in pissing off nearly half the country but it was successful. Think of it as a trade off: him winning isn't directly correlated to making a majority of the country happy-its just how our poltiical system works. Until reformed, the name of the game will be 270. Now that he's where he wants, some assume he's going to pivot his tone to be more presidential/inclusive or whatever because that's in his best interest . Remember, it could very well be quite possible that what he did/say to  get elected is not necessarily the same as what he wants to do/say once he is  actually in a position of power. I'm not defending or supporting it but what corvidpsirit is saying brings up interesting points. I don't want to sound like Machavelli here but sometimes theres an argument to be made for pragmatism in effective governance.", "*gets out picture of Harambe*", "Hillary Clinton's true character will be revealed in the next few months. Was she in this race #ForHer or for us? Because we know Sanders didn't drop a beat every time he got kicked down. He starting fighting for the Democratic party that shat all over him once he lost the nomination and then immediately started fighting for us again once Trump won. We know where Sanders stands with out a doubt he stands with us, for America. I know Hillary is probably in shock, so we'll give her some time, but if she just walks away I think its telling of her character. All that influence she has could be of benefit to reforming the Democratic party behind Sanders, if she reciprocates the support the way Sanders himself did for her. Lets see if she continues to fight for us or if it was all always just about her. I have my suspicions...", "Accurate. My favorite Republican-ism is that they are for \"smaller government.\"\n\nNot really. They **love** big government but only when they're in charge. Republicans haven't been \"small government\" since 1960.", "Her slogan was \"i'm with her.\" Compare that to \"Yes we can\" or \"make america great again\" and it's clearly all about her ego. ", "Four of his campaign staff were TPP lobbyists. Two of the official transition staff are TPP lobbyists. The TPP will happen but with all the worker provisions thrown out.", "☭You don't make friends with Capitalists.☭", "Obviously somethings changed since 1998. Seems a whole lot more confused now. ", "&gt;Secretary of Homeland Security: Governor Chris Christie Sheriff David Clark\n\nOh shit ", "&gt;fill in the gaps with tax money from upper class ...republicans will be fucking ecstatic\n\n\n....have you met a republican?", "This doesn't surprise anyone who has been paying attention. He is even advertising family businesses on his transition webpage. Without full tax financial disclosure we can never know how much money he will make from profiting on business deals cut with knowledge of inside or secret info. What will he give away to pay off personal or family debts to foreign banks? We'll never know but absolute power corrupts, and this is the ultimate \"pay to play.\" ", "&gt; Howard Dean\n\nHoward did more to rebuild the Dems in 2005-09 than any democrat has done since.  He's the reason that Obama had the run he did and that we made gains (then) in the House and Senate and the reason the Democrats are using unified voter files and technology.  Edit:  And since Dean left as chair, the Dems haven't been able to [staunch the bleeding.](http://www.governing.com/blogs/politics/gov-democrat-howard-deans-fifty-state-strategy.html)", "aaaand South Park called it in September\n\nhttps://www.youtube.com/watch?v=TlqKFlU7YAs\n\n\"why did it have to be her. im so fucked\" Garrison Trump", "Obama was the best gun salesman ever.", "she \"feels\" less honest.  This election had nothing to do with facts", "Ok but she had to become 1000x more relatable to working-class white voters in the Midwest.", "I dont think the majority of trump voters are racist but rather that it seems they don't particualarly care. For a lot of poeple even if you yourself arent a racist sexist or a bully, supporting a candidate who arguably is demonstrates a tacit acceptance that those things are an ok byproduct of getting what you want. Its human nature I guess to do whats best for yourself.", "Oh man Trump is dead now! The Washington Post, a completely neutral journal cites ANOTHER completely neutral post, The NYT as it's source! Man! Trump is so pro establishment, that's why the big people like Soros and D.C love him! I can't believe Trump won 3% of the votes in Washington! So pro establishment it's disgusting!", "His cabinet seems to be on the track to being filled with lobbyists and GOP staples.", "&gt;Secretary of Homeland Security: Governor Chris Christie Sheriff David Clarke\n\n[David Clarke let a man die in his jail by denying him water for days.](http://www.jsonline.com/story/news/investigations/2016/09/15/death-county-jail-ruled-homicide-inmate-had-no-water-days/89960362/)", "I was thinking earlier today about how she thought it was her turn to rule over 300 million people.  That's pretty fucked up.", "He pulled out a projector and showed him unseen footage of the JFK assassination from a completely different angle. Then asked, \"Any questions?\"", "Not to mention I'm 99% sure the whole birther issue was a big ploy to rile up his base and keep him int he news so that he could have a bigger following for a presidential run.", "I would kind of hope/think that everyone that runs for president thinks they deserve it.  It would be kind of weird to go through all of that trouble otherwise.", "To be fair they will certainly do things now that it can be anything they want.", "Clarke is a straight up fascist.", "\"he'll take our guns!\"", "I wish John Stewart would run I could get behind him", "Bernie saying \"in my opinion Hillary isn't qualified\" vs Trump endorsing the chants of \"LOCK HER UP\" and saying \"You'd be in jail\" are not. fucking. equatable.  \n\n", "Benghazi!", "That kid is about to jump off the window.", "The very people who broke the unions outsourced the jobs overseas, sold Americans down the Hudson river to Wall Street, were just put into power by the very people they screwed so hard in the first place.\n\nDoh!\n", "The scary thing about this analysis - which I think is probably correct - is that there may not be much we can do to fix their problems. Like so many others have said automation did a lot more to kill US factory jobs than globalization did. There is no magic lever government can pull to revitalize rural economies. They are going to continue to suffer and lash out.", "90% of Senate incumbents and 97% of House incumbents were reelected.\n\nThat's some swamp draining right there. Who needs logic?", "Even though we have a Trump presidency coming up I'm extremely thankful to be alive at the same time as Bernie. Thankful that I can witness a true progressive leader. ", "It's like his party registration. Republican. Democrat. Republican. Democrat. Independent. Republican. Democrat. Republican.\n\nAnybody remembers the shit Kerry got for supposedly flip-flopping on a couple of things? Jesus Fucking Christ.", "As much as I didn't like it at the time this end justifies that Bernie chose to support and fight for Clinton. \n\nBernie was always going to have to keep fighting for real progressive policy whether Clinton or Trump won. If she lost while he was still standing against her, he would be blamed and people would believe it. Instead, there's literally nothing standing in the way of the fact that the establishment dug their own grave. He couldn't have *possibly* done more for them, and they failed spectacularly on their own terms.\n\nBernie is now the most liked and influential voice in the party because of his decisions.", "&gt;Obama campaigned to pull out US troops from the Middle East ASAP... but just look at how long it took him to do it. President Obama knew A LOT more than Candidate Obama on the importance of foreign affairs. He couldn't just simply pull out the troops like he said he was going to do. It has to be a strategic move and even then, after years of planning, we still created ISIS.\n\nWhile I don't disagree with the point you're trying to make, Obama wasn't able to withdraw the troops because Bush signed a two year commitment with Iraq that the US was bound to. As soon as the commitment expired Obama withdrew the troops - he withdrew a few weeks early actually.\n\n[Source](https://en.wikipedia.org/wiki/U.S.%E2%80%93Iraq_Status_of_Forces_Agreement)\n\nedit:\nFor those of you who don't remember, the press conference for this agreement is when [GW practiced his reflexes on international television](https://www.youtube.com/watch?v=duLds-TZMGw).", "Shower thought: maybe he really is playing 8D hyper Jenga because he is a multidimensional being who can cross through realities and holds a superposition on reality.  Meaning he can take policy positions directly at odds with each other without having that be nonsense.\n\nOr people are too stupid to just call the guy out for having no idea.  It's the emperor's new clothes and the entire media is like \"Wow, now he might not end Obamacare!\" when he did not say that.  He did what he always does and said nothing.", "I don't disagree about moderates but just thinking in terms of left/right like it's all a single line you move back and forth on, is way oversimplifying.  The message isn't \"shift to the left\".  It's \"go back to supporting workers and the middle class like you used to, instead of the billionaires like you do these days\".", "Nobody puts baby-hands in a corner...", "Aw crap we really will have pence...hide your uterus. ", "&gt; I understand their frustration. I understand not liking Hillary. But I DON'T understand how they couldn't see through his paper-thin smokescreen of rhetoric and complete BS.\n\nBecause they are Republican. Getting scammed by candidates like Trump is their cultural identity.", "Can't upvote this enough!  Yeah the guy who made his name building golf courses casinos, and skyscrapers represents the rural class.  Uh huh!  And they fucking believed it!", "But those will be poor people and Republican politicians don't give a shit about poor people. ", "Personally I think that opening the doors should include reaching out to more centrist Republicans. Drop the anti gun stuff that isnt research based (magazine restrictions banning guns on looks, demonizing gun owners), talk about how universal health care benefits businesses (one less burden for them and less bureaucracy for everyone), and get rid of the \"tax and spend\" label by focusing on the ROI from investments (paying $x now for education means we save $y in the future etc).\n\n", "He needs to stick around as long as possible...I don't see him kicking the bucket anytime soon though", "Trump looked shell-shocked in that meeting with Obama. Don't be surprised if he fakes sickness and resigns and disappears. \n\nI think the realization of the situation scares the fuck out of him. Oh well :)", "This is so tacky but that's what makes it so TRUMP.", "Yeah a 'real person' with the vocabulary of a fucking 4th grader and the sentence structuring of a 2nd grader. If this country weren't chock-full of fucking morons, that would've rightly been seen as insulting.", "The gun issue is a trap national Democrats fall for every time.  ", "Honestly the vast majority of his supporters DO NOT CARE. That's not why they voted for him. To many of his supporters, this was all a big game. Like a football game. They just wanted him to win - for no other reason than to beat Hillary Clinton. That was it - at any cost. All a game. The only thing that will get them to realize the mistake they made is when many of them lose their jobs under a Trump administration. Short of that, they do not care about the impact to the country or to minorities, or gays, or women, or non-Christians, or any other segment of society. It was a game. Their man won. In the simplest terms, that's all they wanted. At any cost.", "&gt;Reddit has lived in an echo chamber of calling Trump supporters stupid.\n\nDude you must be new here. All summer, Clinton supporters were stupid, while Sanders supporters were children.", "I've been debating with Trump supporters since the 8th. I swear it's different than any debates I've had before... the facts are irrelevant they ignore everything I say unless it offends them, and they all question my intelligence once they run out of counter arguments. I even ended an argument by bringing up the Dunning–Kruger effect to one of them today. I'm not that smart but it feels like I'm an adult playing basketball against a child. I feel like a dick for saying that too because I'm sure that there are plenty of Trump supporters that have a decent argument. I just haven't found one yet. \n\n\nI think I've even called a few of them worse than social justice warriors. ", "[Yup](http://i.imgur.com/r7eaEUX.jpg)", "&gt;Democrats are going to have to be more like him\n\nI think more specifically, at some point the ideology of the Wall Street Democrats is going to have to be rejected. Not necessarily right now, but by the 2020 or 2024 elections, Democrats need to have a consensus that the Clintons and Obama were on the wrong track. Otherwise you're just going to have a situation like we saw with Obama and we're seeing now with Trump: populist rhetoric gets a candidate elected, and within days the establishment's usual suspects emerge from the woodwork and fill cabinet spots and other positions of power. If the Wall Street Democrats are all marginalized by then, real progressives can fill those spots.", "Maybe we could cut back our military spending and funnel it into job retraining programs for people displaced by the loss of those industries. I wonder if that would be the kind of government assistance those people could get behind.", "a madman is the only safeguard from the dominionists. these are truly strange times", "&gt;Sanders eyeing Senate leadership bid  \n  \nHow do we help?", "I've been saying it since the Primaries. Whoever fucking thinks this guy is an outsider is missing the bigger picture. He is of the same billionair capitalist class that influences elections with their massive donations to politicians like Clinton. There was NO outsider here. Sure he had unconventional approach to the formalities of political discourse but he nor his administration is going to be filled with so called \"outsiders\" or anti-establishment.\n\nWe live in an era of global capitalism and people call this guy anti-establishment. What fuck are you all on.", "It's too late now. Whether you voted for Bernie or Hillary in the primaries what does it matter now? \n\nWe need to unite and get ready to lead the opposition against Trump. Join us at /r/political_revolution", "It's basically Cockney rhyming slang.\n\nvoted for trump = took a dump. \n\nAlright mate was just in the kermit voting for a big fat Donald when I couldn't believe my minces the bog roll was gone, I had to wipe my aris with the currant bun and who was on the cover only president dump himself, if you can Adam and Eve it", "He even has upper class toys. We had hot wheels toy cars like that. This kids got limos and a super car", "Can we please call taking a shit \"Voting for Trump\" now?", "Y'know what? I'm actually optimistic. I think a trump victory will finally motivate a true progressive movement in the Democratic party and I think leaders like Bernie Sanders, Elizabeth Warren and Keith Ellison could help bring about that movement.", "&gt; Short of selling his businesses they say, he won’t be able to reassure the American people that he’s not acting in his own interests.\n&gt; \n&gt; Never before has a billionaire with so many diverse business entanglements directly affected by White House policy taken the presidency, and the potential conflicts of interest facing Donald Trump are so unprecedented that U.S. ethics laws weren’t even written to account for them.\n&gt; \n&gt; President-elect Trump could hold sway over regulators’ investigations into banks that have lent his businesses hundreds of millions of dollars. He’ll be directing relations with foreign governments, such as Saudi Arabia’s, whose rulers have bought everything from real estate to a yacht from him as he struggled to pay off debts.\n&gt; \n&gt; Watchdogs are already scoffing at Trump’s plans to turn his sprawling global empire over to his adult children – whom he also named to his transition team on Friday. Short of selling his businesses, they say, he won’t be able to reassure the American people that he’s not acting in his own interests.\n&gt; \n&gt; “If he doesn’t address this problem, every single decision he makes will be questioned as a conflict of interest,” said Paul S. Ryan, vice president of policy and litigation at Common Cause. “President-elect Trump campaigned against corruption, and America deserves his making good on that promise and cleaning up government.”\n\nIt's quite interesting that all Trump supporters couldn't stand for the Clinton Foundation to remain open if Hillary became president but remains silent on this. ", "My dog voted for trump the other day and then stepped on his vote and came inside and left a trail of votes all over the fucking place. ", "Trump's plan is NOT a blind trust. His businesses would have to be completely sold off and his assets managed by others. It is especially corrupt to call it a blind trust and then involve family members in running the transition during which time they will have access to classified information. ", "They used the ignorance and conformist attitudes of the serfs against them and it is so sad. I would be laughing my ass off if I had a private island somewhere so far from society that all I would have to worry about was illness or nuclear fallout but I am not because I don't . ", "File under *shit i really should know about our government but had to google:* \"No the President cannot fire the Vice President. The VP has won a national election and has taken a Constitutional oath. He can be impeached by the House and removed from office if convicted by the Senate, but the President can't just arbitrarily get rid of the VP. \" :/", "Don't even try to make sense of the cognitive dissonance. Trump is everything they believe they hate Clinton for in droves. ", "Well 60 million people still supported the guy after he was caught talking about grabbing women by their pussies.  Sounds pretty rapey to me.  He also put down a muslim family who had lost a son in the Iraq war fighting for our country.  Sounds pretty racist to me.  Are you suggesting this doesn't reflect on his own supporters somehow?", "Yeah I saw Michael Moore warn people of what would happen but hardly anyone listened.  He was completely right on how it was going to go down.", "My daughter \"voted for Trump\" the first time we let her run around with no diaper.", "Blue collar American votes for billionaire who eats chicken wings and pizza with a knife and fork because \"he's just like me!\"", "Sanders supporters were annoying as the trump supporters were.  Clinton however ruled the front page of r/politics.  To find any info on Hillary and her shadiness you had to go to the shitty ass The_donald.\n\nThe front page of politics was covered in \"Trump said this Trump said that\"  While true it provided nothing of substance and only furthered the divide.  \n\nIf you honestly think that the front page of r/politics was overrun with articles talking about how clinton and sanders supporters were idiots then you are delusional.  ", "Which is exactly why he is such a shit-stain. He tapped into the basest most racist sentiments in the country just to help himself.", "He plans to put his assets into a \"blind trust\" that will be overseen by…his children. That is NOT how a blind trust works. Shady to say the least.", "People didn't vote for Trump in Michigan and Wisconsin and Pennsylvania because he's PC or racist.  Some sure...but all of them? No.\n\nThey voted because they were sick of a political system that had fucked them over for the last thirty years.  They were sick of seeing CEO's and politicians take millions from lobbyists.  They have no jobs, they have no healthcare, and no hope.\n\nTrump spoke to them like no politician ever did.  That's why he won.\n\nWe can call them racists, or we can talk to them about their needs.", "someone in that party (oh sorry forgot he's \"not a Democrat\") is picking up the pieces and leading. \n\nIt hurts to think about how close we may have come to him leading the country right now. ", "Yeah but they are our (R) fat cats!", "Except of course Bush would fall in line.\n\n\nWhen Trump starts straying off message he may encounter a little accident.  If I were Trump, I'd fire Pence and replace him with someone crazier or perhaps even a Democrat, just as an insurance policy.\n\n\n(though I don't think Presidents can actually fire the VP)", "Hijacking top comment. Join us at /r/political_revolution. Join /r/BernieSanders too. We're going to need every single person who's prepared to change the Democratic Party and lead the opposition against Trump", "His face when he won was priceless. He was going to be the host of his own network where he could do whatever he wanted and people adored him and now he has to do the work of being president while thousands are protesting all over the country, including on his front doorstep. He's hated even by a lot of people who voted for him because he's already started breaking all his promises. In every public appearance since he was elected he looks like someone just drowned his kitten.", "Seriously that was the end of the conversation. She got off the phone. I guess it's time to do some thinking.", "What bully tactics are you referring to?  I see a lot of pent up aggression towards the right largely due to their complete lack of reason.  No compromise.  Racism.  Hatred.  Ignorance.  But when they're called out for it all of a sudden they're being bullied and poor them?  Somehow I feel that the onus to reach out is much more on the right than the left, and I doubt we will see any such effort in the years to come.  Unfortunately.", "The entire summer she did rule the front page. It was all about her emails and in the comments it was how stupid her supporters were to still trust her. Then it was about her rigging the primary and about how stupid her supporters were to still trust her. Then it was the DNC leaks and how stupid her supporters were to trust the DNC.\n\nThen it turned out that the emails weren't a crime, the primary wasn't rigged and the DNC leaks were just interoffice bickering.", "I mean... They are stupid.... Or is that not PC enough for you?\n\nAnd Trump didn't win because we called his voters dumb. He won because Democrats and liberals are naive over-idealistic morons who didn't come out to vote because they weren't inspired by Hillary. Trump got fewer voters than Romney in 2012. Hillary just lost 3x that amount and so she lost. She depressed the Democratic turnout. \n\nYou can keep feeding yourself this \"we only voted Trump because you bullied us!\" meme, but it's a pretty transparent attempt to get liberals to stop calling out your stupidity.", "Including a lot of the fools who voted Trump because \"we gotta shake things up.\"", "I for one, hope she takes her well-earned retirement and allows the party to move on. ", "my puppy pooped on my shoe the other day. not sure what that means politically. ", "The sentiment I'm seeing on The Donald regarding the victory is less of a \"This is good because he is the best candidate\" and more of a \"LOOK AT WHAT YOU MADE ME DO\"", "The best thing for Bernie was Hillary losing.", "Exactly this! Where's the uproar from Trump supporters about this corruption? This is something Berlusconi or Putin would've done. ", "He and Obama made a secret deal where Obama still makes all the decisions but just tells Trump what to do.  Then the Republicans won't block stuff because a white guy is suggesting it and Trump won't have to do any work.", "Even if Bernie is not the next president he is fundamentally changing the Democratic Party. We will never forget his contributions.", "The fact that he talked to his audience like a real person and not like a political robot is what gave him the edge over Hillary. You can whine and call him xenophobe racist all day but the bottom line is Americans were tired of spineless shills like Hillary getting up on stage and talking through their party's agenda and sounding so fake and politically correct. She is *wayyy* less relatable to the Average blue collar worker because of how fake she comes across and the fact that she CHEATED to even get the nomination. \n\n\n\n\n\nTLDR: Billionaire trump isn't very relatable. Fake multi millionaire Hillary who cheated is even less relatable. \n", "Except she did several shady things in the primary and four members of the DNC have been let go because of the info that's come out...\n\n\nI mean there's proof of payment and collusion... it's not even debatable, it's facts.\nClearly I'm not going to get anywhere in this discussion.  Look, trump sucks but it does not excuse what Hillary did.", "Send him campaign funds and write your democratic senators to support him.", "&gt;The fact that he talked to his audience like a real person \n\nYes he was the master of the ten word answer.  Which is why he won the half of American that can't comprehend eleven word ones.", "Wouldn't that be amazing and all the hard right are suddenly cheering on progressive platforms that a few years ago were literally demonic to them. Would be a sight to witness.", "FOR 8 YEARS! You think people would realize their irrational fear but instead they just buy another gun. ", "Even then you wouldn't be laughing as your island sunk beneath the rising waves.", "Prove me wrong.\n\nEvery Republican since Reagan has used the exact same strategy. Trump just used crasser words.", "Trump's entire campaign was projection.\n\nUnfortunately half of the voters are idiots. \n\nIt's downright embarrassing to be associated with these dimwits by way of nationality.", "Never thought I'd hit the time in my life where I can say the views of the Pope are presently more progressive than the president-elect. ", "It's probably not a bad idea. Teach people what discrimination actually means versus just not agreeing with an idea, view or lifestyle. Otherwise if you're forcing people to live with something they truly don't believe in, could everyone cry discrimination?\n\n\nI don't know, I'm tired and thinking way too hard about this.", "Ugh. Hillary's camp refused to even meet. The Deputy Foreign minister said there was \"not productive\" contact.\n\nHillary is politically dead. Like Trumpers wanted it. It's all about him now buddy.", "LMAO. So what do you think you're going to do? You got him for four years.", "That's his secret -- he's always been confused.", "Is Jewish was a carpenter, denounces the moneychangers...", "Trump is the ultimate embodiment of the southern strategy. A rich New Yorker riding to power by exploiting the bigotry of poor rural white Americans.\n\nDon't let anyone tell you he's not a real Republican. He's as Republican as they come.", "i find trump less scary then the republican senate/house/supreme court which has its own agenda that it will easily be able to push.", "We need to spread the meme. Get it to AskReddit and the other big subs.", "Gravity shouldn't be taught as fact then.\n\nJesus. I don't think Creationists understand what the word \"theory\" actually means. It's very different from a scientific hypothesis.", "That sounds good but I'm not enough of a policy wonk to say if it would actually work or if they would be in favor of it. Ironically, lowering the cost of college is one form of a \"job retraining program\", which Clinton promised to do.\n\nA big question for this kind of plan is whether or not jobs can return to these economically depressed areas. People may not be so happy about an offer to help them transition to new jobs if it means abandoning their homes and moving to urban areas.", "Yeah. Everybody enjoy your protests while you can. If Clark is in Trump's cabinet you will have no sympathy whatsoever coming out of the White House. That dude is a fuckin skullcracker and a jackboot. The militarization of law enforcement and THAT FUCKIN DUDE will be able to declare you terrorist groups and enemies of the state. Not even alarmist that shit is real.", "It was probably the best moment I've had since Tuesday night. Not that that's a high bar lol", "Oh please tell us how the rest of that conversation went!", "Was it Left shoe Right shoe, or are you one legged?", "Did you see his face during Trump's speech? If the next four years are as bad as I'm afraid they'll be this kid will be emotionally fucked. Probably already is. I expect that stuffed lion was around for him more than his father.", "All is forgiven. Move forward.\n\nStronger together ;)", "He's not wrong though.\n\nYou can't ditch Obamacare without a valid replacement, Trump and the GOP has no replacement.", "Hillary is done. ", "I think he's saying you're a moron if you based your vote on how relatable a president is and not their fucking policies and qualifications.", "They don't care just look at The_Donald. To them idiots, it's all about 'winning' and being 'right', I don't even think they give a fuck about what he does, as long as he won and they were right. They aren't looking at the situation as 'How could this be improved', these are the people who look at politics as entertainment, rather than a means to evolve and better the world.", "The periodic table is just a theory no one has seen any of these atoms and elements and molecules, a new theory might come along about how chemistry works.", "Schumer did go along with Bernie in backing Ellison so I think there is opportunity with him. I don't think Bernie is thinking senate minority leader, I mean he hasn't even officially been a party member, but he should definitely be given some leadership. ", "This is the fallout from automation in factories.\n\nWhat are we going to do when self driving trucks take over (and they will sooner than you think) and one of the largest employee groups in America lose their jobs. Almost every trucker is going to be unemployed with literally no useful skills for the economy.\n\nHow much of rural America is built around supporting those truckers? The cafes and hotels and truck stops that may be the final source of income for many small towns along the interstate... with no more customers. Yes the trucks will still run on diesel but no drivers to eat at the truck stop or stay in the hotels. Hell the refueling stations will probably be automated.\n\nI drove 4500 miles this summer through the entire center of America, from south Texas to northern Minnesota (almost border to border) while on that excursion this was the fevered thoughts going through my head. The geek in me is so excited for the new dawn of robots, but the small town kid who grew up in my dads convenience store waving at Canadian truckers and seeing them load up on \"good American cigarettes\" before heading over the border... well that kid in me saw a horrifying amount of people who are on the brink of losing everything. From truckers and dispatch people to small town waitresses working in greasy spoons to help make ends meet. Gone.\n\nAmerica already has the worst safety net in the western world, and with the political climate the way it is, I wouldn't bet on anyone trying to improve it. Hell... people on the left are trying to stop it from being completely shredded and just maintain what we have now. Paul Ryan wants to privatize Medicare ffs. \n\nI wish we could have an adult discussion in America about these very real, very frightening things... but we can't. It's too hard, it's too frightening. We need universal healthcare and a minimum income to provide for these people when the automation takes their jobs away. But it's not going to happen. I just don't see it being something that can even be brought up without people screaming \"communist\". The same people who will very soon lose everything will fight tooth and nail to stop anyone from actually helping.\n\nNow I'm depressed. More.\n\nEdit: Thanks for the gold!\nEdit2: thank you all for the discussions, this is great and makes me believe in Reddit again ;)\nEdit3: fixed loose to lose ya grammar national socialists :D", "&gt;Or people are too stupid to just call the guy out for having no idea.\n\nWatching from Europe it seems that Trump voters simply don't care for truth, ideas or coherence. They don't care. They think about Trump like football fans think about their team. It's a form of faith, and it's far from the rationality required to distinguish facts from bullshit. Or emotions. \nJust think how Trump convinced his electors that he was an anti-establishment choice. It's totally baffling. We only needed one day to discover what cabinet he had in mind, and what he really meant with his statements. \n\nBut more importantly, you american fellows need to understand what the roots of this faith are, and if you want to change it you have to act on the soil. Moore has a point.\nA large chunk of your voters are uneducated, frustrated, poor, intellectually weak people, exposed to any kind of populism. They don't have the tools to defend themselves.\nThey will *feel*, not *think*. They will *believe*. \n\nThis is the true weakness of a democracy. Democracy doesn't work well without freedom, and there's no freedom without education. Is an uninformed, ignorant choice, a true choice?\n\nWhen Hillary arrives at the debate dressed and groomed like a sci-fi intergalactic pope in white robes, those people will *feel* far from her, and won't *believe* her. Trump's message was so simple, so minimal, so empty, everyone's got it. Even the most simple mind. The media, baffled, has worked as an echo chamber, repeating his bullshit over and over until they became believable. He tricked the media. They did exactly what he wanted. Voices continuously repeating his name, monitors constantly showing his face. They mocked him, and he grew stronger. The more and more people went against him, the more his rhetoric \"I'm all alone against the establishment\" grew stronger. \n\nAnother element is that: it's been a very entertaining campaign. Entertaining like a trainwreck. It's awful, but you can't stop watching. I found myself following closely USA politics as I do with Italian politics, watching live all the debates. And I never did that. Just because of Trump. I expected entertainment, and I got it. \nCan you imagine how many americans did that too? How much attention he got for his attitude? \n\n*\"Finally someone who understands me! Someone who thinks and talks like me! Someone I can actually understand!  And he makes me laugh too! Because he says bad words in places where he shouldn't! SO FUN!\"*\n\nI may be exaggerating, but I think part of the votes were votes for the entertainment. Berlusconi held its power almost 2 decades playing with TV mechanics applied to politics. \n\nHowever I believe the main reason is that people wanted to say a big \"FUCK YOU!\" to all of those faces they are used to see around from decades, that they feel they betrayed and ignored them for a long time. And that FUCK YOU was incarnated by Trump. It doesn't matter if he had any believable solutions to their problem, that FUCK YOU felt very good. We can't know how long that feeling will last. \n\nThey felt Trump understood them. \nThat's the job of a salesman as Trump is. Take the form of your listener like a Ditto, mimic them to communicate and establish a bond with them. They will trust you and they will buy it, it doesn't matter what you're really selling to them, because they're buying... you. \n\nI've seen that in Italy with Berlusconi, I'm seeing it again now with Trump. \n\n(Apologies for my bad english.)\n", "\\&gt;posts long message in flawless English\n\n\\&gt;apologizes for English \n\nFucking Europeans I swear ", "Trump is playing peacemaker now.\n\nThat's not necessarily a bad thing but it is a jarring change of rhetoric.", "On a side note I'd just like to say that we're the only first world country without universal healthcare and yet we still think it's our responsibility to be the world's policeman.", "&gt; When Hillary arrives at the debate dressed and groomed like a sci-fi intergalactic pope in white robes people will feel far from her,\n\nThis is the best sentence I've read in a while.", "An example of Stockholm syndrome if I ever saw one", "It's predictable. He treats people like shit until he beats them or gets what he wants from them and then they are the greatest. He did it with rubio and bush and now clinton. ", "I feel that based on his words here, he has taken the mantle and he will lead the left now. He is rising to the occasion, and he isn't going anywhere.", "Moore's point that he will unintentionally break laws seems totally plausible. A candidate who had previous government or military experience is exposed to restrictions laws, and classifications, and even with experience, a lot of them fuck up. Trump is a private sector guy. He hires lawyers when he fucks up. This is different. He's a public servant now. ", "Weird that sounds like Clinton's plan for West Virginia coal miners. Oh well.", "if Trump rightly, concerns you, then Pence should scare the shit out of you.\n\nthis is a guy who wants to force women to [hold funerals after they have abortions](http://www.huffingtonpost.com/entry/think-trump-is-scary-check-out-mike-pence-on-the-issues_us_57f137d5e4b095bd896a11db), who minimizes the [health risks of smoking](http://www.snopes.com/mike-pence-smoking/) and who believes that [gay people can be cured](http://www.politifact.com/california/statements/2016/jul/28/gavin-newsom/true-mike-pence-advocated-conversion-therapy/), like most good evangelical Christians he is a creationist who [doesn't believe in evolution](http://www.forbes.com/forbes/welcome/?toURL=http://www.forbes.com/sites/shaenamontanari/2016/11/10/vp-elect-mike-pence-does-not-accept-evolution-heres-why-that-matters/), in short, he would love to take us back to 1950\n\n\nedit: spelling/links\n", "If you look at the data. Less people voted for Trump than McCain or Romney. Trump didn't win because he convinced people to vote for him. Trump won because Democrats stayed home.", "Which is part of what is scary about Trump. He'll really hurt the economy and his reelection pitch will be a barely veiled version of \"I had good ideas, but immigrants, Muslims and BLM stopped me!\" \n\nAnd they'll send him back too", "I'm on Obamacare and I'm a 62 year old white entrepreneur who has a 6 figure salary . I don't qualify for any subsidies. It was a god send. Luanching a new company I needed to leave my last companies health plan. Before Obamacare I was looking at $1800 a month just for me. In New York State I was able to get a great plan for  $450 a month. But a few miles away, across the border in Jersey, it was twice as much. \n\nThey need to fix the problem  of such a discrepancy from state to state. But Obamacare itself is great. And it is certainly better than the alternative. ", "That's what I was hoping for but his cabinet certainly doesn't bode well, unless he starts dramatically firing them one by one, *The Apprentice* style.", "Right?  They literally brought flip flops to rallies to make fun of him.  Amd he only flipped on like two issues!!!", "The con is not past tense. It is still ongoing. I think most of this post-election analysis overlooks one of the most momentous and dangerous aspects of the equation here. \n\nRemember the talk of Trump media Trump TV and so on? It's already a thing. Trump media exists. They don't need a new cable station, they have Breitbart, Drudge, World Net Daily, call in talk shows, on and on. \n\nTrump media was a potential money maker if Trump lost the election. Trump media will be 100X or 1,000X more useful as a literal propaganda arm of the state. Think of what a Trump administration, which has allies in Republican controlled senate and congress, can do with alternative media streams that shape public viewpoints in their favor as they distribute billions of dollars in government funding, while privatizing the nation's infrastructure and quietly beefing up the nation's police state. \n\nSteve Bannon ran Breitbart. Steve Bannon is slated to be Trump's chief of staff. His real job might as well be media collaborator and propaganda czar. Think about this. The Trump administration does not have to take over media outlets to run their ongoing propaganda. Those outlets already exist. \n\nThere were already countless outlets ready and willing to churn out pro-Trump propaganda for the sake of monetizing ad clicks and traffic. How much more intense will their loyalty become when they are able to further monetize connections to the state via Trump Republican controlled Washington. \n\nAnd then there is Facebook, the most powerful vector for spreading demagogic propaganda in the history of the world. Republicans spent years cultivating their base to believe the traditional media cannot be trusted. They have created the ideal conditions for a walled garden. They don't have to kill off their media rivals, they've already poisoned them. And Facebook is the natural vector for delivering propaganda via socially created echo chamber, with the consumers of propaganda congratulating themselves for having the \"real\" story (as opposed to what the fake WaPo or fake NYT says on and on). \n\nOne of the big reveals of this election is how powerful propaganda is. And how easy demagoguery is. Trump demonstrated in real time how easy it is to lie constantly and nonstop with no consequence. Combine that with the social influence of Facebook, walled garden media consumption, and masters of the manipulative arts like Bannon running things. \n\nThe Trump organization already has Ministry of Truth apparatus as powerful as anything Russia or China might have dreamed up, as powerful as anything Orwell might have imagined. \n\nYou think the con was past tense? Wait til economic stress hits. The next recession or financial crisis or terrorist attack. Don't be surprised when the same family members who inexplicably supported Trump start muttering about enemies of the state. They are being programmed, like computers hijacked by botnets.\n\nEvil has figured out how to weaponize stupidity and gullibility on a scale and scope never before seen. All the infrastructure was there, just waiting to be picked up. ", "You mean taxpayer funded public education? We had that candidate. ", "It is really more like 96% of Senate incumbents. 6% didn't run for reelection.", "And now he's putting those exact people in charge that's the point of this thread, let's get back on topic here.", "I completely agree with Moore. Trump's personality (that of an impulsive narcissist) just doesn't jive with being POTUS. He has an incredibly short attention span and is a novice at politics. Can you imagine him sitting still and being educated on Foreign Policy 101? I think at the beginning, he'll give it a shot, and say, \"I'm going to be the best President anybody ever saw,\" but will quickly get frustrated when he realizes he can't do Twitter all the time, when he has to sit in long boring meetings, when he realizes just how fucking stressful being President actually is. He'll inevitably do something to fuck it up, and blame Congress, Obama, the media, whoever...anybody but himself. Pence terrifies me though. ", "I've been saying exactly that except I've said he'll blame it on an Obama hangover. I absolutely agree that without a *dramatic* turn of events the same people will vote for him again. Things like tax cuts for the 1% and walking back on Obamacare will be overlooked. It'd take something like an actual mass deportation and resulting labor crisis in the ag industry for his voters to turn on him. ", "There was a perfect meme of that face he make where he looked shocked and it was \n\n\"When you lie on your application but get hired anyway\"", "They straight up just made up some bullshit \"She's more electable\" \"But polls and data say the opposite\" \"She's more electable\" \"...\"", "It's almost as if he said whatever he wanted just to get elected. ", "In some shitty way Trump president helped to reform the DNC", "Either laughing his ass off or so utterly confused that he actually won. Looking by the way he's been acting recently probably the latter.", "There's a difference between being a representative and being a governor. \n\nAs a representative you push for your special interests. \n\nAs a governor, you do what's best for your state. \n\nPence got the endorsement from the much-liked former Republican governor Mitch Daniels (now president of Purdue) basically with the promise that he wouldn't pursue a social agenda. Mitch Daniels was liked because he focused almost exclusively on the economy and government efficiency. He gave no fucks about social issues, and it was implied that Pence, as the successor of Daniels, would set aside the social dogmas that he was known for and govern a state that was on a very good path, economically, after Mitch Daniels' two terms.\n\nHe didn't do that. \n\nFrom day one, Pence didn't govern--he played national GOP politics. Whatever the big firey debate of the day was among the national GOP, he grabbed ahold of it and pretended to be its conservative crusader, even if it had absolutely zero relevance to the state of Indiana. He spent time, money, and resources on championing issues that Hoosiers didn't care about or didn't support, because he wanted to pander to the National GOP's ultra conservative base for his future career. Essentially, he was using Indiana as a stepping stone. He never cared about being governor. He always had higher aspirations, and the governorship was a stepping stone to a higher federal office. Most Hoosiers, left or right on the political spectrum, espouse this opinion about him.\n\nAs I said before, Mitch Daniels literally gave no fucks about social issues. Indiana is generally a conservative state, but it's never been a state particularly hung up on social issues, and it's never been a state that follows the national GOP's social platform. Indiana has, for as long as I've been alive, been a business Republican state--politicians like the Bushes, Mitt Romney, etc. We voted Obama into office, and prior to Mitch Daniels in 2005, we had 16 straight years of Democratic governorship. Indianapolis, the capital and largest city in the state, routinely switched between Republican and Democrat mayors, and it has managed to have long-term plans and continue its momentum regardless of which party is in office.\n\nSo Pence, with his national conservative GOP politics, has been an aberration that has directly harmed Indiana's image and its pocket book. \n\nIn the three years since Pence took office, he:\n\n* Pushed through legislation making harsher penalties for drug crimes against the protests of numerous major legal organizations including the Indiana Bar Association, as well as most Hoosiers\n\n* Inherited a phenomenal state balance sheet from Mitch Daniels and used it as an excuse to push tax cuts so extreme (would have caused a tremendous deficit) that the Republican-controlled Congress shut him down\n\n* Tried and failed to amend the Indiana constitution to ban gay marriage, despite widespread polling that showed that Hoosiers didn't support it, and despite the vociferous condemnation of virtually every major business in the state\n\n* Since his gay marriage amendment failed, he literally, as payback (not exaggerating, the signing ceremony was invite only, no media was allowed or invited, but someone leaked a picture that showed Pence surrounded by well-known anti-LGBT extremists), came back with the Religious Freedom Restoration Act which was a genuine political circus. It humiliated Indiana on the national stage, directly harmed Indianapolis, and was met with, perhaps, the fiercest backlash by the people of any state in the Union. The extraordinary protests of Hoosiers and businesses allowed the state GOP leaders to basically coerce--to his visible chagrin--Pence to amend the law and \"fix it\" (this was actually the [front page](http://media.theindychannel.com/photo/2015/03/31/indy_star_fix_this_now_1427838279029_15914269_ver1.0_640_480.jpg) of the biggest newspaper in Indiana). \n\n* The RFRA was such a debacle that Pence ended up hiring an expensive out-of-state public relations firm to heal Indiana's national image. He couldn't answer why he chose an out-of-state firm. He couldn't answer why he chose such an expensive firm, when there are many firms in Indiana that could have done the job. It was eventually canceled, and was yet another waste of taxpayer money. To date, the RFRA has cost Indianapolis (a city that fought against it, changed the official tourism website to rainbow colors, and hung a huge rainbow banner at the airport) $60 million, and the total cost--to the economy and reputation--to the rest of the state is unknown. \n\n* During the gay marriage supreme court fight, he literally sent the Indiana attorney general to *other states* to advise them on how to craft their laws and fight gay marriage nationally. He did this on the taxpayer dollar. He continued to spend taxpayer money fighting gay marriage in the courts and with lawsuits despite, at the time, everyone knowing what the Supreme Court decision was going to be. It was basically a political stand by Pence; an expensive political stand that Hoosiers didn't support.\n\n* He fought to pass a law preventing cities from passing their own minimum wage statutes. Is this \"small government\"? \n\n* He has acted like a strongman (think Turkey's Erdoğan), doing everything in his power to make Glenda Ritz, the state superintendent **and an elected official**, quit her job, and barring that, stripping her of the power given to her by the Indiana constitute and the Hoosiers that elected her through backroom deals, conspiracy, and highly technical legal challenges. Just Google \"Mike Pence Glenda Ritz.\" You could write a thesis on it. \n\n* Everyone, literally everyone, was on board for receiving a *huge* federal grant for preschool funding. The Indiana Department of Education was literally in the final stages of the application process--and the federal government was happy with Indiana and going to give us an especially large chunk of money--when Pence came in and shut it down for no reason because accepting money from the feds became politically untenable among the national GOP tea partier crowd. And, of course, you can't be elected president--Pence's eyes were always on the future--without support from the GOP's far right base. After shutting down the process, he has recently been opining that it would be a good idea to get federal money to fund preschools... A year after he shit all over the Dept of Education's proposal to do just that. \n\n* The HIV epidemic in southern Indiana is out of control and among the worst in the country. Of course, we could provide free needles for heroin addicts like has been done in many states to curb HIV problems, but that is politically repugnant to Mike Pence. He also managed to get the Planned Parenthoods in that part of the state shut down, eliminating the opportunity for poor people to get tested. The HIV epidemic, which never had to be an epidemic, continues, and Pence gets to push the problem on our future governor as he goes to join Trump on the national stage. \n\n* Speaking of Planned Parenthood, Pence is highly proud of his accomplishment at passing the single most restrictive abortion law since Roe vs Wade. The law, HEA 1337 is far stricter than anything even in the Deep South and is almost certainly unconstitutional. He knows that it's probably unconstitutional. Nevertheless, Indiana taxpayers will spend millions of dollars for our attorney general to fight the law all the way to the Supreme Court, just so Pence could make his political statement. \n\n* He literally tried to make a state-run news agency that he would then give exclusive interviews and access to. I don't even know if that's legal, but he tried to do it and was promptly crucified by the media and even his own party. \n\n* He asserted authority to ban Syrian refugees from being settled in Indiana. He has no authority. No governor has. He knew that, but he was planning to be a GOP presidential candidate, and he needed to show that he was strong and anti-Muslim refugee to appease the national GOP base. He took leadership role in this discriminatory crusade, appearing on national TV to preach his ignorance. This particular event managed to throw multiple refugee settlement organizations into disarray--which, by the way, actually include the Catholic Church of Indiana (the arch bishop of Indianapolis publicly criticized the governor)--and several Syrian refugees which were well into the process of moving to Indiana had to be relocated to another state. Pence didn't back down until the courts affirmed that his order was unconstitutional.\n\n* He shut down a highly successful energy efficiency program--one of the first in the nation, making Indiana a trailblazer--initiated by the Indiana Utility Regulatory Commission with the support of previous governor Mitch Daniels. He did this for no good reason, other than to signal to his far-right constituents that he was fighting against Obama's evil despotic EPA. \n\nThis is all just in his three years in office. He is reviled across the state, and especially so in Indianapolis. There is (was--now that he's the VP nominee, he can no longer be governor) a bipartisan *Pence Must Go* campaign to get rid of him, and there are literally [billboards](http://media1.fdncms.com/nuvo/imager/u/original/3821872/pmg_billboard.jpg) and [yard signs](http://media.theindychannel.com/photo/2015/04/17/16x9/_Fire_Pence__signs_go_up_after_RFRA_2839710000_16967639_ver1.0_640_480.jpg) plastered all over the city. Pence is, by virtually all objective measures, one of the worst governors in recent Indiana history, at least in terms of working for the benefit of the state. He has basically focused on far-right Christian social conservative interests to the clear detriment of all else, most importantly the current and future well-being of the state's reputation and economy. \n\nEdit - From /u/masamunecyrus. Thanks /gold!\n\n", "One of the reasons I thought Bernie had a better chance that Clinton against a republican was his history of supporting the second amendment. Whether I agree with it or not his stance is much more acceptable to people across the spectrum (let's put it this way: any progressive would rather see free education at the cost of limiting gun sales.)", "There is one difference. I am deeply considered about Trumps need for revenge and short temper. I am really really scared he has nukes.\n\nWe progressed from the 1950's once before. We can do it again. You can't progress your way out of nuclear winter.   ", "And I thought season 1 was totally unbelievable. ", "Bingo things are going to get worse for them, no matter what. There's tons of old company towns out there with thousands of former employees out of work, just waiting for the steel mills to spin up again. Those companies are gone or are husks of their former selves. It's never going to take 3000 people to run a factory in this country ever again, and that's a hard truth many aren't willing to accept. \n\nThese people desperately need to adapt, move, re-train, and re-invent themselves. City planners need to wake up and figure out what can work. Look at Pittsburgh, a city once run by steel, now has great universities, hospitals, and an emerging tech industry. Detroit is an empty hole because it didn't diversify fast enough and now it's too broke to do much of anything quickly - but people on the ground there are starting to turn it around by themselves.  It's not easy, it's not simple, but it's doable. ", "Stay tuned for season two of \"The Cabinet\"", "Your fear of losing money is different then their fear of losing their lives their families, their dignity and way of life.  Their fear is of mass deportation, racial and religious discrimination, violence and intimidation.  Some of this comes from people who feel like Trump's victory gave them the green light to lash out in hate.  They rightly expect, based on rhetoric during the campaign, that Trump will institute state sponsored violence in the form of regressive immigration policies, state suspicion of muslims, removal of rights for LGBTQ families. This is the fear. And it is justified based on what we are seeing happen around the country right now.", "Speaking facts is being smug.", "Under the existing system people will die without biotech companies insurance companies and hospital owners making obscene profits.  Obamacare did not change the corruption and profiteering of a system that puts corporate profit above the well being of those who pay for healthcare.\n\nThe only good thing about Obamacare was that it prevented insurance companies from refusing people with preexisting conditions.  The rest of it just socializes the costs (a good thing in itself) of corrupt, monopolistic, profiteering corporations at the cost of everyone who needs medical care (an inexcusable deference to moneyed interests), i.e. essentially everyone.  For god's sake!  Pharmaceutical companies lobbied *for* Obamacare.", "I thought he looked overwhelmed as well. If you look at his old interviews when questioned about a possible presidency he _always_ said it was a job he wouldn't want to do.", "Arpaio might have a hard time fulfilling a cabinet role from a jail cell.", "As someone who was born and raised in a town currently crippled by meth addiction this one hits really fucking close to home.\n\nEvery time I've gone home for the holidays, I've seen my hometown get worse and worse. I used to eat at this little mom and pop pizza joint that just recently shut down because it was getting robbed constantly by the meth heads in the strip of motels across the street and the owners (like third generation) were scared they would get killed one of those times.\n\nIt pains me to see my family supporting Trump, honestly thinking he's going to fix this crisis by waving his magic wand and bringing factory and coal jobs back. My home town is dying and they're being swindled by a con-man. It's reminiscent of the televangelists telling cancer patients to give up all their money and trust God rather than pay for their prescriptions.\n\nWhat's worse is I'm no longer welcome among most of my family because I moved away to live in the big city. My family has been convinced by swindlers to give up their lives and then they were convinced to hate me for leaving to find a better life.", "&gt;\"We are disgusted and condemn this extremist ideology and associated actions in the strongest possible terms\" NC GOP Chairman Robin Hayes said in a statement provided to CNN. \"These acts and thought processes are no reflection of the heartbeat of this great country and are counter to the efforts to make America great again. We stand with the Democratic Party in calling these out-of-state troublemakers to go home.\"\n\nThat's pretty nice to see.", "Trump is well on his way to doing a 180 turn on everything. Hillary is great Obama is great, and now Trump is thinking of keeping Obamacare. \n\nThe next thing coming is probably his reversal on trade policy. He will probably embrace TPP and back down on renegotiating existing trade deals, simply because he is gutless when the pressure is on. I don't expect him to build a wall either. It was just a bunch of bs. \n\nTrump is not as tough and smart as he thinks he is. Instead of draining the swamp, it looks like he will be going for a nice, long swim in it. ", "Thank you. I know its probably ridiculous for me to feel this but seeing you say that actually gives me a sense of closure.\n\nI voted for Clinton in the general by the way. But the ridicule that Sanders supporters recieved in the primary hurt a lot. I never resented the Clinton supporters who were just honestly more centrist; I respected that. But so many of you made us feel like shit and called us delusional for haveing the audicity to believe in our guy. I got over it and voted for the party, but I know a lot of people that felt really put off by the attitude, and I cant entirely say I blame them.\n\nI hope we can start to heal as a party going forward.", "The problem with this line of reasoning is that Democrats did nothing to stop this assault. In some cases they hastened it (free trade). Why turn to the democrats when they obviously can't or won't protect the working class. I think this is the line of reasoning of some working class voters \n", "&gt; I think I've even called a few of them worse than social justice warriors.\n\nThey make me feel so sorry for ever hating on SJW's if I'm being perfectly honest.", "These are the same people that literally just got busted for racial voter suppression.", "Nothing you wrote negates the fact that his supporters have no problems with men grabbing women's pussies and being racist. ", "Yeah i hate to agree with him because it means i have to agree with him and defend trumpers but Donald knew he needed to tell these people theyd get their jobs back. Now you and I both have the reasoning to know that it isnt going to happen, but a lot of people, well thats all they needed to hear. Hillary just condescended them and while she was RIGHT, she offended them. Nobody won here. Hillary gave actual solutions to the problems and was reasonable. Worst idea ever. You have to embellish the truth and essentially lie to get elected. Trump did that by saying shit like, ILL CALL GM AND MAKE THEM MOVE BACK TO DETROIT OR ELSE. We KNOW he wont do it and he knows he wont do it, but its all they had to hear to vote for him", "He's like one of those people at work who does nothing but complain and offers no solutions.", "They asked me how well I understood theoretical physics. I said I had a theoretical degree in physics.", "And drop gun control.", "I love how passive aggressive r/politics is.", "Middle class Americans without health insurance are only one medical crisis away from being poor Americans. ", "Good news: It'll be MUCH EASIER now 😐", "Ready for this?\n\nhttps://www.washingtonpost.com/news/wonk/wp/2016/07/29/the-smoking-gun-proving-north-carolina-republicans-tried-to-disenfranchise-black-voters/\n\n&gt;&gt; The federal court in Richmond found that the primary purpose of North Carolina's wasn't to stop voter fraud but rather to disenfranchise minority voters. The judges found that the provisions \"target African Americans with almost surgical precision.\"\n\n&gt;&gt; In particular, the court found that North Carolina lawmakers requested data on racial differences in voting behaviors in the state. \"This data showed that African Americans disproportionately lacked the most common kind of photo ID, those issued by the Department of Motor Vehicles (DMV),\" the judges wrote.\n\n&gt;&gt; So the legislators made it so that the only acceptable forms of voter identification were the ones disproportionately used by white people. \"With race data in hand, the legislature amended the bill to exclude many of the alternative photo IDs used by African Americans,\" the judges wrote. \"The bill retained only the kinds of IDs that white North Carolinians were more likely to possess.\"\n\n&gt;&gt; **Most strikingly, the judges point to a \"smoking gun\" in North Carolina's justification for the law, proving discriminatory intent. The state argued in court that \"counties with Sunday voting in 2014 were disproportionately black\" and \"disproportionately Democratic,\" and said it did away with Sunday voting as a result.**\n\n&gt;&gt; **\"Thus, in what comes as close to a smoking gun as we are likely to see in modern times, the State’s very justification for a challenged statute hinges explicitly on race — specifically its concern that African Americans, who had overwhelmingly voted for Democrats, had too much access to the franchise,\" the judges write in their decision.**\n\nA meme, is it?", "Most of the women I know who supported him are evangelicals who did it entirely because he said he'd roll back Roe v. Wade.  They rationalized voting for him because it would save unborn lives and convinced themselves anything he said more than five years ago was \"old trump\" before he was \"born again\".  Any attempts to deconstruct that obviously bullshit line of logic was met with \"but abortion\".  They would have voted for anybody short of Satan if they said that.\n\nWhat Trump succeeded on was appealing to a wide swath of people in the same way.  He said a lot of things you didn't like, but he also said that one thing you **really** liked, and that trumped everything else.  When you feel desperate, you cling to longshots and hope in the face of despair.\n\nSo now we open the box and the waveform collapses.  Schrodinger's candidate can no longer hold all positions at once, and he's going to get crucified for it.", "Too late ... Hillary is the most electable candidate", "Condescending and smug with your facts and science. It is your fault for being smug and condescending!", "Yep. But even though the Democratic policies would have helped them more than the Republican ones the Democrats didn't do a very good job of convincing those voters that fact. \n\nThe Hillary campaign was so hopelessly lost on this issue that even Bill Clinton couldn't convince them:\n\n&gt; in general, Bill Clinton’s viewpoint of fighting for the working class white voters was often dismissed with a hand wave by senior members of the team as a personal vendetta to win back the voters who elected him, from a talented but aging politician who simply refused to accept the new Democratic map.\n\n[Politico](http://www.politico.com/story/2016/11/hillary-clinton-aides-loss-blame-231215)\n\nBasically, the Hillary campaign decided to ignore those voters because they didn't think they needed them. They completely blew it.", "In my most desperate dreams I imagine that Trump really is playing whatever-D whatever-chess and is going to reform the national government with the same urgency and popularity as FDR. I can't tell you how much I want to believe that. I don't, but I really wish I did.", "Do you really think he is going to just start nuking people he doesn't like?\n\nAs in some president somewhere said some mean things about him and he just presses a big red button on the White House to nuke some city?\n\nI can't guarantee it but I'm pretty sure the US president can't just go \"lol nukes\" and launch them.", "I believe we're skipping qualifications this year. All good. ", "I've been thinking about this and I'm terrified of pence but this might actually be the better option. It would be so much easier to beat pence in four years than to beat trump. I'll pray for your uterus though. ", "&gt; Putting someone like Keith Ellison\n\nThe only way this happens is if Obama comes out and endorses him.", "People seem to forget that batshit crazy places like Pakistan have nukes. \n\nNo one is going to be sending nukes flying. Even if a country leader had a death wish all groups of high officials in that country would sooner host a coup than have their country turn to ash.", "At least the dems were adopting some of Bernie's platform and they would have gotten some general public assistance.  The GOP doesn't care about them at all and despises the poor.", "Honestly though he's always been confident in front of cameras, even at the debates. He looked so out of place after his meeting with Obama. He looked super nervous or some shit. I don't even know ", "During the primaries he also tweeted some stuff that rubbed a lot of people the wrong way. He was a superdelegate and tweeted this:\n\n&gt; [@D_Born @BernieSanders Super delegates don't \"represent people\" I'm not elected  by anyone. I'll do what I think is right for the country](https://twitter.com/govhowarddean/status/706219827535462401)\n\nWhile his point was right it's a condescending way to say it, and it certainly doesn't win any points when there's a populist wave going on.\n\nThen he also just has tone-deaf tweets like this one:\n\n&gt; [Sorry to disappoint. Fed up with Bernie supporting cyber bullies and negative campaign tactics against HRC who I like and respect](https://twitter.com/govhowarddean/status/708814927352504324)", "He's not going to make it past the release of the new Starbucks holiday cup. Does anyone remember how triggered he got by it last year?", "Absolutely it will be spun to somehow be the left's fault. ", "Rumor has it he speaks with a Slovenian accent because he's been basically living with only his mother in a wing of Trump Tower his whole life.", "Agreed. The best parts of Obamacare were killed by a thousand cuts. Everyone still wanted their profits protected.", "Absolutely. As much as a whole lot of dems feared a Trump win this is the best possible outcome in the long term for progressives. If HRC managed to eek out a win past Trump, establishment dems would have the wheel for the next 4 years going into 2020. Due to the upset, the DNC is in tatters wondering where it went wrong. That void in leadership really does open up an opportunity for not only Bernie, but the entire progressive movement.", "Drain the swamp we're turning the area into a nuclear waste dayspa", "It's understandable but so damn illogical. Many of these folks don't possess reason or logic. They need better education -- it's not their fault our education system is pitiful. But there's no will by their elected officials to change that. They profit from a low-IQ class.\n\nAt the same point, I hope to god the idiot Democrats don't go overboard with pandering to the unreasonable, under-educated population. These are folks who don't want to compromise on anything -- some (very few) are literally domestic terrorists.\n\nLet's see what happens when Trump can't follow through on all of his asinine dictator nonsense. I hope the Trump extremists protest when things don't go the way they were promised -- it's their right to protest.\n\nAnd organized, respectful, peaceful protesting is what they should have done instead of mope around and buy into what this cartoon charlatan was selling.\n\nWe need better ways to educate much of our population.", "&gt;  fakes sickness\n\nHe's 70 years old and has been obese for at least 20 years. He might not need to fake anything.", "Just looking at his reaction on election night and the pics I've seen of his meeting with Obama said as much. If he really wanted it the joy and pride would have shown in his demeanor. He was completely pandering and it stunned him as much as anyone else that it paid off on the night that mattered most. If Hillary had won the mood in both situations would have been completely different. She would have been elated accepting President-elect, and the meeting with Obama would have been full of beaming smiles. Reality is what it is, but it feels wrong in a should not-have-happened way. The shadow of what would have been seems to be more haunting for all involved this time around. All mho of course.", "Well... clearly LOL", "And now Trump supporters will defend him as he goes back on his every promise.", "This is a man who has admitted that he doesn't even read...at all!!!  (Let that sink in.)  He doesn't demonstrate a basic understanding of our government military or policy and doesn't seem to even try to learn. ", "Who does that? /S ", "I love how you think these laws only want ID.\n\nThey almost all come with reduced voting hours and less polling stations.\n\nAnd the intent is very obviously to suppress voters. Are you even contesting the intent of these laws?\n\nThe laws don't even prevent fraud because voter fraud is mainly an imaginary problem republicans use to rile up their base.", "It seems like this will be a very tense 4 years of democrats hoping Bernie doesn't die.", "Looked through each point and I think everyone should be aware of them. Here's a short part from each point: \n\n1. Rule #1: **Believe the autocrat. He means what he says.** Whenever you find yourself thinking or hear others claiming, that he is exaggerating, that is our innate tendency to reach for a rationalization. This will happen often: humans seem to have evolved to practice denial when confronted publicly with the unacceptable. \n\n1. Rule #2: **Do not be taken in by small signs of normality.** Consider the financial markets this week, which, having tanked overnight, rebounded following the Clinton and Obama speeches. Confronted with political volatility, the markets become suckers for calming rhetoric from authority figures. So do people. Panic can be neutralized by falsely reassuring words about how the world as we know it has not ended. \n\n1. Rule #3: **Institutions will not save you.** It took Putin a year to take over the Russian media and four years to dismantle its electoral system; the judiciary collapsed unnoticed. The capture of institutions in Turkey has been carried out even faster, by a man once celebrated as the democrat to lead Turkey into the EU. Poland has in less than a year undone half of a quarter century’s accomplishments in building a constitutional democracy.\n\n1. Rule #4: **Be outraged.** If you follow Rule #1 and believe what the autocrat-elect is saying, you will not be surprised. But in the face of the impulse to normalize, it is essential to maintain one’s capacity for shock. This will lead people to call you unreasonable and hysterical, and to accuse you of overreacting. It is no fun to be the only hysterical person in the room. Prepare yourself.\n\n1. Rule #5: **Don’t make compromises**. Like Ted Cruz, who made the journey from calling Trump “utterly amoral” and a “pathological liar” to endorsing him in late September to praising his win as an “amazing victory for the American worker,” Republican politicians have fallen into line. Conservative pundits who broke ranks during the campaign will return to the fold. Democrats in Congress will begin to make the case for cooperation, for the sake of getting anything done—or at least, they will say, minimizing the damage. \n\n1. Rule #6: **Remember the future. Nothing lasts forever**. Donald Trump certainly will not, and Trumpism, to the extent that it is centered on Trump’s persona, will not either. Failure to imagine the future may have lost the Democrats this election. They offered no vision of the future to counterbalance Trump’s all-too-familiar white-populist vision of an imaginary past. \n", "&gt;he has offered few details other than tactics like \"bomb the shit out of 'em\" \"take the oil,\" and \"take out their families,\" the majority of which are considered war crimes under international law.\n\nI shouldn't be laughing, but this is just so ridiculous.", "Also that she saw it as a complete inevitability.", "He's going to propose single payer and breaking up the big banks next.", "&gt; He worked some as a carpenter although “he was a shitty carpenter,” Bloch told me. “His carpentry,” Morrisseau said, “was not going to support him, and didn’t.”", "This last cycle just might convince him.  At least it set the \"refreshed\" precedent of no needing to be knee deep in politics along with the other 500000 lawyers in DC.\n\nThis is what the best president for america would look like.\n\nSomeone who is intelligent, politically aware, and cares about the american people.  They don't need to be a lawyer or career politician - then just need to be self aware enough to surround themselves with those kinds of people and smart enough to know when they are spewing self-interested bullshit.\n\nJon Stewart is actually the perfect candidate - he need only \"manage\" the country and deligate tasks to those more experienced than him and take advice from those more experienced than him.\n\nI've said it for years - the people best for the role of president will never be allowed near the possibility of being president because the globalist elite see the presidency as \"their\" tool to control the masses.  Hence Hillary - hence that huge machine that happened.\n\nThat Trump was elected, whether you hate him or love him, was a miracle that I doubt will ever happen again.  The danger now is that the established globalist .1%'ers know the limit on what they can push.  \"Ok, Hillary was TOO corrupt, but if we dialed it back 10% to only 90% as corrupt as hillary, that person [x] can sneak by.\"\n\nEveryone even now trying to drag Trumps name through the mud totally missed the entire fucking point of why he won.  He DIDN'T WIN -  The Establishment lost because of their own Hubris and the American people were sick of it.\n\nThey set the corruption bar so low they needed Trump to have a chance... and they miscalculated how sick of it all everyone was.\n\nFuck em\n\n\"But but but, muh climate change, muh lobbiests, muh immigration\" -Tone deaf mother fuckers - It aint about that.\n\n[This is the reason why Jon Stewart should be president](https://www.youtube.com/watch?v=vmj6JADOZ-8)\n\nCrossfire was cancelled soon after\n\nHe did something similar with the stock market guy.", "All our fault for our condescension with facts!", "But he's going to end Obamacare on day one.\n\nOh wait no he's not.\n\nGood choice guys. ", "He's the dog who caught the car. ", "Umm... Presidential pardon.", "The DNC must be purged. All Clinton surrogates must go. They tried they failed. No more dynasties.", "That could win some gun supporters vote", "The DNC crew are trying to sell it as some sort of mysterious phenomenon.  You lost DNC.  You lost as horribly as you possibly could.  And you lost wholly and completely to an oafish bungler.  \n\nThe leaders in the DNC need to quit.  Truth:  They crashed their boat into the only Iceberg  for 1000 miles aroind them in daylight, and sank it, and killed almost everyone on board, and are now sitting in the lifeboats by themselves talking about how they're going to get everyone back to land again--but they can't:  there's nothing but bodies--an endless carpet of floating bodies, with clawed icicle hands, the dead hopers and dreamers--floating silently around them.  \"Maybe we should steer around the icebergs next time!!\" one of them says.  The rest of the DNC leaders in the lifeboat clap, and say \"Here, here!\"  and \"That'll do the trick!\"  But the quiet sloshing of the corpses on the waves returns, and they brood to themselves, and despair.  The moon sinks beyond the cold horizon, taking all hope with it. ", "You have *maybe* another week of using \"Clinton's corrupt\" as a crutch. She's done she lost, she's out of politics. It's all about Trump now and his shady dealings. So, get it all your of your system now, because it's going to take a lot of your energy to defend him during his presidency. \n\nEnjoy being on the wrong side of history. ", "Trump wasn't so much anti-establishment as the establishment was anti-Trump. For many people that was enough (the enemy of the enemy is my friend).", "Yep... self driving vehicle technology is basically here already it's just being perfected before it's deployed en-masse. Sadly I think you are right that this is going to devastate rural economies. Similar things will happen in other industries as well. And I don't know that there's anything we can do about it. \n\nAs an electrical engineering student, I too am excited about technological progress. But I can see the terrible side effects that can happen when disruptive new technologies are introduced. Luckily I think we have several decades (at least) before humanoid robots are cheap enough and good enough that they can completely replace humans for tasks like plumbing, construction, cleaning, etc. But that will happen eventually, and we will need to respond to it somehow.\n\nI think eventually we will have no choice to go to universal health care and a minimum income. But most people *want* to work. They want to be self-sufficient and provide for their families. A future in which robots take all of their job opportunities away and leave them with no option but to accept government handouts is a nightmare. \n\nThere is nothing we can do to stop this future from happening. It's going to be a major turning point in human history, a complete restructuring of society. But we have no real idea now of how we are going to respond to it yet.\n\nI really hope we manage to ditch the current version of the GOP by then, but if we don't, they are going to change anyways. If 50% of the population is unemployed and barely getting by day-to-day, the \"pull yourself up by your bootstraps\" narrative will not be well-received.", "Construction will be heavily automated pretty soon too.\n\nhttps://www.youtube.com/watch?v=WzmCnzA7hnE&amp;feature=youtu.be\n\nThere really just won't be enough jobs. Automation has already removed lots of the work that needs doing there are plenty of people who sit at their desk 8 hours a day because that's the requirement for getting paid, they could be done everything in a couple hours and just head home (or just work from home in the first place) if it was allowed.\n\nOur entire attitude about employment really needs to be changed.", "Just so people are fully aware: Altria is Philip Morris cigarettes. They changed their name to try and remove their shit stain reputation from it. Don't ever be fooled", "He literally lives in a huge ass skyscraper with his name on it. \n\nYOU DUMBFUCKS DIDN'T BEAT THE ELITE.  \n\n**YOU ELECTED IT.**", "European here you have no idea how many words I misspelled before auto correct and google.\n\nLike I used to think sun was written soon, wtf", "That feel when we are all being hypnotized in the same way Trump captured \"the right\" so successfully.\n\nHe's saying all the 'right' things to assuage the left's anger and disappointment neutering moderates from more radical leaning left. \n\nStop listening to what he's saying - watch what he is doing. And what he's doing is appointing Chris Christie, Sarah Palin, etc into cabinet positions. Why is he appointing these other very, very polarizing, clownish and entertaining people, while also trying to be calm, gracious, quiet, everything that will assuage the left's fears.\n\nBecause he's waving the vaguest, most transparent cloth in front of your face. Who gives a shit what he portrays to us - his team has fucking perfected the intuition of portrayal in the media, and how to play it to their benefit. Who cares what their words are, how can you apply any weight to anything they say, the whole lot of them, on all sides?\n\nBe smart in the weeks/ months ahead.", "pretty sure thats what the GOP banks on every year.  Trickled down will totally work this time guys... just  vote us in you'll get your money ;)", "You know I think this sentiment is why we will always be inherently biased against female politicians like her - what else could she have worn to seem, I don't know, more presidential? Is she supposed to come on stage in a cocktail dress? I think this plays a large part into how people perceive power. I'm not saying it's people trying to be sexist, but trust me, there's a reason nobody complains about Trump wearing suits (to be fair, they attack other things like his hands, which also carries a tinge of implied sexism) but can attack Clinton for wearing the female equivalent. ", "Dude I'm convinced Jesus could run as Democrat and they would all still vote Republican. Parties have become a way of life instead of actually doing any research. ", "To be fair one of the last questions of one of the debates was to say something positive about the other candidate. Trump actually complimented her and said she is a fighter and doesn't give up or something along those lines", "The key lies in separating in the public consciousness usefulness and profitability. Human endeavors need to stop being quantified in relation to their economic worth.", "O: \"Listen now I know you want to repeal my Affordable Care Act...\"\n\nT: \"That's correct!  As soon as I'm in office that's the first thing to go!\"\n\nO: \"Well if you do that, the guys who are in charge of the aliens at Area 51 are very financially invested, and they are threatening to become whistle blowers. The FBI will have to go kill them while they're on vacation in Aspen.  Meanwhile, as a distraction, the CIA will carry out a false flag attack in Albuquerque that will kill dozens of women and children that they'll blame on the Arabs, creating a surge in pro-war and anti-Islamic sentiment nationwide that will ultimately lead to a devaluation of our dollar and send us in to a recession, starting with the nations top-earners.\"\n\nT: \"I *may* not repeal Obamacare.\"   ", "Indeed. They're also completely opposed to the solution to the core of their being. What you just described sounds to them like \"become dependent on the government.\" These are people that (believe that they have) built their lives on their own through hard work and determination contributing to their part of the world and making an honest living for themselves. They won't want to just simply accept that they'll get a paycheck from the government without working for it and that's what they'll do. They'll feel like leeches. Human beings do have a need to feel useful, to feel like they are contributing to their own survival and their community, they won't accept that their destiny and their livelihood is no longer under their control.", "The right just repeat something over and over again in the hopes that the dummies buy into it.  Enough times they do.  ", "I think it comes down to the people who felt disenfranchised and ignored. He was a populist telling them un-PC shit they might not all necessarily agree with but to them he felt like a breathe of fresh air. And many probably didn't think he would win.\n\nSo now the guy won after making some outrageous promises. He's got a bunch of snakes around him who are hungry for power. A GOP that's scrambling to pretend they were with him all along - but many also secretly hoping he'll fuck up so Pence can step in.\n\nThis is gonna be interesting.", "Isn't that great? Real leaders rise naturally. ", "&gt;Not necessarily right now but by the 2020 or 2024 elections,\n\nNo, necessarily right now.  Let's not let enough time pass so that everyone can forget who lost the Democrats the election.  If you let enough time pass, you can sugar coat it to look like a Trump presidency was inevitable, and brave Hillary put on a noble, yet hopeless battle.\n\nThe time is now.", "Yeah it seriously was. I read it a few times and chuckled. When I got to the part that this guy isn't even American but literally surgically dissected this entire debacle into exactly what it was with utter briliant observation and why - I wanted to print and frame his post.\n\n/u/Phedericus you sir, are a smart man.  \n", "This is the guy who spends presidential debates airing 30 year old grudges. Yeah hes totally over it. \n\nNone of his words have meant anything at all, and suddenly hes supposed to be taken at face value? Hes a pathological liar and narcissist, and everything that comes out of his mouth serves one person only\n \n\nYOU\nARE\nBEING\nMANIPULATED", "See your problem here was that you were paying attention to actual facts. The real way to select a leader is apparently something involving a racist animated frog. And somehow this needs to be made dank. I don't know what dank is, and I don't know if I have ever been it.", "Yeah I think a lot of people are learning that lesson.  So many people I know that were Hillary supporters told me they liked Bernie and his ideas, but thought there was no way the rest of the country would be caught dead supporting a self-described socialist.  Turns out America votes for the person they like, not the most moderate.", "While he attacked her for having no stamina.  Somehow those 2 things don't contradict.", "Yeah you probably shouldn't let the Dilbert guy gaslight you. Climate-change denier Myron Ebell is going to be dismantling the EPA. Or just take Trump's own 100 days plan:\n\n&gt;* FIFTH, I will lift the restrictions on the production of $50 trillion dollars' worth of job-producing American energy reserves, including shale, oil, natural gas and clean coal.\n\n&gt;* SIXTH, lift the Obama-Clinton roadblocks and allow vital energy infrastructure projects, like the Keystone Pipeline, to move forward\n\n&gt;* SEVENTH, cancel billions in payments to U.N. climate change programs and use the money to fix America's water and environmental infrastructure", "Jokes on you! I voted for him because I hate women and mexicans!", "exactly. why the fuck should we start taking trump at his word now? need to hope for the best &amp; be prepared for the worst. ", "I don't really get the Trump thing at all. Even my (to my standards) conservative military religious American friend can't stand Trump, and he loved Bush. I just don't get it at all. \n\n", "Watching that video fucking made me tear up man. We had the one and we fucking pissed it away for the clinton machine. Who fucking lost to Donald Trump.\n\nFuck the DNC.", "Trump knew how to play the political game. He has showmanship. I doubt he actually meant most of what he said but he said it because it works. Crooked Hillary Clinton was nothing more than a catchphrase to rally his base.", "They tried to. They passer Dodd-Frank and created the consumer protection bureau which is now all toast. It wasn't great but had the republicans helped at all it could have been real legislation to right the issues with the last collapse. Instead we get total deregulation which only helps the owner class. ", "And that's not even taking into account the trials - predominantly civil he has to face beforehand, and the potential actions taken by his businesses beforehand. Even if those actions are completely separated from his presidency, holding office and being in prison or jail isn't going to be an accepted combination. \n\nAll in all, this was a possibility with either candidate. If anything does happen, it's going to hurt the country immensely. ", "Trump is about a generation shy from being pure nouveau riche and holy shit it shows. ", "I'll be honest I can't believe it didn't get more press. \n\nWhen I heard the question I was like \"Oh man this is a tough one for these two\" and then Trump went and spit out a completely unexpected and seemingly *honest compliment*. I just about fell out of my chair. That was one of the most genuinely surprising things in the whole election, at least to me. I mean except for the end and stuff.", "It's unlikely anyone will take over as Chair until after January 20th. Considering that Schumer will then be the most powerful Democratic Party member after that date and he supports Ellison, there's a good chance this takes place.", "Also I would rather have Pence dealing with other world leaders. ", "he appointed a climate change denier to lead the EPA.  He isn't liberal.  He sounds like he WAS but thats gone.", "Bold move pardoning someone before hiring them to help run the fucking federal government", "I think exactly the same way. The truckers and their industry are probably going to be the biggest but cabbies/rideshare drivers, too. Delivery services. Heck, possibly auto workers and auto repair, if there's a robot version of zipcar that shows up when and where you need it. \n\nI think health care and MBI are the keys. Health care is a solved problem (that is, outside of the US there are workable solutions that we could adopt and refine, but there is the ability to deploy a sustainable national health care program that's better and more cost effective than what we do now). MBI is still a work in progress. \n\nBut I don't think that opposition would be as strong as you think right now. I certainly don't hear Alaskan politicians railing against the oil fund, and they're not exactly the most blue state we have. I think that politicians like Ryan, or even back to Reagan, find support in things other than economics, and then use that to execute an economic agenda. Sure, you'll find plenty of people who shiver at the word 'socialism', and a large number are convinced that free market capitalism is the freest, bestest, most wonderful system possible, but there's a swath in the middle that, I think, could make it possible. ", "You could make the argument that his health care plan was completely unrealistic because he knew he wouldn't have to worry about it actually getting passed.  ", "did you not hear? he appointed a climate change denier to lead the EPA.  let your mind panic again.", "Being gracious right now is the easy part. It's expected. He just won an election to make him the most powerful man in the world. Personally I don't take it as any indication that he now will be a different person. The real test comes January 20 when he becomes the President and the ball starts rolling. Remember, in the past year and half, there were moments when his advisors and staff were able to reign him in but he always returned to his worst impulses. He always returned to that Donald Trump we've known. Some say that becoming President is sobering... yet there are also instances in history where gaining power brings out the worst in a person. We'll see..", "&gt;  simply because he is gutless when the pressure is on\n\nA saw a commentator on TV the other day who had an interesting take on things: For the first time in his life Trump has to work with people that he can't fire.\n", "seriously what is the point of having definitions for words like racism and sexism if when people blatantly fall within the confines of those definitions and you call them our for it you are called SJW/PCbitch/smugasshole/hypocrite/berniebro/shillary......it genuinely makes no sense to me", "Absolutely. I'm terrified of trump on the international stage. Not that pence wouldn't start wars but I don't think he'd start a world war. ", "You know my cousin? Yah that rich white 68 year old guy who lives in his mountaintop retreat in California who lived off his wife's income his whole life? And here's little old me terrified that my same sex marriage will be annulled and I'll be forced into conversation therapy by Pence. Yah, fuck that guy. ", "This is a joke right? I hate him because of how he's acted how he's treated other human beings, etc. etc. etc. Basically, he's a shit person and I hate him. I am sorry that playing him randomly talking with music cued to make people feel a softer emotion didn't toy with my critical thinking ability when assessing this man's agenda and personality.", "Sorry what is the other alternative for a business woman than a pantsuit? You're coming across as giving reasons to justify why you wouldn't like her no matter what, because again she is wearing a very \"traditional\" thing for a woman like herself to wear, yet somehow that's not good enough for you and youre comparing it to a t-shirt and sandals. This is what I mean - we literally have ingrained connections between \"pantsuit\" and \"bitchy untrustworthy business woman\". Yet when a man wears the standard apparel, he is regarded with power and authority (because you can't really fuck up a suit I guess?). I know I'll acknowledge that I dont treat the two equally, will you? I just don't think she has any other option, and the result is that people treat her worse than a male candidate purely because of her looks.\n\nClinton is probably devastated by this. She got mocked as first lady of Nebraska for her funny glasses and hair and lack of accepting Clinton's last name, and she changed, and she got mocked as First Lady in the white house, and she got mocked after that. Trust me, Hillary tried really hard to be exactly what America wants, but they keep saying its not good enough because she's a woman. That's got to be disheartening...", "If this is such a detested program and if the premiums are going through the roof why have 18 Million people signed up for it, when the tax penalty for not signing up (i.e., the mandate) is still pretty small, and certainly a lot less than the premiums?\n\nI know that a lot of people hate it on principle because of the mandate, and I get that, but if it such a popular program that helps a lot of people, why get rid of it?", "&gt; The message isn't \"shift to the left\"  It's \"go back to supporting workers and the middle class like you used to instead of the billionaires like you do these days\".\n\nExactly people don't care if youre a \"socialist\" now as long as youre trustworthy and wont sell out. When they hear social programs from highly educated (as fox news calls them \"the elites\") lawyers like HRC they think fascism or communism BECAUSE the person who is selling it you is corrupt to begin with, which is mostly true. \n\nCorporate money has been corrupting the system on both sides, which is why 50% of the country will be Independent/no affiliation soon. It's all about the money. Get corporate money out of the system. \n\nEdit: That said I want to say that Bernie doesnt need to be a Senate minority leader to have a large audience. I hope he doesnt take it because DNC's reputation is in the gutter right now or it will def play into the Trump audience's hands (he's already endorsed HRC that will also come up). \n", "bernie is too old to go again. they need to find someone like bernie but younger.", "I am really happy Clinton lost.  But I am really really unhappy that Trump won.", "And so did a lot of her supporters which is why they're flipping out so hard. They thought victory was assured for so long that they got arrogant, which made people not want to be associated with them, and thus they lost. Now instead of analyzing their behavior, they're turning the loss into anger at others for \"wrong think.\"", "Everyone in this thread does realize that most illegal immigrants come in by ship or plane and a wall would do nothing to stop them right?", "Yes let's give the FBI the power to decide who can run and who can't. What could possibly be wrong with that.\n\nShe has been investigated during the last 30 years, either she is a criminal mastermind that can hide her crimes exceptionally, or you know she is fucking innocent and the right has been destroying her credibility for 30 years. \n\nAlso she lost to a candidate under trial for fraud and child rape, so apparently people don't care about what the judicial system thinks of a candidate. ", "This is how we win 2020. A clear message. ", "Not really. If the Democrats stop being anti-right to bear arms they could easily take places like KS. The problem is they basically let NY and CA control the entire party.\n\n", "I hear this. Climate change always stops me in my tracks though. There is no silver lining there.", "&gt; talk about how universal health care benefits businesses (one less burden for them and less bureaucracy for everyone)\n\nThis so much. Businesses pay out huge amounts in healthcare premiums for their employees. They could use that money for growth or even pass it on to current employees to ease the burden of the taxes from the single payer system. ", "No they don't realize that most illegals came here on a visa of some sort and then just overstayed.", "Same with $15 federal min wage", "Haha your English is great.  I have thought of Trump as the American Berlusconi, right down to the banging a minor part.  That's not a great person to be compared to, at least from what I followed of Italian politics.  \n\nThe whole \"feels over reals\" thing has been haunting me after Tuesday.  People have no idea what they've done, and they're happy about it.  I'm very interested in how it works out for us all.\n\nSpeaking of which, what were some of the bad things that Silvio did for you guys?  I know only about the control of your media and going after critical journalists, plus the sex stuff, but I'm sure there's even more I'm not aware of.  Spill the dirt, what do we have to look forward to over here?\n\n", "Angry at the establishment the voters marched on, to elect the same establishment again.\n\n&gt;&gt; “For decades, Americans have experienced a populist uprising that only benefits the people it is supposed to be targeting.... The angry workers, mighty in their numbers, are marching irresistibly against the arrogant. They are shaking their fists at the sons of privilege. They are laughing at the dainty affectations of the Leawoof toffs. They are massing at the gates of Mission Hills, hoisting the black flag, and while the millionaires tremble in their mansions, they are bellowing out their terrifying demands. 'We are here,' they scream, 'to cut your taxes.” ― Thomas Frank, What's the Matter with Kansas? How Conservatives Won the Heart of America", "they are too busy drowning themselves in cognitive dissonance &amp; double speak..it's all over this fucking sub. fucking disturbing. ", "I wonder how long it will take for his supports to realize they were duped by a con-man.", "A lot of successful entrepreneurs I have met don't use ACA but rather other insurances offered for self employed folks. \n\nEvery single one of them believe that Obamacare is only for extremely poor folks who \"don't want to make money on their own\". Every one of them also blame the ACA on the high taxes they get as sole proprietors. \n\nSo thanks for adding your personal experience to this. It's seriously good to hear from the other side. ", "Yeah I was one who called y'all delusional and I am sorry for that as well. Turns out I was the delusional one since Hillary had already been rejected in 2008 and I should have known she would be rejected again. I was just blinded a little I think. I wanted it so badly for her. So many people wanted it for her. But we should have known better after 2008 and the fact that so many people both within our party and outside the party were saying it was a bad idea for her to run.", "More and more I'm seriously thinking this is like the grand finale episode of Punk'd.  It'll come time for the inauguration speech and Ashton's going to walk up to the podium to announce he pulled off the greatest prank ever.\n\nThat or its something like the Jauquin Phoenix documentary where he pretended to be an aspiring rapper. ", "That's a deal I could live with. I'll get a gun and use it to defend my uterus! :p", "Trump was used to playing on the playground. \n\nNow he is the teacher watching over the playground. \n\nHis silly little bullshit playground games aren't going to work anymore. It's not even in the same league as \"big league\". It's a whole 'nother animal.", "Just because someone is a billionaire doesn't mean they're evil; the only thing it means is they're rich.  Bill Gate is the richest person in the US and he's devoted his life to doing good.", "Gonna move out of the house you paid off 10 years ago to a more expensive house? Go to a university or tech school at the same time? Move your kids to a new district? People don't want to do this and many times they simply cannot do this.", "Obama too. \n\n&gt;As the pool of reporters were led out Trump told them several times that Obama was \"a very good man.\"\n\nWent from Worst President ever, incompetent, stupid, etc to \"Obama is a very good man\". Its just good sportsman ship.  ", "I honestly believe he wishes she had won - and is trying to figure out *some* way out of this mess he's created. ", "You are exactly correct. I will guess the feeling of \"FUCK YOU\" ended on election night. They got their win had their orgasm and have completely forgotten about whichever emotionally charged false campaign promise appealed to them. Not one single person who screamed about building the wall will give a shit when there is no wall. Not one single person who screamed \"lock her up!\" will give a shit when nothing happens. Democrats failed by not providing an emotional appeal. ", "Don't count your chickens before they hatch.\n\nWhen Obama won the first time it was clear that the Republican party needed to rebuild itself. They did, but not in a good way. It isn't looking good for the Corporatist Democrats, but they're not dead yet.", "While that is true he does not exist in a vacuum, and there are many people within the DNC who would prefer a continuance of Clinton Democrats. It's frankly incredible. I would not write off Howard Dean (or O'Malley) yet.\n\nAs of now, Obama is the only figure in the DNC who commands something close to universal respect.", "Seriously this. Us repubs will agree to drop the abortion thing if you drop the gun control.", "This statistic has held steady for the last 65 years and is due to the system they built. You can't get support to primary a sitting congressman from the party organization and you will be cut out of the party if you try. Couple that with the fact neither side will ever vote for the other and you have a permanent congress due to the controlling party picking their own voters with gerrymandering. Without strong alternate parties this system won't change. Don't believe the myth that people hate congress but love their congressman they are given no choice.", "He loved the attention while running. He loved being able to say what he wanted and having half the nation eat it up. He wanted to win and definitely didn't want to lose. But he totally didn't want to be President. I just love seeing his face these last few days. He looks as shocked as many of us do. ", "Guess who else got walloped in the south? Hillary. Guess who will continue to get walloped in the south in every presidential race for the rest of our lives? Every. Fucking. Democrat. Guess what happens when you're a Democrat running like a Republican? Democrats don't vote for you. \n\nTrying to build a strategy around people that DO NOT VOTE FOR YOU is what produces epic failures like we saw on Tuesday.", "boy this comment makes me realize Trump has hella good assassination insurance. I knew about a chunk of that stuff, but not all of it. \n\n&gt;Inherited a phenomenal state balance sheet from Mitch Daniels and used it as an excuse to push tax cuts so extreme (would have caused a tremendous deficit) that the Republican-controlled Congress shut him down\n\nthose had to be fucking dramatic tax cuts to get a GOP state Congress to shut it down. Source: Live in WI. ", "Yeah I totally agree with you. In fact I have a question: now that we hear about Trump IMMEDIATELY going backwards about the wall, Obamacare and muslim bans; now that we hear what kind of cabinet he has in mind, very far from the anti-establishment aura he worked for during the campaign, including very well known names, bankers and establishment representatives; How his voters are reacting? Do they see that? Do they care? Is anyone raising any question? ", "I want Trump to condemn this shit. ", "TBH the general state of current affairs seem like they're scaring the hell out of Glenn Beck lately which is rather fascinating to watch.", "A guy came on Glen Beck's show a few months back and said he was going to do whatever it takes keep Trump accountable to his promises or take him out. Anything. \n\nScared the hell out of *Glen Beck*. \n\n[Link](http://www.redstate.com/sweetie15/2016/08/24/glenn-beck-caller-chilling-message-trump-doesnt-build-wall/)", "&gt; I can't guarantee it but I'm pretty sure the US president can't just go \"lol nukes\" and launch them.\n\nThey actually can. That is the scary part. Do I really think he will do it? No. But it is disturbing that the possibility is there. ", "Jesus knew that if your carpentry gig doesn't work you need to get into social advocacy.  Bet Bernie and Sanders talked too much on the job and didn't hammer nails fast enough.\n\nedit:  This is a pro-Jesus and pro-Sanders message", "Spare me.\n\nThe rural brothers and sisters were insulted that their urban brothers and sisters told them they'd be stupid for drinking bleach instead of tepid water so they chugged the entire bottle whilst flipping the finger. Now that blood is starting to leak out their mouths, there's all this indignation that they don't see sympathy on the faces of everyone they threw petulant raspberries at.", "You think he wouldn't do it?", "If any industry needs to be nationalized it's medical care.  It should not be run by for profit entities.  Period.", "Lindsey Graham just stated he wants Ted Cruz to be nominated for the Supreme Court. He's one of the \"reasonable\" ones \n\nSource: https://www.google.com/amp/www.nydailynews.com/amp/news/politics/lindsey-graham-adversary-ted-cruz-scotus-nominee-article-1.2869882", "Kicking her while she's down was one of the key themes of his campaign. It was the central hateful rallying cry of his brownshirts. It was a promise that he offered the nation in a debate.\n\nOf course because this is bizarro world, he will now get tremendous credit for magnanimity simply for not attempting to jail a political opponent. The bar cannot be any goddamn lower.", "this article is excellent...might as well also mention this tidbit:\n\n&gt;The national press is likely to be among the first institutional victims of Trumpism. There is no law that requires the presidential administration to hold daily briefings none that guarantees media access to the White House. Many journalists may soon face a dilemma long familiar to those of us who have worked under autocracies: fall in line or forfeit access. There is no good solution (even if there is a right answer), for journalism is difficult and sometimes impossible without access to information.\n\n**this is terrifying.** trump already refused to let the press pool accompany him to DC this week..he didn't inform the press of his schedule on Wednesday..he's already bucking traditional protocol in many ways (see [here](https://apnews.com/22b62277e34b47008a760c660084968a)] he has already tweeted blasting the press for covering protests. if this shit doesn't scare you, it should. how the FUCK are we supposed to hold this dude accountable if we don't know what the hell is really going on? good work, America. ", "He took the whole \"just tell them what they want to hear even if it's total bullshit\" campaign tactic and turned that shit up to 11.\n\nEdit: a letter.", "More so imo", "I feel like [Trump saw this meme](http://www.gannett-cdn.com/-mm-/e864d4c5445b78b2fd9ceb78059bb8a5cb06be36/c=17-0-707-519&amp;r=x404&amp;c=534x401/local/-/media/2015/12/10/RenoGroup/RGJ/635853512231271622-0b283a5a331d8fec94b3ffdd94e658ba.jpg) and even though he never said this quote he believed it. So he ran with it and is now our president. ", "You mean how he looked tired? The speech he Trump gave at 4 a.m. eastern time? I wonder why the kid looked tired at 4 a.m. ... Probably because Trump beats him!", "Well what did he know?  He only WON TWO PRESIDENTIAL ELECTIONS."], "links": ["5cgswr", "5chl8x", "5chl8x", "5chl8x", "5cgswr", "5cgswr", "5chl1d", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5chi76", "5cgswr", "5chl8x", "5chl8x", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5chi76", "5cgswr", "5cgswr", "5cgswr", "5chl8x", "5chl8x", "5cgswr", "5cgswr", "5chl1d", "5chi76", "5cgswr", "5chl8x", "5cgswr", "5cf4js", "5cgswr", "5cgswr", "5chi76", "5cgswr", "5cgswr", "5cgswr", "5cgh8u", "5chl8x", "5cgswr", "5cgh8u", "5cgswr", "5cf4js", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cgbiu", "5cgswr", "5cgswr", "5cgswr", "5chl8x", "5chl8x", "5chl8x", "5cf4js", "5cgswr", "5cgswr", "5chl8x", "5cgswr", "5cgswr", "5chkza", "5chl8x", "5chl8x", "5chl8x", "5cfx2d", "5cgswr", "5chegv", "5cgswr", "5cgswr", "5cgswr", "5cgswr", "5cegka", "5chcm7", "5chl8x", "5cgswr", "5cgswr", "5cf6mz", "5cfnsq", "5cgswr", "5ch8rd", "5cgswr", "5cgswr", "5chi76", "5cgswr", "5cf9rn", "5cgswr", "5chl8x", "5chegv", "5cgswr", "5cgswr", "5chl1d", "5cgswr", "5cgswr", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5cgswr", "5chl8x", "5cgswr", "5cgswr", "5chl8x", "5chl8x", "5cgswr", "5chl8x", "5chl8x", "5cgswr", "5chkza", "5chl8x", "5ci1hx", "5cgswr", "5chl1d", "5cgswr", "5cgswr", "5cgbiu", "5cgh8u", "5cgswr", "5chl8x", "5chkza", "5chi76", "5chi76", "5cgh8u", "5chl8x", "5cgswr", "5chssg", "5chl8x", "5cgh8u", "5cgswr", "5cgswr", "5chkza", "5ch8rd", "5ci0wz", "5chl8x", "5c7n7w", "5chl1d", "5chl1d", "5cgswr", "5cf4js", "5cgswr", "5cgswr", "5cf4js", "5chi76", "5cgswr", "5cgswr", "5cf4js", "5cgswr", "5chyxr", "5cgswr", "5chl8x", "5cg90c", "5c7n7w", "5cgswr", "5chkza", "5cgswr", "5cgswr", "5chyxr", "5chi76", "5chywl", "5chkza", "5chi76", "5cgswr", "5cgswr", "5chssg", "5cfnsq", "5cgswr", "5chl1d", "5cgw6a", "5cgswr", "5chi76", "5cf6mz", "5cgso6", "5chkza", "5cgswr", "5chzgb", "5chtft", "5cgh8u", "5cf4js", "5chl8x", "5cgso6", "5chi76", "5cgh8u", "5cgswr", "5cgswr", "5chl1d", "5cgadj", "5cgswr", "5cgswr", "5chi76", "5cgswr", "5chkza", "5ci67q", "5cgswr", "5chl8x", "5chl8x", "5chl8x", "5ci67q", "5ci67q", "5chl8x", "5chl1d", "5ci67q", "5chl8x", "5chl8x", "5chl8x", "5cgswr", "5cgswr", "5chl8x", "5ci67q", "5cgswr", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5ci67q", "5chl8x", "5chl8x", "5cgswr", "5chl8x", "5cgbiu", "5chl8x", "5chi76", "5ci429", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5cgswr", "5cgh8u", "5chl8x", "5ci429", "5ci429", "5chl8x", "5ci429", "5chl8x", "5ci1hx", "5ci67q", "5chl8x", "5ci429", "5cgswr", "5ci7y3", "5cgswr", "5cgswr", "5chegv", "5ci67q", "5cgswr", "5cgw6a", "5chl8x", "5chkza", "5cfx2d", "5cgswr", "5cgso6", "5cgswr", "5cgbiu", "5cgh8u", "5cgao3", "5cgswr", "5cgbiu", "5chl1d", "5cf4js", "5chegv", "5chl8x", "5chi76", "5chl8x", "5ci429", "5cgswr", "5ci2cu", "5chl1d", "5chkza", "5ci1hx", "5cgw6a", "5ci7y3", "5cfx2d", "5chl8x", "5chl8x", "5ci429", "5chi76", "5cgswr", "5cgswr", "5cgw6a", "5chl8x", "5ci429", "5ci1hx", "5chi76", "5cgswr", "5cgw6a", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5ci67q", "5chl8x", "5ci67q", "5cgswr", "5chl8x", "5chl1d", "5cgswr", "5cihue", "5chl8x", "5chl8x", "5cicok", "5ci67q", "5ci67q", "5cihue", "5chl8x", "5chl8x", "5ci67q", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5ci67q", "5chl8x", "5cihue", "5chl1d", "5chl8x", "5ci67q", "5chl8x", "5chl8x", "5chl8x", "5ci67q", "5cig30", "5chl8x", "5cig30", "5chl8x", "5chl8x", "5cig30", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5cgswr", "5cibdn", "5chl8x", "5ci67q", "5chl8x", "5chl8x", "5ci67q", "5chkza", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5cicok", "5chl1d", "5chl8x", "5chl8x", "5ci67q", "5cig30", "5chkza", "5chl1d", "5chl8x", "5chl8x", "5chl1d", "5chl8x", "5chkza", "5ci1hx", "5chl8x", "5chl8x", "5cig30", "5cgh8u", "5chl8x", "5cibdn", "5cicun", "5chl8x", "5ci67q", "5cf4js", "5cgswr", "5chl8x", "5cgh8u", "5chl8x", "5ci429", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5ci67q", "5cicok", "5chi76", "5chl8x", "5cicun", "5cgh8u", "5chl1d", "5chl8x", "5chl8x", "5chl8x", "5ciod4", "5cicok", "5chl8x", "5chl8x", "5ciod4", "5ci67q", "5cihue", "5chl8x", "5cihue", "5chl8x", "5chl8x", "5cicok", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5cihue", "5chl8x", "5cihue", "5chi76", "5ciod4", "5ci67q", "5chl8x", "5cihue", "5ci67q", "5cihue", "5cinmu", "5chl8x", "5chl8x", "5chl8x", "5cgh8u", "5cicok", "5cihue", "5cinmu", "5chl8x", "5cijx5", "5ciod4", "5cgbiu", "5chl8x", "5chl8x", "5cijx5", "5chl8x", "5chl8x", "5cihue", "5cihue", "5chi76", "5chl8x", "5cicok", "5ci429", "5cijx5", "5chl8x", "5ci67q", "5cgh8u", "5chl8x", "5ci67q", "5cihue", "5cinmu", "5cihue", "5ci67q", "5cihue", "5chl8x", "5cihue", "5chl1d", "5cihue", "5chl8x", "5chl8x", "5cicok", "5ci67q", "5cinmu", "5chl8x", "5cihue", "5chkza", "5ci67q", "5cinmu", "5cihue", "5ciod4", "5cijx5", "5chi76", "5cig30", "5ciftk", "5chi76", "5ciod4", "5ci67q", "5chi76", "5cgh8u", "5ciqj0", "5chkza", "5cinmu", "5ci67q", "5ci67q", "5chegv", "5cibdn", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5ciod4", "5chl8x", "5chl8x", "5chl8x", "5ciod4", "5chl8x", "5cgswr", "5chl8x", "5chl8x", "5chl8x", "5ci67q", "5ci67q", "5chl8x", "5ciod4", "5chl8x", "5chl1d", "5ciod4", "5chl8x", "5chl8x", "5ciod4", "5chl8x", "5ci67q", "5ciod4", "5chl8x", "5cihue", "5chl8x", "5ciod4", "5ci67q", "5cihue", "5chl8x", "5cinmu", "5chl8x", "5ciod4", "5chl8x", "5ciod4", "5ciod4", "5cgh8u", "5cihue", "5cicok", "5chkza", "5chl8x", "5ciqj0", "5chl1d", "5chi76", "5chi76", "5chi76", "5cipkw", "5chi76", "5ci67q", "5chi76", "5ci67q", "5ci67q", "5cipkw", "5ciod4", "5chl8x", "5cirzf", "5ciod4", "5ciod4", "5cicok", "5cgbiu", "5chl8x", "5chi76", "5cgswr", "5ci67q", "5chl8x", "5ciod4", "5ciod4", "5chl8x", "5ci67q", "5ci67q", "5chi76", "5chl8x", "5chkza", "5chl1d", "5cihue", "5chl8x", "5cijx5", "5ciod4", "5ciod4", "5cihue", "5ci67q", "5chl8x", "5cinmu", "5cicok", "5cinmu", "5ciod4", "5cig30", "5chl8x", "5cgswr", "5ciod4", "5chl8x", "5chl8x"]}