{"comments": ["My question is how do we change the perspective of the general public away from believing they *have* to work hard and \"earn\" their money to a mindset of \"why the fuck do you *want* to work 40+ hours a week when you could work 20 and make the same?\" We've been brainwashed into believing that slaving away and working your whole life is the only way to earn success. Another problem is how most people are raised believing that asking for help or a handout is looked down upon (weather it's intentional or not.) Hell the other day I let my car insurance lapse coverage because I was too embarrassed to ask my family for money and now my insurance is more expensive. Even though I'm aware that it shouldn't be a shameful thing it's been drilled into my head. ", "Is it just me or does every pic of Trump post-election seem like he is genuinely worried that he actually got elected.", "CHRIST THANK YOU. Hillary had tons of plans for the rust belt but voters and the media don't give a fuck about policy. ", "Also we complain that Hillary wears $10K jackets but Trump wears $20K suits. But he's a man of the people? Honestly I don't give a shit about either example; they are both rich and for them that really isn't a lot of money. But we only complained about her clothes. ", "To be fair he wears a $20K suit like it's worth $200.", "&gt;(oh sorry forgot he's \"not a Democrat\") \n\nI said it during the primary and I'll say it again now: Bernie is not a Democrat, Bernie is what the Democrats used to be and what they ought to be.", "He is taking over the leadership of the party. It needs to be made clear to Donna Brazile Debbie Wasserman Schultz, Tim Kaine, and the rest of the losers that their services are no longer needed. The Democratic Party will now be handled by Bernie Sanders, Elizabeth Warren, and whoever they see fit to appoint. ", "They actually own a shit ton of [companies](http://imgur.com/a/7dYFh) not just smokes. ", "I think Republicans are a little fucked here. They spent all this time bashing ObamaCare but they never really had a comprehensive plan of their own to offer. Sadly what we're going to wind up with is some shitty republican version of ObamaCare, but they can't realistically repeal the whole thing outright and watch millions of people lose their health insurance overnight.   \n\nWhat's sad is republicans could have spent the last 6 years working with the President to improve the ACA, but that would require them to actually want to improve the country instead of being obstructionist assholes for the sake of being obstructionist asshole.", "Maybe people don't hate him because he is anti-establishment. Maybe they hate him because he's a pompous asshole. ", "This is the frustrating thing how do you explain to those people that this guy they voted for because he promised them jobs and a house cleaning of all the typical 'swamp' politicians isn't actually going to do any of these things? Even with all the evidence in front of their face right now, all the career politician names floating around for his staff and cabinet members, favors returned for mouth pieces like Guliani and Gingrich, and I guarantee they still aren't swayed or regretful of their decision to believe this guy. How do you actually express this without them thinking you're just another leftist elite condescending and talking down to them? This is why so many opposing him have been going mad the entire election, he lies constantly so why would you believe him when he says he'll drain the swamp and give you a job that the natural progression of economics and technology has simply elminiated? The swamp is the same it's just more red.", "The elite hated him. The media hated him. The politicians in both parties hated him. It's hard to argue he's not an outsider. ", "Drain the Swamp! \n\nand then refill it with more shit I guess", "Thank you /u/JasonBored I'm not sure I'm a smart man, I think it's just that... Sadly, I've seen that before. Your election as been a huge deja-vù, in many ways. \nIn Italy has been a common feeling; from here it's glaring, but it's hard to explain because I grew inside of it, I lived it most of my life. In a way, watching your election from outside also made me understand some things better about what happened here. \n\nIt's not really about the similarities between the two men (and there are many) but more how they get connected with the people, how they are able to exploit people's emotions, indirectly using the media for their purposes and ultimately changing forever how politics work. I can say, \"I feel you\". And I wish you all the best. ", "I mean I've had a very different experience as an American learning foreign languages so I can't really comment intelligently on that. It's like anything below perfect native English gets criticism while even a cursory attempt at speaking Spanish or German (the languages I'm semi-coherent in) gets endless praise. It's a weird dynamic being a native English speaker and even after traveling a lot and meeting non-native English speakers it's tough to put myself in others' shoes ", "They are not protesting his legitimacy they are protesting the man himself. ", "He said he's going back to independent to finish out this term as he broadcast himself as an independent when running for senate reelection in 2012 and owes it to his constituents to finish the term as advertised, but would run for his next senate bid in 2018 as a democrat. Ultimately 100% symbolic since the Dems are looking to him now for guidance, but reeks of principle.\n\nI just can't even... 30+ years in politics and the man sticks to his principles. Even on areas I don't necessarily agree with him on (such as nuclear energy) I can't do anything but respect him. Hell, even a good number of Trump voters have respect for Bernie.", "lol seeing this shit pisses me off beyond belief.\n\n\"You call me a racist because I act like a racist so to spite you I'm gonna vote for a racist.\"\n\nYeah. The fucking brightest of the bunch.", "I remember that so much.\nEvery time I asked one of my Hillary friends \"show me the poll that proves this because I have a bunch that says the opposite\"\nAnd then they would just say 'America won't elect a socialist\"\n\nThey won't elect a wall street fanatic either!", "- He's not serious about the campaign \n- He will drop out in a couple of weeks\n- He will never get above 10% in the polls \n- He will never get above 20% in the polls \n- He will never get above 30% in the polls\n- He will never win the republican nomination \n- He will *never* become president     &lt;-------------- YOU ARE HERE\n- He will never *really* ban Muslim immigration into America \n- He will never *seriously* deport 11 million people\n- He will never *literally* build a fucking wall ", "The boot straps narrative is already a total joke. Hard work gets trumped by connections and cronyism every time.\n\nPun unintentional but apropos.", "Bernie was also like what FDR used to be. The New Deal is what led to the Democrats becoming the liberal party.", "This is a good point.  So I assume Congress will be confirming Obama's SC nominee now.", "Yes that's wonderful. Hitler was also a painter.\n\nAnd I don't give a flying fuck about Godwin's law anymore", "It wouldn't be an issue if America sucked it up and just got a single payer healthcare system but alas when you have the average American believe the BS of 'private sector is the better sector' then don't be surprised when good public policy is ignored in favour of ideology.", "I hope the Trump supporters understand that she's not going to be locked up. ", "I think a lot of them are essentially happy it's not Hillary so they just love that and then you've got those who just hate anything remotely liberal. So this feels great right now for them. They're willing to overlook the fact that his administration will still be full of lobbyists and Wall Street and GOP establishment types because they think they might pay less taxes (which might be the case at first, but they'll lose a shit ton somewhere else), and they think Trump is the right guy to fight ISIS because they're terrified.\n\nSo right now, those guys don't give a shit. They are like the dunces who know they have to listen to a 2-hour timeshare pitch so they can spend a week in a resort. They know it's a sales tactic but they're willing to play along.\n\nDifference is, they're going to end up forced to pay through the nose for that timeshare, and the resort will turn out to be a shithole.", "All those people hate Ted Cruz too.  He's no outsider.", "That is actually Mike Pence", "&gt; Bernie is what the Democrats used to be\n\nBernie is actually what Republicans (circa 1920s) used to be before they became corrupted with the idea that progress was an attack on their wallet and their church.", "This election has practically made me schizophrenic about the media and politics in general. I hear Trump say he might keep Obamacare might do this, might do that, and I'm halfway tempted to just give in to optimism - the election we just had proved that, at least partially, the media and Dems went full on propaganda machine. They can't be trusted so much either. \n\nAnd then I remember that nope, Don is still, my eyes didn't deceive me. It's a fucking endless dialogue about \"Who am I being manipulated by today?\" ", "Bernie Sanders gives me hope that will make it through republican rule and Trump. ", "Reposting from another thread:\n\nThe people aren't as right wing as you think. They are actually quite liberal. See: [Is Bernie Sanders Too Radical for America?](http://prospect.org/article/bernie-sanders-too-radical-america)\n\nLarge numbers of Americans across the political spectrum support much of Bernie's agenda but [a study](http://www.bbc.com/news/blogs-echochambers-27074746) out of Princeton a couple years ago determined that the public has little to no influence on public policy, and only gets what it wants when it wants the same thing as powerful special interests.\n\nThe reasons for that discrepancy are many and complex: we have an electoral college which gives extra weight to the presidential votes of rural citizens, who tend to be more conservative. We have a Senate which over-represents those same rural citizens by giving them the same number of senators as citizens in more populous states. We have a system of voting that favors older, whiter, wealthier (and thus more conservative) voters. For example, you must re-register to vote every time you move, and liberals are more likely to move than conservatives (because liberals tend to be younger and poorer). We currently have Congressional districts that were largely drawn by Republicans in 2010 (since states are responsible for drawing their districts, and more states were under Republican control then). So in the 2012 and 2014 Congressional elections the Republicans took more seats than they received votes:\n\n[﻿Given that Republicans will only win about 52 percent of votes in House races, how are they ending up with 57 percent of seats?](https://www.thenation.com/article/republicans-only-got-52-percent-vote-house-races/)\n\n[In 2012, the first congressional election after the last round of gerrymandering, Democratic House candidates won 50.59 percent of the vote — or 1.37 million more votes than Republican candidates — yet secured only 201 seats in Congress, compared to 234 seats for Republicans.](https://www.republicreport.org/2014/gerrymandering-rigged-the-2014-elections-for-republican-advantage/)\n\nEven at the very local level, who is more likely to show up to a city council meeting at 7pm to voice their concerns? Not poor people working a swing shift, or single moms watching their kids, or college students who have a late class. It's going to be old retirees with nothing else to do, and wealthy people who have a favorable work schedule and can hire a sitter to watch their kids while they go do their civic duty.\n\nAnd that's to say nothing of the influence of money in politics. You need to hire staff and consultants, rent office space and pay for the utilities, and print and send thousands of mailers. Depending on the size of the district and how competitive the race is, you could need to raise millions of dollars for even a relatively obscure office. That money has to come from somewhere.", "Liberal here.  That would be great. I would be happy.  Right now I'm on a plane. And trump is flying.  I'd be an idiot to want him to fail.  But if he starts doing barrel rolls and ejecting people, I'm going to be pissed and want another pilot ASAP.", "With over 300 million guns already in the country fixing systemic inequality poverty, mental health and drug abuse would do more faster to reduce deaths from guns than reducing sales going forward could.", "Ha yeah we need to shut that one down right away. Regardless of how one feels about the Clintons, they are officially political poison.", "I've talked to plenty of Conservatives with regards to socialized healthcare and there's an argument they will actually agree with most of the time (almost always in my personal experience).\n\nWe're already paying for the healthcare of others. Every time someone goes to a hospital and can't afford the bill, everyone who does pay their bill covers it. Now since we're already paying for the emergency services of others, it seems to make sense to just pay it for everyone to begin with, and cut out insurance companies entirely. It reduces the cost, simplifies administration and billing.\n\nOnce we do that, and cover the emergency services of everyone, it becomes a good idea to reduce those costs. How do we do this? Regular checkups and preventative care. It's just plain less expensive to catch things early. So we may as well socialize basic care too.\n\nNow we've given everyone socialized emergency and basic care, paid for through taxes, and frankly we're spending less on it. The middle class and the poor get the largest benefits, as do small businesses.\n\nWe can still have insurance, to cover additional treatments past what the basic level is, but it's no longer a requirement.", "This. \nPeople forget this fact. He has said he doesn't read. His favorite book is one of his own- that he didn't even write.\nI guess it's kind of fitting America being known for its poor education around the world, elected a man who doesn't read.", "He did promise us he was going to surround himself with the smartest people.  He is about to be surrounded by some of the best minds of our generation.  Sarah (I see Russia from my backyard) Palin Ben (Trying my hardest to stay awake) Carson, Chris (the builder of bridges) Christi, and Rudy (911) Giuliani, just to name a few. I am starting to think he meant he was going to LITERALLY go out there and drain swamps, which would be a perfect job for this crew.", "We'll need 2018 first.", "Bold? Provocative? May backfire? Then it's a Trump guarantee.", "Nope. Silence. It was never about policy. ", "It's not even CA it's the CA Democratic party. Who suffers from the same issue of \"my turn\" as the national party.\n\nIn any solidly Democratic district, the ones who get elected are the ones the party puts forward and supports. Challenges to incumbents from within the party are not supported (so they die due to lack of recognition and lack of funding). We had two Democrats running for Senator, I got emails asking to fund one of them (but not the other) to help ensure a Democratic senator. **There were only Democrats on the Nov 8th ballot for Senator** (top2 primary).\n\nThis crap is getting old, the people aren't choosing California's politicians, the Democratic party is. The politicians aren't held accountable to their constituents, they're held accountable to the party. This means party line votes, no bucking the party ever, and every politician is essentially a carbon copy vote record and stances.", "Dems are pursuing issues like assault weapons bans and extended magazine bans which will have virtually no statistical effect on gun violence but are sure piss off gun lovers.\n\nThey're also pursuing no-fly no-buy policies which are on shaky constitutional grounds but are great for Republicans who want to stir up fear about gun-grabbing.", "I understood this at the time. Those who wanted Bernie to do something hotheaded simply did not understand the man they admired. ", "This is implying that Trump is an altruistic person. He's not. Nothing in his history of business even remotely suggests it. The Trump described in that article is a fictional fabrication of the author. Trump is a pathological narcissist and they have an inherent ability to convince vulnerable people that they care about them when they really don't", "&gt;I hear Trump say he might keep Obamacare might do this, might do that, and I'm halfway tempted to just give in to optimism\n\nha..i actually read about this earlier and had a passing thought along the lines of \"maybe he'll really seek out obama's counsel on health care &amp; tell the establishment GOP to fuck off!...be the unlikeliest savior that will in the end, move the GOP base to the left and bring us all together..\" \n\nlike why the fuck am i allowing myself to have these insane thoughts? i guess this is what can happen when trump has taken every fucking position on nearly every issue... &amp; i am desperate to find some silver lining in this disaster...\n\nbut you're right..we can't let our guards down &amp; the manipulation of the press under the trump admin is going to be unprecedented. deciphering fact from spin is going to get even more challenging...check out this article if you haven't already: http://www2.nybooks.com/daily/s3/nov/10/trump-election-autocracy-rules-for-survival.html", "&gt; he'll blame it on an Obama hangover.\n\nThen they can blame Obama for everything from 9/11/2001 to 1/20/2025", "The DNC gets caught rigging the primaries in their own words and somehow hillary got victim shamed.\n\nNot Hillary sucked as a candidate because she and her cult deliberately alienated people they needed in the general not Hillary sucked as a candidate because she took 20 years blackmailing journalists and courting third world despots and got caught in their own words, no t hillary sucked by completely turning her back on the liberal left with her withered pragmatism, and definitely not that she sucked by getting an all-star celebrity cast that failed to energize a weary, battered, impoverished electorate.\n\nNo, it must be the kids that were wrong.", "But pardon the language: why the fuck not.\n\nI'm a scientist, and on Monday I will be going (with many of the graduate students in my department) to a webinar about how to react to Trump's election. The writing is on the wall for funding, and it's going to be a lot harder to find STEM jobs in this country in two years. As a result, we are going to be learning about which countries will be the best places to look for post-doctoral positions, and how to apply for them.\n\nThe writing was on the wall for these factory towns, 30 years ago (probably as long as many of those factories operated) just like it is for us, why didn't they prepare then, when they had the economic means to do other things?\n\nI'm from Wyoming (live in CO now), and Liz Cheney just won a house seat on a platform of bringing back the coal industry, claiming it has been regulated to death. Frankly, natural gas won because of the energy market, so why are they more concerned with bringing coal back than exploring expanding solar and wind, or tourism, or agriculture? (In my opinion coal should be taxed heavily, given the health effects it causes, the cost of which get passed on, but that is neither here nor there)\n\nWhy are we apologizing to and for this? I can understand the frustration of these communities, but it's hard to take it seriously when there is so much more effort to blame people a thousand miles away than there is to find solutions. ", "Because it was. This election cycle was amazing from start to finish. Trump ran one of the strangest most unorthodox campaigns in history he killed two political dynasties, flipped multiple democratic strongholds republican, and did this while the media and both party establishments were crucifying him at every opportunity. \n\nSay what you will about Trump, but there is no denying his campaign was amazing.", "Pretty sure the only people he's ever actually stuck it to are the middle class workers he's avoided paying for three decades. Other than that he's simply been mouthing off about the nasty woman that he's been in bed with since '92. \n\n", "You know you should hop over to /r/liberalgunowners some time and ask us why we oppose so many of the Democratic gun control proposals. There's actually reasons behind it other than \"molon labe\" and \"shall not be infringed\". Some of these \"common sense\" proposals are just badly thought out, or have huge glaring problems when viewed by someone knowledgeable about firearms, or just aren't even addressing a real problem (like assault weapon bans).", "Indeed. My sister is one of them she actually yelled at our mother (Who has been supportive of us our entire lives) because she voted for Johnson. We live in California, Clinton won California, my mother's vote was not a swing vote... but it's not about the results. It's about validating their views through having a majority.\n\nIt's the crybully mentality taken to the logical conclusion. \n\nEdit: A friend said it's the classic story of the tortise and the hare, only in this case the hare flips out and accuses everyone who didn't wake it up (despite it wearing earplugs) of being the reason it lost. ", "I am not even sure how gun control became a partisan issue. I am as liberal as they come but there are half a dozen firearms in my house.", "It's just mind-boggling. Things like banning assault weapons or extended magazines would have statistically no effect on gun violence and yet they pursue it.\n\nWant to stop gun crimes? Ban personal handguns. Don't want to lose your political career? Expanded background checks, maybe, then get on with your life.", "Trump had less votes than Mitt Romney in 2012 and still beat Hillary.", "So much salt. Hope they shrivel in it.", "This whole election has taught me that sometimes Godwins Law isn't going too far. ", "And which of his policies are going to achieve that? Repealing the ACA bringing back nonexistent jobs, or that yuuuge 3% tax cut that the the bottom 95% are going to see?", "Trump won because \"Democrats\" are tired to being called Democrats.  Most people that stayed home silently left the party.  You're looking for something to blame.  Blame your party.  Blame your candidate.  ", "Sorry but you people are going to hear \"I TOLD YOU SO\" on repeat for the next four years. Get used to it.", "Oh like Trump did to Obama and Joe wilson with the you lie and all the racist bigotry to back to africa talk surrounding Obama for the last 8 years, and sptting on african american congressmen, and jumping the white house fence yeah thats right that was some respect \n\nNo worries wapo we are showing our respect", "The senate should have had a hearing on Garland a long time ago. The GOP doesn't get to decide what presidents get to make supreme court nominations. Their obstructionism is unprecedented and unconstitutional.", "They're gonna have to or get used to the consequences. Many of these areas have been in steady palpable decline since the 80's. The towns haven't changed the people haven't changed, and the entire world is 40 miles ahead. It's not their fault that they're out of work, it's not their fault that they get paid shit wages, but it is their fault that they've failed to see what's happening and prepared for it. It's their local government's fault for betting their existence on a single industry or company. If you've watched your co-workers get laid off one after another for 20 years, why haven't you saved up for when it's your turn? Your dad worked the coal mine for 40 years and got his watch, he was lucky, you'll have to be more flexible. Nobody wants to hear this shit. No politician will ever say it. \n\nBut there is hope. Many cities are diversifying on multiple fronts. It takes a bunch of money to clean up waterways and industrial sites, but new developments can bring much needed business and commerce to the area. The large cheap buildings are being used by start-ups and other innovative manufacturers. There's not going to be a lot of good jobs for the high school dropouts, or even the high school grads, but that's why funding secondary education (trade schools to universities) is so important and such a big deal that tuition is skyrocketing. ", "Holy shit this was infuriating. And the news broke just days before of the DNC's emails proving what we all knew was going on. The wounds were rather fresh. And she had the audacity to tell us we were being ridiculous? She lost my respect right there. ", "New York and California would vote blue regardless if the Democrats view on the second amendment.", "Absolutely not. This is one issue I feel strongly about and it has been largely mischaracterized by the right. The message has to be louder and clearer that Democrats are not trying to abolish the Second Amendment and take away guns from law abiding citizens. You hear this false narrative all over right wing media and it's simply not true.\n\nAny non-criminal can just walk into a store and legally buy a gun. Yet in order to legally drive a car, you have to get a learner's permit for a period of time, pass a written test and road test, and pay for insurance. Why? Because driving a car with no training is extremely dangerous. It's not unreasonable to apply some of these same regulations to gun ownership.\n\nNothing can prevent a gun from being fired and killing someone if it's in the hands of someone with malicious intent. Yet, most of us walk around with smart phones in our pockets heavily secured with sophisticated encryption technology and fingerprint scanning. Why? Because it would be dangerous if the wrong person got their hands on our personal data. Again, not unreasonable to apply some of this technology to guns.\n\nNo one is saying that law-abiding citizens shouldn't have the right to own guns for protection, hunting, or hobby. I'm sick of this bullshit story that Democrats are going to throw away the Constitution and ban all firearms. This particular issue wasn't a major factor in the election this year, but it should have been. I hope that Democratic candidates will articulate this point clearly in the future and not allow room for fear-mongering.\n", "Can I have some examples? It's all well and good to say I'm wrong but if you aren't backing up your point with an example no one is going to pay attention.", "If by clear message you mean \"Chelsea Clinton\" then 2020 is in the bag GG 2 EZ.\n\n\n/s", "A trumpet tried to show me a video yesterday to change my position it literally said \"we don't care if he means it (what he says) or not, he tells us what we want to hear, and we like it.\"", "It wouldn't be hard for it to be even remotely better. Trump literally picked up a list of the least popular high-profile republicans and used it to fill out his cabinet.\n\nFucking *PALIN*!? The one who sunk McCain's campaign?!", "The truth of the matter is that Pence and Newt will be handling this country and telling him what to do. It's like a shitty boss with an efficient secretary. ", "Yup. He is gonna pull a Sarah Palin and quit halfway through his term because he gets bored.", "I don't know I just hate how that's become one of those issues that's taboo for no good reason.  A couple months ago, we had a mass shooting in the state of Washington.  Unfortunately, five people lost their lives.  We learned, though, that it could have been much worse as the perpetrator had tried numerous times to obtain more firepower, but was denied every time and ended up with a single low caliber rifle.\n\nThat's all I mean when I say I favor gun control.  I don't want to bother enthusiasts, hunters, or collectors or pressure concealed carries.  I just don't think it should be a non-starter to wonder how we can also keep them out of the hands of people who will use the to commit crimes. ", "Hijacking here to give [a shoutout to Brand New Congress](https://brandnewcongress.org/home) -- help former Bernie staffers and local-level progressives recruit and campaign for progressive candidates for the midterms. ", "2018 at the very latest. ", "lol. Just watching Trump propose most of what I know r/politics supports is just too fucking funny.\n", "Please don't blame \"west coast tech companies\"\nThis is driven by market demand it's everyone. \n\nOr to put it another way: If our technology centers on the coast don't perfect self driving cars, the Chinese will. Or he Germans. It's going to happen.", "Jesus Christ what the fuck is this title?", "I wish. We can't even agree someone is knocking at the door.", "Kansan here jesus fuck can the dems just be reasonable about gun control ffs. Gun usage in urban and rural environments is significantly different and regulations targeting urban issues aren't reasonable in rural areas.", "&gt; There is a reason why you're butt hurt about the fact that the republicans have swept the entire government.\n\nIt's not \"butthurt.\"  It's genuine fear.", "&gt; but I missed the email where they explained what action they took to \"rig\" the primaries.\n\nSTAND BACK ECHO CHAMBER ABOUT TO BE SHATTERED.\n\nHillary's campaign trying to stop a GMO bill because it helps Bernie: https://wikileaks.org/podesta-emails/emailid/4930\n\nTim Kaine promised as VP as far back at a year ago: https://wikileaks.org/podesta-emails/emailid/2986\n\nCNN town hall questions fed to Hillary's campaign ahead of time from the DNC: http://www.politico.com/story/2016/10/wikileaks-email-hack-clinton-donna-brazile-229609\n\nThe Primary debate schedule WAS skewed to reduce viewership which helps Hillary: https://wikileaks.org/podesta-emails/emailid/5688\n\n\"As soon as the nomination is wrapped up, I will be your biggest surrogate.\" - From the current head of the DNC before single vote was ever casted: https://wikileaks.org/podesta-emails/emailid/5616\n\nThe Hillary Victory Fund was a front so the DNC can launder money directly to Hillary's campaign far beyond the $2700 cap: http://www.politico.com/story/2016/04/clinton-fundraising-leaves-little-for-state-parties-222670 AND THE CLINTON CAMPAIGN LOVES IT: https://twitter.com/wikileaks/status/793673434710540288\n\nMass collusion with the media: https://twitter.com/wikileaks/status/795696999597281281 https://twitter.com/wikileaks/status/795073756599291904 https://twitter.com/wikileaks/status/794608823000559616 https://twitter.com/wikileaks/status/790713289311387648 http://observer.com/2016/11/new-dnc-emails-expose-more-dnc-media-clinton-campaign-collusion/\n\nSanders had a non-aggression pact with the Clinton: https://twitter.com/wikileaks/status/794756750926876672\n\n\"Where should we stick the knife in?\": https://twitter.com/wikileaks/status/794220599803461632\n\n\"meetings with other candidates to make credibility\": https://twitter.com/wikileaks/status/793877632333049856\n\nMoving around primary dates to benefit Hillary and give rise to Trump: http://dailycaller.com/2016/11/03/leaked-clinton-camp-discussed-moving-primary-dates-to-shut-out-challengers/\n\nThe world is a lot more informative when you don't stand there plugging your ears and screaming LALALAALALA.", "How will Trump's policies actually help the work class? ", "Well isn't it? Let's count how many times she's investigated from here on out. Republicans were relentless with their internal shit throwing about anything they could and the media ate that shit up.", "David Clarke is a lunatic.", "I don't understand what is wrong with deporting illegal immigrants. If you want to immigrate to my country that's fine but do it legally. Most of us are law abiding citizens and I struggle to understand why we're all expected to be so accepting of people who have shown blatant disregard to the laws of our land.", "I'm still stuck on his kids running the business and also helping with the transition ", "Damn that's well written. ", "Uh once he starts to do something to earn my respect, I'll give it.  At this point his done numerous things for me to lose it.  ", "&gt; Drop the anti gun stuff that isnt research based (magazine restrictions banning guns on looks, demonizing gun owners),\n\nI'm 100% for massive gun reform but I agree, it's just never helped democrats win anything. Abandon this issue until voters are actually willing to show up for it.\n\nThe rest of what you said is spot on.", "I honestly feel like I'm getting more stupid by constantly reading and being around the opinions and justifications of the people who support Trump hardcore and this new found nationalism in general. It's so encouraging to see posts like this to remind me it's not truly the Twilight Zone quite yet. I will be staying away from political YouTube videos for quite a while though", "He's walked onto a whole other battlefield where he has few to no allies, no experience, and general degree of animosity against him. Trump has literally walked into the heart of the establishment and in that zone, you can't be anti-establishment lest you intend to be an island. In which case, you'll have little impact on the country because you won't be able to efficiently lead it.\n\nIt's not like being CEO of a business. You can't just waltz in and take charge, especially if you've had little to no experience and very few actual connections to help you out. There are a lot of factions in the government and almost none of them have a reason to trust or aid Trump if the establishment doesn't give them the greenlight to do so. \n\nIt's not worth breaking from the lords of the realm to support the king if the king can't get shit done without said lords in the first place.", "maybe if the other side didn't run such a divisive campaign. ", "Violence remains not the answer", "SJWs are most definitely a thing. \n", "It is devastating. I have cried and drank myself into a stupor every day since Tuesday tbh. I am not blaming her outfits or how she looks. I think that we overestimated the ability of our nations voters to make decisions based on logic and reasoning. "], "links": ["5chl8x", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5ci67q", "5ci67q", "5chl8x", "5cicok", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5cizab", "5ci67q", "5chl8x", "5chi76", "5cgao3", "5chl8x", "5ci67q", "5cizab", "5chl8x", "5cicok", "5ciod4", "5chl8x", "5chl8x", "5ci67q", "5ci67q", "5ciod4", "5ci67q", "5ci67q", "5cj54p", "5ci67q", "5ci67q", "5ci67q", "5cihue", "5cgw6a", "5ci67q", "5cinmu", "5chl8x", "5chi76", "5chi76", "5ci67q", "5chl8x", "5ciod4", "5chl8x", "5cj26i", "5chl8x", "5ciyrj", "5chl8x", "5chi76", "5chi76", "5chi76", "5ci67q", "5ci67q", "5chl8x", "5chl8x", "5chl8x", "5chl8x", "5cj26i", "5cizab", "5cizab", "5chl8x", "5chcm7", "5chi76", "5chi76", "5cicok", "5ci67q", "5chl8x", "5chl8x", "5chkza", "5cihue", "5ci67q", "5ci67q", "5ci67q", "5cj54f", "5chl8x", "5cibdn", "5chl8x", "5chi76", "5chkza", "5cj26i", "5chkza", "5chi76", "5cinmu", "5cj0yd", "5cgso6", "5chl8x", "5cizab", "5ci67q", "5chl8x", "5cgswr", "5cig30", "5cj4fs", "5chi76", "5chl8x"]}