{"comments": ["There was a 70 some old year old women at my polling place who was on a cane and struggling to even walk. She flipped the fuck out when they weren't checking ID's and started yelling at the volunteers. It was bad.", "I live in North Carolina so we used to but they got rid of it a few months back.", "and ~~they used~~ have been using that one video for years and years claiming it ~~was~~ an epidemic. ", "Do you have Id requirements in your state? If not that's hilarious. ", "&gt; Since Virginia is an open carry state he could legally have his weapon. Plus, he was respecting Virginia’s rules about canvassing at polling places: Campaigners have to stay back 40 feet from polling places, and the sidewalk where the man was standing is outside of the no-canvass zone.\n\n&gt;“They said that there’s nothing they could do, that he was well within his rights to be carrying his weapon,” she said.\n\nIs voter intimidation not illegal in Virginia? His campaigning and gun carrying might not have been illegal individually, but doing both at the same time should definitely fall under voter intimidation.", "We already know how conservatives responded to black panthers with guns. The Mulford Act in California happened because of black panthers in Oakland\n\n&gt;The law a response to the Black Panthers' conspicuous exercise of the right to armed self-defense, also was supported by Gov. Ronald Reagan.\" As the bill's conservative sponsor, Don Mulford (R), argued in 1989, \"openly carrying a gun is an 'act of violence or near violence,'\" Sullum noted.", "I am taking a roll of tin foil to the polls with me.  Anyone who tries to talk to me will get no response only a quickly fashioned hat.  I've been working on it, and I can have a hat folded for them in 20 seconds.  I can't wait!", "I support the 2nd Amendment - but when I hear people saying we need it to protect us from tyranny... I can't help but think when and if tyranny finally does arrive in this country they'll be it's champions. ", "If I've said it once I've said it a thousand times.  If Congress sends Clinton liberal bills she will sign them into law.  If you think that she alone will create a liberal agenda you are going to be disappointed in her.", "&gt; And when Trump insulted POWs i was blown away. I honestly thought active duty members vets, POWs, military families would all come out and defend our POWs and stand up for them.\n\nIt's because he's a Republican.  That's literally it.  His statements about POWs, earning a Purple Heart, how sleeping around and risking STDs was \"his own Vietnam\" ... those would've absolutely sunk, right then and there, any Democratic candidate.", "Anyone with a brain and an ounce of compassion.", "Everything this man says makes me respect him more", "Sure he was within his rights and the law, but he was being a giant asshole.\n\nI'm curious what options other people have to counter this kind of assholery while also still being with their rights and not breaking the law.", "Trump's Greatest Hits of 2016. *As seen on TV*", "She probably doesn't care what I think and I'm not advocating for her but nothing Hillary can say or do will make Trump any less of a disgusting con.", "Form a party within a party.\n\nThe Tea Party is holding the Republican Party by the balls. Replicate this from the left.", "Midterms.  Berniecrats get my vote Clinton's Corpratists will not.", "Not that surprising after a campaign that's textbook fascism.", "Cant wait this shit goblin to lose", "Latinos be like Surprise Muthafucka. And now he probably get stuck in his own prison.", "And Trump is counting on fascists like you", "What about when he said \"Grab them by the pussy\" \n\nWait was that Bernie or someone else... ", "And if you read between the lines his opposition to the Iraq war is that we didn't go far enough (ie, take the oil).", "She's a public servant more than a leader, but that's good. She has proven that she will bow to pressure from her constituents and donors.\n\nIn a representative democracy, that's how it's supposed to work. She's a little more....convincable...than Bernie, but Obama was the same way. I think she'd be happy to have people pressuring her to adopt a Bernie-type agenda, with so much pressure put on her and Congress that they just have to shrug their shoulders at the big corporate donors and say 'I gotta do this for the people, or I won't get reelected.' And kick the corporate interests down the road for a little, instead of vice-versa. ", "The GOP has the best warnings. Like Paul Ryan warning that Bernie Sanders might chair the Senate budget committee if the Republicans lost Senate control.", "Trump is hoping the 'poorly educated' pull through for him. Ignorance is the only way he can win.", "I'm dumb as a brick and even I can't stand the idea of voting for Trump! ", "\"Saudi Arabia with Nukes? Absolutely.\" - Donald Trump when asked if Saudi Arabia should have nuclear weapons. ", "I think he's just pointing out how the dude has a small dick.", "along with science logic and facts.", "\nIn 1993 and the rest of her tenure as First Lady [Clinton pushed the government to fight AIDS](http://articles.latimes.com/1993-11-24/entertainment/ca-60384_1_aids-honors-clinton).\n\nIn 1998, [Clinton worked behind the scenes to defeat a ban on gay adoptions](http://www.politico.com/story/2015/04/clinton-white-house-gay-rights-hillary-clinton-staff-116859), successfully too.\n\n\nIn 1999, [she backed domestic partnerships to ensure benefits for all Federal employees and denounced DADT](https://www.washingtonpost.com/blogs/the-fix/wp/2013/03/18/how-hillary-clinton-evolved-on-gay-marriage). As a quick side note, DADT made things better for gay servicemembers. It banned discrimination and harassment stemming from sexual orientation and removed the ban on gay servicemembers. While there were obviously zealous officers that didn't get the memo, and while it didn't remove the ban on openly gay servicemembers, it still helped. It actually came about when Bill Clinton tried to completely remove the ban on the LGBT+ community.\n\nIn 2000, [she became the first First Lady and to march in a gay pride parade](https://www.washingtonpost.com/archive/politics/2000/06/26/hillary-clinton-giuliani-march-in-ny-gay-parade/93eab33a-6e64-4c3b-9035-f8dbd1a2e30e/).\n\nIn 2004, [she spoke out on the Senate floor against a proposed constitutional amendment that would ban gay marriage](https://www.youtube.com/watch?v=6I1-r1YgK9I). I'm pretty sure at this point, everyone and their mothers have seen this YouTube video that shows Clinton saying something along the lines of \"marriage is a sacred bond between a man and a woman.\" The great irony of this video is that this phrase comes directly out of a speech by Clinton on the Senate floor against a proposed Constitutional amendment that would explicitly ban gay marriage. Her rhetoric in this speech, to me anyways, is brilliant. It opened a new avenue of attack against the amendment. The speech basically said that if you were against gay marriage, you could also be against the proposed amendment. I'm willing to bet that at least a single person changed their vote due to that speech. In the same, obvious vein, the speech shows that Clinton isn't at all against gay marriage. If she was, she wouldn't have given that speech. She would have simply said \"yea\".\n\nIn 2006, [she fought to preserve AIDS/HIV healthcare funding](http://votesmart.org/public-statement/177631/senator-clinton-presses-for-fair-share-of-ryan-white-funding-for-new-york#.U1aXMvldV8E)\n\nIn 2007, [she cosponsored legislation to reduce LGBT+ based hate crimes](https://www.congress.gov/bill/110th-congress/senate-bill/1105/cosponsors?q=%7B%22search%22%3A%5B%22s1105%22%5D%7D).\n\nAlso in 2007, [she supported lifting restrictions on LGBT+ servicemembers](http://usatoday30.usatoday.com/news/politics/2007-04-22-clinton-iowa_N.htm?csp=34).\n\nThroughout her tenure as Senator, [she repeatedly cosponsored ENDA to prevent employment discrimination based on sexual orientation](http://www.politico.com/pdf/PPM42_benhrc.pdf).\n\nIn 2009, [she extended heterosexual partner benefits to homosexual diplomats](http://www.nytimes.com/2009/05/24/us/24benefit.html).\n\nAlso in 2009, [she awarded GLIFAA as the Employee Resource Group of the year](https://www.usaid.gov/content/gays-and-lesbians-foreign-affairs-agencies-named-employee-resource-group-year).\n\nAgain in 2009, [she fought Uganda to promote human rights for the LGBT+ community](http://www.state.gov/secretary/20092013clinton/rm/2009a/12/133544.htm).\n\nIn 2010, [she made it easier for transgender Americans to change their passports to reflect their actual gender](http://www.politico.com/magazine/story/2016/07/hillary-clinton-2016-transgender-rights-passport-policy-state-department-lgbt-equality-214007).\n\nIn 2011, [she took a leading role in passing the first UN resolution protecting the LGBT+ community](http://www.state.gov/secretary/20092013clinton/rm/2011/03/158846.htm).\n\nAlso in 2011, [she secured a UNHRC statement against violence towards the LGBT+ community](http://www.state.gov/secretary/20092013clinton/rm/2011/03/158846.htm).\n\nYet again in 2011, [she launched the Global Equality Fund to support human rights advocates](http://www.state.gov/j/drl/rls/rm/2013/215847.htm).\n\nAnd once more in 2011, [she made a historic speech at Geneva that declared that \"gay rights are human rights\"](https://www.washingtonpost.com/blogs/post-partisan/post/clintons-geneva-accord-gay-rights-are-human-rights/2011/03/04/gIQAPUipcO_blog.html?utm_term=.bed838d044a0).\n\nAnd because she was a busy woman in 2011, [she announced that it was formal US foreign policy to support gay rights aboard](http://www.nytimes.com/2011/12/07/world/united-states-to-use-aid-to-promote-gay-rights-abroad.html?pagewanted=all).\n\nAnd throughout her tenure as Secretary of State, [she worked to protect the LGBT+ community in more ways than I can name](http://www.state.gov/r/pa/prs/ps/2011/12/178341.htm).\n\nIn 2013, [she formally and publicly endorses gay marriage](https://www.youtube.com/watch?v=6RP9pbKMJ7c).\n\nWhile as a private citizen Clinton doesn't have as much clout as she did as a public servant, she still supports the LGBT+ cause.\n\nIn 2016, [she made a surprise appearance at another pride parade, making history as the first presidential candidate of a major party to do so](http://www.out.com/news-opinion/2016/6/27/hillary-clinton-made-history-new-york-pride-parade).\n\nCourtesy of /u/hcregna", "Oh look Vox spewing shit again.", "1) Clinton gets into the Whitehouse and feels no obligation whatsoever to change a thing. ", "\"And both anti-government militia groups such as the Three-Percenters and the Oath Keepers and neo-Nazi/white nationalist organizations including the Nationalist Socialist Party the American Freedom Party, and various Ku Klux Klan-affiliated groups are actively preparing to deploy to watch the polls to make sure the election isn’t “stolen” from Trump by these powerful global elites.\n\nThat Donald Trump released an ad just days before the election that is specifically designed to fuel the paranoid conspiracy theories held by these armed extremist groups is profoundly disturbing.\"\n\nIf I were Putin trying to destabilize America, this is certainly one thing I would do.", "This can't be true I have been told by experts (loud people on Facebook) that nobody in the military supports Hillary because she didn't wear a flag pin during the debates.  They told me that no real military person could support a candidate who disrespects the country.  (Which they assure me, not wearing a flag pin is disrespecting our country)  This must be more lies made up by the MSM to prop up Hillary.\n\n(Oh how I wish I didn't need to point out that this is sarcasm, but experience has taught me that I need to make that clear.)", "It's more of an and/or thing at this point.", "&gt; “They said that there’s nothing they could do that he was well within his rights to be carrying his weapon,” she said.\n\nWell yeah, but asking \" Who are you going to vote for, Crooked Hillary?\" is NOT within his rights.  the fucker should have been arrested.", "&gt;October 27th\n\nOh for fuck's sake man\n\n", "Says upper class white woman with little at stake. ", "Feel better about yourself people who are truly dumb would never have the self awareness to realize it.", "I am praying for an election day landslide this needs to happen.  Low single digits isn't enough to send a message.", "They won't pressure her. They let her control them.", "Actually Trump called ya poorly educated.", "Bernie supporters need to prove they can be a reliable voting block otherwise why should the DNC cater to their opinions? May as well cater to moderates because at least they vote. \n\nThe DNC proposed the most liberal agenda in U.S. history. If young liberals still won't vote Democratic after that, why should they stick to any of it? \n\nNow, I do think Clinton is inherently more liberal than she is usually given credit for. But the best thing to do when someone offers a huge compromise is to take it and then continue the pressure. You put her in power and then make her work to earn your vote again in 2020 because without you she couldn't have been elected in 2016.", "Obama gets his supporters to be better persons by encouraging them to respect freedom and be tolerant. \n\nTrump gets his supports to be ____________ by _______________. \n\nI will let people fill in the blanks.", "It's legal but it is tasteless as fuck.  \n\nlegal != moral", "Arizona needs to get its shit together. It isn't like elections randomly happen there's no excuse for not being prepared. ", "Damn imm'grants comin' here takin' all our jerbs!", "They are classified as \"low propensity\" voters.  In other words they didn't vote in the past that much if at all or they are new voters.  So they are almost completely missing from the polls.", "But not by the pussy.", "Yeah armed people asking you questions is definitely intimidating.", "And the educated.  \n\nThis is why the GOP hates public universities—kids get exposed to other people and ideas.", "Idiots who don't go around threatening mothers? Get real clown.", "Yeah but Bernie **has never**  voted the opposite of Trump in the senate. So obviously they fit better with each other policy wise. /s", "Glad your only source of news is Reddit TrumpBabe. Thanks for that valuable contribution ", "Extend the order against the RNC forever. ", "I don't know if Americans deserve much credit for dodging a bullet they fired at themselves.", "Are you saying that he wasn't being threatening? The fact that she was harassed after declining is what's wrong with this man not the literature.", "Crab men (\\\\/) (°„°) (\\\\/)", "oh i'll be doing some dragging on tuesday", "I've come to the belief that there's a tiny fraction of Bernie's supporters the likes of HA Goodman, who believe deep in the hearts that Hillary Clinton is an evil person and cannot possibly vote for her.  Regardless.  They might distrust Clinton and Trump equally, but they will get more satisfaction if Clinton loses.  As such they might vote for Trump or stay home.\n\nClinton's final days strategy ought to be: of those who she knows will vote for her, get their asses to the voting stations.", "Oh wow. I have no idea why I just saw this. \n\nIt's still not that long ago. And it was unsubmitted. ", "Everything is a false flag!!!  Including this post!!!\n\n", "Oh boy dont get me started. I had a debate with a LATINAS FOR TRUMP supporter right away I poked fun at \"people that hate their own people\" and she confirmed my theory that she only encountered hate and racism from her own people not whites (too bad she spent most of her life around her own people, and I appreciate white liberals for making her feel welcomed)  \n\nShe got on my nerves when she showed no basic understanding for the economy or anything for that matter. \n\nShe said Trump is honest and makes a lot of money and Hillary wont reveal how she got her wealth :/ she doesnt even understand what releasing your tax returns mean, poor woman thinks that it only shows you write a check to the gov every year to pretend youre a good citizen. Soo many screen shots im going to sell to historians 30-50 years from now. ", "God I hope this is true. I really do.", "All i know is that if he incites violence when he loses by a landslide they better get his ass for sedition.", "I disagree. Trump is that bad. ", "This is what happens when your base is completely made up of conservative radical extremists. Second amendment intimidation to suppress the first. Expect more of it when you vote Trump.", "no clue what the fuck you're on about with that straw man argument \n\nwas referring to this\n\nhttps://en.wikipedia.org/wiki/Mulford_Act which the NRA supported", "Gays blacks, latinos, Jews, and women are pretty much the democrat base. :)", "The living will envy the dead!", "The [Black Panthers](https://en.wikipedia.org/wiki/New_Black_Panther_Party_voter_intimidation_case) did get in trouble in 2008. If I remember correctly the alt right media were all pissed off about it.", "America? if we stop trump I'll chalk this up as yet another time America saved the world. ", "Gotta tell you the 0% is impressive as hell. I appreciate the shit out of it.", "It seems harassing someone about their candidate choice right before they go vote would only harden their resolve. Human nature.", "I see you have Trump's problem of not understanding what quotation marks are for.", "Ha goodman was pushing for Rand Paul before Bernie. He is no liberal he is merely anti-Clinton.", "One can only dream", "idk I got into a bit of a discussion with a trumpeter the other day, and they told me among other things that 'He's only bankrupted 4 times, and that's not really a big deal - just good business' , when I disputed his honesty level and pointed out his politifact record I was told it was a fake site and that anyone can find websites to say whatever they want.  Then she said she'd watched all his speeches and that's all she needed, she remembers stuff and that is proof to her that he's a legitimate good choice.  She's for sure anti-Clinton, but also for sure pro-Trump, even if she's oblivious to what that means. ", "Because many self-described \"Libertarians\" are really just \"Fuck you I got mine\" conservatives. So Trump isn't much of a stretch for them.", "Start prepping for 2018. Work on strong moderate candidates to win back GOP-held districts. In safer ones primary House members who could be more left wing, eg Gabbard. You force them to move left even if you don't beat them.", "Makes sense the lives of their family members depend on getting this right. Draft dodger who thinks he knows more than the generals, wants to commit war crimes, plays fast and loose with nukes, insults PoWs, thinks not paying his taxes is smart, and wants to weaken our military alliances. Can't picture that being very appealing.", "This is a lie....you are a liar.  This was about school elections. You know how you know its not true? Because ....if Obama had told illegal aliens to vote in a presidential election...\n\nWE WOULD HAVE FUCKING HEARD ABOUT IT!!!\n\nEdit: My mistake this is a different video than I thought.  Does that make me wrong? NO because this one is a lie also. \n\nObama clearly says...If you have a family member that is undocumented then you have a greater reason to vote\".\nHe clearly says dont be worried to vote if you have undocumented family living with you.", "kasich is the only one who never boarded the trump train. if trump loses he's the only guy who gets to beat everyone with that card come 2020", "Strength and resilience through diversity true in biology and Nation States.", "Wang is just straight up ignoring the fact that there's still 8.5% of the vote missing in national polling averages. That's just in heads up. There's 12.1% missing between Trump and Hillary in the 4-way polling.\n\nSilver thinks that will be a massive factor and Wang doesn't. Wang literally says in this interview that \"this is the most statistically stable race since Eisenhower vs. (somebody)\", implying that there's no volatility here. I'm not a statistician on their level, not even remotely, but I can recognize hubris when I see it.\n\nI also respect Silver for recognizing this and pointing it out, even knowing that it could make him look like a complete idiot post-election. He doesn't know for sure either way, and isn't going to pretend he does. If Clinton wins (as he predicts will happen), he'll no doubt get shit on for it. It takes integrity that most people don't have to speak the truth even when there's no upside to it.", "You must be dangerously full of shit.", "Got out and VOTE!\n\nBury this fucker.", "I cannot help but laugh because that is so obviously ridiculous. Hopefully after the election is over /r/The_Donald will just be a source of comedy.", "I personally think that Sanders could get a non-trivial group of his supporters to protest vote in 4 years if Clinton fails to implement or support a minimum viable platform of liberal policy. Given who she is to the other side any lost support could end her in 4 years.", "Still not sure...\n\nFuck this election.", "538 currently has it at 291 for Clinton 246 for Trump.  Hardly a landslide.  I really hope these guys are right and Silver is off and Trump's brand of bullshit is thoroughly repudiated, but we shouldn't take anything for granted. ", "Kellyanne Conway:\n\n&gt;“You're taking it literally” Conway said. “You're stuck on this one thing.”\n\nor\n\n&gt;[Responding to a quote of Trump's] “That’s a very unfortunate phrase, and people really should stop using it,” Conway said.\n\nor\n\n&gt;[Kellyanne Conway walks out of interview with Dana Bash]", "When Jay Z runs for president we will hold him to the same standard.", "I could not disagree more. Only one candidate in my lifetime has ever repeatedly threatened nearly all civil liberties in direct quotes that can be taken in context without spin.\n\nIt sounds less like \"We'll be fine\" and much more like \"We'll be screwed\".", "Lock him up!", "Get in the basket. ", "If you experience intimidation while voting make sure to report it.\n\nContact the [election crimes](https://www.fbi.gov/investigate/public-corruption) division at your local [FBI field offices](https://www.fbi.gov/contact-us/field-offices).\n\nAlso file a report with the DoJ's Civil Rights division:\n\nToll-free - (800) 253-3931 // Telephone - (202) 307-2767\n\nInformation on responding to voter intimidation.\nhttp://www.snopes.com/2016/10/12/how-should-voters-respond-to-unlicensed-poll-watchers/\n\nElection Protection coalition\nhttp://www.866ourvote.org/", "God forbid people exercise their right to vote. ", "Nevada GOP Official: I'm a racist!", "if your attitude is that the goal of a government is to limit peoples opportunity to vote then you should not live in a democracy.\n", "&gt; If you experience intimidation\n\n&gt;Contact...your local FBI\n\nWhy? Does the intimidator need help?", "Helping them? You mean by allowing them to exercise their constitutionally protected right to vote? ", "I think that I've finally realized why Trump thinks the election is \"rigged.\" Because he honestly doesn't believe Hispanics should be allowed to vote Latino's votes shouldn't count. After all, he does not believe that children of illegal immigrants born in the United States are actual citizens but those children get to vote.", "“Last night in Clark County, they kept a poll open till 10 o’clock at night so a certain group could vote,” Chairman Michael McDonald said at a rally for GOP nominee Donald Trump Saturday in Reno.\n\nHmm... what \"group\" do you think he was referring to?", "He's back to talking about it being rigged again.\n\nConway must've called in all her favors got some bad internals.", "I live in NC also had someone on my facebook whining about how they \"didn't even check our i.d.'s #rigged\" ", "I don't even understand how the GOP is still elected in some states. Obviously there's some severe gerrymandering but how can people support these blatant racists?", "40 feet isn't very far at all but that's the key bit of info here. Perhaps after the election we'll see bills proposing a larger \"buffer\" area, but once you're outside 40 feet, you're just like any other dude handing out flyers on the street. It's very clear what his intent was, and it's voter intimidation in all but the letter of the law. \n\nHe's playing the \"I'm not touching you\" game. Sure, you're not actually touching me, but you're still a dick. ", "I'm not one of those people who says they're going to move out of the country if Trump wins but it's a whole other story if it means I might be put in a boxcar like my relatives were in the 1940s...", "Why the fuck would she care after she already has their vote?", "\"I'm not confident enough with my racism to blatantly call Hispanics out.\"", "Used? It's still constantly being brought up. Put that shit in present tense. ", "They love to victim blame all the time.", "\"Don't you feel less free when there's more time available to vote?\" says only a stupid person", "But but.. they were armed with black skin. /s", "Its not about victim blaming\n\nits about not taking responsibility for themselves.\n\nThey are happy to blame *anyone* as long its not themselves", "&gt;\"The polls are supposed to close at 7 this was kept open 'til 10. Yeah, you feel free right now? You're think this is a free and easy election?\"\n\nOh, so *this* is what conservatives mean by tyranny. I get it now.", "Bernie successfully got the Democratic Party to adopt the most progressive platform in history.\n\nSo now progressives *must* reward them for it. Otherwise the party will take home the message that liberal voters are too fickle to bother appealing to. And the DNC will move further to the right, chasing after fictional \"moderates\" for another generation.\n\nThis is how progress works, folks. It's incremental. Otherwise the Progressive Movement would be called the Instant Gratification Movement.", "My cousin is an army officer. We generally don't talk about this because we are polar opposites and it becomes genuinely frustrating. He hates Obama and regularly says that Obama hates the military. I mentioned the POW thing and he brushed it off as just stuff politicians say when they are campaigning (essentially the \"locker room talk\" defense I guess).\n\nSo then a few months later, I'm not sure how this came up, he cited  Obama mispronouncing \"corpsman\" and saluting with a coffee cup as evidence he hates the troops. So I said \"But you see a man with 5 deferrments who attacks a gold star family and POWs and think 'he's got my vote!!'\" ... He just said \"you're never going to change my mind.\" So basically, the I could shoot someone on 5th avenue thing. \n\nI can't. ", "Unfortunately they represent a lot of people with the same views. ", "An example of how much Trump hates modern America. He is cheering for ISIS over our allies. ", "No they're not. At least not this one. ", "Yeah. Why would he want people to vote? \n\nNot like there's a presidential election going in or something.", "And yet it's the dems trying to curtail the 2nd.", "Can we please have another racist Trunp controversy before the election?\n\nAlso he's such a liar.  One location was kept open for one extra hour past closing time to accommodate more voters.  Not even close to what he said.", "If this guy were black the headline would be \"Police shoot armed black man threatening voters outside polling place.\"", "Here I go suppressing voters again!\n\n- The GOP", "American of Romani descent here... I'm with you brother. Never thought I'd see the day when Europe looked like a safer bet for my family, but Trump's done a bang-up job cultivating old hatreds in the New World.", "Didn't you watch Luke Cage? That guy was unstoppable!", "i tried to pun. ", "Vox went from pretending to be neutral to obvious bias, and now has settled on straight activism.", "That's pretty much what is happening right now.  ", "Wonder what would happen if a black guy with a bigger gun carried legally open went up and stood in front of him or gave him a look if he even looked like he was going to talk to somebody. ", "Heaven forbid people exercise their right to vote", "The Tea Party base loves Trump. He is basically the first Tea Party candidate for President.", "I find all this talk of ID's strange in the UK you get posted a polling card with a number on it, and you give the number to the person at the desk (not sure if you need the card or just the number).", "I am the furthest from a Trump supporter possible but I completely missed the anti-Semitism. George Soros and the Fed chair, favored Republican punching bags, and then the CEO of Goldman Sachs who fucking nobody likes. Who else would you pick to represent Wall Street and big banks?\n\nIs being anti-big bank the same as anti-Semitism now? Cut me a fucking break.", "Reward them? Getting the changes to the platform is as good as giving them an unsigned legal agreement.    \n   \n\nFracking? Denied.      \nTPP? Denied.   \nSuperdelegates? Neutered but not removed.    \n   \nThis was all to  [\"throw Bernie a bone\" and make us think we \"'won' something from the party establishment\".](https://wikileaks.org/podesta-emails/emailid/5423).   \n    \nThat said, I agree that we keep have to moving forward. We can only *hope* that Bernie can keep Hillary true to the DNC '*promises*'. I view the presidency as a lost cause, but I won't stop working to get progressives into congress and state/local positions.", "The argument that I want to throw out is that by Voting Trump the people who did [this](http://www.politico.com/story/2016/11/black-church-burned-trump-slogan-230651) win. But I think it could be too generalist. ", "And theres nothing wrong with that. If you're in line before closing time then its the states fault for not providing fast and efficient service, not the voters fault for being stuck in a line for hours. ", "No Bernie was the one that said \"if she wasn't my daughter I'd probably be dating her\"\n\nWait...", "I really really thought the POW thing would sink him.  Having lived through the Bush 2003 Iraq warmongering and the yellow ribbon barrage that followed it seemed the troops were the one sacred cow for Republicans as a whole.  \n  \nApparently not though: you can shit on POWs and say our generals are stupid and don't know what they're doing and Republicans fucking love it.  The entire facade of what Republicans claim to be about has been destroyed this election cycle.  ", "This is just fucking insane.  How did we reach this point?", "I want you at my polling place.", "How is there a Republican nominee for president who attacks a Gold Star family attacks American POWs and constantly insults our active military? Just how?", "Rush Limbaugh public HOPED Obama would fail.   How that 'Murica grab you?", "One of these days us Asians will be part of this too.", "Just the natural product of evolution. One of 'em was bound to develop an immunity to bullets.", "&gt; Why do we even let Hispanics vote?\n\nHe continued. ", "Donald Trump basically called for this kind of stuff from the podium. He's directly at fault.", "Hey I'm from the future.\n\nTrump lost in a landslide. It wasn't close at all. ", "What rules were broken? they were in line before the polls closed?  Why should a voter be disenfranchised because the polls aren't getting people in and out fast enough?", "I don't think the fact he was carrying near a polling place is intimidation.  I think him coming up to her harassing her about her choice in candidate and trying to stop her from leaving is though.\n\nIf the guy had been standing 40ft away and just holding a sign I wouldn't call that harassment.  Rightly or wrongly being armed at political demonstrations is a common thing.  It's weird to people who aren't familiar with guns or don't carry that often but it's common enough (in places where you can carry obviously) that it by itself isn't intimidation IMO.", "You sound bitter.", "I want to believe...", "Abortion. That is the only non-bigoted issue that keeps the GOP going. I know several people here that are voting for Trump simply b/c of abortion. They hate him for everything else and probably align more with Clinton but abortion is that big of an issue for them. ", "I was a huge admirer of Ivanka Trump before this election. I am a Jew and was so excited to welcome her to the tribe. \n\nAnd then the election happened. \n\nI was completely shocked at the antisemitism coming from the Trump campaign. How could Trump promote such rhetoric when his favorite child is Jewish and her very Jewish husband is one of the most important Trump advisers? \n\nSo I decided to study up on Kushner. It turns out his father is a shyster and the apple doesn't fall far from the tree. Kushner's entire extended family has turned their back on his father and him and I now understand why.\n\nIvanka is just as shady as her father and she married the Jewish version of Trump.\n\nDisgusting.\n\n", "He's got a lot of emboldened followers. It will take a while clearing up the shit he's left in his trail.", "That's not entirely correct. If you've voted before you don't need ID but if it's your first time you do.", "\"You have to go back and look and study,\" says the man who never does, and has no clue what's going on. \n\nI'm going to need an irony detox after this election. ", "If you're in line before the polls close you get to vote. Those are the rules pretty much everywhere.", "&gt; The liberal wing of the Democratic party could actually take some notes from the Tea Party. \n\nYeah like actually voting during midterm elections.\n\nIf you're a liberal that didn't vote in 2010 or 2014, Obama didn't fail you, you failed *him*.", "Pretty much. Relative to Bernie and the majority of people in power at least. I'm one of them.", "I am fully prepared to be disappointed in my home state. Doesn't surprise me at this point this election really has shown me a side I didn't expect from family members and close friends.", "\"The polls are supposed to close at 7 this was kept open 'til 10. Yeah, you feel free right now? You're think this is a free and easy election?\"\n\nI think it was actually 9pm for the last night of EV\nEdit: confirmed, many polls open to 8 or 9 pm depending on location.\n\nhttps://mobile.twitter.com/reviewjournal/status/794730958305968128", "Hey don't forget about us college educated whites. ", "Some of us just like to shoot and think this is really fucking stupid and inappropriate.", "Voters?", "What I don't understand is why Trump's Jewish daughter and son-in-law are a part of this.", "This is a really incredible strategy. Give the power to someone that has rigged the primaries against their candidate then once they have that power make demands that can easily be ignored. Really genius stuff. ", "Fucking uppity riggers thinking they have the right to vote like...like PEOPLE!", "The biggest injustice is that even though Arpaio may eventually go to prison he is rich enough to never spend a day in his own jail, wearing the pink underwear, living in a tent in triple digit heat and eating tainted meat, like so many other people who are too poor to get out... and almost all of those people being humiliated and, quite arguably, tortured under the reign of Arpaio are legally innocent. They haven't had their trial yet making them innocent under the Constitution.", "1a happened under Obama and we could barely get the ACA passed.", "But remember Hillary is bad because Saudi Arabia", "I'm on board the Taco trucks  let's derail the Trump train. ", "But that was in the inner city. Imagine if they did that in the 'burbs and justified it by saying they're looking for voter fraud?", "It's questionable whether he was within the law.  Sure you can open carry and campaign within a certain distance of the polling place but as soon as you cross into anything that seems like intimidation of voters as opposed to simple advocacy it's likely illegal.  In particular as soon as he went from \"here's your Republican ballot\" to yelling at her for not voting Republican they'd be well within the law to have him arrested.  It's just whether the state or locality wants to put a stop to it unfortunately.", "What I don't understand is why Jewish republicans are so nonplussed by this.\n\n", "Which certain group - Hard working Latinos just getting out of work or slimy white dudes just out of the house for the first time for the day to score meth?  \n\nEither way it's a very nice gesture.", "Right? I canvassed for 6 hours today and came back to 2 mean PMs from Trump supporters. So while they were shitposting on Reddit my friends and I told 250 voters where their polling place is, helped a bunch of seniors arrange rides, and even convinced a few people who were going to sit out to vote in the hopes of a liberal Supreme Court. \n\nAnd we are only 3 people - there were dozens going out from this office. And we're going out tomorrow. And Monday.  \n\nEdit: thank you for the gold! ", "If conservatives had any real sway over the republican party Trump wouldn't be the nominee.", "(Psst Mosul is going well)", "People who have jobs...", "I live in Nevada and this is more accurate than you think. Our primary industries are mining and casinos. Neither one of those businesses uses the standard 9-to-5 model that is so popular in corporate work. Even the men and women at the mines who are strictly office job behind-a-desk types are still there for the majority of the day, and oftentimes, at strange hours. There's a reason even smaller places in Nevada usually have at least one 24-hour grocery store and/or food outlet.\n\nStaying open late to help people vote who are working from, say, 6 am to 6 pm with a 45 minute commute both ways? Yeah, that *is* helping out 'certain groups'. Those groups are commonly known as PEOPLE WHO WANT TO VOTE. This shit is especially ridiculous, and pretty clearly displays who this sniveling fucksocket is trying to vilify. Besides, can't *both sides* vote in these polling places that are kept open so insidiously late into the dark, dark night? ", "It's easy to pick out the poisonous ones. Usually very colorful like a bright orange or something.", "His skin was definitely a weapon.", "Not that I've seen... but we aren't really on the radar here. \"Illegals\" are the gypsies on this side of the pond. But once the deportation squads are done with Central/South Americans who's next? I'm not keen to find out.", "I mailed in my ballot. I feel...dirty inside.", "Showing pictures of Jews while ranting about global banking conspiracies... Nope never heard from anti-Semites that before (we did, it was in Germany)", "Overtones?  The purposeful editing of Jews during tag lines makes it completely obvious that trump's campaign is trying to appeal to anti-Semites.", "I voted for Bernie and was as anti-Hillary as any of them during the primaries but I can't get into the mind of a someone who embodied Bernie's ideals who would vote for Trump out of spite. That's so incredibly sad to think about.", "But that one black guy was opening doors for old ladies. Clearly intimidating them.", "And you average hardcore Christian Trump supporter doesn't like Catholics.  Serendipity.", "Get the Berniecrats to the general and people will follow. ", "As much as I hate Trump I'm glad he's ok. We don't need an assassination. We just need a clear, decisive victory over Trump. ", "Via: @KevinBohnCNN: \"A law enforcement official tells CNN no weapon has been found related to the incident in Reno and Donald Trump\"\n\nAnd: John Santucci @JTSantucci --- Senior sources tell @ABC the threat escalated when someone shouted gun at Trump rally.  Source with direct knowledge says no weapon found\n\nEDIT: \n\n@marcambinder --- A Homeland Security official confirms the @ABC report: no gun found crowd panicked as a guy tried to raise a sign; someone shouted \"gun.\"\n\nEDIT 2:\n\n@BenMargiott The man detained by Secret Service after Trump was rushed off the stage has been released\n\nEDIT 3: Per the BBC's James Cook on Twitter, the protester is named Austyn Crites and he said the following:\n\nAustyn Crites says\n1. I held up Republicans against Trump sign.\n2. I was kicked and choked.\n3. Someone shouted gun.\n4. I was saved by cops.\n\nEDIT 4: Per The Guardian's Paul Lewis on Twitter, Crites added the following:\n\nHe says he's a Republican. He said he was terrified by how the crowd responded: \"I was in survival mode. I knew I could die at that moment.\"", "Just finished 8 hours of canvassing here in Florida. Really hope Dems can pull through!", "No a simple pussy grab is all that's required. ", "And now the CNN panel will spend half an hour speculating baselessly about what happened and showing the clip over and over and over.\n\nThe count is 7.\n\n8.\n\n9:27 ET count is 9\n\n9:31 ET   10\n\n9:32 ET    11\n\n9:34  ET  12\n\n9:36 ET 13 + 14\n\n9:41 ET 15\n\nCome on we can hit 30 before 10 PM GO CNN GO\n\nChrist, Van Jones, wrap this up - it's been 5 minutes since we saw the clip\n\n9:46 ET HERE WE GO    16\n\n", "Contact local police first. The FBI can't legally respond to a polling location they only investigate after the fact.", "They at still check your IDs before you go in to the bathroom right?", "CNN panel congratulating the crowd for not going vigilante? Really? Is that how low the bar of human expectation has been lowered?", "Ya and then if it's found out that you voted for someone else (as in, your neighbor votes too, or some other way) you're a felon and go to jail.\n\nVoter fraud does happen, but only like 32 times in the last couple of million votes cast.", "Someone needs to just fucking loop this guy complaining about AMERICANS wanting to vote.  Seriously what is rigged about people wanting to vote?  Are Trump supporters mad that its costing the state extra money or something?  I mean, couldn't they leave GOD EMPEROR and his rally and go *vote early in their state*?  No one is stopping Republicans from getting Republicans to go vote.  No one is stopping Republicans from BUSING IN REPUBLICANS to vote.  Its not illegal, ITS THEIR FUCKING RIGHT AS CITIZENS to be allowed to vote.  I SUPPORT Republicans busing in their voters to vote. \n\nFUCK this, WE should have MORE PEOPLE VOTING, not less.  Its the State's fault if it requires so much extra time so that everyone gets a chance to vote and they are just that fucking incompetent.\n\nClinton Campaign:  MAKE THIS A COMMERCIAL ON LOOP FOR FULL 30 SECONDS.", "Agreed. I prefer a healthy Trump humoring me with his concession speech on Tuesday. ", "&gt;only like 32 times in the last couple of million votes cast.\n\nLast couple of *billion*. Not million.\n\nVoter ID is a solution in search of a problem.", "As a Canadian that has no horse in the race this seems like an extremely biased article. It's like \"Hey guys, vote for Clinton because she'll totally start listening to you if you elect her!\"", "https://mobile.twitter.com/BNONews/status/795078725880676352\n\nNo weapon. False alarm.", "Wow and Hispanic votes up 103%", "The 2nd only applies to good Christian, whites", "\"So what? All he did was plaster \"globalists\" on a bunch of Jewish people's faces\". \n\nThe people running Trump's campaign are anti-semites. Steve \"I don't want my kids going to school with jews\" Bannon is his campaign CEO. Give me a fucking break pretending this shit isn't intentional. ", "I want to laugh but I'm afraid if I open my mouth I'll drown in my tears", "Violence is never the answer no matter who you support.\n\nEdit: Wasn't aware how controversial this would be.", "Hispanic vote up 103%.\n\nMaybe Trump should try calling them rapists some more see how that goes. ", "He thinks it's rigged because he's an idiot in denial.", "Hijacking your comment to note that Trump came back shortly after so it doesn't look like they thought it was too serious of an incident.", "CNN is idiotic right now", "&gt;Judy Brown Loudoun County registrar, confirmed that the man was standing outside her office in Leesburg and handing out GOP literature\n\n&gt;“There is a gentleman standing outside the office with a holstered gun,” Brown told HuffPost. **“According to law enforcement, because Virginia is open carry, he’s allowed to have it.”**\n\n&gt;**Brown noted that the man was “being nice” to people**, and that he **appeared to respecting the observed 40-foot no-canvassing zone outside of the entrance**. \n\n&gt;Brown said her office contacted the local Republican Party, which got the man to agree to pull his Trump shirt over the weapon so people couldn’t see it. \n\n&gt;Loudoun County Republican Committee Chairman Will Estrada told HuffPost that the man was a former law enforcement official and veteran with a concealed carry permit.\n\n&gt;“’We don’t want to startle anyone,’” Estrada said he told him. “He felt really bad, he pulled his T-shirt over it, and I think everything was fine after that.”\n\nhttp://m.huffpost.com/us/entry/us_581cf16ee4b0aac624846eb5\n\n", "There was actually a segment debunking that whole thing on CNN today. One of those guys left without any problems the other was an actual poll watcher that was there volunteering. \n\nThey also said that area is almost all democrats. They talked to a republican in that state and he said he got three votes in that area when he ran. If they wanted to intimidate people to stop them from voting, I'd think they'd go to a more republican area. ", "The pussy grab shall be administered by any citizen to any unregistered Muslim found in public without the required star and crescent armband.", "Guy did not have a gun. Per whats being reported by law officials", "It's not a constitutional right to buy liquor without showing ID. It **IS** our right to vote without additional taxes being required which is essentially what requiring you to buy a laminated piece of paper from the state is.\n\nIf you have a problem with it, blame your great grandpappy who thought it was funny to disenfranchise minorities", "If you're in line you get to vote.  I swear, this fucking guy isn't qualified to run a Six Flags. ", "Non American here what info do they require of you if they aren't checking IDs? What makes it impossible to put in multiple votes? Here in Sweden we show our ID and a they cross us off a list after we have voted.", "Reagan called for a ban on open carry because of the black panthers. ", "I can't speak for all states but in Maryland you tell them your name and they ask for your address.  Then they take the sticker with your information on it scan the barcode and affix it to your paper ballot. ", "That's exactly the point. It's not targeted toward *you* it's targeted toward the anti-Semites who pick up on those phrases and the identity of those individuals.", "Good. Violence is not the solution.", "Major consequences for minute benefits.  ", "He doesn't think its rigged he just needs something to yell about when he loses in a massive landslide. I predict he won't go down with dignity, something like \"*It's a coup folks, its a shame what's happened to America. Crooked Hillary and the Democrats stole the election from the good people. We just got started folks*\" - some shit like like that. He'll steal the spotlight away from Hillary who has worked her whole life for this moment.", "I am the child of Holocaust survivors. I keep thinking to myself: surely this can't happen here now. This is modern society, we know better. My country surely will stop this from happening. It can't be as bad as it looks. And then I realize: that's what my grandparents thought.", "From the party of \"Personal Responsibility\" to the party of \"Someone else is responsible not me!\"", "Muh enthusiasm gap. ", "Come on Dems keep it going!  Don't forget, vote early and vote often!  Scratch that last part.  Just vote, dammit.", "Which would be fine. But here IDs are state level only. Also voting and registration is by state only. They oversee both without Federal involvement. \n\nIDs would be fine if they were free and easy to obtain. But no one wants to pay for it. Also many older people of African American descent don't have birth certificates. Lastly many states provide very few locations where you can get ids. All this combined is considered a poll tax or a hurdle to allow the execution of your rights. ", "Like the rest of the constitution.", "it's wrong. i'm a gun owner who never carries in public and never will but doesn't the average person know not to confront a mother in public like this? especially with such aggressive words? especially as an armed man?!\n\nhe shamed himself.", "Idiocracy exposed in all its' flaming stinking anti-glory.  \nThe same goes for evangelicals who scream in outrage when Bill Clinton has an affair, but let slide a pathologically lying, groping vulgarian.", "Then he goes on to mention that they're bussing in scores of people so they can vote!\n\nThat's what is call a ground game you dipwad. They're just upset they had zero GOP get out the vote effort.", "Thanks for your hard work!", "Nothing disrespects democracy more than people voting ", "Trump creates the most enthusiastic voters. Unfortunately for him many of them are voting against him lul", "Why are we even talking about this in America? How did this become OK?", "Or to any Mexican without the required sombrero patch", "ACLU says if you got in line before closing time, it stays open.", "We don't know for sure that it was an assassination attempt yet. Obviously the Secret Service thought that there was a credible enough threat to act but we don't have the facts.\n\nEdit: No weapon found, so thankfully it was a false alarm  https://mobile.twitter.com/BNONews/status/795078725880676352\n", "My bet? That's because it's the officers who are donating not the enlisted.\n\n[The enlisted prefer Trump to Clinton more than 2:1](http://www.militarytimes.com/articles/this-poll-of-the-us-military-has-gary-johnson-tied-with-donald-trump-in-the-race-for-president), but the officers prefer Clinton (and this poll was from before Johnson's support imploded, so I imagine those running from Trump ended up supporting Clinton).", "Buying liquor isn't an inalienable right granted in the constitution.", "You'd think so but then Republican legislatures shut down most of the DMVs in the state in primarily minority areas.", "Is that out of the ordinary at a Trump rally?", "And they will move back to /r/the_donald where they consider it a win to read more conspiracies rig online polls, break site rules, and make fresh alts to post here.\n\nThis subreddit should have had a karma/age limit well before the election got this far and the admins should have taken action against /r/the_donald long ago.\n\nIt will be interesting if either are changed come the end of the election when /r/the_donald implodes.", "And it's not just this one dickless shitsack.  It's the countless ones that will *defend* this shit all the while wailing about 'rigged elections' and 'thugs' intimidating people to vote for Obama.\n\nI can't take this fucking election anymore.  In previous elections I have despised candidates.  In this one I have come to despise nearly half of the country.  Irredeemable, brainless scum, the type that across history have stood in opposition to *every single thing* humanity has ever done right.  The type that have enabled every sort of atrocity that has been committed over the centuries.  The type that is incapable of learning, of growing, of admitting fallibility, of being led by anything but the ugliest, basest emotions.\n\nI am tired of having to share a country with these vermin.", "Thank you ~ the World. ", "He's already yelling at the Hispanics in Nevada. ", "With donations averaging $27 we can gather millions to donate to her foundation and then get her to listen to us.", "Its *always* been that\n\nSomehow welfare queens were a big enough drain to damage the economy to them ", "I'm a veteran of OEF and OIF and you can always tell a fake tough guy. I don't expect the president to have served but getting deferments and then bad mouthing actual war hero's screams coward to me. Trump is a guy you move quick towards and he flinches\n every time. Every time", "You don't need any form of ID to vote in the UK (because otherwise you'd have to have polling staff identifying what's legitimate id for anyone without a driving licence or passport and that could potentially lead to disenfranchising people). You just need to provide your name &amp; address to the polling staff. The polling card just makes you a little easier to find on the electoral register (it's got your elector number on it and that's how the register is ordered) and is used to inform you that there's an election on and where you're to vote.\n\nBut that's because our electoral system might be flawed as fuck in terms of the results it produces but anyone trying to introduce laws which can potentially disenfranchise people are immediately knocked back by the Electoral Commission. \n\nHaving an actual independent body responsible for how to run elections was pretty standard everywhere in the western world I thought. Reading the stuff on here, that's absolutely not the case.\n\nedit: ID not if!", "This. Right here.", "Yeah man lets pay our politicians money so that they will listen to us! What a fantastic idea. ", "Wait so if I know my friends address I can vote for them?", "As a bunch of non-Jews pontificate about how this isn't anti-semitic Jews are on track to reject Donald on record numbers. So, deal with that.", "You have to pay for an ID if you need an ID to vote it becomes a type of poll tax. That is explicitly prohibited by the constitution which some people clamour to be so fond of yet they have such a minimal understanding of it.", "Trump and the alt right are normalizing this behavior. Wish responsible \"Second Amendment folk\" would call them on it. I don't because I'm not carrying and I don't want to be shot simply because I voted for someone. ", "Good God step off the ledge.  The markets love hillary, great job news, relatively miniscule terror threats, she's moderately progressive and she's done this rodeo before and world leaders absolutely love her by and large. \n\nWith a republican lead house and possible senate there isn't much she can do anyways.\n\nNow trump on the other hand has literally talked about using fucking nukes on people during this election cycle and talks about women worse than I'd say about my enemies.  He is a loose cannon, economists know he is full of shit and you talk about corruption  like trump hasn't hidden his   tax returns dorm a fucking reason. \n", "Sadly true. I find hope in millennials. ", "PLUS IT'S A GOOD THING THAT MORE PEOPLE ARE VOTING. THE MORE PEOPLE THAT VOTE THE BETTER.\n\nFuck. As someone who spent their college career studying ways to get people to vote and to counter U.S. voter apathy the GOP have really fucking pissed me off this election. ", "We now know it wasn't:\nhttps://mobile.twitter.com/BNONews/status/795078725880676352\n\n&gt;BREAKING: No weapon found after man is detained at Trump rally in Nevada sources say - ABC", "Because people exercising their constitutional right is hurting his candidacy.", "Back in the 1960’s the Black Panthers did partake of their then legal rights to open carry guns in California during a protest at the state capitol. Scread the white folks so much that conservatives - including then Governor Ronald Reagan - supported gun control legislation. Read up on the Mulford Act.\n\nEven the NRA back then was in favor of some gun control laws.\n\nFunny how the pendulum swings.", "All the major asian groups  voted/prefer Hillary as the majority according to the asian american poll stats. \n\nJapanese and Filipinos are the biggest Trump supporters by far(although Hillary is still what they voted the most) but Indians and Koreans are the biggest pro Hillary. \n\nhttp://fivethirtyeight.com/features/asian-american-voters-are-diverse-but-unified-against-donald-trump/", "They've exposed the foundation - fascism racism, religious intolerance, hate, and greed. At the core, that's all they want. ", "People act like he's the first racist stupid, misogynist, dumb, bad looking, pudgy, anti-Semitic, inarticulate, low-intellect, fascist, privileged, combed-over, narcissistic, trashy, vulgar goon who ever got farther than he deserved in politics, but the voter suppression stuff is what's really bothersome.", "As a Filipino American Im really disgusted by other filipinos who vote for Trump after all the horrible shit my folks have told me about the Marcos era and now with Duterte, Im just. Im sorry guys.", "What happened?? \n\nEdit: they're saying someone shouted there was a man with a gun\n\n\n", "I'm skeptical as hell but as much as I hate to say it, supporting Clinton right now is the best option for progressives. It's the logical next step.\n\nGet her elected and then eventually make the DNC cater to progressives like the GOP caters to Evangelicals.", "&gt; A public servant doesn't take $1M from Qatar\n\nAre you confusing the Clinton Foundation and Hillary Clinton?\n\nIf I had a charity working on humanitarian crises I wouldn't be too picky about who is signing the cheques. If there are strings attached then it would likely be an issue but until you have evidence of strings you're literally blaming Hillary for operating a very successful and effective charity.", "No no no. Bernie was the one who said \"Women you have to treat them like shit.\"\n\nHold on...", "You don't actually believe the entire FBI is rigging the election for trump do you?", "That is exactly the case as I've seen it. Most of the louder enlisted guys spend all day talking about how Hillary is the devil while old O's who are hanging around egg em' on. The old guys (enlisted or officer) seem to lean HARD Trump. But the young O's, the guys who make up the bulk of the officer ranks, who are college educated, who make decent money and many of whom have yet to start a family? We're putting that expendable income on our political beliefs. ", "I've never voted before in NC (just moved here) but didn't get my ID checked. In fact, there were signs everywhere: \"you don't need an ID to vote\".", "\"Hillary will say anything and change nothing.  She is unfit to be president\" - Barack Obama 2008\n\n\"She can change!\" - Bernie Sanders, 2016", "Good luck outbidding Saudi Arabia and Qatar. ", "Boy i wonder who they're voting for!", "Republicans made it so nothing could happen without a super majority of 60 Senate votes the successfully turned Lieberman against the dems.  59 votes wasn't enough.  It's why we don't have a public option.", "Bingo. This is the correct explanation. Party identification. ", "Because if it was an assassination attempt as some have claimed, then you have to assume it's a coordinated event with multiple actors.", "(((globalists))) ", "Because the kind of people that support Trump are racists.", "There was absolutely no reason for him to be carrying other than to intimidate.\n\nAm open carrier who lives in VA.", "PLUS the little problem where they started to shut down the offices that serviced the mostly black areas meaning that on top of requiring the IDs they made it super difficult to get one!", "Everyone in the trump subreddit is saying it was a credible assassination attempt. lmao", "Paranoid people being paranoid.", "I swear to god half the shit this man says is straight out of /r/nottheonion", "Americans.", "Aren't his supporters the same people that claim everyone would be safer if we all had guns? ", "What does being a former leo and a veteran have to do with going to a polling site armed and heckling people for not supporting your candidate?", "I think covering this is a mistake on the part of the media. I always downvote shit like assassination attempts/school shootings because coverage inspires copy-cats.\n\nOr worse inspire some deranged Trump supporter to try and \"even the score.\" We really ought to starve these sorts of headlines of oxygen. \n\nEdit - Especially considering Trump Jr. just tweeted it as an \"assassination attempt\" (it wasn't, no weapon - just a protestor with a sign) ", "The problem with this theory is that...\n*painful sigh*\nTo many trump supporters it doesn't matter if your ancestors were the first slaves brought to America or Latinos that have been in the southwest since Mexico owned it. If you're dark skinned you aren't \"real Americans\" and therefore should have as little influence on the country as possible. Interesting how in all the hubbub about Obama's birth certificate and citizenship no right wingers brought up how it's kinda weird that Hawaii is even a state since it's far out there and full of lots of Asian people. It's cuz if Obama was white and from Hawaii no one would care. Hell they'd probably vote for an actual foreigner as long as he was a white male republican.", "Its funny since they arent a credible subreddit. They will probably conclude it was a sweede so they can go back into a meme war again ", "Only them though. If the Muslims and the blacks and the hispanics have guns no one will be safe.", "Suspect WITH a gun at the white house.  Not called an assassination attempt.  Trump rally suspect NO gun.  Assassination attempt...  Lol. \nThe right is obviously trying to use this as an attention tactic.  Unfortunately the tactics will only go to prove Trump is simply a loud mouthed coward.  ", "Well Trump doesn't really see the point of voting, he'd prefer if we just 'give it to Trump'\n\nhttp://www.cnn.com/2016/10/27/politics/donald-trump-cancel-election/", "Latino voters are turning out in historic numbers.\n\nThe GOP can thank Donald Trump for enraging the Latino community into engaging with the political system in America.  ", "Wasn't an assassination attempt.  Guy had no weapon.", "If you are on line by 7 pm you get to vote. The line was very long. So maybe Nevada needs a few more polling sites? This is absolutely great!!", "Yet I guarantee you if and when a Hillary supporter shows up armed and combative at a polling station, Info Wars (Russia's US-based information warfare trojan horse) will be shrieking about the liberal police state. \n\nOr it it's a black/brown supporter, he'll just be shot by the cops.", "I don't care who you support hanging out near a polling place intimidating people with a weapon is bullshit. Let people vote as they want. ", "Straight out of /r/theonion even.", "Either way good for secret service to act so quickly.  ", "Trump had set a major political milestone in 2016. Want to know what that is? \n\nHis campaign has made it possible for Hispanics and non whites to officially pivot to Democrats for years to come. \n\nWe also had this historic pivot in 1964 when black voters started to vote for Democrats. \n\nTl;dr Donald Trump is a modern George Wallace of our times. ", "It's strange how people are all \"BLACK PANTHERS WERE BAD PEOPLE! THEY WANTED TO BLOW STUFF UP AND KILL PEOPLE!\"\n\nActually the people in those groups who would push to blow stuff up...that was most of the time an FBI mole trying to get them to do something that they could take ALL of them down for.\n\nNow, that's not to say some of them weren't on the edge of doing something crazy themselves, but still...doesn't excuse the crap that was being done by the FBI", "As a Bernie Sanders supporter I have to say Clinton is a far superior choice to Trump.\n\nClinton's policies are close to what Bernie Sanders campaigned for. Sure they don't go as far as Sanders' policies but they're still a great step in the same direction, and Bernie and all of us will do everything we can to make sure Clinton and Congress implement those policies successfully. And hopefully once those policies are put in place and we see the results, we can continue to the more progressive policies that Sanders campaigned for.\n\nTrump on the other hand is the complete opposite of Bernie Sanders and will take our country in the opposite direction. For example Bernie Sanders and Clinton want to make affordable quality healthcare available to everyone in America. Trump wants to strip tens of millions of Americans from having access to health insurance. Bernie Sanders and Clinton want to combat climate change and promote clean energy sources like solar and wind. Trump is against clean energy and wants to expand the fossil fuel industry and increase carbon pollution. Bernie Sanders and now Clinton are fighting for LGBT equality. Trump's VP Mike Pence signed a bill to jail same-sex couples for applying for a marriage license. Bernie Sanders and Clinton want to make sure the wealthy billionaires pay their fair share of taxes. Trump wants to give billionaires tax cuts so they pay even less. Etc.", "I swear people should read Hitler's early speeches. They're all about globalization and the failing banking system.  There's been too much of that same stuff this year.  ", "You're not alone.", "Get this shit to the front page.  With the union strike potentially shutting down public transit this might be pivotal. ", "I'm more sympathetic to Nate here.  You can argue that his model is too pessimistic but the reasons for that are clear, well explained, and make sense.  Ryan also attacked his integrity which was some bs.", "Voting against him felt awesome. ", "Yes but the media covered it like one. Which will be sufficient to do the harm I am mentioning.", "There's no real story here and I don't like to see this reported.\n\nThe secret service doesn't like to take chances anymore for obvious reasons. The candidates usually have tents set up so they're out of public view between the time the leave their bulletproof car and they enter the building; no more open-top limos, probably ever again.\n\nAt the slightest hint of danger they place their bodies between him and any possible threat, which is exactly what they're supposed to do. Apparently someone yelled \"He has a gun!\"\n\nRealistically, the only weapon you could smuggle into a rally would be a small, polymer handgun, and a person in front of you would protect you from that, so they protected him first and asked questions later.\n\nEdit: [Here's the front page of Politico right now.](http://i.imgur.com/lWO3mzt.png) I find it incredibly distasteful.", "It's pure propaganda. Every Bernie supporter I know is voting trump because of the corruption of the DNC and Hillary herself", "Well not really. The \"problem\" is that minorities and young people are able to vote. Voter ID laws go a long way towards sorting that out.", "Yes  fuck face the polls stayed open because American citizens were still in line to vote, this is common practice you ignorant fucking shit for brains.", "&gt;According to CNN law enforcement officials said that no gun was located in connection with the Reno incident. Later, Homeland Security announced that the crowd had panicked when the man tried to raise a sign and they misidentified what he was raising, Marc Ambinder from USA Today reported.\n\n\n[Reagan got a bump in polls from an assassination attempt](https://en.m.wikipedia.org/wiki/Attempted_assassination_of_Ronald_Reagan) so they are trying to use a man lifting a sign to do the same with Trump.\n\nThere was no gun, someone just yelled there was.", "The thing is the stereotype of the minority welfare queen bankrupting the country is a farce. White families make up the vast majority of welfare recipients. In fact, one could reasonably argue that the more conservative a state is, the more likely it is to be a welfare state. Conservative strongholds like Georgia, Alabama, Mississippi, etc, receive far more in federal benefits than they pay in.", "lol go take a look at the_donald and see them screaming about an assassination attempt still. ", "They got outsmarted by... Planning and teamwork. Who knew that would be a good thing to have.", "Casino workers? They don't get off until late. ", "That's not even a voting issue but a common sense one. Before all day breakfast if I walked in to McDonald's at 1015 and spent 20 minutes in line you better believe I'm getting some breakfast. ", "Free hat?", "Yep.\n\nLeave it to Trump's base to yell about Lee Harvey Oswald and firing squads just get out there and vote peacefully to stop this man.", "&gt;“It is a cruel irony but no coincidence, that millennials—the most diverse, tolerant, and inclusive generation in American history—are now facing exclusion. Minority voters are more likely than white voters to wait in long lines at polling places. They are also far more likely to vote in polling places with insufficient numbers of voting machines … This kind of disparity doesn’t happen by accident.”\n\n[June 4 2015](http://www.slate.com/articles/news_and_politics/politics/2015/06/hillary_clinton_speaks_out_on_voting_rights_the_democratic_frontrunner_condemns.html)\n\nBeyond that, don't get too hopeful. When millennials faced conservative disenfranchisement tactics during the primaries they blamed Hillary and shit on Marc Elias when he tried to explain the situation and presented ways to fix it. Even after Bernie joined a lawsuit in Arizona many of his supporters continued to claim it was Hillary that was rigging the election. ", "breitbart did everything it could to elect Trump and failed.\n\nlol", "Finally something besides \"trump was rushed off stage.\"", "Trump went off stage because his own supporters started beating the shit out of a protestor ", "Scared shitless sheeple with voting rights could be killing democracy.", "I really hate Vox. The articles are always so patronizing. They treat their reader base like they're a bunch of children. There's nothing wrong with the concept of ELI5 for objective shit but ELI5 for opinion-based articles is fucking stupid. It literally just tells people what to think by using absolutes, and not really admitting any bias. ", "haha they picked up [New Yorker's satire article](http://www.newyorker.com/humor/borowitz-report/putin-appears-with-trump-in-flurry-of-swing-state-rallies). ", "No weapon.", "The annoying thing is that if conservatives didn't directly try to disenfranchise certain groups with things like closing down voting locations in their neighborhoods closing down DMVs, targeted voter ID laws, getting rid of straight ticket voting, cutting down on early voting times, purging voter registration records and other similar measures there wouldn't be such long lines. ", "If only there were some kind of...tall structure to keep them from getting to the polling places.", "Well it's about fucking time.  ", "A man held up a sign.\n\n\nSomeone in the crowd screamed \"gun\".\n\n\nThe Secret Service took Trump off stage. He was back on in minutes. \n\n\nSign-man escorted out no weapon found.\n\n\nTrump's family and supporters still crying \"assassination attempt\".\n\n\n[EDIT]: The cause of the disturbance was a protestor holding up a \"Republicans Against Trump\" sign and the ensuing scuffle to tear it out of his hands. ", "For years people have been saying 'Latino's could be one of the strongest forces in American electoral politics ---IF ONLY THEY VOTED'.  \n\nIt looks like Trump decided to test that theory.", "And patched sombrero", "Actually: \n\nA Homeland Security official confirms the @ABC report: no gun found crowd panicked as a guy tried to raise a sign; someone shouted \"gun.\"\n\nhttps://twitter.com/marcambinder/status/795080972278468608", "Why more people aren't thinking the same thing you are is concerning.  We've turned into a nation of teams where everyone on the other team is a piece of shit.  They should be jailed/roughed up/kicked out.  I think a Trump presidency would be a disaster, but we have to find a way to talk to each other after the election.  Obstructionism is insanely un-American, and just adds fuel to the fire.  Neither candidate wants to unify.\n\nLook, we need to find a way to move past partisan bullshit.  Turn the other cheek instead of fighting shitty fire and mudslinging with more of the same.  Respect free speech and each other's opinions even when you feel like those opinions are poorly founded.  Discuss things you disagree with don't threaten, bully, and shut out.  This particular individual was being a bit shitty for sure, but that doesn't mean we should be shitty right back.\n\nEveryone needs to grow the fuck up real quick so we can get this country in order no matter who wins.", "This was a study only involving in person voter impersonation. Voter id laws don't address the \"real\" issue which is absentee ballot voting. \n\nI put real in quotations because it's unlikely to be a significant amount it just is more than in person fraud. ", "I voted against him the first day early voting opened. The first time I've ever been old enough to vote.", "&gt; the liberal police state.\n\nThis gives me a headache.", "“He’s like ‘Who are you going to vote for, crooked Hillary?’\n\nThat is not polite", "That's the real story - fervent trump supporters assault peaceful protestor.", "And of course the Trump campaign and The_Disgustings will call this an assassination attempt no matter what. Facts no longer matter.\n\nThey will use this as an excuse to make calls for murdering Hillary her supporters, and to try and gain sympathy support. ", "&gt; what \"group\" do you think he was referring to?\n\nAnti-Trumpers. If it wasnt for those fucking anti-Trumpers he would be winning! ", "Good hombres.", "If you are in the community of anti-Semites this ad would rally you. \nThis is the thing with 'dog whistle politics', if it's done well, and you aren't in the targeted group, and you have been otherwise primed to notice, you won't. \n\nHere's an example;\n\nRemember Trump's big immigration speech after visiting Mexico? This is a little excerpt from it: \n&gt;We’ve admitted 59 million immigrants to the United States between 1965 and 2015. Many of these arrivals have greatly enriched our country. So true. But we now have an obligation to them and to their children to control future immigration as we are following, if you think, previous immigration waves.\n\n&gt;We’ve had some big waves. And tremendously positive things have happened. Incredible things have happened. To ensure assimilation we want to ensure that it works. Assimilation, an important word. Integration and upward mobility.\n\n&gt;Within just a few years immigration as a share of national population is set to break all historical records. The time has come for a new immigration commission to develop a new set of reforms to our legal immigration system in order to achieve the following goals.\n\n&gt;To keep immigration levels measured by population share within historical norms. To select immigrants based on their likelihood of success in U.S. society and their ability to be financially self- sufficient.\n\n&gt;We take anybody. Come on in, anybody. Just come on in. Not anymore.\n\nSeems par for the course on his rhetoric, like I think it's kind of gross but nothing jumps out here. But there is a major dog whistle here, which I only learned from browsing /r/altright at the time.\n\nWhy did you pick that time frame? Starting with 1965 specifically? To the uninformed it's random, he could have picked any date, and it had to be some year. Turns out that 1965 is the year that the Immigration Act passed, which gutted a previous law which imposed quotes demanding that the intake of immigrants must reflect the proportion of those people in American society already. Essentially a measure taken intentionally to preserve the dominate proportion of white Americans. It was after that bill passing that the proportion of whites in America started to slowly shrink, and is seen as a major point of defeat to new nazis. But don't take my word for it. This is the altright thread in question: https://www.reddit.com/r/altright/comments/50l0ea/trump_retain_historic_populations/?\n\nThe images and terms used in the ad in question reflect a usage that is targeted to rally people who know how to decode it, and to specifically not look anti-Semitic to you or me.\n", "&gt; a 6 figure salary\n\nI love how this inane talking point is totally predicated on the idea that $100000 is some insane amount of money to make in a year. Like clearly anyone making six figures must be some sort of criminal.", "This. \nWho complains in democracy about more number of people voting? ", "Naa that 3/5ths bit pertains to black people.", "For everyone else's sake I hope he's wrong.  ", "&gt;Yup. The corporations definitely want Hillary's Trans Pacific Partnership so they can ship even more jobs overseas and raise their profits.\n\nThe TPP actually does ship jobs overseas yes. It's to tie nations like the Philippines to us, rather than allow China to continue expansion. It comes at a time when the public is tired of overseas economics, but with &lt; 5% unemployment, we're doing fine.\n\n\n&gt;Yeah. And she was a complete fucking failure. Russia, China, middle east, NAFTA, TPP... Everything she's ever touched has been a fucking disaster. Of course world leaders love her. She'll continue the decline of American wealth and influence.\n\nWar isn't the answer to wealth and influence, your time in the sandbox should be proof enough of that. A Republican sent our military there. Building a wall, separating citizens by religious beliefs, cutting economic ties, and threatening everyone with *grave consequences* just makes us one step short of North Korea.\n\n\n&gt;No he hasn't \n\nhttps://thinkprogress.org/9-terrifying-things-donald-trump-has-publicly-said-about-nuclear-weapons-99f6290bc32a#.3jrhkmr1l\n\n\n\n&gt;Wait a second. Which candidate invaded Libya? Which candidate is pushing for war with Russia and accusing them of hijacking our election?\n\n\n\nNeither of the candidates invaded Libya, because neither of them have had command of US military.  Republicans were pushing for it, when Obama was like 'Okay sure' they 180'd so hard they got whiplash. We've been wanting the current despot out for decades. The last time we bullied them, F-14s shot down two of their fighters. With a successful air campaign, minimal US casualties, and a victory for revolutionary elements. We did good by *not* doing another occupation. Same thing with Syria, ISIS, and various other minor counter insurgency operations. \n", "[It actually shows Hillary leading]", "You're telling me #SpiritCooking didn't work?!??!", "If someone starts banging on about \"elites\" and *doesn't include Trump himself* in that category they're probably dogwhistling.", "My cash is on Wang. He doesn't have clicks and commentary to promote. It's just a side project with numbers.\n\n\nhttp://election.princeton.edu/", "Trump is like that one guy in your platoon who always has a profile for 'shin splints' but can play basketball on the weekends just fine.", "These are all problems but they have further causation than Hillary fucking Clinton. Feel free to keep living under your rock though. Neither candidate is going to fix these problems unilaterally my dude.", "Truth. I used to be an anti-Muslim after 9/11. How dare they attack New York City?\n\nThen I went to a university that had a significant Muslim population and got to know them. Now I look back upon the time before that with shame at how bigoted I was.\n\nI am *precisely* the kind of person the GOP fears... someone who got edumikated and became liberal as a result.", "Says Russian propaganda site contrary to major media reports. ", "I guarantee Trump will not formally concede. He is mentally incapable of doing so. Let me explain.\n\nTrump has a grandiose sense of self-importance. He routinely overestimates his abilities and inflates his accomplishments often appearing boastful and pretentious. He blithely assumes that others attribute the same value to his efforts and may be surprised when the praise he expects and feels he deserves is not forthcoming. Often implicit in the inflated judgments of his own accomplishments is an underestimation (devaluation) of the contributions of others. \n\nTrump is preoccupied with fantasies of unlimited success, power, or brilliance. He ruminates about \"long overdue\" admiration and privilege and compares himself favorably with famous or privileged people. He believes that he is superior, special, or unique and expect others to recognize him as such.\n\nTrump believes that his needs are special and beyond the ken of ordinary people. His own self-esteem is enhanced (i.e., \"mirrored\") by the idealized value that he assigns to those with whom he associates. He is likely to insist on having only the \"top\" person (doctor, lawyer, hairdresser, instructor) or being affiliated with the \"best\" institutions but may devalue the credentials of those who disappoint him.\n\nTrump requires excessive admiration. His self-esteem is very fragile. He is preoccupied with how well he is doing and how favorably he is regarded by others. This often takes the form of a need for constant attention and admiration. He expects his arrival to be greeted with great fanfare. He may constantly fish for compliments, often with great charm. \n\nTrump’s sense of entitlement, combined with his lack of sensitivity to the wants and needs of others, may result in the conscious or unwitting exploitation of others. Trump expects to be given whatever he wants or feels he needs, no matter what it might mean to others. For example, he may expect great dedication from others and may overwork them without regard for the impact on their lives. He often uses special privileges and extra resources that he believes he deserves because he is so special. He has a lack of empathy and has difficulty recognizing the desires, subjective experiences, and feelings of others. He may be oblivious to the hurt his remarks may inflict. \n\nCharacterized by arrogant, haughty behaviors, Trump often displays snobbish, disdainful, or patronizing attitudes. For example, he may complain about a reporter's \"rudeness\" or \"stupidity\" or conclude a medical evaluation with a condescending evaluation of the physician.\n\nVulnerability in self-esteem makes Trump very sensitive to \"injury\" from criticism or defeat. Although he may not show it outwardly, criticism may haunt him and may leave him feeling humiliated, degraded, hollow, and empty. He may react with disdain, rage, or defiant counterattack (e.g., “You’re the puppet!”). Though overweening ambition and confidence may lead to high achievement, performance may be disrupted because of intolerance of criticism or defeat.", "Except many Latinos in these areas probably know some illegal immigrants and know they aren't like Trump is painting them. Not to mention that excuse doesn't work with his comments against Judge Curiel", "Trump taken off stage by secret service.\nTim Kaine's bus is hit by a police car. \nWhitehouse is on lockdown. \n\nWhat THE FUCK is going on?!", "is there a particular benefit to restricting voting hours? besides the obvious one--to make it harder for poor people to vote?", "They have shown that there was no gun msnbc did report a bunch of psychos physically attacking a CNN reporter and taking his camera while shouting Luigenpresse when he tried to get footage of the scuffle ", "It's what Bernie would have wanted! ", "Remember when the Access Hollywood tapes dropped and was on the front page of the mainstream media? It was nowhere to be found on Breitbart. Breitbart removed the police shooter when he was found to be a white Trump supporter. And yet it's the MSM that's biased.", "I think everyone involved in the political business right now from reporters to analysts like Nate are operating on very little sleep and a lot of stress.\n\nCan't blame any of them.", "Looked like there was a lynching/people stomping on the dude from the angle I saw. Glad they didn't lose control of the situation.", "I'd rather not. i'm sure it'll pop up on r/all several times by all the trumpclone-subs. ", "Thank you! Was going to say the same.\n\nIf you want to enact a progressive agenda then you need to get progressives elected. Start with the 2018 primaries and by 2020 you can reverse the gerrymandering and get some real momentum going. ", "That actually makes sense. You need a college degree to be an Officer. The college educated prefer Clinton by a long shot. ", "Man just get us through the next couple of days...", "It was open until 10 up here in Minnesota. Does that mean those people could vote up here too?\n", "&gt;But the thing is there is some really strong arguments and good evidence showing that people in positions of power with global and political influence might be harmful to our society.\n\n\n*That's exactly the point.* This sort of coded language is specifically used with plausible deniability in mind. That way, when anyone starts to question any possible subtext behind the advertisement, they can just brush it away by saying it's speaking in general terms. Ultimately though that's irrelevant, because the people they are trying to broadcast to will hear their message loud and clear.\n\nDoing it publicly has a very specific, frightening function. It shows the rest of the community that they are emboldened and gaining power.", "The DNC needs to burn for this.", "There are other things on the ballot than just the presidential race.  I wish people would stop suggesting others stay home if they're focused on the presidential race.  In fact in non-presidential race years, I wish people would get out an vote.  There are always congressional seats and referendums to look at, and then state and local offices as well.  [drives me batty when shit gets snuck in on non-presidential years (not really snuck in, just no one votes so they can get just what they want), and I know those items would be down-voted if they happened during presidential races].", "Huge pro gun conservative here.... If it came down to a civil war I'd likely be more apt to pick up arms against the Y'all Qaeda types", "If you have evidence of illegal voting then please share it. ", "Can we get this to the front page of r/all sandwiched directly between the_donald's \"Trump survives assassination attempt\" threads?", "The coma thing.", "Have they acknowledged at all over there that it wasn't an actual assassination attempt or are they still busy circle jerking themselves into a coma?", "[Paul Lewis from the Guardian sheds some light on the situation.](https://twitter.com/PaulLewis/status/795094200064753664)\n\n&gt;This is the man who was ejected from the rally sparking panic. He was holding a sign: \"Republicans Against Trump\"\n\n&gt;He says he's a Republican. He said he was terrified by how the crowd responded: \"I was in survival mode. I knew I could die at that moment.\"\n\n&gt;His name is [...snip...]. He's 33 and works on high altitude balloons. He's voting for some Republicans this year - just not Trump.\n\n&gt;[...snip...] told me he was punched, kicked. Someone grabbed his testicles and he his neck was in a chokehold. He said he feared for his life.\n\n**edit:** It's also worth noting that Trump said to \"take him out\" and claimed that he was \"paid by Hillary\" to protest before the incident escalated. This just reaffirms what we already know - Trumps rhetoric is dangerous and his rallies are extremely volatile...\n\n**edit 2:** If you use twitter, please retweet Paul's information to combat all the misinformation that always seems to spread like a wildfire during this election. People deserve to know what actually happened tonight, but unfortunately I worry that voters will simply be bombarded by spin and propaganda for the next few days...\n\n**edit 3:** [Video of events with more context. Including Donald Trump telling the crowd to \"take him out\" just after the protesting starts.](https://youtu.be/eemJPPb8Otw?t=2). Video even comes from a pro-trump, alt-right group - not that it matters because it's basically raw footage.\n\n**edit 4:** Whether Trump meant to \"take him outside\" is not the point here. I'm simply quoting his exact words. The point here is that shortly after Donald Trump said this, regardless of what he *meant to say*, people in his crowd started fighting with the guy, someone falsely accused him of brandishing a gun, and he was attacked and beaten up by Trump supporters until the secret service took him in, questioned him, and them immediately released him. \n\nI know the Trump people want to continue pretending that Trump personally fought off an assassin in an epic katana duel, but these are just the facts of that happened last night. Would a sane person react to Trump and start  beating the guy up? No. But I'm not sure sanity was even on the menu last night, and in the end, the guy was an innocent protester who was attacked and accused of something serious (that he didn't do). \n\nIf you want an example of how a protester at a political rally should be handled, look to your President Barack Obama from a few days ago, respectfully addressing it and teaching us all a lesson about true democracy. Leaders diffuse chaos, but not Trump, chaos seems to follow him wherever he goes.\n\nNow I've spoken as clearly as I can about this and I've said my piece. GO VOTE!", "No weapon! No weapon! You're the weapon!", "So his evidence of voting fraud is... people voting?", "No shit and the whole \"Liberals attempt to assassinate Trump\" bullshit.\n\nThe guy was a Republican protesting him for god's sake. ", "I just went and looked and yes definitely the coma thing. Also someone said this was the forth assassination attempt on him. When the hell were all the others? I didn't even hear about any that ended up being bullshit like this one.", "Sure didn't stop the Trumpsters from declaring \"assassination attempt.\" They're fighting a war alright against reality.", "Please keep whining Donnie. It's super attractive   ", "Just a \"certain group\".", "They love to tear into hillary for the Bosnian sniper fire thing...then they do this shit.", "no weapon found unknown person yelled \"Gun\", random dude probably got tackled.\n\nSounds like a setup, the comments section on other sites reporting it, and people on FB (mine at least) are already blaming Hillary supporters for an assassination attempt.. So it looks like the plan worked fine.\n\narticle with comments.. that clearly says no weapon was found.\n\nhttp://www.zerohedge.com/news/2016-11-05/trump-rushed-stage-secret-service-nevada-rally", "No that's campaigning. Cheating is when your supporters try to vote for you multiple times.\n\nEdit: But if you want to know the **real** reason Trump hates Beyonce, look at net worth. She's worth $465M, he's only worth $150M. And he can't stand being poorer than a black woman.", "PSA: If you haven't noticed already 90% of the articles on this sub are extremely biased.\n\nAs a former Bernie supporter there is no way that I am voting her her. Anecdotal yes, but this is a common sentiment in my personal experience.", "Here's one that I know of...\n\nhttps://www.theguardian.com/us-news/2016/jun/30/briton-charged-in-us-after-assassination-attempt-on-donald-trump\n\nHe told police that his aim had been to kill Trump.\n\nwhen he went to the Battlefield Vegas gun range the day before the Trump event to practice shooting.\n\nHe had driven from San Bernardino California, for the specific purpose of killing Trump, according to the secret service report\n\nhttp://heavy.com/news/2016/06/michael-steven-sandford-donald-trump-las-vegas-rally-assassination-attempt-kill-arrest/\n\nSandford told a Secret Service agent he tried to grab the officer’s gun to “shoot and kill Trump.” He told the agent he thought he could fire one or two rounds before he would be killed by law enforcement\n", "Yes the Constitution is a big conspiracy to rig the system towards democracy and away from authoritarianism", "Answer: She won't. Definitely not voting for her.", "this could be your president. the guy who doesn't want you to vote at all.", "There is nothing more anti-American than denying people their right to vote.  If there is one thing Americans are more proud of than anything else it is having the right to vote.  We may not use it but we like having the right.\n\nThen you get dumbasses like this who try to take away that right from others any way they can.  It's quite frankly treasonous.  If they don't like people voting they should move to Russia.", "I wonder if the media will report that a guy was holding a republicans against trump sign who was attacked and while they were kicking him on the ground someone yelled gun. I guess in the heat of the moment a helpless man you are kicking on the ground a sign might appear to be a gun?", "\"You know what I'm talking about\"", "In fact I saw them mocking her for that in the thread about this topic on r/t_d because look at this REAL THREAT Donald is under compared to her make believe threat!!", "Why is he going around asking people if they're voting for crooked Hillary? What is the purpose of this and what does it serve? And why is he carrying a gun? Just because he's allowed doesn't mean he has to. None of it serves any purpose and will do nothing but make people feel uneasy.", "Straight out of /r/conspiracy.\n\nHonestly I am surprised he hasn't claimed Obama is a Satan worshipper because he had a bandaid on yet. That got upvoted on both /r/conspiracy and /r/the_donald.", "The nimble centipedes over at r/The_Donald are claiming that this was a credible assassination attempt and that it should be blamed on the left.", "So true. You can go back through my post history and see me decrying Hilary as an evil warmongering, corporatist bitch back in March who I'd rather see the country go to Trump than vote for...but I'm sucking it up and eating my words.", "&gt;None of it serves any purpose and will do nothing but make people feel uneasy.\n\nThat is the goal of voter intimidation. If he can discourage enough people from voting he might get in to conservative heaven.", "Apparently someone yells gun. Secret service goes into action. Guy is apprehended but no gun is found. That's not actually what happened is it? Someone in the crowd just \"swatted\" another person in attendance? After trump told someone to get out", "Reagan also actually got shot. \n\nThis dude had a sign.", "He's back to claiming it's rigged he is obviously scared now.", "Typical Trump moment. \n\nSomeone yells gun and there is no gun.\n\nJust some blatant lies and a bunch of clueless followers losing their minds.", "Nobody tell him about Oprah!!", "They're keeping the polls open to let *those* people vote.\n\nWe can't expect Trump to win if *those* people are allowed to vote. How is that fair?", "He's kind of right. Long lines at voting locations are indicative of less polling places which is often a voter suppression tactic. \n\nVoter suppression predominately discriminates against poor and minorities which tend do vote democrat. So it's rigged in his favor. ", "Lolololololol cant even blame the left for this one. This was in-house. ", "Reminds me of how everyone on the right was livid about the cop killer in Iowa until they found out that he was a white Trump supporter who waved the confederate flag at high school football games.", "Hmm if he's back to calling it rigged it could mean they aren't seeing good polling internally.", "It said \"Republicans Against Trump\"", "Any hispanic voter seeing this and considering voting Trump needs to understand that he does not see you as a citizen or a worthy human being, simply because of your heritage. Keep that in mind.", "Shhhhh don't bring logic into this or else you'll ruin Vox's attempt to make Bernie holdouts think that voting Clinton is actually a smart idea now. /s  \n  \n(but really this is obviously a fake article just designed to make Bernie supporters more comfortable voting for HRC or giving them a way out for voting for her while still claiming to be progressives)", "Reagan was already 69 days into the presidency when the assassination attempt occurred. The bump in polls were for [his approval rating as President](http://www.cnn.com/2011/OPINION/03/30/avlon.reagan.shooting/) not for the election. \n\nThe difference for Trump is that he isn't yet president and the \"assassination attempt\" won't do much in boosting his numbers for the election polls come Tuesday. \n\n&gt; Despite an electoral landslide over Jimmy Carter with a 44-state win in 1980, Reagan won with a narrow popular margin of 50.7%. Moreover, Gallup's valuable presidential poll tracker shows that Reagan's approval ratings were significantly split along partisan lines after his 1981 inauguration, with 74% Republican support and 53% from independents but 38% from Democrats.\n\n&gt; In the wake of the assassination attempt, Reagan's approval ratings jumped -- providing a new baseline that propelled his legislative agenda forward and helped translate to his broad-based re-election. By the 100th day of his administration, 51% of Democrats supported him and 70% of independents in addition to 92% of Republicans.", "Only if you're in \"certain areas\"", "My wife's aunt is married to a Cuban immigrant whose entire family lives in Las Vegas and is proudly voting trump.   They are saying pretty much the same thing daily on Facebook. I work in NJ with a Latvian woman married to an Egyptian (yes also Muslim), both now citizens, all proudly voting for trump. The Cubans and Egyptians I'm speaking of, extremely light skinned.  Every god damn one of them is putting down people darker than them that also happen to be immigrants. My mind is fucked from trying to argue it with them. My comment probably isn't really relevant or productive to what you're saying but felt it might be interesting to share in response. ", "So would Scott Baio (😂) also be cheating? ", "Add me to the list.", "You would think they would have learned from the 1st great Meme War that much like invading Russia in the Winter you don't start shit with the Swedish.\n\n", "Because one party is specifically invested in keeping the number of people who vote to a minimum.  \n\nThey will continue to do their best to keep polling hours and days to the shortest period possible.  ", "No kidding that they parade a 2008 obama quote as being against hillary. I wonder what will happen if we show them 2008 trump quotes of being pro-hillary.", "Trump Jr is retweeting \"Assassination Attempt\" tweets and bringing up the DNC as inciting violence.\n\nTurns out the \"assassin\" had a sign that said \"Republicans against Trump\" and crowd members started a fight with him.  \n\nThere was no gun and no assassination attempt.\n\n", "Saying there was an assassination attempt isn't sensationalizing. It's lying.\n\nEdit - And I just noticed its at the top of /r/all. A big fucking lie from a bunch of sad sad liars actually wishing that there was an assassination attempt.", "\n\n[Reagan got a bump in polls from an assassination attempt](https://en.m.wikipedia.org/wiki/Attempted_assassination_of_Ronald_Reagan) so don't expect the Trump campaign to be admitting this.", "It's rigged because voters get to vote?  But it's not rigged when Trump supporters show up at polling places to intimidate democrats?  It's not rigged when black and Latino voters are removed from the registry?  It's not rigged when polling places are only located far away from areas mostly inhabited by black or Latino voters?\n\nFuck Trump.  Please don't forget to vote!", "&gt; but I'm sucking it up and eating my words.\n\n&lt;3", "*Brown* people voting is his evidence of voting fraud.\n\nSee also: *Welfare fraud*", "The guy who was accused of this should go to the news and tell the story from his perspective. I'd be really interested in hearing what he was doing and how this all went down.\n\nIt's starting to sound like this: republican guy comes to protest against Trump at a rally Trump tells his supporters to \"take him out\", some kind of altercation breaks out, and then the audience starts yelling \"gun! gun!\" prompting secret service to do what they're trained to do in such situations. \n\nIf this really was an unarmed man who was singled out by Trump, falsely accused of something and mobbed by an angry group of Trump supporters it could be very bad news for Trump. If anything, it shows once again how violent and volatile his rallies tend to be.", "We need to watch certain areas ... certain areas where there could be a lot of riggers... certain areas of inner-cities *wink-wink* where there could be a lot of ... riggers", "Trump has read them. (Really)", "Glad it wasn't a serious threat. A high altitude balloonist would make an interesting assassin though...", "The guy was a Republican. The sign he had said \"Republicans against Trump\".", "So certainly not a Democrat. Wonder how trump will use this? Guessing his next speech will talk about Hillary personally paying this guy to try to kill him with a sign.", "thats exactly what happened. ", "[deleted]  \n ^^^^^^^^^^^^^^^^0.3337 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/90628)", "Everything this guy says is the dumbest piece of shit I've heard. And people actually complain about Clinton preparing for her appearances. Look at the alternative: nonsense.", "It's almost like if you aren't a complete piece of shit people do events for you other than the KKK.", "We have to stop dealing with this shit. The media has to black him out after Hillary has won. She deserves this moment and she deserves having the media pay attention to the issues that she is pressing forward with. Not Trump's tantrum.", "The Republican call for voter ID laws at least sounded better on paper than \"drive all the minorities away from the polls\". I almost miss those days.", "One early voting site stayed open past the 7 PM closing time Friday. The site was in a area that a good number of Hispanics live. The reason it stayed open was because how long the line was. Everyone that got in line before 7PM was entitled to vote.\n\nThere was no busing in Hispanics.\n", "Won't be voting for her either. She hasn't earned my vote.", "Already released.....", "It is when you hold a view that many people should not be allowed to vote on the basis of their religion race, and socioeconomic status. \n\nRemember, Trump hates the Constitutions and Civil Liberties. So it makes perfect sense how he thinks that everyone who is legally allowed to vote is a form of rigging because only certain people should be allowed to vote in his view. ", "All this rigged stuff makes me wonder where the projection is.", "Birth?", "Authoritarians (assholes) do this all the time. Instead of \"swatting\" they just call the cops and say \"I think this guy at [place] is on drugs and acting suspicious\" and LE will be there in two shakes of a lamb's tail. \n\nThese old people that live around the city park where I live will call the cops on you for playing basketball or having a picnic. They just tell police that they think drugs are being used and LE jumps into action. The police show up and look through all the bags search you and everybody with you and then check out the car you came in because.. \"drugs\". \n\n", "&gt; The annual military pay raise this year is thr fourth year in a row of the lowest worst pay raises in decades.\n\nYou should probably contact the Republicans in the House and Senate, given that they have blocked the White House's requested raises. \n\nBlaming Obama because the GOP refuses to pass larger raises is like blaming the Referee because your boxer put his guard down and got punched in the face. ", "Chacheating.\n\nWe're deep in the rabbit hole folks.", "[Reality?](https://i.sli.mg/3xbEX6.gif)", "From a statistical standpoint Nate's numbers absolutely make sense. The polls are all over the place this election, and I think it's because there's no one good method to poll anymore. How do you get a reliable random sample when few people have landlines, most people don't answer cellphone calls from random numbers, and online surveys require some level of opt-in?", "Same here buddy", "Millennial here I voted last week and a lot of my friends already voted. Fuck this generation battle. We're just as capable as any other generation. We get so much shit even though the odds are stacked against us.", "It's a good question! ID laws may be considered to infringe on the right to vote because some citizens may not have the means to obtain the ID.\n\nSimilarly voter competency tests are a non-starter because not everyone is functionality literate, but they all have the right to vote anyway.\n\nEmpirically, in recent history, **Republicans tend to be at the fore of voter suppression efforts because those easily suppressed tend to vote Democratic.** That ranges from ID laws, to voter fraud allegations, and to polling limitations, which includes messing with early or absentee voting, removing polling stations in densely populated areas, and other skullduggery.", "In politics October 27 was so long ago no one even remembers it. ", "He's such a sore and jealous loser. ", "Those who profess colorblindness often retain this mysterious tendency to discriminate between shades. ", "No a character in his essay fantasized about being gangraped.\n\nFunny how we have to take it out of context to find something Bernie \"said\"...", "That's okay. Everyone should be voting regardless of who they support. Of course we'd like them to vote for our candidate but overall more people voting is better than less.", "At which point the story disappeared. ", "Can gays have guns or nah?", "Your whole argument is that guns make people safer. Someone says the word in a crowd and you all piss your pants.", "I think it depends. Are they the quiet kind who increase property values or are they [this guy](http://tvmedia.ign.com/tv/image/article/817/817288/the-opposition-20070831044610025.jpg)?", "They don't want that. It hurts them in the polls. Republicans actively worked to disenfranchise certain demographics by doing stuff like closing polling locations and DMVs in specific neighborhoods enacting unnecessary Voter ID laws, getting rid of straight ticket voting, cutting down on early voting, defunding voter registration drives and a bunch of other crap.\n\nIn some places they were pretty blatant in their approach. \n\n&gt;The judges noted that Republican leaders had drafted their restrictions on voting only after receiving data indicating that African-Americans would be the voters most significantly affected by them.\n\nhttp://www.nytimes.com/2016/07/30/us/federal-appeals-court-strikes-down-north-carolina-voter-id-provision.html", "They already released him wouldn't have done that if he tried grabbing for a gun.", "https://en.wikipedia.org/wiki/Triple_parentheses", "Shit I was gonna vote stein but now I'm def voting Clinton I don't want my state going to dumpster.", "Nope your point is correct. Trump only believes that those who vote for him should be able to vote. Thanks for clarifying. ", "There was no assassination attempt. His crowd of supporters attacked a protester and someone shouted \"Gun!\"\n\nA protester could have been killed at his rally and his cultist followers are spinning it like he survived a liberal plot.\n\nSeriously. 40% of this country needs to stop drinking the alt-right KKKool-Aid", "So I checked out that Jack Posobiec guy's tweet claiming it was an assassination attempt. Trump actually tweeted back calling the sign guy a would be assassin. The fuck is he smoking..\n\nIt really boggles my mind how Donald freakin' Trump could possibly be our next president. People really want to elect a guy who's famous for yelling \"You're fired!\"? I get that Clinton has her sketchy background but we're talking about electing a freakin' reality TV 'star' as the next president of the US. How did America get to this point? In what world is Donald Trump suitable to be the next most powerful person of the world? \n\nMy sister is voting Trump and one of her reasons is his staunch immigration policies. No explanation to why his immigration policies are better than Clinton's. Just that he's going to be strict on immigration. I guess she totally forgot how our parents were both immigrants.", "To be honest I doubt this story survives the night.  Clearly wasn't an assassination attempt, there was no weapon, and now I'm hearing the guy has been released.  The next three days will be jammed pack with the final push and election day, this story won't be more than a footnote Sunday morning.", "&gt;Crites said held a sign that said “Republicans against Trump.” He was terrified by the crowd’s reaction to him. “I was in survival mode” he said. “I knew I could die at that moment.”\n\n&gt;**He told Lewis that “Someone grabbed his testicles** and had his neck was in a chokehold.”\n\nI'm guessing they learned this from Trump.", "holy shit that's actually the first time I ever went on that sub. Dude those people are insane", "No shit it's like an actual cult. Things are going to get nasty when he loses Tuesday.", " Ha! The guy  detained was even a Republican....holding a sign that said \"Republicans against Trump\". So much for party unity. ", "Trump's campaign strategy has often been get a story out to the public let the media pick it up and make it their top story, and then when the inaccuracies get revealed it doesn't matter because everyone is already focusing elsewhere.  Unfortunately for Trump's team, at the exact moment they were boosting about surviving an \"assassination attempt\", the media was already reporting that it was just some guy raising a sign and another person freaking out.\n\nWorst of all, this happens Saturday night when most people aren't following the news.  I'm predicting this story is just a footnote tomorrow morning then forgotten by Monday.", "Voters. He's literally complaining about voters.", "Was banned from the Donald for posting the secret service statement. \n\n\"Anti-Trump\" was the moderators reasoning. ", "Oh man. Good times. A shoe! It's such a good weapon there is something especially insulting about it.\n\nhttp://stream1.gifsoup.com/view1/3108879/george-w-bush-dodges-shoe-o.gif", "It was an \"instant reaction\" on social media.  Someone yelled gun little facts known, people assume the worst.  By the time people wake up on Sunday the full story will be there.", "[deleted]  \n ^^^^^^^^^^^^^^^^0.2069 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/66259)", "They really don't give a fuck do they? I feel like this election is going to end Jim Jones style on the top of Trump tower.", "You know what they say \"The facts have a well-known liberal bias.” ", "This man is a hero. He is seeing his party going to shit and is taking a stand.\n\nI am not a republican and I am not for Trump however I respect him for taking a stance. ", "Despite what this sub would have us believe a hell of a lot of us former Bernie supporters won't be voting Clinton. ", "&gt; Hell they'd probably vote for an actual foreigner as long as he was a white male republican.\n\nWhen Schwarzenegger became governor of California, some Republicans started talking about amending the US Constitution so he could run for president.  So, yes.\n\nhttps://en.wikipedia.org/wiki/Equal_Opportunity_to_Govern_Amendment\n\nhttp://www.washingtontimes.com/news/2013/oct/18/arnold-schwarzenegger-lobbies-law-change-seek-pres/", "False flag!\n\n/s", "Actually it's pretty American to find ways to disenfranchise groups you don't like. ", "Well considering they were literally beating this dude on the ground when they all of a sudden mistook his \"republicans against trump\" sign as a gun I'm going out on a limb they were just trying say some random shit to justify beating a man on the ground.", "I bet he thinks he deserves a medal for this.", "Trump's bravery is [as majestic as the wings of an eagle](https://i.makeagif.com/media/12-09-2015/x580wh.gif).", "According to the accused he was beaten up before anyone ever shouted \"gun\"\n\n&gt;KRNV's Ben Margiott reported at about 7:25 p.m. that the man, who identified himself as Austyn Crites, had been released from detainment. Crites said in an interview that he is a Republican and had been holding a \"Republicans Against Trump\" sign.\n\n&gt;\"When I pulled out the sign, people around me were trying to grab the sign,\" Crites told reporters. \"And so all that was occurring was booing, of course, that's what you would expect.\"\n\n&gt;He continued: \"All of a sudden, because they couldn't grab the sign, or whatever happened, bam, I get tackled by all these people who were just, like, kicking me and grabbing me in the crotch and just, just beating the crap out of me.\n\n&gt;\"And somebody yells something about a gun, and so that's when things really got out of hand,\" he said. Crites said he thought he would have been killed if law enforcement hadn't responded.\n\nhttp://nebraska.tv/news/election/donald-trump-rushed-off-stage-returns-to-continue-rally-in-reno", "That sign could have given him a serious paper cut. ", "Tried to make him bleed from...........his wherever ", "Hopefully if the story doesn't become a footnote the media will flip it in to a story about Trump and his campaign being pathological liars and trying to spread fear, anger, and hysteria to their supporter base...you know the story that they should have been reporting for a year now. ", "The \"gun\" was a sign saying \"Republicans Against Trump\"\n\nSigns like that will make us all safer.", "Lots of Republicans are Hillary supporters. There is a reason no former president Dem or Rep has endorsed Trump.", "I agree.  If Trump's camp decides to push it then you can easily say no evidence supports an \"assassination\" attempt.  And it contrasts poorly with how Obama handled a protester yesterday.", "Yea. There is this pesky thing called reality that occurs outside the confines of this subreddit that is pretty hard for them to correct.", "Why would they vote for Trump? He's almost the exact opposite of Sander's in every single way including policies, honesty, and integrity. His picks for Supreme Court Justices alone could set back Sander's ideal decades.\n\nI can see not voting Clinton, I'm not sure I can stomach it either.\nIt just makes zero sense to support Sander's and vote Trump, they have no overlap. ", "/r/the_donald is totally not propaganda", "The police frisked him. Donald's supporters assaulted him.", "So they still give Clinton shit for the 'sniper fire' comment after two decades but a republican holding a sign = legitimate assassination threat.\n\nNo double standard there at all /s", "Even trumps latest tweet implies he was in potential danger. I'm curious if someone really mistook the guy for having a weapon or if that person that yelled \"gun\" was being a Dick to the guy protesting. ", "All I can say is that a lot of us arent standing for it and working to turn the tide.  This isnt the country I think of and I want to see for the next 4 years.  The feelings are going to be around regardless but as a hispanic I want to say I'm here for all my LGBT, muslim, immigrant, jewish, etc friends.  ", "&gt;My sister is voting Trump and one of her reasons is his staunch immigration policies. No explanation to why his immigration policies are better than Clinton's. Just that he's going to be strict on immigration.\n\nI was thinking the other day that if he really does what he says he's going to do he's going to have to use eminent domain to take U.S. citizens' land on the border in order to build that wall.\n\nPlus it won't even stop people overstaying their visas unless he creates a new immigration authority that specifically targets and cracks down on visa-overstayers.", "That's what /r/the_meltdown is for.", "The incredible thing about this whole fiasco is that it turned out Trump was 10000% worse than anyone could ever have predicted!!! Sure the business guy who yells \"you're fired\" on a TV show, OK hahaha *that guy will never be president* - oh fuck, I didn't realize he was a fucking psychopathic sociopathic rapist fascist! I mean seriously.", "I think it's pretty likely he's not going to concede now. This isn't some brave front he's putting on. I  think he really believes it. He's a Narcissist on the verge of having his world shattered full blown denial and delusion.", "If someone draws a gun on a presidential candidate (or anyone for that matter) no matter who that candidate is, it's a terrible thing.  What happened instead seems to be either an overly frightened individual or someone who wanted to see a protester roughed up by others by yelling out \"gun\".", "Just a complete and utter lack of character. Say anything do anything to get ahead.", "I don't think there's ever been a better argument against white supremacy than this election. I say this as a white male but thank god for women and minorities for saving us from my own racial/gender demographic.", "I don't understand it.  Change is not useful if it is antithetical to the change you need.  To me Bernie's campaign wasn't so much about anti-establishment as it was bringing progressive ideas and ideals to the table.  He wanted billionaires out of politics; Trump is literally a billionaire.  He wanted to address climate change; Trump says it's a Chinese hoax.  He wanted to improve healthcare in America, get costs under control and provide everyone with an essential service; Trump wants to turn it back over to the for-profit insurance companies and create HSA's (which are the polar opposite of socialized healthcare).  Sanders wanted to end the upward flow of money, make the 1% give something back, it was his biggest campaign talking point; Trump wants to cut taxes for the wealthiest, reduce regulations, and is still beholden to the disproven myth that supply-side economics solves all problems.\n\nI'd understand voting third party, or not voting at all, if you're a Sanders supporter fed up with the Democratic establishment.  But a vote for Trump is a vote against everything that Sanders stands for.", "Hopefully the Republicans Against Trump guy who was protesting sues for libel.", "Don't go there. \n\nYou can manage to not be in an information bubble without ever going to teh_jingo. ", "Plus he was holding up a sign saying he isn't going to vote for Trump. It makes no sense that he would draw attention to himself with a big sign if he was an armed assassin.\n\nTrump's supporters were just looking for an excuse to rough him up and grab his junk.", "Trump and his campaign once again failed the leadership test.\n\nClaiming an assassination attempt with no information is irresponsible reckless, and downright dangerous. The fact that it is 100% wrong just shows how unfit anyone in his cabal is to hold any sort of leadership position.", "Don't know how Trump's campaign is going to keep saying that this was an assassination attempt after the sign guy was released and spoke to the media... but I'm sure they will... and I'm sure his supporters will believe him...", "Thank you for doing so.  I saw on the Bernie threads ALOT of folks arent getting over it and would rather see Trump than her because Bernie lost... or something.  I found it all rather depressing.", "I was dead set on it...but Trump kept talking. Hilary still didn't win my vote. Trump scared it to her. ", "Way too over complicated for this shitshow.\n\nThe protestor runs a Republicans Against Trump protest group and Trump's crowd reacted to dissent the only way they know how.  Hysteria.\n\nHopefully the protestor sues for libel.", "Here's the account of the man per a CNN reporter: \n\nhttps://twitter.com/JDiamond1/status/795118443443945473\n\nPoor man sounds like he was attacked for having a different POV. And then someone said the magic word.", "But /r/the_donald called this  a credible  assination attempt ", "I grew up in PA and never got why other Pennsylvanians loved Yuengling so much. It is just another cheap piss tasting beer. God bless craft brews.", "uh no... he didn't have a gun.  there's no speculation anymore", "\"My God it's comin' right for us!\"", "I laugh at the fact conservatives were scared of a gun", "I know Trump's craziness is discussed all the time and so many exaggerated statements are made about him but I am so worried. A candidate for President is demeaning our democracy. He claims it's rigged because Democrats are voting and his supporters cheer! He is the antithesis of everything that makes this country great and they cheer for him. He brags about sexual assault and demeans women and minorities and they cheer for him. He calls for the imprisonment of his opponent and they cheer. He calls for war crimes and they cheer. He says he might not accept the results of the election and they cheer. \n\nIf he wins, god help us all. \nIf he loses, what will they do? ", "There is a difference between saying cutting polling sites and hours in areas where black people live is voter suppression which it is and the RNC is open about that strategy, and claiming that non-citizens are being bused in to steal an election. ", "Why not criticize the long lines that have been created due to Republicans limiting voting hours at polling places to limit voter turnout? Right because it is only bad if it hurts Trump, but fine if it hurts your opponent. ", "It says so fucking much about his personality though\n\nHe can't speak on war heroes without comparing them to himself\n\n", "The \"weapon\" is a sign saying \"Republicans Against Trump\".\n\nYelling gun when there is none is equivalent to yelling fire in a theater.  A pathetic attempt to gain sympathy for The Donald by a sick Trump supporter.", "I am an American Jew who is not shy about my heritage and I'm very nervous about this election. My father has always worried that there might be a point where we would not be welcome in the United States.  I always thought that was overkill paranoia but not I'm not so sure.  While the rhetoric has mainly not been directed at Jews I doubt his racist  followers would stop at persecuting Hispanics and Muslims.  I cannot believe that we, the country that is supposed to be the exemplary democracy, is on the verge of taking a time machine back to 1930s Germany.", "[deleted]  \n ^^^^^^^^^^^^^^^^0.6917 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/85041)", "Or you belong to a certain group\"", "two words:\nAnti\nEstablishment ", "Tonight I watched a secret service guy grab a pussy.", "Women and minorities being allowed to vote isn't voter fraud despite what Rapey the Orange Clown says", "It's literally written into every single one of our founding documents", "I had a dream last night that Trump won the election and was walking down the hall toward the oval office with his aides and asked of them \"So what do I do now?\" and one of them responds: \"Excuse me Mr. President?\". \"You know how do I repeal Obamacare and make this country great again and other stuff like that?\"", "Seriously how is that sub so popular?", "u/iamusuallynotright didn't say he is voting for Trump.", "Manafort's business dealings in Ukraine helped to get rid of Manafort.", "I just created an alt and subscribed so that I can view the meltdown on Tuesday.", "I had hoped the news organizations would have been tougher on Trump about this but I guess SNL will do (only because I know it pisses Donny off).", "Ted Nugent and Scott Baio?", "Wow. Assassination attempt with a sign. ", "The demonization of Hillary is deep. ", "&gt; No explanation to why his immigration policies are better than Clinton's.\n\nWell his plan is a lot louder. It's the Bill O'Reilly school of epistemology. The more and louder you shout something, the more you know it's true.", "Even if we never saw or heard from him again after the election (which would be a truly great thing) he and his alt-right have already damaged our democracy as much as the tea party has, and his supporters and the tea party will continue to do so into the future.", "IKR.  As a white male I apologize on behalf of all of us, regardless of whether you want me to, for Donald Trump.  He is all the worst possible traits in us personified.  Whatever the exact opposite of what Bernie Sanders represents is, that's Trump.", "Fucking fuck you. Implying that such a horrible thing could never happen again is the pinnacle of ignorance and one way to allow it to happen again. \n\nThe Jewish people have been attacked for millennia and suddenly they're safe now? I mean I'd love to say yes but fuck... American had always had a strong anti semetic component. ", "dudes who are losing", "The only case of in-person voter fraud so far was by a Don supporter. Same goes for the case of mail-in voter fraud. ", "I'm glad that Republicans have started to be more public with the fact that they know that lower turnout = good for them. ", "Also our first 7 presidents were British-born, I am just saying..\n\nEdit: Changed 6 to 7, I forgot about Andrew Jackson being the same age as John Quincy Adams.", "Did anyone yet comment on the fact that he called it a *Democrat* polling station as though polling stations have political affiliations? lol", "Especially because the Swedes are a lot more likeable than Trump supporters.", "Yeah those damn riggers. ", "So he was an assassin who was hiding a gun in his junk?\n\nOnly he had no gun and only a sign drawing attention to himself saying he is a Republican who is not going to vote for Trump.\n\nPlease stop embarrassing yourself.", "Yeah that is not remotely what happened.  The crowd started beating a guy because of his sign.  Then someone yelled gun after he was down on the ground.  He didn't \"run to the front\".  Secret service / law enforcement came later and at least according to him saved his life before the mob beat him to death.  And of course he had no gun.", "I think anyone would have been afraid in this situation. "], "links": ["5bchyj", "5bchyj", "5bchyj", "5bchyj", "5bchyj", "5bchyj", "5bchyj", "5bchyj", "5bc25u", "5bcg11", "5bc2qr", "5bcffe", "5bchyj", "5bcv55", "5bchyj", "5bc25u", "5bc25u", "5bchyj", "5bcyxv", "5bcwdb", "5bchyj", "5bcffe", "5bcg11", "5bc25u", "5bc2qr", "5bchyj", "5bc2qr", "5bcg11", "5bchyj", "5balae", "5bc25u", "5bc25u", "5bc25u", "5bcwjl", "5bcg11", "5bc2qr", "5bchyj", "5bcv55", "5bct98", "5bc2qr", "5bcc1h", "5bc25u", "5bchyj", "5bc25u", "5balae", "5bchyj", "5bcr0y", "5bcz7t", "5bcc1h", "5bcffe", "5bchyj", "5bc2qr", "5bchyj", "5bc25u", "5bbza3", "5bchyj", "5bc2qr", "5bchyj", "5bc2qr", "5bcffe", "5bc25u", "5bcv55", "5bchyj", "5bcej0", "5bcc1h", "5bcwjl", "5bct98", "5bchyj", "5bchyj", "5bc2qr", "5bbd3a", "5bchyj", "5bc2qr", "5bc2qr", "5bchyj", "5bbza3", "5bc25u", "5bcwdb", "5bcej0", "5bbd3a", "5bc25u", "5bcg11", "5bcssu", "5bb5gi", "5bc2qr", "5bbd3a", "5bchyj", "5bcjgr", "5balae", "5bc25u", "5bchyj", "5bbd3a", "5bcc1h", "5batrm", "5bct98", "5bcwdb", "5bchyj", "5bchyj", "5bd999", "5bd4fq", "5bd4fq", "5bchyj", "5bd4fq", "5bd999", "5bd999", "5bd999", "5bchyj", "5bd4fq", "5bchyj", "5bcyxv", "5bc25u", "5bd4fq", "5bchyj", "5bchyj", "5bd4fq", "5bchyj", "5bchyj", "5bd4fq", "5bc25u", "5bcg11", "5bd4fq", "5bd74t", "5bc25u", "5bd999", "5bchyj", "5bd999", "5bchyj", "5bd999", "5bcyxv", "5bchyj", "5bchyj", "5bc25u", "5bchyj", "5bchyj", "5bd4fq", "5bc25u", "5bchyj", "5bd6ez", "5bc25u", "5bchyj", "5bd4fq", "5bcffe", "5bcg11", "5bd4fq", "5bchyj", "5bd74t", "5bd74t", "5bc2qr", "5bchyj", "5bd4fq", "5bchyj", "5bcyxv", "5bd4fq", "5bchyj", "5bd74t", "5bcyxv", "5bd4fq", "5bcyxv", "5bcyxv", "5bchyj", "5bd74t", "5bd4fq", "5bc25u", "5bcffe", "5bd1e4", "5bd4fq", "5bc2qr", "5bchyj", "5bd4fq", "5bcyxv", "5bc25u", "5bd4fq", "5bcwdb", "5bc25u", "5bcg11", "5bcwdb", "5bchyj", "5bchyj", "5bcyxv", "5bd4fq", "5bcd83", "5bc25u", "5bd74t", "5bd4fq", "5bd4fq", "5bbd3a", "5bchyj", "5bcyxv", "5bd4fq", "5bd6ez", "5bcyxv", "5bc25u", "5bchyj", "5bd4jb", "5bc25u", "5bdc5z", "5bdc5z", "5bdahi", "5bchyj", "5bdc5z", "5bchyj", "5bchyj", "5bdc5z", "5bchyj", "5bd999", "5bdc5z", "5bchyj", "5bc25u", "5bdc5z", "5bdahi", "5bchyj", "5bd6ez", "5bchyj", "5bdc5z", "5bdahi", "5bd999", "5bdc5z", "5bdc5z", "5bchyj", "5bchyj", "5bchyj", "5bdc5z", "5bchyj", "5bd999", "5bchyj", "5bchyj", "5bchyj", "5bd6ez", "5bdc5z", "5bchyj", "5bd999", "5bcyxv", "5bchyj", "5bdahi", "5bdahi", "5bchyj", "5bchyj", "5bchyj", "5bcg11", "5bd4fq", "5bdahi", "5bd999", "5bdahi", "5bchyj", "5bchyj", "5bd999", "5bdc5z", "5bcg11", "5bchyj", "5bchyj", "5bdc5z", "5bchyj", "5bchyj", "5bdahi", "5bdahi", "5bc25u", "5bchyj", "5bcg11", "5bchyj", "5bdahi", "5bc25u", "5bchyj", "5bd6ez", "5bchyj", "5bchyj", "5bd74t", "5bd4fq", "5bd4fq", "5bdc5z", "5bd999", "5bchyj", "5bc2qr", "5bcg11", "5bd999", "5bc2qr", "5bdc5z", "5bc25u", "5bc25u", "5bcffe", "5bchyj", "5bcg11", "5bchyj", "5bc25u", "5bc25u", "5bdjah", "5bc25u", "5bcg11", "5bdc5z", "5bcyxv", "5bchyj", "5bchyj", "5bchyj", "5bdc5z", "5bdc5z", "5bdsof", "5bd999", "5bdc5z", "5bchyj", "5bdc5z", "5bd999", "5bdc5z", "5bdc5z", "5bdp9k", "5bd4fq", "5bdpna", "5bdc5z", "5bd4fq", "5bchyj", "5bchyj", "5bdsof", "5bdc5z", "5bdahi", "5bchyj", "5bcffe", "5bd6ez", "5bc25u", "5bdrtt", "5bdrlz", "5bdpna", "5bdc5z", "5bdc5z", "5bc25u", "5bchyj", "5bd999", "5bdp9k", "5bchyj", "5bdc5z", "5bd4fq", "5bd999", "5bd4fq", "5bchyj", "5bdc5z", "5bd4fq", "5bdkmr", "5bdp9k", "5bdp9k", "5bdc5z", "5bc25u", "5bdoxb", "5bdnwx", "5bd4fq", "5bdpna", "5bdqsr", "5bd999", "5bdjah", "5bchyj", "5bdjf0", "5bchyj", "5bchyj", "5bdpna", "5bchyj", "5bchyj", "5bdc5z", "5bdc5z", "5bd999", "5bdjah", "5bd6ez", "5bc25u", "5bd999", "5bchyj", "5bdrlz", "5bd74t", "5bdrhw", "5bdpna", "5bd6ez", "5bdrlz", "5bcg11", "5bd74t", "5bc2qr", "5bdnwx", "5bdgtz", "5bdahi", "5bdp9k", "5bd999", "5bdp9k", "5bc25u", "5bdkmr", "5bdrlz", "5bdc5z", "5bdc5z", "5bc25u", "5bcg11", "5bdp9k", "5bd999", "5bd6ez", "5bc25u", "5bchyj", "5bchyj", "5bd999", "5bdx22", "5bdx22", "5bdx22", "5bdx22", "5bdx22", "5bdsof", "5bdx22", "5bdx22", "5bdx22", "5bdufc", "5bdsof", "5bdx22", "5bdx22", "5bdufc", "5bc25u", "5bdx22", "5bdsof", "5bc25u", "5bdsof", "5bd4fq", "5bdx22", "5bdsof", "5bdx22", "5bchyj", "5bdsof", "5bdx22", "5bdahi", "5bchyj", "5bdc5z", "5bdx22", "5bdsof", "5bdx22", "5bdufc", "5bdsof", "5bdsof", "5bdc5z", "5bdp9k", "5bdsof", "5bdc5z", "5bdsof", "5bc25u", "5bdx22", "5bdsof", "5bd999", "5bdufc", "5bc25u", "5bdc5z", "5bdsof", "5bdc5z", "5bdc5z", "5bdx22", "5bdx22", "5bdsof", "5bdahi", "5bdsof", "5bdc5z", "5bd4fq", "5bd6ez", "5bdc5z", "5bdc5z", "5bdc5z", "5bdc5z", "5bcg11", "5bdsof", "5bdufc", "5bd999", "5bd4fq", "5bdsof", "5bc25u", "5bdx22", "5bdsof", "5bdufc", "5bcv55", "5bdc5z", "5bcg11", "5bdufc", "5bdx22", "5bdrlz", "5bc25u", "5bd4fq", "5bd4fq", "5bcv55", "5bdufc", "5bdsof", "5bcffe", "5bdrtt", "5bdp9k", "5bdc5z", "5bdu9r", "5bdc5z", "5bd999", "5bdx22", "5bcyxv", "5bdx0p", "5bdsof", "5bdx22", "5be465", "5bdx22", "5be465", "5bdx22", "5bdx22", "5be465", "5be465", "5bd999", "5bdc5z", "5be465", "5bdx22", "5be465", "5be3rr", "5bdc5z", "5be465", "5bc25u", "5bd999", "5bdx22", "5bd4fq", "5be465", "5be465", "5be465", "5be3rr", "5bdx22", "5be465", "5be465", "5be465", "5be465", "5bdx22", "5bc25u", "5bc25u", "5bdx22", "5be465", "5be465", "5be465", "5bcyxv", "5be465", "5bdx22", "5be465", "5bdsof", "5bdx22", "5be3rr", "5bcc1h", "5bc25u", "5be3rr", "5bdx22", "5be465", "5be465", "5be465", "5bdahi", "5bdahi", "5be465", "5bdx22", "5bdx22", "5be7bd", "5be465", "5be465", "5bdx22", "5bdsof", "5bdsof", "5be7y3", "5bcg11", "5bdx22", "5bcyxv", "5be60d", "5bdsof", "5bc25u", "5be3rr", "5be7y3", "5bd4fq", "5bd999", "5bdx22", "5bc25u", "5be4gs", "5bdx22", "5be7dn", "5bdufc", "5be465", "5bcg11", "5be465", "5bd999", "5bcc1h", "5bcyxv", "5bd999", "5be7y3", "5be7y3", "5bd999", "5bd999", "5bdc5z", "5bdsof", "5be465", "5be3rr", "5bdx22"]}