{"comments": ["That's what you get for using your first amendment rights at a Trump rally. ", "Trump supporters beat the shit out of a Republican and then Trump claims victory.  What a night.  ", "So much for the \"assassination attempt\" jackasses. \n\nThe only person in danger here was a guy who was beaten up by Trump's angry mob of brownshirts for holding up a sign.\n\nThis is how a real President deals with protesters: http://edition.cnn.com/videos/politics/2016/11/04/obama-north-carolina-protester-crowd-focus-sot-nr.cnn", "This is how Trump supporters treat protesters. They try and get the protester killed.", "Trump is the candidate who reminisces about protestors getting carried out on stretchers slammed in the face etc - he was asked to denounce the behaviour and said he had to admire passion from his crowds who would punch dissenters who were being dragged out", "I think the story is that after lying about how Obama dealt with a protester Trump pointed this guy out, asked him if Hillary had paid him $1500, and then said \"take him out\", at which point the protester, who apparently wasn't even shouting, just holding a sign, was roughed up by supporters and/or security.", "Maybe she could just end the lose an hour part but keep the gain an hour of sleep part? ", "Clearly he had it coming! Signs are dangerous! /s \n\nSeriously though what is amazing about this story is that it suggests that even before the gun comment was uttered, that ushered Trump off the stage. Trump supporters were turning on their fellow Republican simply because he had the audacity to protest. All the while Trump seemed to either egg his supporters on, or did nothing. Meanwhile just a few days ago, Hillary/Obama supporters booed a Trump supporter with a sign, and Obama told them, \"Don't boo, vote!\" \n\nThe differences between the two sides could not be clearer. ", "Also they pushed away press trying to cover the incident.\n\nhttps://twitter.com/IceManNYR/status/795077481309016064", "Typical Trump Supporters.", "Haha the_donald's argument is that the guy was actually a democratic \"plant\" thanks to a grainy twitter picture of a similar bald white guy.  It doesn't even matter if it's true; it's okay that they all ganged up and beat the shit out of a protester (then lied about an assassination attempt to make them not look like such scumbags) if the guy was a democrat against Trump instead of a republican against Trump?  Trumpettes are that easy to bait into violence, even after O'Keefe apparently showed them the conspiracy against them??\n\nWhere are all the Trump fans' videos of the incident?  There were clearly at least 30 or 40 cell phones recording during all of it, and the video I've seen sure don't make Trump look afraid of any guns.  He is lead away by the secret service like a confused toddler.  A lot of people are saying he has Parkinson's.", "Pay close attention to the bottom right at [2:27](https://www.youtube.com/watch?v=eemJPPb8Otw&amp;t=2m27s). That's CNN's Noah Gray getting pushed away his camera grabbed and shoved aside by Trump supporters for trying to get a closer look at the incident. \n\nSo much for the first amendment. ", "Trump supporters beat up the man before 'gun' was ever shouted because he pulled out a sign.\n\n&gt;KRNV's Ben Margiott reported at about 7:25 p.m. that the man who identified himself as Austyn Crites, had been released from detainment. Crites said in an interview that he is a Republican and had been holding a \"Republicans Against Trump\" sign.\n\n\n&gt;\"When I pulled out the sign, people around me were trying to grab the sign,\" Crites told reporters. \"And so all that was occurring was booing, of course, that's what you would expect.\"\nHe continued: \"All of a sudden, because they couldn't grab the sign, or whatever happened, bam, I get tackled by all these people who were just, like, kicking me and grabbing me in the crotch and just, just beating the crap out of me.\n\n\n&gt;\"And somebody yells something about a gun, and so that's when things really got out of hand,\" he said. Crites said he thought he would have been killed if law enforcement hadn't responded.\n\n\nhttp://nebraska.tv/news/election/donald-trump-rushed-off-stage-returns-to-continue-rally-in-reno", "Yep [here you go, straight from the horse's mouth.](https://youtu.be/eemJPPb8Otw?t=2)", "And yet /r/The_Donald will still blame Hillary for this.", "It was meant to be insulting. In Muslim culture it's incredibly offensive to show someone the bottom of your shoe. Now intensify that by throwing it at their head. ", "Lord of The Flies definitely comes to mind. \n\nThat book scared the shit out of me when I was a kid. It still scares the shit out of me. ", "&gt; He said he was a wrestler in his youth and used his training to turn his head to the side to maintain an airway open as he was being choked by one man who had him in a headlock. “But there were people wrenching on my neck they could have strangled me to death” he added.\n\n&gt; Crites said when he was on the ground he heard someone yell “something about a gun” and he kept telling those on top of him that he had merely been holding a sign.", "* No gun.\n\n* \"Republicans Against Trump\" sign.\n\n* Trump supporters not happy grab at sign, grab at protester.\n\n* Someone says \"gun.\" You can guess where it goes from there.", "Nasty? More like hilarious. ", "Given his thin skin that could be a serious issue", "wow thats fucked. The media has totally failed tonight by buying completely manufactured propaganda hook line and sinker.", "The incident that occurred tonight at the Trump rally serves as the perfect allegory to describe his campaign and the fears of his supporters. See he has been yelling \"gun\" for almost a year and a half now, and 45% of the American voting public believe there really is one.\n\nTuesday night, after 8 years of those same people complaining that this country is a joke in the eyes of the rest of the world, we will truly become one.", "The good folks over at the Donald have imagined so bigly that the guy who charged the stage had a knife so now he had a knife.\n\nPretty sure there was no knife.", "Don't generalize I know plenty of Bots who aren't Trump supporters.", "Holy shit you are dead right.  Watch the [video here](https://youtu.be/DstxWc3Pbhs?t=34m59s).\n\nSo, not only was this NOT an assassination attempt like the trump supporters are saying, the whole situation was created by trump.", "This and the one time that guy tried to rush Trump's stage during the primaries (with no weapon just as a protest, not that that excuses him) are the only two times I've heard of anything resembling an assassination attempt happening.", "Neither is /r/politics. Oh wait. .....", "&gt;  And it contrasts poorly with how Obama handled a protester yesterday.\n\nYou mean the we-go-high moment that Trump already bodged by lying about a tolerant and reasonable reaction?\n\nThere's no point treating Trump's mouth as a place for rational decisions. It's a coin toss whether he forgets this or claims he saw the gun himself.", "I think they're gonna apeshit bananas and try to stage a redneck coup or some cuckoo shit.", "Is it a false flag that the crowd called gun just to beat the shit out of him for daring to voice his dissent?", "A Trump's supporter pulled a sign and protested Obama showed respect to the protester.  Trump immediately lied about that.\n\nA Trump's protester pulled a sign.  And Trump is calling this an attempted assissination.\n\nDonald Trump is doing everything, pulling every trick to incite and excite his supporters.  It does not matter if they lie out right, there's just no time to correct the lies.  That's what he counts on.  \n\nI am not surprise if he'll pull a few more nasty tricks these next few days.", "the man claims he was beat up put in a chokehold, had his testacles grabbed before anyone said 'gun'", "When I first went there several months back I seriously thought it was a joke that everyone was in on but as i continued reading through some threads I realized they are very far removed from any sense of reality.", "No it's because Trump is an unhinged fascist moron and a minority of republicans still have a shred of decency", "&gt;“The fact that I got beat up today that’s just showing what he’s doing to his crowds. But I just want people to understand I’m going to be OK, but now what’s more important is if the country going to be OK? So do your part and vote.”", "Trump pointed him out and asked him how much Hillary was paying him and then said \"Alright take him out\".", "Eh close enough.", "They might even be able to add the video of his crowd going after the reporter who was trying to get a camera shot of it\n\nhttps://twitter.com/IceManNYR/status/795077481309016064", "Trump supporters are scum. Watch. They will blame this on the Hillary campaign. Bunch of assholes. ", "Not only did the guy not have a gun but it was just a Republican with a sign. \n\nThis doesn't stop morons from somehow connecting this to progressives, the DNC, and Hillary. \n\nTrump is so toxic that members of the GOP are attending rallies and agressively holding placards. Trump is also so delusional that he thinks people will fall for this non-assasination attempt to vote for him. ", "Damn *r*iggers... ", "[In the next rally the invocation dude at the start of the rally said there was an attempted murder of Trump.](https://www.youtube.com/watch?v=UD3VMnWOFdc)\n\nI mean, Trump will probably babble on about it a little when his ADHD kicks in. But anything he says during those fits tend to never find traction, it seems.\n\nI think the buzz about what polls saying what, specifically polls to make it look like Trump could win, are going to dominate all the news until Tuesday.", "Donald post make up 70% of all/rising. It's speculated that they use bots to mass upvote everything. Or it's actual people which is sadder because it proves they have no lives. ", "It mistakes his hand for a helpless field mouse", "Lace up your jack boots folks the fascists are coming to town. ", "Or some Trump supporter got caught up in the moment and was going to shoot the guy. Maybe they didn't find a gun because they searched the victim.\n\nOr someone yelled \"I wish I had muh gun! Yeehaw!\" and the noise of the crowd distorted all non-gun words. It was a Trump rally almost any combination of malice and stupid has some potential to be true here.", "Yes I get it, it's a terrific insult, just surprised it hasn't caught on outside the Arab world.", "Guys remember quoting Trump is just proving you're biased against him duh!", "I'd choose Commancho over Trump. And make Trump star in ow my balls for 7 seasons.", "do you have an easily accessible source for this\n\n&gt; It's also worth noting that Trump said to \"take him out\" and claimed that he was \"paid by Hillary\" to protest before the incident escalated. This just reaffirms what we already know - Trumps rhetoric is dangerous and his rallies are extremely volatile...", "wasnt just that it was an honest to god in person swatting. Someone yelled gun because his sign said republicans against trump.", "Don't feel too bad about it. I did the same but I'm a pragmatic person and knew that if I didn't want a Trump presidency I'd have to vote for his biggest opponent. It helped when Bernie was able to push her platform left on several policies.", "/r/the_donald is to political propaganda what kool-aid is to a cult set up in a private compound in Guyana.", "Well to be fair they think he is a credible candidate. At least they are consistent in that area. ", "By accusing the the protester of having a gun. ", "&gt;  so it's fair game in my book\n\nIt's fair game to beat up people just because it happened at a Clinton rally? What are you 8?", "Hitler actually lost his election. He was later appointed Chancellor to appease his riotous supporters who--while not strong enough to claim an outright majority--were causing a fair number of political problems.\n\nWhen Trump loses we need to remember that the policy of appeasement didn't begin with Chamberlain. (A man whose name is so associated with this political concept that his is quite literally the first picture you see when you look up Appeasement on Wikipedia) No, appeasement started with Hindenburg (the man, not the vehicle) and his appointment of Hitler to the office of Chancellor in 1933. With the further appointment of two of his allies in Ministerial positions that ensured Nazi control of the police, the last chapter of the Weimar Republic came to a close.\n\nAt least when Trump loses, he won't be given control of the FBI... Oh, wait. Seems like he's already got some influence there. Well at least he'll have alienated enough of the media that he'll have trouble putting out his own propaganda, right? Nope. Not with Trump TV and Breitbart and a few others spoon-feeding Trump's Big Lies to his eager supporters.\n\nYeah, this won't be over the day after he loses... The danger of fascism will be with us for generations to come. We aren't immune and we need always to be on guard. Otherwise we will quickly discover that democracy **always** dies to thunderous applause.\n\n**edit:** for clarity.", "&gt; ... it could be very bad news for Trump.\n\nNo it can't. Facts no longer matter. The people who are voting for him are idiots with their blinders on. He could rape an 80-year-old woman in the middle of the street on camera and there would be an army of apologists standing in line to defend him.\n\nThis whole campaign has really exposed the ugly side of America.", "Well clearly. First Obama yells over a protester at his rally. Then they try to rig the elections. They can't stop the Trump train so killing Trump is clearly the only move the left has left.\n\n/s", "Sure Donald. That'll be the new rule. To be president, you have to hold big rallies until you feel like you've probably got enough support to be the president. We won't bother with phony voting, we'll just wing it. ", "It looked to me on the youtube video that the secret service intervened to save his life.", "Of course trump was scared. He's...\n\n-A registered republican since 2011 \n\n-Risked getting beaten or worse by jumping into the center of his basket to hold a \"Republican against Trump\" protest sign\n\n-Claims he's voting for Clinton on his facebook page...In swing state...That's currently spelling bad news for Trump\n\nIf I was Trump I would be scared too", "When we're not downvoted to silence in a minute flat people can clearly see that there a lot of us. ", "He was holding a sign.... One of the supporters shouted \"gun\"", "Early voting sites have been reduced in democratic-leaning locations. So he's right but for the wrong reason. Long lines are a sign of rigging. But they're rigged by R lawmakers who are trying to disenfranchise D voters, resulting in long lines", "[Then they pushed away news cameramen who tried to film the incident](https://twitter.com/IceManNYR/status/795077481309016064)", "The Constitution is rigged. ", "There are plenty of republicans voting for Hillary but all Republicans down ticket. They don't deserve to be beaten at a republican rally. ", "Source?", "They were literally trying to remove a man who had a sign \"Republicans Aganst Trump\" when someone shouted \"gun\" and nearly got the man killed.", "Wrong. Those are lies spread by Crooked Hillary it's sad. What really matters is that Hillary and that pervert Anthony Wiener had thousands of e-mails, and they should be locked up. Vote for Trump and that will be stopped.\n\n/s\n\nEDIT: Jesus guys, it was sarcasm. added /s", "&gt;By the time people wake up on Sunday the full story will be there.\n\nAnd just watch and see the disinformation will run rampant. A very small minority of trump supporters maybe enough to use 2 hands counting them will say oh ok no assassination attempt, but the rest will have some version of it being a real credible threat, and the vast majority will almost certainly give Clinton the credit of trying to have him assassinated. \n\n", "http://www.businessinsider.com/donald-trumps-ex-wife-once-said-he-kept-a-book-of-hitlers-speeches-by-his-bed-2015-8\n\n", "They don't need an actual story. They can just sit there and speculate and then pass the speculations on as fact until they've fabricated their own story.", "To be part of history?  Latinos save america.", "How would you expect the Secret Service to react if someone yells gun?  Them reacting as if it might be a real threat isn't proof of anything other than a scuffle and someone yelling gun.\n\nEDIT: The deleted comment was someone saying (I'm paraphrasing because I didn't copy it) that the threat must have been somewhat legitimate because the Secret Service acted like it was serious and they know what they're doing. Which is obviously absurd since the Secret Service isn't going to take the risk on a split second judgment that, hey, there probably isn't a gun, they're going to do their jobs well and act as if this is a serious threat on a President/potential President.", "I think many see it as their duty to do their best to report on things while trying to not being part of the story themselves?", "Also the whole not let any Muslims in thing?", "Signs don't kill people. \n\nPeople kill people ^holding ^signs ^they ^disagree ^with ^^unless ^^police ^^get ^^involved.", "You can say that about a shit ton of things he has let go on and on and on. He will carry this himself for at least a day, then come out and say it was a credible attempt, and then later say \"I didn't say that\", while all(the vast majority) his supporters will say that it was. ", "The fact that people are so worked up over bullshit surrounding the Second Amendment while things like this are going unchecked shows just how misguided the country has become. ", "He didn't do anything but protest by holding up a sign it was Trump supporters that made the situation into a mess by attacking him/confusing other Trump supporters to the point that one of them shouted gun. ", "Mark Cuban for example", "Yeah unfortunately the media these days doesn't let absence of facts stop them from reporting or speculating about that happened. Hopefully people will clear this up.\n\nEdit: Also the video I linked didn't contain the part where Trump said the guy was \"paid by Hillary\", but I believe that happened shortly after he took the stage again. ", "Why would Russia release Trump supporters' names?", "Don't worry /r/The_Meltdown is designed for those who want to watch the trainwreck from a good safe distance.", "He may not have a choice when this is all over. I'm not saying he should be forced to concede by any means--but someone he'll actually listen to needs to sit him down and give him a big boy talk when this is all over.\n\nIt would be stupid not to concede. It would affect himself as much as everyone else.", "It was classified years after the fact. This is a nonstory. ", "&gt; started talking about amending the US Constitution\n\nEveryone knows there's only one amendment and that's the 2nd. ", "This is amazing. Well overdue.", "Either you're being intentionally obtuse or you're just ignorant of the contents of his speeches.  He raved about the banking system and the fat Jews from New York and Russia that preyed on the German people.  He used discontent over the paper mark collapse to help drum up antisemitism.  \n\nHitler was also pro-infrastructure anti-tobacco, and vegetarian, but none of those were used to try to stage a genocide (well...ok, the infrastructure investment was).  ", "Not surprising considering they were Typical Trump Supporters.", "This would have been a story about violence at a Trump rally but someone had the good sense to yell \"gun\" and spin it into an assassination attempt...", "PLUS they THEN started to beat up a CNN cameraman who left the press pen to try and film what was going on. Footage:\n\nhttps://twitter.com/IceManNYR/status/795077481309016064 ", "&gt;Either way the crowd piled on him, he said, kicking, punching, holding him on the ground and grabbing his testicles.\n\n&gt;He said he was a wrestler in his youth and used his training to turn his head to the side to maintain an airway open as he was being choked by one man who had him in a headlock. “But there were people wrenching on my neck they could have strangled me to death,” he added.\n\n...\n\n&gt;“My heart still aches for what this nation could potentially do by electing him,” he added. “That hurts me much more than any of this violence.”\n\n&gt;“The fact that I got beat up today, that’s just showing what he’s doing to his crowds. But I just want people to understand I’m going to be OK, but now what’s more important is if the country going to be OK? So do your part and vote.”", "This is a big relief all around. This election process has been demoralizing if there were an actual assassination attempt, I might short circuit. I don't like or agree with Trump on nearly anything, but he does have the right to live. And there's a large portion of the voting populace that agrees with him on much more than that. Bottom line: glad everyone is safe. Your weapon is your vote. Use it. \n\nEdit: I stand by my phrasing. My words are my children and I support them. \n\nErr...my children are my words...?", "&gt; grabbing his testicles\n\nThey are really following their master comand. Grabbing by the genitals", "I think you mean \"your vote is your weapon\" not the other way around, lol.", "&gt; That's what you get for using your first amendment rights at ~~a Trump rally~~ Trump's America.", "Would totally vote for the candidate that would end DST.", "I just got banned for pointing out that this incident wasn't an assassination attempt and the guy was a registered republican to someone on the_D raving about liberals attempting to assassinate Trump.\n\nReason given by mods: Troll", "/r/politics is a left-wing circle jerk.\n\n\n/r/the_donald is an insane alternate reality that legitimately scares the shit out of me sometimes. ", "Its like when The_don forgot to ban someone and he speaks up rationality", "Trump Supporters: We're tired of the establishment telling us what to do.\n\nTrump: Kill for me.\n\nTrump Supporters: k", "oh thank god. MAKE IT PERMANENT. Hate getting out of work to darkness. ", "Fucking hell this is the first I've seen this. These people really have zero respect for their peers, let alone freedom of the press and the constitution as a whole. I'm just hoping sanity prevails on Tuesday, but people need to get out there and vote in massive numbers...", "Not only did Obama don't boo he listed the reasons we should respect the guy. I have a feeling regardless of the outcome of this election we will miss Obama a lot.", "TIL Hillary Clinton can just create extra time at will. ", "Misleading headline.  She said she'd consider **either** ending DST **or** making it permanent.", "Meanwhile Obama defends a Trump supporter at a Clinton rally and r/The_D can only talk about how a Black man was yelling at White people.", "The Donald was losing their shit that the assassination attempt news was being blocked by Reddit. They were bitching about it even after it became clear he the guy didn't have a gun.", "This never gets old", "But did you see how Obama screamed at that guy? /s", "Arizonan checking in: get with the program you turkeys. We've got a lot of problems around here, but none of them are caused by not flipping our clocks back and forth for no reason", "Maybe this is irrational of me but that one line pisses me off unlike anything else. I'm not a fan of Megyn Kelly, she isn't someone I would want to be friends with for a lot of reasons, but hearing Donnie say that about her activated some sort of primal mama bear defense mechanism in me. How fucking shitty of a person do you have to be to resort to period jokes to try to shame a woman while she is at her JOB. It is infuriating times infinity. ", "Yes and today Trump again showed he was unfit to be President. To be President, you have to be the leader for ALL Americans. That Trump shows no willingness to stand up for people who aren't his supporters is scary. That he's shown that he's OK with his supporters being a wild mob, and even encourages them to be so is even more scary. Yet that's exactly what we've seen throughout his campaign, and the far right says Obama is the most divisive President ever! Hah. ", "That might get weird after a few years man.\nSun goes down in 1am", "The average IQ there is single digits", "I mean at least in /r/politics when blatantly biased or just ridiculous stories make it to the front page, the top comments are usually calling out how biased/ridiculous it is.", "Dude don't assume he will lose some may read this and not vote. Don't pull another Brexit.", "I'm friends with the sister in law to the poor guy who got beat up and accused of having a gun. The locals are reporting such garbage. He was released from police custody AT the event because he was not a threat. If anything the person who yelled \"he has a gun!\" should be liable for trying to incite a mob. What happened was incredibly dangerous and should not be taken lightly. \n\nhttps://www.facebook.com/jolenehayes/posts/10100547610501199", "So in addition of being a necromancer she is also a chronomancer?!", "That is terrifying.", "You can't think logically about things like this just let them happen. ", "So in a strange twist of fate that shout of \"gun\" may have saved his life?", "Well the one who [drove from another state, went to a shooting range, had tickets to two rallies on consecutive days and]( http://bigstory.ap.org/article/5e545c4b80054368989ed2b7dc669f4d/authorities-uk-man-arrested-rally-planned-kill-trump)  \n\n&gt; Sandford said he had been planning to kill Trump for about a year but finally felt confident about trying it, the complaint states.   \n\nEnded up pleading guilty in September [British Man Who Tried to Shoot Donald Trump Pleads Guilty](http://time.com/4492765/british-attempted-trump-shooter/)  \n\nI don't know about the other attempts being referenced.", "Seeing these guys makes me want to shave.", "[Here's what the crowd did to the cameraman trying to film it.](https://twitter.com/NoahGrayCNN/status/795078955493490688)", "By Tuesday the dude from today will have had two AK's a couple grenades and a pressure cooker bomb.", "Completely backwards.  Should be *permanent* daylight savings time if anything.", "Wow they're trying to disrupt the camera's coverage in hopes that they beat the protester up. Multiple different supporters were trying to keep him from filming.", "What's really gets on my nerves is how they were offended on how Obama handled the guy who held theTrump sign  when he was speaking.  They were lying but still the hypocrisy is mind boggling.\n\nIt's like night and day.", "Even if true (sounds too good to be accurate imo) still go out and vote. Make this shit double-digit. \n\nElectoral college should be double for Hillary. ", "You laugh but...\n\n[They actually think this.](http://archive.is/sSOfy)\n\nThe dude's name **is** listed in Wikileaks\n\n...because he bought a book written by the founder of Stratfor and his name was listed in their books when their emails got leaked. It has nothing to do with the election at all whatsoever but /r/the_dumbass is going to go apeshit over it. People on /pol/ have reportedly found and released his home address. The nightmare has just begun for this #NeverTrump Republican.", "Ku coup", "That is definitely not true.", "\"Take him out(side)\" clearly. We don't need to take Trump out of context to make him look bad.\n\nEdit: fair criticisms below", "Love that username.", "There have been two credible threats to Trump's life. Not kidding or exaggerating either (four however, is an exaggeration).\n\nAttempt one: **Tommy DiMassimo** hopped a fence and attempted to climb onto the stage at a Trump rally in Ohio. He had a knife in his pocket. He claimed that he merely wanted to spit in Trump's face, but he did have an actual weapon, so anything could have happened.\n\nAttempt two (the most serious one): 20-year-old British man **Michael Sanford** attacked a security guard at a rally, attempting to remove the gun from his holster. Sanford stated under oath that he was planning to kill Trump and anyone in his way. He pleaded not guilty and is currently facing 20 years in jail.", "I've spent most of the election season with this same attitude wondering how we could possibly have sunk so low that someone like Trump is one step away from the White House door.\n\nBut the simple fact is that *we have* sunk that low, and *he is* one step from the door - and worse yet, he *can* still be our next President no matter how narrow people think his chances are. We should all be on the edge of our seats until the results are finally in.\n\nAnd if he does lose, everyone needs to keep the corks on their champagne bottles for a bit and take stock of the fact that America nearly put a god damn tyrant (and make no mistake, he *will* be a tyrant if he wins) in our highest political office - and we need to make sure that we **never** come close to doing something like that again.", "I'm not sure people get it. DST is during the summer. It makes the afternoons longer. Why would I want to waste sunlight on the morning? Fuck the morning!", "Given that the man was assaulted by the crowd it seems some in the crowd did take it that way.", "Seems like the Secret Service agents went above and beyond today. They're the only ones that handled this situation appropriately.", "Commancho was shown evidence of a reality besides what he already believed and followed his advisor's lead. He already has a leg up on Trump.", "Don't forget Donnie asking \"Won't anyone rid me of this turbulent protester?\"", "But that's basically the same thing? I'm down as long as it isn't changing twice a year anymore.", "This is what fascism look like", "&gt; Haha the_donald's argument is that the guy was actually a democratic \"plant\" \n\nMany people are saying he was a plant by the Trump campaign to act as a plant by the Democrats, to make the Democrats look bad.\n\nMy point here is if /r/the_incels want to deny facts by playing false flags, two can play at that.", "So in Trumpland:\n\n- an armed man harassing women and children at a polling station is democracy in action\n\nWhile\n\n- a man holding a sign at a rally is a \"credible assassination attempt\"", "A year agoi would never believe that such people exist in US in such numbers.", "At last! A reason to vote for Hillary!!!", "So there was a Republican Against Trump protester at the rally Trump gets mad and says 'take him out'... his supporters start to beat on him and then his security acts like it's an assassination attempt?  This election, man. ", "Former wrestler all my young and young adult life myself.  Yes. Yes it is. ", "Dude the first amendment is only for people who agree with the status quo approved by emperor god Trump. Come on this is middle school shit.", "Yeah as long as it's entirely done online and they don't have to actually speak to real people and can be achieved through unfunny memes. \n\nThose clowns are fucking toothless. They'll pipe down when Donnie bails on them eventually. ", "They already are. They're trying to say that because he supports Hillary and his name is on some list in an email (apparently he bought a book), he's a campaign operative. ", "&gt; His facebook is full on Hillary\n\n\"Nevada Republicans proudly voting for Secretary Clinton\"\n\n(because they can't proudly vote for anyone else)\n\nDude has been a registered Republican for 5 years.  Do you think this incident was planned 5 years ago?\n", "You forgot to add tap dancer. ", "People always complain that kids don't play outdoors. Well when it's dark right after school what do you expect?!", "Ugh I hate that woman. One of the most dishonest people on TV. Trump could walk out of the tower with no clothes on and she'd just sit there talking about how fabulous his suit looks.", "North Carolina Senator Kay Hagan was up in early voting in 2014 but still lost on election day.  \n  \nDon't just think someone else is going to do it for you. Vote for Hillary Clinton and against the Orange Fascist on Tuesday.", "how dare he hold a sign in trumps america", "They worship Alex Jones and think he's a reliable source of information. That's all you need to know to understand their level of attachment to reality", "The rule is you have to be born a citizen of the US **OR** be a citizen of the US at the time the constitution was ratified but no one ever talks about that second option because it hasn't been relevant for centuries and never will be again unless we invent time travel or vampires turn out to be real.", "Every 6th year you gain 19 hours instead of 1", "Honestly this was really the biggest indication for me as to how his campaign would be. Our national symbol even said fuck you", "Yeah that would be good but if it's Clinton behind it the other side will resist, so we'll end up with half the people at 5pm while their neighbors are at 6pm.", "First previous protesters at Obama's rallies have been much closer than this guy got to Trump.\n\nSecond, \n\n&gt; It was a situation that happened to escalate poorly and considering the 2 previous attempts by protestors to attack Trump (Thomas Dimassimo, Michael Sandford), an attempt to harm Trump wasn't out of the question.\n\nIt was a situation where Trump's people beat a guy up.", "&gt;/r/politics is supposed to be balanced for everyone\n\nNo it's not. That's not how reddit works at all. Reddit content is user driven and there's not some mandate that /r/politics readers have to upvote \"balanced\" content. People are free to upvote things as they please, so given the fact that reddit traffic is dominated by 20-somethings, who are very liberal as a demographic, it's really obvious why /r/politics leans extremely liberal and always has. /r/politics is a huge liberal circlejerk that's often really low effort and overly dramatic, but it's not some delusional, anti-reality cult like the_donald. Dissent is actually allowed in this sub, unlike the Trump dominated areas where you're instantly banned for not properly exalting dear leader or not believing every single ridiculous conspiracy theory.", "Are they charging the people who attacked this man? ", "Oh it'll survive. Not because of any anti-Trump bias by the media, but because it's exciting video. It'll be played over and over and over again. ", "It's scary man. I'm not worried though. No way is Trump winning this election. Still how is my country going to cope with his supporters afterwards? It's going to get worse before it gets better.", "nothing more dangerous to trump and his goons than freedom of speech", "he had [the best moves](http://instapunk.com/images/shoe-matrixB.gif)", "Goddamn these people are horrifying.", "Not to mention he's an *actual* self-made man.\n\nHe started in a nowhere country with no fame and no money. He saw Charles Atlas recognised that he was only famous due to his body, and said \"I can do that\". And he did.", "&gt; Watch President Obama Defend a Protester at His North Carolina Rally\n\nhttp://time.com/4559072/barack-obama-north-carolina-rally-heckler-video/", "Remember the DNC reporting they had been bugged? Top comments were all about it being the new Watergate how Trump is the true criminal, circle jerking about how they'd be arresting them all for treason with Russia soon. \n\nYou had to scroll all the way down for the people saying \"They found a radio signal and no device.\" A radio signal. These idiots do the exact same shit, they're just pretending they don't right now. ", "I think I'd feel pretty disenfranchised as a voter if I stood in line for hours to exercise my right to vote... only to be told \"Sorry we're closed!\"\n\nIt's a BS system when you even have to wait in line for hours to be able to do something that SHOULD be simple.", "Even if you're now convinced Clinton will win that's not good enough. The GOP needs to be under a landslide greater than Goldwater '64, or they just won't learn nothing.", "\"Take him out\" means take him outside. Are you implying that \"take him out\" meant use violence against him?", "Came here to say this. He's right but not for the reason he wants to be.\n\nThe long lines are an indication that there aren't enough polling places, which has been happening all over the place thanks to Republican efforts to stop people from voting.", "Reports of him pleading not guilty were to the crime of unlawful possession of a firearm. The firearm that he was alleged to have unlawfully possessed was the cop's.\n\nIt is entirely consistent to say \"if I got the gun I was going to shoot Trump\" while also saying \"but I never got the gun\". If he doesn't get the gun, he is never unlawfully in possession of a firearm and is therefore not guilty of that particular crime.\n\nThough after speaking with his lawyer and mother he did end up pleading guilty. ", "[Whole segment.](https://www.youtube.com/watch?v=NE9YuB2MLPs)\n\nPretty on point with how the media ignored Russia/FBI/KKK to circlejerk over the emails non-story.", "The secret service intervened to save an unarmed nonviolent protester from a violent mob. ", "Yeah I saw. These people are in their own insane reality. Trump could bring a child on stage and strangle them and his followers would somehow find a way to blame it on the Hillary campaign and the corrupt media. ", "To you perhaps. Not to most of the world.", "Strangely enough as a Republican I agree completely. I'm hoping McMullin wins in Utah. The only way that the party can move forward is if it reforms itself from its fringe elements. Or those fringe elements throw a tantrum and leave. It would be mortal to the Republican Party and highly dangerous to our republic of Trumpism is allowed to take hold. \n\nThough I'm also hoping that we retain control of the Senate. ", "Pastors go to a special hell for telling lies for political gain.", "And it's painfully ironic that at the same time they've built this false narrative about Obama \"screaming\" at the protester and denying him his first amendment rights (basically the opposite of what happened) just a day ago. Then this happens at a Trump rally and somehow trump is praised as some kind of hero.\n\nFuck this election. It's entirely too unrealistic.", "Wasn't it just yesterday that Obama told Hillary supporters to not boo the Anti-Hillary supporter and then today, Trump is inciting his hombres against an Anti-Trumpeter? \n\nAs a Canadian, I'm sitting back and laughing my ass off at what America has become, that a Tyrant can be so fucking close to becoming your leader. ", "\"Take him out\" - Donald Trump", "Yup. \n\nDid Trump plant the guy? Highly unlikely. \n\nIs his campaign trying to make people believe he was in mortal danger to get sympathy even though it had to be obvious what actually happened before the secret service would let him go back out? You betcha. \n\nHis supporters still think he survived an assassination attempt even though the supposed assassin is out giving interviews!", "I read two threads in the_d today about a huge act of voter fraud in Broward. I thought \"why haven't I heard about this anywhere else?\"\n\nI look into it a bit find an update to the story and post this in each of those threads.\n\n&gt;[UPDATE: A statement from the Broward State Attorney's office released Friday confirmed they had conducted a “preliminary review” of the complaint, in which they concluded that “there is nothing illegal or improper about the conduct.” After touring the office and speaking with SOE staff, they determined:](http://ijr.com/opinion/2016/11/261634-florida-voter-fraud-broward-county/)\n\n&gt;[It was determined that the ballots were being completed by SOE staff on behalf of overseas military personnel who had voted by faxing their ballots to the election office. The fax paper does not scan into the voting machines and the votes must be transferred onto a ballot that can be scanned. State law allows such a transfer of vote to a computer ballot.](http://ijr.com/opinion/2016/11/261634-florida-voter-fraud-broward-county/)\n\nMuch to my suprise, it actually got a couple upvotes. One person even responded with\n\n&gt;\nWell I don't know if that's what they were doing or not.. If that really is what's happening then I have no real qualms with it (imperfect situation which could be improved) and its believable. Unfortunately the investigation to find out what actually happened doesn't seem too rigorous...\n\nso they didn't quite believe it but it made at least a couple of  them question it.\n\nTwo hours after I posted that I got this [message in my inbox](http://i.imgur.com/2KxqHat.jpg) and find that my posts have been removed.\n\nI'm not even shit posting against trump or harassing anyone or doing anything other than pointing out that what these threads are claiming isn't true, but the mods there are so shitty they can't even let people see a hint of facts. \n\nNo facts allowed, only their narrative.\n\nEdit: as a bonus, here are a handful of [comments from those threads](http://imgur.com/a/zfCPu)", "It's also yesterday that Trump accused Obama of treating a supporter badly... ", "Secret service possibly saved his life. Crowd member was strangling him. ", "The second amendment protects ~~the other ten~~\n\n[except the first amendment](http://www.redstate.com/jaycaruso/2016/09/17/donald-trump-continues-crusade-first-amendment/)\n\n[except the second amendment](http://www.redstate.com/leon_h_wolf/2016/09/22/nra-strongly-condemn-trumps-stop-frisk-comments/)\n\n[except the fourth amendment](https://www.washingtonpost.com/politics/trumps-latest-plan-would-target-at-least-5-million-undocumented-immigrants-for-deportation/2016/09/01/d6f05498-7052-11e6-9705-23e51a2f424d_story.html)\n\n[except the eighth amendment](http://www.usatoday.com/story/news/politics/onpolitics/2016/06/29/donald-trump-istanbul-airport-attack-hillary-clinton/86504460/)\n\nBut yeah [Trump will plead the fifth 97 times to avoid admitting adultery](http://www.charlotteobserver.com/news/politics-government/election/article105179136.html). Real constitutional scholar, that guy.", "Anyone who laid hands on him should be charged with assault fuck them all.\n\nEdit: Short of the SS of course who did their job with no malice on top of it, they weren't going to likely beat him to death unlike the trump supporters living out their fantasy of taking down someone trying to attack their candidate.", "What people are also forgetting is that some jerkoff started shouting gun in a crowd. That's against the law is it not? It incited panic that lead to the crowd beating the ever loving christ out of the guy. ", "She's already almost ended DJT.", "How fitting obama defends a trump supporter and a republican gets choked out at a trump rally", "Bernie Stein, and Johnson supporters, I hope you watch this video.  This man was an innocent man - a Republican - that simply held up a sign that he disagreed with Trump.  For holding up the sign, he was beaten and savaged by the surrounding Trump supporters.  Pay attention to what this man says - that Trump is a facist and a dictator, and that if he comes to power, America will look a lot more like his rallies.\n\nHate on Hillary all you want, even if you think she is corrupt.  However, Hillary is not a dictator, she is not a facist, and at worst, she is within the normal boundaries of other politicians who are corrupt (keep in mind that Trump is also corrupt - ie. his use of Trump Foundation).  Countries world wide, including many in Europe, can get past a corrupt politician fine without the country being destroyed.  However, surviving a facist and a dictator is a whole other issue.  Just ask Nazi Germany and Mussolini's Italy.  \n\n", "Semantics! ", "Do as I say and as I do.", "The crowd was fixated on that trump supporter. All their hate all their anger directed at one man. And Obama did not stand for this. He gets the crowd to quiet down and listen in. And that is pretty hard given how many times he asked people to quiet down before the crowd became silent. He's certainly a skilled public speaker. \n\nAnd a decent human being. he didn't just say we should let the man have his free speech. He listed reasons people should respect him. Reasons to respect a man that moments ago they had focused their anger and their hatred upon. The fact that Obama felt he needed to say something speaks volumes about his morality.", "Your comment is hyperbolic but it sure as hell isn't triple digits.", "This is the first time I've seen raw video.\n\nFucking lol at an alt-right site posting that like it's supposed to make Trump look good?\n\nHis supporters are a mob. We had a protester come to a rally in NC, not the one that's been on the news but a different one.  It wasn't covered because nothing happened.  The guy in the stands on the sides put up his Trump sign.  The crowd around him started to boo and get loud, but the people on the edges shushed them because they didn't want to make a scene and would rather hear the president speak.  I know because I was one of the \"shushers\".\n\nSecurity eventually came by and asked him to leave. He left peacefully and nobody outside of half that crowd ever heard anything about it.\n\nThese people literally start beating on the guy, somebody feigns and the rest parrot the line \"he has a gun,\" they attack the media, and then chant \"USA\" at the guy as he's leaving.\n\nWhat the fuck causes this?  Too much television?  Microwave radiation?  I'm floored and really disturbed.", "hell I'll pay the legal fees if he gets sued!", "TIL: Posting facts is Trolling.\n\n(To be fair the truth is dangerous to their candidate.)", "IANAL but I believe they'd have to prove s/he knew there wasn't a gun. It's not illegal to shout fire in a crowded theater if you actually think there's a fire. ", "But not really. Promises are cheap", "Man. Fuck those people. ", "I wouldn't laugh about having a dictator at your doorstep.", "Kids in my class mostly made jokes about it and didn't find it interesting.\n\nIt was probably one of the most important books I have ever read. ", "That moment when you realize we are all stranded on an island and Trump leads the hunting party.", "I read the last half of that book in one sitting as a teenager late at night finishing at about 2am.  I was up wide-eyed until daylight I was so freaked out. ", "Did you hear Trump go on and on about mean Obama was to that guy? It's fucking hillarious since he keeps telling people to go watch it. \n\nObama defends the guy and thanks him for his service. I would ask how delusional can you get, but then again they think Hillary is a wizard. ", "It'll be a woman black, and muslim by the time they get done with it.  In the fevered hours of post concession, they'll start to rate the woman, calling her a '3 at best'. ", "W-well no these are important semantics. You said \"Your weapon is your vote.\"\n\n\"Your *weapon* is your vote.\"\n\nThis implies that rather than voting, you should utilize weaponry to express your political opinions. Basically the polar opposite of the rest of your comment.\n\n\"Your vote is your weapon\" is what you meant.\n\n**EDIT:** I'm no linguist, and I am not speaking from a technical,  linguistic standpoint. I just suspect that people will naturally emphasize one's first possession in each statement, rather than the second: \n\n\"Your *vote* is your weapon!\" \n\n\"Your *weapon* is your vote!\"\n\nIt's true it could go the other way if you emphasize the second item, but I don't think many people will do that from the get-go. I could be wrong though - I'm just basing it on a hunch:\n\n\"Your vote is *your weapon!*\"\n\n\"Your weapon is *your vote!*\"", "No president! No president! You're the president!", "&gt;The GOP nominee was complaining at a rally in Denver Colorado that the language at a get-out-the-vote concert headlined by Jay Z and Beyonce was \"filthy\" by \"any standard.\"\n\n\nI don't words", "No that's their job.  They get about 1/10th of a second to make a decision, and when some asshole yelled 'Gun!\", they jump into action, and drag the person they are protecting to safety while shielding them with their bodies.  Emphasis on drag, as sometimes, it's against that person's will.", "No that's an accurate description of tonight's events", "13pm", "Man I'm having gold old days thoughts about Bush. WTF", "Also i think its better for people's mental health in the winter to at least get a tiny bit of sunlight after work. ", "The narrative is set. Trump supporters will say that Trump narrowly and bravely avoided an assassination attempt by militant liberals or Isis, or Blacks... Or \"fuckin' somebody that isn't us\"....\n\nBut like a hero he came back out on stage.", "This man is an absolute hero. He is a true patriot and I'm proud to be an American because of people like him.", "Wait somebody still listens to Dick Morris after he was publicly embarrassed on fox news during their 2012 coverage?", "&gt;I get that Clinton has her sketchy background\n\nA lot of which isn't even that sketchy. The amount of bullshit laden to her 'scandals' is very high. Far more smoke than fire.\n\nTrump, on the other hand, genuinely does have a sketchy background and we genuinely don't know much about him other than what he tells us(which is laughably unreliable), what we can determine from lawsuits, leaks and personal accounts. It's a bizarre inverse from reality. \n\nTrump is at the very least as secretive as Clinton (and effectively far more-so just on the basis that Clinton has had her business leaked a lot more, unwillingly or not) is yet she's the one who carries the reputation of being cloaked in scandal and deception. Go figure. ", "Sad that they have to try to hide their actions.", "\"Brown people should only be allowed to vote from 1 location between the hours of 10:00 am and 10:04 am.\"", "WTF man? we had 8 years of \"If Obama's behind it\" and now we have to deal with \"If Clinton's behind it\". \n\nWhen will these people stop?\n\n", "He's never going to build the wall it's just a false promise to get elected. Trump neither has the inclination nor the dedication to actually do the hard work to make it happen.\n\n It's why he never gives details for anything...Bigly. ", "At this point it's pretty much written in stone that anything Trump or his minions accuse Hillary of, donny has done the same or worse. ", "Could he just have been a dude playin' the dude disguised as another dude?", "This shit is getting dangerous. It felt like the crowd was one click from doing the same to the camera man.\n\nMob action is nothing to fuck with.", "Lol just say \"fuck trump'' like a normal person goofball", "So the only person that was actually in any danger was the republican protesting against trump.", "If you read the guys comments he already had the sign up. He didn't reach into his jacket and people thought he had a gun... They were trying the pull his sign down and then someone yelled something about him being armed... That's when they decided to beat him, kick him, choke him etc. Because that's how you're supposed to treat someone who disagrees with you...", "How?  Do you honestly think anybody is going to speak up and finger another Trump supporter?\n\nWell maybe *finger*, but not rat out.", "Christian here. I support all of my fellow Americans too; regardless if they are LGBT Jewish, Muslim, Hispanic, Green, Purple, Black, etc. I am voting for Hillary, just threw in more cash as an upper middle class Joe to her campaign.\n\nJesus taught to love others as ourselves. Those who support Trump are incompatible with that teaching.", "Definitely. In winter I get to work when it's dark, and get out when it's dark. I don't have a window in my office. I can't begin to tell you how depressing winter is for me.", "They didn't show prominent Jewish people in their ads. I understand what you're saying but that commercial was dog whistling like a mother fucker.", "if you're close enough to punch someone and someone puches that guy and someone else kicks that guy, well you aren't going to pass up on a lynch mob now are you?", "&gt; But faulting people for defending themselves after hearing a gun call out? For real? We need more people who are willing to act in a situation like that...\n\nIf you're close enough to punch someone you're close enough to see if they're holding a gun. ", "It started out that way (because a Trump presidency is just _that_ ridiculous) but the problem with creating a subreddit that sarcastically makes fun of idiots is that eventually you get colonized by actual idiots who aren't in on the joke. \n\nI wouldn't be surprised if one day /r/ooer turns serious. ", "Wait he literally said the same exact thing? On mobile didn't watch but assumed it was about the other thing. What the fuck", "Limited vocabulary? But yes that's what he said", "It is simple my friend people who don't support Trump are no longer considered americans. Fire up the DC-8s boys and girls, we're going deporting!", "Just like puppets", "This is a joke right? You're telling me if people started shouting \"Gun!\" at one of Hillary's rallies it wouldn't be taken seriously? Her gender is a non issue.", "Don't forgot assaulting journalists who tried to film them.", "My tastebuds boycotted yuengling years ago", "I will mate. Threats on people's lives should be taken seriously Hillary's included.", "It's an honest mistake. He is a white republican they assumed he was carrying. ", "Nobody is upset about the secret service doing their job. \n\nIt's the mob of people assaulting a guy that we're concerned about", "I can answer this. I'm a Bernie supporter. I'm also an old fart and I've been pissed at both the Dems and Reps since Reagan, to give you a sense of my perspective. \n\nYes, there are back room deals made. Of course there are. This is ultra high level politics, nothing exists in a vacuum. Hillary was supposed to be 2008. Then Obama happened. She supported the party, and everything was put in place for her in 2016. \n\nThen came Bernie. But not again. This was her time. She did have the support, but of course everything was set up for her. It had been long before Bernie was a factor, and it doesn't mean his campaign was for naught. Quite the contrary, should the Dems win the Senate, we may see a progressive agenda the likes not seen in a long time.\n\nIntra-party machinations are not the same as federal election vote-rigging. Trump is an absolute disaster of a candidate. Yes, the system still sucks. But we're making progress. Every movement makes another crack. This shit takes time, and it'd be a mistake to undo decades worth of progress because we don't like the person who can stop that from happening.", "the fuck?", "\"Taking a stand\" against what exactly? I'd love to hear. Certainly not democrats because the GOP has been obstructing them long before Trump. Not republicans because they are all spineless cowards who have caved in to that lunatic and his cult members. ", "Serious question. I do bjj and choking always cuts off the carotid arteries and causes you to black out. Is cutting off their breathing a thing is wrestling? ", "/r/the_donald are still trying to make it a thing but it's just a little bit sad at this point..", "His ass.", "They didn't even CITE anything!  Anyone can say \"according to latest polling\" and have it mean nothing.\n\nBreaking news: According to latest polling both Hillary Clinton and Donald Trump are down in the polls compared to professional wrestler [Dalton Castle!](http://www.rohwrestling.com/sites/default/files/img0255.jpg)", "Yes let's go with the batshit insane theory.", "Trump is a man that discovers a word or phrase he likes and then runs the phrase into the ground.", "\"The media doesn't cover us fairly!\"", "Wow what a lightweight response. LOSER. Low energy.", "They're unhinged from reality. ", "WHY IS THIS NOT BEING PLAYED ON MEDIA SITES?\n\nAll I saw was the latter part. Trump is fucking ridiculous", "You've never dealt with narcissists. \n\nThey legitimately believe the lies they tell others because they **have to.** Their egos are too fragile. They don't have a shaky relationship with the truth, the truth is whatever it has to be for them to not lose face. They have NO relationship with the truth. Example: Trump ran with the birther thing because he HAD to. He brought it up once because he was stupid enough to believe it, then got flak for it. And that just won't do when someone is So Spectacular and The Best. \n\n\nBeing wrong isn't a possibility. When a veteran tried to correct him on the number of daily veteran suicides, he just HAD to correct her. A normal person would say \"ah my mistake\" or \"thank you for the correction\" and move on because everyone makes mistakes and minor ones like the ones he made usually don't even register on the radar. But any time he is corrected, he needs to take a stand against people assailing his ego. Because you either suck up to him or you are his greatest enemy. It's why he stays up late at night, obsessing over insults people made about him long past what is considered normal. \n\n\nAnyone who insults a narcissist ABSOLUTELY, MUST BE PUT IN THEIR PLACE and ANYTHING about them is fair game for criticism, social rules and mores be damned. Got criticized by a an ex-POW? Call them a loser for getting captured. Getting your ass kicked in a debate? Bring up your opponent's cheating husband's affairs and bring his mistresses(?) to the next one. Humiliated by a president in front of the entire nation? Buddy up with his mentally disturbed half-brother to get back at him. Polls show you losing? Then someone MUST have the pollsters in their pockets. But are some polls showing you winning? Then those must be correct. \n\nNarcissists also have a basic lack of empathy and MUST make things about themselves. Trump wrote a condolence letter to Kelly Preston after her 16 year old son died detailing how he tried to seduce her and failed. Don't know how to explain why he wants to fuck his daughter, but he also definitely wants to fuck his own daughter. \n\ntl;dr - He definitely believes the things he says. The truth is something entirely different to a narcissist. And he wants to fuck Ivanka.", "OK Mr. Celebrity Apprentice.", "The Germans we're just following orders.", "Making it permanent would be nice because then we'd get extra sun in the afternoon rather than the morning when no one's awake. ", "It escalated poorly because his supporters get whipped up by his rhetorics. \n\nAnd then when the facts have become clear his campaign is still trying to act like there was a real assassination attempt, which is really tacky. But Trump is nothing if not tacky. ", "Got any proof there buddy?", "And? I'm a registered Republican and I voted for Hillary instead of that piece of shit who commandeered my party.\n\nGood on Austyn for making his voice heard. \n\nGo on and tell me how people freaking out about ~~nothing~~ **someone holding a different view than them** constitutes a false flag.", "Lol Trump's supporters talk about killing Hillary every day and sell t shirts about it. Cry me a river. ", "Hahaha what the fuck are you talking about", "These people were grabbing the guy's nut sack for having a friggin' sign.  \n\nFucking ridiculous.", "Trumps thugs beat up a man for protesting like they always do. Spare me your crocodile tears.", "National debt? Are kidding? Trump wants to build a 2000 mile wall through the middle of a remote desert landscape dramatically increase spending while simultaneously cutting taxes and throw millions back to getting their healthcare in the ER. Every legit economists warns his budgets are complete and total fantasy and his trade policies would likely spark trade wars with our biggest partners. I don't think many people truly appreciate how much we are already tied to the global economy and how painful and expensive it would be to try and leave it.", "Trump supporters are their own breed I wouldn't even call them republicans...", "Speaking of \"ow my balls\" the guy with the sign said that the Trump crowd that attacked him grabbed his balls and choked him.\n\nGenitalia grabbing seems to be a theme with his campaign.", "Where are all the Republicans like you? I miss civil political discourse.", "I can't. I like wieners and Mike Pence wants to hunt me for sport.", "I have a theory that a secret service agent corners Trump in the bathroom hands him the phone and Trump then listens to someone list exactly what will happen if he doesn't concede, including him going to jail.\n\nHe will make insinuations after the fact but I would be surprised if he doesn't concede.", "This is unbelievable to see happening in America. I was born in an authoritarian state - I am absolutely terrified of the similarities I see to Trump and his supporters.", "Brown shirt: out \nRed hats: in", "He is the literal embodiment of projection.", "Jesus fucking Christ I wish this wasn't accurate, but it is. 2016 is a crazy fucking year. ", "The worst of America right there. When shining a light threatens to reveal their animalistic behavior they would rather attack the source than become civil.", "Worse than that he's getting doxxed and having some bizarre accusations hurled against him (big surprise, right?)", "He didn't scream at all - he asked the crowd to quiet down in a pretty calm tone of voice given that he was at a political rally with thousands of actually screaming folks all around him.", "And yet it's the DEMS that are the violent ones according to Donald Trump Jr. (Retweeted by him)\n\nhttps://twitter.com/JackPosobiec/status/795081025479131141?s=09", "I'm normally straight but he was kind of cute. I couldn't resist I just went up and grabbed him by the testicles.\n\n&lt;satire&gt;", "Worse yet many of them are doxing the guy because his name appeared in a totally unrelated wikileak from 2012 from some random company (Stratfor) that he bought a book from.\n\nBuy a book in 2012, get raided by a mob of maniacs supporting a self-proclaimed fascist in defense of Donald Trump the presidential candidate in 2016. Fuck me, this is crazy.", "As a Minnesotan if our country falls apart would it be alright if we joined you guys?  I like hockey and I'm politely passive aggressive!  I'd even learn french if I had to!\n\nedit: I'll even help pay for the wall in southern Minnesota!", "this is an interesting tweet from September.\n\n\n&gt;\"Anyone feel @realDonaldTrump campaign's next big move could be staging an faux assassination attempt on Trump?\"\n\n\nhttps://twitter.com/BoutrosTO/status/776814249620504576", "Which makes you wonder about Mr. High Energy Sniffles and his demand that Hillary Clinton take a drug test.", "And elsewhere they are victim blaming http://i.imgur.com/dmwDQSk.png and saying it was his own fault.", "Have you forgotten the guy in Las Vegas who tried to take the gun from the police at a Trump rally? \n\nHe rots in jail now. ", "Republicans are safer at rallies stumped by Obama than those of their own candidate.\n\nSad!", "I mean it pretty severely inconveniences you, as you now have someone very cross with you and only one shoe'd foot. Unless you're going around with an extra shoe.", "Reminder that /r/the_donald uses upvote botting on almost every post. \"Bot first analyze later\" is the policy of that sub.", "There is nothing conspiratorial about this.  It's straight up old fashioned mob mentality.  \n\nTrump says he'll pay legal bills for people who beat up protesters at his rallies?  Someone might actually take him up on that offer.  ", "welcome to Trumpland. \n\nhttp://www.nytimes.com/2016/11/05/opinion/beyond-lying-donald-trumps-authoritarian-reality.html", "That's because nobody at that age really understands how much human nature is like that book.  Read it in your 20s and you'll really be scared.", "Source? Only hearing this from people from /r/the_donald.\n\n&gt;He was deemed enough of a threat for the USSS to evacuate the candidate and restrain the suspect.\n\nHe was only deemed a threat because of someone shouting out gun like a complete moron.", "The ones that would look out of place at a Trump rally.  You know...them Riggers.", "Honestly knowing the volatility of Trump rallies, I'm amazed at how well the secret service were able to deescalate and defuse the situation. Kudos to them for preventing total chaos. ", "Because they are idiots", "Jesus what an idiot.", "Trump himself already blamed Hillary for it as events unfolded. He said that the guy was \"paid by Hillary\" to be there... He has no issue lying. It's amazing.", "[It's more like a](https://i.makeagif.com/media/9-19-2015/f5kM0c.gif)\n\nEDIT: T_D \"shills\" downvoting humor", "I'm really disappointed with how that crowd reacted to Obama. When your president is trying to tell you something especially if they are one you support, you should probably be quiet and listen to them. That crowd was disrespectful.", "People don't get to commit assault because they don't like a news network.", "[It certainly is.](http://www.navy.mil/ah_online/constitution/photos/130823-N-SU274-106.jpg) ", "This guy should be on the media circuit tomorrow. I don't want to hear any more bullshit stories about how Trump is a hero who fought of an assassin. I think the world should know how Trump and his supporters are a powder keg of violence and chaos waiting to explode for the most trivial reasons and when they do lash out they always blame it on Clinton.\n\nLet's end this fucking election on Tuesday in a big way; VOTE. VOTE. VOTE. Flush this piece of shit and his entire cult of personality down the drain.", "[In sharp contrast to what happened at a Clinton rally while Obama was speaking.](https://www.theguardian.com/us-news/video/2016/nov/04/barack-obama-trump-supporter-free-speech-video) The man was peacefully and safely escorted out while clearly agitated. They would have left him if he didn't cause a stir.\n\nShows a lot of what you need to know. :(", "why did his son and other surrogates rush to claim it was an assassination attempt when it wasn't? I'm not saying it was staged because obviously there's no conclusive evidence. Its just peculiar.", "You could also say \"your weapon is your *vote*\" and the emphasis there makes it seem like you're wielding your ballot as a saber.\n\nIt could really go either way, but since they didn't emphasize any words, it's left to your brain to provide a tone.  Some people would go \"*weapon*\", some would go \"*vote*\", but in reality, neither is right or wrong.", "Every witness is saying he aggressively knocked over a number of people including elderly people to get closer to Trump. He was deemed enough of a threat for the USSS to evacuate the candidate and restrain the suspect.", "Holy shit I've seen this \"the protestor was acting violently\" line at least a half dozen times. Even if he was that's no justification for the violence against him. Get a cop, don't choke the guy.\n\nThe secret service intervened because someone yelled gun.", "Lol there is zero evidence, he is mentioned in a 2011 email because he bought a political science book and how on earth is a daycare even relevant.\n\nYou guys have really gone off the deep end. ", "They're rabid Dogs.\n\nI take that back.\n\nThat would get insulting to dogs.", "Evidence to your claim? Or are you referring to [this.](https://www.reddit.com/r/politics/comments/5bdx22/no_weapon_found_after_commotion_at_trump_rally/d9nunly/)\n\nThese wikileaks are not from Podesta but are from a company called Stratfor, who sold him a book called The Next Decade. Now, I don't think him buying a book is grounds for getting assaulted by a mob of angry Trump supporters or dox'd.", "The reason shit like this is important is that the presidents words have incredibly weight behind them. This is why most people consider the \"Second amendment people\" comment so horrible despite many of those same people admitting that he likely didn't actually intend to suggest murdering Hillary. Because his intent is absolutely irrelevant, what other people interpret in his words is what is relevant.\n\nWhen you go onto a stage infront of millions of loyal (Almost cultist) followers and say something that could be interpreted as \"Go assassinate this evil person\", someone in that crowd who is willing to do something like that might interpret your statement in that way. When you go onto a stage infront of millions of loyal (Almost cultist) followers and say something that could be interpreted as \"Beat the shit out protestors\", someone in that crowd who is willing to do something like that might interpret your statement in that way (Which has happened multiple times now).\n\nEvery person with the amount of power trump has should be INCREDIBLY careful with choosing their words and statements. Everything they said should be three times removed from even possibly being interpreted as \"Go and do something illegal or violent\".\n", "Trump seems to think that airing commercials that are literally his own words in context is nasty so yeah checks out.", "Well that's not the Secret Service's fault though, is it?  Let's be fair: I agree that Trump is a pussy, but you can't base it on the Secret Service doing their job.", "The Secret Service heard someone yell 'GUN' They did the right thing. No chances should be taken. ", "Hey you're the one supporting the Narcissistic, Xenophobic, Rapist, not me.", "Proof? he was immediately released by the police instead of charged with assault so highly dubious. ", "If there's one government agency that I trust to do its job it's the Secret Service. They seem to have their shit together. ", "*Boo hoo everyone who disagrees with me is a liberal!*", "I loved that so much. Just casually dodges it and then stands up straight again like \"Who throws a shoe? Honestly.\"", "If someone thought he was rushing the stage with a gun they had every right to try and keep him from firing. \"Pardon me can you wait while I go get a cop?\"", "Probably yes. There is even the possibility that someone shouted \"Gun\" when someone pulled a gun on the victim, and it was misinterpreted by the SS as the victim having a gun.", "I was thinking the same thing. Nothing else could have possibly gotten the attention of security so fast - and they pulled the poor guy out from the mob.\n\nOn the other hand however, it also might have led to more violence against the potential assassin before he was pulled out.\n\nInteresting turn of events.", "Seriously this is like the fucking [kiss of death](https://youtube.com/watch?v=C5Pa9YvAqLs). As a Hillary supporter I couldn't be more relieved.", "Always confuses me to see Hispanic people supporting Trump like, that's the man who wants to kick all Hispanic people out of America. That's not speculation, he's literally said that.\nAnd black people too, The Republicans have been gerrymandering for so long to stop black votes mattering, and Republicans have literally done nothing ever for the black community (besides ending slavery 200 years ago), I don't get it, why do these people vote for him, it doesn't make sense to me. ", "&gt;Noam Chomsky once observed that when he listens to a sports call-in-show he said \"it's plain that quite a high degree of thought and analysis is going into that. People know all sorts of complicated details. On the other hand when I hear people talk about, say, international affairs or domestic problems it's at a level of superficiality that's beyond belief.", "If after the election Clinton wins and rips off her mask to reveal she's Mitt Romney I'll still think we dodged a bullet.", "More likely he'll claim that multiple TV news sources showed pictures of the gun.", "I don't think choking him or grabbing his testicles qualifies as defending themselves\"", "[Video showing the guy protesting then Trump telling his supporters to throw him out.](https://www.youtube.com/watch?v=eemJPPb8Otw&amp;feature=youtu.be&amp;t=2)\n\nIf he was rushing to the stage SS would had stopped him or would had removed Trump from the stage.\n\nNow show me any evidence, preferably video, that shows anything that contradicts what I shown. I'll wait.", "For a minute there I had mistaken the 'r' for an 'n'.\n\nI had no idea what the word \"riggens\" meant.", "&gt;If they legitimatly thought there was a gun being pulled... than good on them for trying to call out a threat. Turns out it was a sign and they should probably get their eyes checked.\n\n\"Gun\" was yelled to provide cover for beating the guy's ass", "Kellyanne: \"It's not something I would do but it shows his determination to MAGA, no matter what it takes.\"  \n  \nRudy G: \"Now liberals are getting all wound up about this gun. Oh!  He was going to shoot with this gun! The poor kitten! Folks, do you have any idea--any idea--the things I saw on that tragic day in lower Manhattan? I can tell you I would gladly rather see one kitten--who, by the way is impossible to housebreak, I can tell you that--have that problem than see the suffering wet would see from coast to coast under Hillary. The *humans* that would be getting shot everywhere. The hypocrisy is astounding.\"  \n  \nTrump: \"Time is running out. You know I'm the kind of guy who will do this. I will. Make no mistake.\"", "To high schoolers you'd think the climax of the book was \"sucks to your ass-mar\".", "I've spent the last few days thinking about this except I don't know why trump can't just spend a couple of millions plus donations for his supporters to buy an island and become dictator over it. Maybe it'll result in LOF. ", "My dad was at the rally. He is a big Trump supporter. Even he says there wasn't a gun people were just freaking out. He used the commotion to find better seats closer to the stage. We may have extremely different political beliefs, but we both agree center stage in-front of house is the best audio. ", "Are you joking? Citizens should have every right to restrain a person acting violently for the safety of those around them. There won't always be a cop immediately available.", "Ok so when they atracked the cameraman also, they were all about that free speech and first amendment stuff I guess /s", "Doesn't mean one can't be worse and it is obvious one is worse that person is Donald Trump.", "The first amendment is a thing. Battery is also illegal. We are a fucking civilized nation ffs we don't go around beating the shit out of news reporters because we disagree with them.", "This guy is one of the few on either side that actually seems to put country over party (and even over his own safety.)", "Are you actually playing the victim card the same night your fellow statesmen Almost killed a guy for a sign?", "Really love how you leave out your sources. Totally convince me that this guy deserved to be beaten for expressing his freedom of speech.\n", "Hey you don't speak for me buddy. Im confused as fuck. Do I shoot or do I vote? ", "They are evidence of a functioning system. And a terrible voting system that is intentionally not build to scale to demand. ", "Do you not understand the concept of respect and dignity? You don't harass or attack someone else just because of their job. ", "Depends on the position and where your opponent could have you, but, yes. The thing is, you get pinned in less than 3 seconds.  ", "Wait I thought Trump supporters loved guns. Don't they want everybody to have guns?", "Even if he was there's no justification for the physical violence he suffered.", "it would obviously be Winfrey/West", "You do realize that wiping a server of any kind, is recommended security policy when it is decommissioned right? \n\nOf course you don't, because you have absolutely no fucking clue about technology beyond what model of iPhone makes you look cool.", "True 20 million people may lose insurance, debt will explode, and the economy will go to the shitter, but at least we'll force the women to carry fetuses to full term, and the taxes might get lowered. That's why.", "Bad hombres? Muslims? People from the \"inner cities\"?", "see that's the kind of edit that gets normal downvotes tho", "I was 6 feet from this incident and what you described is totally incorrect. We were packed in there very tightly, to where you were touching every person around. He shoved his way forward, starting jumping up and down, shoving, pushing people. Then people started to fall down, knocking over many people. This was happening the first time Trump shields his eyes from the light. He ignores the activity to not egg it on and keeps talking. He shields his eyes a second time as someone tells the guy to stop jumping and pushing people over and tries to restrain the guy from pushing.  The protester kept pushing so multiple people took him down. It wasn't until the guy was down on the ground that Trump asked if he was being paid, and then said get him out. So he waited until that happened. At that point, someone shouted GUN about SIX TIMES in a tightly packed room of 7,000 people, where dozens of people were knocked over by this guy causing a commotion. That's when Secret Service moved Trump off the stage. This was going on for quite some time and you can see Trump watching it and trying not to egg it on until it got completely out of control. You really have no idea what you are talking about. You can't see shit in live footage of what is happening. ", "That just means a lot of people are uninformed and/or idiots. Trump is still the worse choice by far.", "&gt; but she will be able to prevent congress from undoing everything Obama did. \n\nIt strikes me how people haven't recognized this. Even if all she does is veto the Republican plans she's done a great service. \n\nIf Trump wins, there is a good chance Pence will be the tie-breaker in the Senate, and the GOP will hold the White House and all the executive departments, the Senate, the House, and the Supreme Court for four years (no way the Democrats would win either house back in 2018). \n\nThe Republicans are more rabid than ever before, more conservative than ever before, and they're really good at toeing the party line. If they control all three branches of government, they will be amazingly effective at dismantling everything Obama has done, and most of what Bill Clinton did, and probably some of what Carter did. \n\nI mean Trump literally promised to overturn Roe v Wade, it was part of this third debate. Even if they don't, they'll certainly allow states to continue using TRAP to shut down abortion clinics. They'll certainly pass a national \"religious freedom\" bill allowing discrimination of LGBT folks. They'll try to see if they can combat gay marriage with legislation. They'll certainly start deporting relatives of US citizens and undoing environmental regulations from the 1980s. In four years they could undo 30 years of progressive reforms. \n\nAre people really going to risk that because Clinton is a \"meh\" candidate. Even if she does nothing but veto Paul Ryan's successor until 2020, that's worth my vote.", "They could do a quick first pass just using a tool like unix's grep or some regex search to search subject lines for classified headers. Any skilled computer professional knows that and the people who do full-time computer forensics know a lot more than that, and regularly use sophisticated tools to do this stuff quickly, like hashes of emails from a previous corpus of documents.\n\nAlso, she's taken fire for not jumping through the hoops to do things \"properly\", which would have meant using the State Department's servers, when:\nhttp://www.cnn.com/2015/03/10/politics/state-department-hack-worst-ever/\n\n&gt; (CNN) Overlooked in the controversy over Hillary Clinton's use of a private email server, is the fact that suspected Russian hackers have bedeviled State Department's email system for much of the past year and continue to pose problems for technicians trying to eradicate the intrusion.\n\n&gt; Federal law enforcement, intelligence and congressional officials briefed on the investigation say the hack of the State email system is the \"worst ever\" cyberattack intrusion against a federal agency. The attackers who breached State are also believed to be behind hacks on the White House's email system, and against several other federal agencies, the officials say.\n\n&gt; ...\n\n", "So that's a no then?", "Don't care to back up your argument then? Ok. \n\nAlso I got the reference, I just didn't find it that funny, sue me.", "Oh yeah like his thousands of Muslims celebrating 9/11... in Jersey.\n\nWhat a delusional fucko.", "Sure restrain him. Don't choke him and grab his balls.\n\nIt was a campaign rally, of course there's cops and the secret fucking service there to handle it.", "We are and it's extremely stressful. Don't fuck this up, guys.", "Are you bothered by the mischaracterizations in service of self-aggrandizement?\n\nMy undergrad degrees required lots of reading of mid-20th century European history and I am continuously struck that the Trump campaign is cut from the same cloth as the major fascist movements.\n\nHillary may be frustratingly opaque, but her conduct is within the four corners of normal American politics.  Trump is something entirely different, and his insatiable ego and inarguable lack of scruples are far beyond acceptable discourse.\n\nWith that said, I didn't mean to bend your ear so much.  Your decision is your own!", "It isn't important because we all understood what he said and you're the only one trying to make it one. ", "Hey we get it already if someone displeases you, beat the hell out of them. It's the Trump way.\n\n", "Why not?  Their leader thinks you can grab vag if you're rich.", "He just released his new book about how Hillary is the devil or something. He pops up every election to skim the pockets of idiots.", "How about this.  If Trump gets elected I'll refinance my life and build the fucking thing myself.", "Welcome to facism. Trump plays his audience and they eat it up. They revere him as some sort of god really.", "At least the Nazis had a nice fashion sense. Those red MAGA hats are tacky as fuck.", "and reddit admins are sitting there and ignoring it while /r/t_d is posting his address pictures of his home pictures of him and everything personal detail they can dig up", "I really think the admins need to crack down on /r/the_dupe. Doxxers fake Hillary ads, etc. Start banning users and quarantine the sub like all the other hate subs. It's not a political sub. It's a goon squad committed to hurting anyone that stands in the way of their one true ~~god~~ groper. ", "Chinese manufacturing quality", "Two things;\n\nBush dodged that shoe like a pro. Moved to the side like a goddamn boxer. He's dodged a shoe before.\n\nSecondly the guy throwing that shoe put all his might into it. 100% of his strength on that throw. He really, really wanted to hit President Bush with a shoe.\n\nHilarious.", "I've been seeing people spreading a donor list around Twitter because it has this guy's name on it. No censorship on anything. All of the other names on that section of the list are completely visible along with their home addresses (or at least what they had on file with the donation). That's really fucked up bringing a ton of innocent people into a potentially harmful situation for them because you felt like going on a witch hunt, you know?", "There are just so many crazy accusations in those comments and just no sources or anything. It's scary people read that and believe it all 100%", "It doesn't matter if it is or not imo. That shit is not acceptable I'm pissed at the admins if they let them do shit like that.\n\nI'm all to familiar with people who do that shit, and it can fucking ruin lives. ", "That still leaves 5% which is 32,500 emails. Why does it matter if 95% are not relevant, as long as there are some that are relevant?", "&gt; Short of the SS of course who did their job with no malice on top of it\n\nr/nocontext", "Words can hurt.\n\nHe was guilty of having a loaded sign and had Donald actually managed to read it, his ego might never have recovered from the shot.", "Obama's patience and poise under pressure is amazing. The blatantly disrespectful shit he's had to endure calmly to avoid being the \"angry black guy\" is astounding. \n\nHe's certainly not perfect but he looks like the greatest president in a generation compared to these two options we have now. ", "Sorry friend if Trump is elected I have a feeling it'll be us joining you...against our will. Trudeau will do something that pisses Trump off and BOOM, annexed. ", "He'll make Trump look bad by governing better.\n\nTrump \"Unacceptable.  Take him out.\"", "There's already been an assassination attempt though. Remember the guy who tried to take a gun from a cop at a Trump rally? It was dumb and didn't get anywhere but it was an attempt.", "Not only that... it seems like trump might've been the one who incited it by saying [\"take him out\"](http://youtu.be/eemJPPb8Otw)", "Can't tell if serious.... The Secret Service had their own high profile controversies the past couple years.", "He leveled that demand days after people started questioning if he was on something.\n\nBy leveling that demand when he knows she wasn't going to turn this into a circus with fucking drug tests, he was deflecting the idea that he might be on something - knowing full well he'd never have to take a test.\n\nIf he really wanted to prove a point, he should have had a nonpartisan organization give him a drug test and share results.  I highly doubt she'd have then let herself be tested.  She wouldn't have wanted to bring it to that level because it's just further erosion of the process and she has also consistently played a game of not letting him dictate the conversation on his terms.  He would, however, have looked good in many eyes for dispelling the drug rumors with actual data.", "Yeah and in a situation as heated as this, it's completely plausible a person could think they really did have a gun. If it really was someone who just shouted 'gun' to rile people up or frame the guy, that is *extremely* shitty and deserving of punishment, but I honestly think it's more likely that some Trump supporter just fell into the fever-pitch mob hysteria and really did believe that some jerky movement he made meant that he was probably reaching for a gun.", "They were already beating him just for protesting. Only after he hit the ground did Someone yell \"gun\". Read the article for once\n\nEdit: clarified my sentence", "A book?!? Burn him!", "\"They better be on the right side when it comes crashing down\"\n\nLet me get this straight these guys hate isis so much the intend on becoming its American counterpart?", "For awhile now I was thinking in the back of my head, that the donald would go away after the election.  Either it would fizzle out or the admins would shut it down.  The idea that maybe nothing will change after the election is concerning.  Those people aren't going away if their candidate loses.", "To be fair he's had 8 years of practice dealing with disrespectful shit. ", "Because he's not.", "They've already called Hillary a satanist and for her to be locked up burning people for ordering books is just the next step.", "thats 32k emails...", "Restrain: punch choke, kick\nAct Violently: hold sign", "/r/the_donald was also really happy to see Obama \"lose it for 2 minutes\" while the crowd was shouting at the protester. ", "This is correct. To argue that the organization of the sentence changes what it means in this instance is wrong. It's like saying A=B is not the same as B=A which is obviously not true. The reality is it could be interpreted either way. Neither is right nor wrong.", "&gt;Crites said **when he was on the ground** he heard someone yell “something about a gun” and he kept telling those on top of him that he had merely been holding a sign.", "Or you can read this part of the article that corroborates the protesters story that he was getting beaten before someone yelled gun:\n\n&gt;Several Trump supporters who witnessed the incident told the Guardian they saw a man wrestled to the ground and after he was on the ground, heard shouts that he had a weapon, prompting panic.\n\nBut of course if you're going whole hog with the \"lying liberal media\" angle there's just no helping you.", "He said was being *beaten* before someone yelled \"gun\".", "Hes going to start a project to design and build the wall. That project will be handled by a private company a company charging 100x normal rate, and conveniently run by one of his children.\n\nAs will most of the other projects Trump will spearhead.\n\nTrump is in this for trump. But people are so stuck in their minds with this whole presidential election as a game of sports: My Team VS Your Team, that they cant even see it, even when trump himself is saying it to them. He literally stated that he is willing to be bought at one of his own speech rallies at one point. \n\nYou know how the west looks at the religious middle east, and wonders why would they put so much importance on religion over something that is realistic and understandable. Look at the republicans supporting trump. Its the same thing, ideology and identity over reality.  ", "That's evangelical extremism for you.  They're gonna have to come up with new scare tactics because every 12-year-old today is exploding demon heads left and right in DOOM.\n\nIn addition, they'll frame anyone outside of, or perceived to be outside of, the \"nationally sanctioned\" religion as a demon/satanist.  When truthfully, in 2016 everybody knows atheists or agnostics or others, and knows that they're just normal people living their lives.", "Say what you want about Bush but that man had cat-like reflexes and threw the greatest first pitch in history ", "It honestly doesn't matter if he concedes or not. He can continue to believe he actually won and can continue to campaign until 2020. Once Hillary wins the election she is the president elect. Donald refusing to concede doesn't change that. At all", "Australia here. C'mon down NorthBros.", "No he doesn't.\n\nSaved you a few minutes.", "A guy who worked for the Hillary campaign in Nevada tries to start a fight at a Trump rally and then spends more time crying to the media than protesting. \n\nHMMM. NOTHING FISHY HERE. MOVE ALONG. ", "&gt;  How do you know he wasnt aggressively rushing the stage grabbing at his waistband? Do you have witness links? Someone has already grabbed a gun at a Trump rally to try and assassinate him so its not like its out of the realm of possibility. \n\nThat's what you said.\n\nI provided video which doesn't show him rushing the stage.\n\nYou can even look at the full rally [here](https://youtu.be/aQMUj6ETaNg?t=1h51m) and see that the guy was in the front of the audience listening to the speech till he started protesting doing nothing wrong for almost 2 hours.\n\nAnd when someone tells you to provide proof, the burden isn't on the person questioning you to provide evidence which contradicts what you say. You provide evidence first to prove your claim correct, not deflect by telling others to show evidence when they question your assumptions.\n\n&gt;As far as I know there is no up close cell phone footage as yet released of the altercation. \n\nThat hasn't stopped you from making assumptions, so I suggest you just crawl back to /r/the_donald and stop trying to deter the conversations in here.", "Innaccurately states that polls were saying Brexit wouldn't win.  That is wrong.  The polls were split.  The analysts were wrong.\n\nAlso any analysis done using social media is irrelevant considering the army of Russian bots propping Trump up. ", "It wasn't the USSS that beat him", "Show me proof of your assumptions that he was rushing the stage. You can see in that video NOBODY is rushing the stage. \n\nYou calling for evidence then dismissing it when it's presented yet making assumptions without putting up any evidence yourself to back it up.", "What law was violated when he stood there holding a sign?", "[I'll just leave this here.](http://time.com/3449641/secret-service-scandal/)\n\nI'll concede that they could be worse though. ", "&gt;Could an argument be that she used her own server because she felt it to be more secure than the State dept?\n\nNah she used it because the NSA refused when she requested a secured blackberry like Obama's and Condaleeza Rice's.  Instead she turned to a private server as a work-around in order to get shit done, as per Colin Powell's suggestion. (I suspect Secretary of State is a high-workload, high-stakes job with real world consequences and you need type A people doing it.)  If her end game was setting up a private server as a secured channel for hypothesized personal corruption she'd have just fucking done it and not farted around trying to source a secure blackberry in order to get shit done.\n\nhttp://arstechnica.com/information-technology/2016/03/nsa-refused-clinton-a-secure-blackberry-like-obama-so-she-used-her-own/\n\n&gt;...\n\n&gt;The NSA refused to give Clinton a device similar to the one used by Obama: a modified BlackBerry 8830 World Edition with additional cryptography installed. And while Clinton's predecessor Condaleeza Rice had obtained waivers for herself and her staff to use BlackBerry devices, Clinton's staff was told that \"use [of the BlackBerry] expanded to an unmanageable number of users from a security perspective, so those waivers were phased out and BlackBerry use was not allowed in her Suite,\" an e-mail from the NSA's senior liaison to the State Department noted.\n\nAlso, she's taken fire for not jumping through the hoops to do things \"properly\", which would have meant using the State Department's servers, when: http://www.cnn.com/2015/03/10/politics/state-department-hack-worst-ever/\n\n&gt;    (CNN) Overlooked in the controversy over Hillary Clinton's use of a private email server, is the fact that suspected Russian hackers have bedeviled State Department's email system for much of the past year and continue to pose problems for technicians trying to eradicate the intrusion.\n\n&gt;    Federal law enforcement, intelligence and congressional officials briefed on the investigation say the hack of the State email system is the \"worst ever\" cyberattack intrusion against a federal agency. The attackers who breached State are also believed to be behind hacks on the White House's email system, and against several other federal agencies, the officials say.\n\n&gt; ...\n\nShe'd have used one of those secured terminals in a secured room for the classifiedish secret stuff - firstly because that's what you're supposed to do and secondly because she'd be sending and receiving messages with classifiedish secret headers to other people on other secured terminals that have to do it that way. I think that network is sort of airgapped from regular email.", "Nobody is bullying you. I am a Democrat but if Trump was running as a Dem I would vote for whatever Republican that was apposing him. That doesn't make me less of a Democrat, it makes me someone who cares about my country before my party. ", "Yeah that argument was used to justify Jim Crow", "How much do you want to bet he was planted by the HRC camp", "I think in Germany that authority was once called the \"gestapo\"", "Yeah bad strategy. It's always better to have a reliable firearm you can throw at assailants.", "I like how you use \"liberal\" like it's supposed to be an insult of some kind.", "Welcome to keeping America great already. I early voted against that pumpkinhole as well.", "So posting factual information is against their rules is what you're saying. These clowns live in an anti-reality. I can't wait for Tuesday I wish I could get a broadcast of them screaming in horror as reality sets in. ", "list of people to round up when trump is elected\n\nbook buyers\n\nchild carers\n\nnon whites\n\nnot leaving a very great country there now are we", "Our elections work off votes not memes and racism.", "Not really a fair comparison she's making a hell of a lot more money than the Germans.", "police officer at chicago trump rally \" i had a glass bottle broken over my head because the dnc paid the mentally unstable to cause a riot at a trump rally\" ", "It feeds into the crooked Hillary mindset. She's so corrupt and evil that she's sending her \"people\" to kill The Donald. No one outside their base will believe it though. ", "Which is why they best the CNN guy too  right? \n\nNah,  they beat him because they're violent fascists. ", "Hey did you read this in the article?\n\n&gt;Several Trump supporters who witnessed the incident told the Guardian they saw a man wrestled to the ground and after he was on the ground, heard shouts that he had a weapon, prompting panic.\n\nJust curious, because witnesses are corroborating the protesters story that the shouts of \"gun\" came after the guy was getting beaten.", "you could simply watch the video from the RSBN live stream of it happening. you can see the guy charge through the crowd pushing people aside, and then when he tried to pull out his sign someone assumed he had a weapon and that's when the secret service stepped in\n\ni highly suggest you look for both sides of the story instead of regurgitating the propaganda you see from the lying liberal media. you'd become a much wiser person", "&gt;kick all Hispanic people out of America.\n\nThat's kind of weird of you to call every single Hispanic in the US an illegal immigrant. ", "And then at a Clinton rally when a Trump supporter showed up people booed but Obama got them back on track and stood up for the Trump supporter...and then Trump claimed Obama was yelling at the Trump supporter...\n\nCan this election be over please?  Can Donald Trump go back into whatever hole he crawled out of and leave us alone?", "The guy is covering the the camera with his Trump sign.  I mean he had a gun right?  But it's, \"Nope, nothing to see here!\"  Dude was assaulted for protesting.", "Do you actually think Mexico will pay for it? Are you serious?", "The man was already being violently attacked before anyone said the word \"gun\" and Trump was telling them to \"Take him out.\"", "&gt;I ask you 2 questions- \"How do you know he wasnt aggressively rushing the stage grabbing at his waistband?\"\n\nAlready posted video of the full rally and  a video of before the guy was assaulted.\n\nHe wasn't rushing the stage yet you still trying to argue he is.\n\n&gt;I asked YOU to prove \"He was only deemed a threat because of someone shouting out gun like a complete moron\" and you can't. \n\nIf he was deemed a threat he would had been removed from the rally way sooner and not 2 hours into the rally when he decided to show his sign which prompted Trump mock him for being a Hillary plant accusing him of being paid to be there before telling his supporters to \"take him out\".\n\n&gt;I'm just asking you for proof and you have none. \n\nPosted ton of proof, it's obviously not going to get through your thick head that the guy was innocent of any wrongdoing.\n\nAt this point, I'm done repeating myself multiple times. You want to believe the guy deserved to be assaulted, fine go ahead and think that. Majority of people realize that Trump goaded his supporters into attacking a protester, which they did, displaying how violent Trump supporters are and how unfit Trump is.", "Blue Jays are baseball.  You're making me rethink this deal sir........", "And that justifies assaulting him?", "You should maybe talk to someone if you get offended by people sharing facts with you. ", "A company from South Africa? Where are they getting their data?  Who is paying for the results? It costs a lot to get the full fire house of data.  I doubt they have it. ", "&gt; Although he described himself as a Republican and fiscal conservative Crites said he had canvassed “for a few hours” with the Clinton campaign in Nevada because he wanted to do all he could to prevent a Trump presidency\n\n&gt;He said he was not fully supportive of Clinton but believed she was the only candidate who could stop Trump from reaching the White House.\n\n&gt;Crites said he had not formal connection to the Clinton campaign and decided to attend the rally on his own volition.", "Traditionally the GOP had an absentee advantage that Democrats had to overcome on election day to erase that would be a tectonic shift in our election politics.  ", "No word of lie that was probably the only moment I respected the man, if only for his swiftness and Spider-Sense.", "what a shocker: a shit source doxing, no proof of anything interesting, but tons of bizarre conspiracies. pls stay on 4chan. \n\n\nthe fuck is a Hillary-friend? ", "Birddogging", "How many people were recording video a the event? or was it not allowed for some reason?", "His reaction to a republican protester at his rally.\nvs\nObama's reaction to a Trump supporter at a Hillary rally.\nBut yeah Obama is the disgrace.", "then why would he have already been on the ground by the time anyone was shouting gun? and why would he have already been being aggressed on and roughed up for exercising free speech in a non disruptive manner", "It is maddening that most of the media still not reporting this story as it should be...\n\n\"Protester Attacked At Trump Rally\"", "What about Kerry vs Bush..\n\nWhere the military massively supported Bush as opposed to Kerry who had actually gone to war. \n\nOr the fact that Republicans are the ones threatening war everywhere getting their friends killed in places like Iraq.\n\nGenuinely I don't give military members that much credit about their blind support of Republicans. ", "I've been wanting to talk shit all day but I've gone this long without getting banned by the Donald and I'm saving my shot till he loses the election. ", "So then in excess of 30000 emails?\n\nEdited to correct bad math. ", "By \"it's working\" you mean Trump making things up about a fake assassination attempt is making his followers even more angry at the Dems?  Or more angry at other Republicans?  Why should they be angry at anyone but themselves for losing control of their emotions?  Or blame Trump for making a mountain out of a mole hill?  I don't see how this comes back on Hillary.", "Yes lol but he wouldn't be accompanied by scary music and talk of the \"global elite.\" ", "Innocent until proven guilty. That's the way we do things in America. I'm always arguing against Clinton and her corruption. One of the ways you can counter my argument is to point out she's never been convicted. From what I understand the charges were just dropped against Trump. From what I understand the original charges were brought up in California and when they went to the plaintiffs house it was a phony address so the case was dismissed and then it was immediately re-opened in NY for political reasons. That makes me think its bullshit and if I thought otherwise I wouldn't support him. Clinton on the other hand definitely gave Abedin hundreds of thousands of Foundation money while she was a State Department assistant working on a weapons deal with Saudi Arabia and American arms manufacturers that just happened to donate to that same Foundation. Cronyism and a slush fund. No fake addresses either.  ", "Yeah sorry, but after all that's been said and done by Trump, I consider anyone leaning towards him either not-too-bright to comprehend the nature of the man, or severely politically uninformed. \n\nOf course, there are those who are simply two-bit, racist, bigoted degenerates but they were never on the fence.", "Don't waste your time he's a mod of r/the_cheeto.", "I am going to enjoy her being elected. What I will not enjoy is trying to heal our country from all of the lies you are helping spread.", "CNN's interview with the protestor afterwards is pretty good evidence this wasn't staged.  The guy wouldn't be doing the moderate Republican thing if it was.  He'd be a rabid Hillary fan.", "&gt; on video.\n\nAre we talking about the video edited and produced by a guy who phrases questions and edits his videos to capture statements that are known to be untrue or hypothetical by the people saying them?\n\nFor example when he released his ACORN video, it was found that the person being recorded was playing along and immediately reported him to the police because he thought O'Keefe was serious. O'Keefe had to pay $100000 to the man who was recorded, presumably for libel. [Source.](http://articles.latimes.com/2013/mar/07/local/la-me-0308-acorn-20130308)", "Some real bad hombre's round these parts", "I go far and beyond informing myself by reading tons of sources for and against my initial bias and then reevaluating my thoughts and beliefs. Most people don't do that. They turn on the nightly news and see how everything is portrayed as neutral. The media in the u.s. is absolute garbage. If trump wins it is there fault. Policies matter but they focus on scandals. Hillary actually has realistic policies and trump has presented maybe three policies that are all demonstrably terrible. The media doesn't point any of that out because they need a horse race for ratings. Stop being a disservice to the American people and do what journalists are supposed to do. To present facts and only facts. People will naturally make up their own minds. Don't present everything as equal because it isn't. ", "That white  British guy,  right? \n\n", "&gt;The video was shot by Nabih Bulos a foreign correspondent working for the New York Times last year. He confirmed to The Intercept that that the footage was not licensed from him, and he would not have approved its use if asked.\n\nWhy the hell do Trump supporters think he won't screw them over like all the countless people he has before?", "Only fitting that his final message be a misdirection contain a lie, and screw over a person involved in creating it.\n\nClassic Trump.  This man's name is going to enter our lexicon as some specialized form of conartistry.", "Seriously. This isn't unrealistic at all. It's fascism 101. It's happened before. Probably will happen again. ", "And now T_D is saying the protester is a Clinton birddog.  It's a fucking disease.", "I think what scares me the most is what happens to all that anger after election day.", "Violence toward the media has really only been coming from one side which is what the video from my reply was referencing. Let's not act like there's not a particular side of the political spectrum here that actually believes silencing opposition and journalists through violence and intimidation is an acceptable way to have a democratic election. They do.\n\nEquivocating to both parties to come across as impartial in your view is nice and all, but it's doesn't reflect what is occurring right now, nor are you actually impartial just by saying \"well they both do it so there!\".", "\"Everybody sit down and be quiet.\" That shit was gold. Crowd was infuriating. He was all class.", "Please tell me that Trump's \"make america great again\" hats are really manufactured in China.  i need this to be true!", "Don't boo  Vote.", "When I read the headline I was going to comment how much it echoes Farage's infamous Breaking Point billboard.  I see they beat me to the punch.", "Copy and paste this shit anytime anyone tried to defend Wikileaks on this site. Reveling innocent peoples private information via illegal hacks is revolting on every level. They are just as bad of a cancer as what they claim to be fighting. ", "As a German don't believe the fear-mongering guy I replied to. Sure there are assholes among the refugees, sure there are some who don't adapt that well to western culture, but I fail to see the difference to many native Germans in that.", "&gt; One of the bigger surprises however to me at least, have been that most of the violent behaviour has come from the left. \n\nHm. From what I am seeing, this is not correct. The violent behaviour toward citizens and media alike has been coming by and large from the right. \n\nWhen I say I am originally from an authoritarian state and Trump supporters remind me of it - it's the violence, the intimidation, the belief that the \"other\" is un-American. It's not just a bunch of people yelling at each other. The cult of personality on t_d posts and the dead serious posts last night on t_d about Hillary being a Satanist attending semen and blood rituals. This is all textbook authoritarianism.", "After the Brexit vote there were people who'd crawled out from under their rock demanding all darker people now 'fuck off'. It had nothing to do with legal or illegal. In their warped, ignorant world view, they felt they'd won a mandate to throw every non-white or non-English speaker out of the country. There's no balance with these people", "He wont even release his taxes. You think The Dingus is going to release a drug test?", "I agree that there are wackos on every side - extremists that accept violence as legitimate way to answer to others. This has been true in past elections. A few crazies on both sides causing trouble.\n\nHowever this election Trump and his supporters have accepted the extreme as normal. I see Democratic rallies where people boo protesters and they sometimes get removed by security, other times like yesterday Obama tells them to let the protester protest! On the other hand, we have the startling and frightening contrast of Trump rallies - where Trump's own hateful rhetoric riles people up against protesters, people have now been beaten, and the media is threatened. This is completely undemocratic.", "Yeah remember when the Republicans only lied us into wars   \n-OUTSIDE- the United States?\n\nGoooooooood times.", "Official ones are us made. But if you don't buy it from the official place you bought a Chinese or Indian made copy.", "His smile after the first shoe always gets me.\n\n\"Heh we playin' shoe-dodge now? Arright, let's go!\"", "It was really weird seeing all those MAGA signs being used to block cameras from seeing what's happening... that metaphor just writes itself...", "It still amazes me how apologistic the conservative right have become of Russian shenanigans.", "Reddit admins u/spez and u/kn0thing have damaged America democracy, and the planet by supporting a violent fascist to spread his insane hatred. People can try to justify it all they want, but that's what it comes down to. \n\n/r/t_d etc's insane conspiracy bullshit is like a virus, its toxic, and Reddit will gladly pay for the bandwidth if it gets them users.\n\nThere's a reason that being a Redditor now has negative connotations. It's been going that way for years...But where we've been this year, with r/all loaded with hateful insanity...\n\nI've been on Reddit on and off for 10 years. And as with Assange, I initially admired the Reddit admins. But I am now disgusted with them.\n\nIs that what they wanted their legacy to be? ", "Because that would somehow make it okay to beat the shit out of a guy for holding a sign. /s", "t_d and 4chan wouldn't be able to prove the sky is blue.", "&gt;Well Clinton does own the onion now.\n\nThe title of the article is literally \"Hillary Clinton's top financial supporter now controls The Onion\".  The co-owner and Chairman of Univision is a Hillary supporter.  The Univision company bought a 40% stake in The Onion.  On what planet does this mean that \"Clinton does own the onion now\"? ", "I prefer [redcaps](https://en.wikipedia.org/wiki/Redcap).", "Commacho actively sought out an expert to advise him on a problem he didn't fully understand but his people desperately wanted a solution to.\n", "And insisting she has health problems then releasing that ridiculous excuse for a doctor's note.  ", "And before you know it China will invade Alaska. Vault-Tec would do brisk business.", "In other words they have collectively started to believe yet another fairy tale. ", "Whoa there cowboy. I generally agree with your sentiment, but are you seriously calling Austria a nowhere fucking country?", "Someone yelled gun", "His cover image literally says \"Nevada Republicans proudly voting for Secretary Clinton\".\n\n[Woops.](https://heavyeditorial.files.wordpress.com/2016/11/crites.jpg?quality=65&amp;strip=all&amp;w=780&amp;strip=all)", "Please keep in mind that if we want to hold her accountable we need to give her every opportunity to push our agenda.\n\nSo come 2018, we need to give her a Democratic Congress.\n\nIf we give her all the tools and she still let's us down, I'll be the first saying to primary her ass.", "Yeah it's Hillary's fault that Trump supporters lash out violently at anyone who disagrees with political opinion.... /s", "Can't have their God Emperor getting any paper cuts. ", "IIRC it started as satire but it attracted 15 year old who can't tell sarcasm from reality who eventually overwhelmed the original purpose and rebranded it. ", "No. \n\nIt has come out that you're a fucking moron though.", "As a German American this election is making me really nervous.  I can't believe all the shit my grandparents grew up with is actually starting up again in my lifetime.\n\nLearn from our mistake, America! Never again!", "&gt; Trump supporters will say that Trump narrowly and bravely avoided an assassination attempt by militant liberals or Isis, or Blacks... Or \"fuckin' somebody that isn't us\"....\n\nYep, a title from the Trump sub reads: \n\n&gt;Trump continues rally after a credible assassination attempt ", "This type of comment is literally what I'm talking about.\n\nIf you have any decency please at least try to consider that saying shit like this reinforces the behavior of people who do real harm to people", "He singled out a guy in the crowd ridiculed him, said \"take him out,\" and then the crowd beat the hell out of the guy. \n\nThat's the sort of thing that really is not okay to do to anyone except an assassin. You just don't look good if you sic a mob on a dude voicing his opinion.", "As someone who's 12 hour shift is turning into a 13 hour shift...thank fucking God ", "Well if you don't like trump she's the only other option. Country over party. It's simple stuff to a person who isn't simpleminded. Figure it out of you can. ", "On the subject I really can't recommend this youtube video from CGP grey enough. It sheds a light on how the issue of modern automization differs from the past forms. It is pretty long, but it's damn well made.\n\nhttps://www.youtube.com/watch?v=7Pq-S557XQU", "Trump didn't start this wave of... energy. He merely tapped into it. The \"movement\" isn't going anywhere even if Trump keeled over tomorrow.", "There is no excuse for that behavior or for those who enable it\n\nWho he is is irrelevant", "I think it means something like a plant meant to incite a response that they can play as victimization and make Trump and his supporters look bad.", "So they are too incompetent to vote on election day but competent enough to vote in the state sanctioned and authorized early voting days?\n\nIs this one of those Schrodinger's Clinton things where she is both too incompetent to be President and a mastermind murdering politician who keeps getting way with it?", "My brother is a professor who specializes in very relevant fields. \n\nHe commented the other day:\n\n&gt; One good thing about this election.. Afterwards we'll have a much better estimate of the number of racists in this country. ", "Don't end DST make it permanent. Sunlight in the evening, please!", "He was mentioned because he bought a book from Stratfor in 2012...\n\nEdit: a book written by a Reagan aide too", "He probably thinks Trump will let him off the hook so he won't die cooped up in an embassy. ", "Diamond Joe? Forgettable? ", "He is talking directly to Gina Rodriguez in this situation about she (AN AMERICAN CITIZEN) has an even greater responsibility to vote because she is speaking for those in the community who are unable to vote. \n\nWatch the [original interview](https://youtu.be/oLLt-a6dI_0), not the picked off comments from Fox News.", "&gt; that's not true in a direct sense\n\nOr any sense.  I never commented about a media outlet being pro- or anti-anything.  Read my comment again.  Clinton does not own The Onion.", "Trumps campaign retweeted this stuff you donkey. And look at the_donald. It's clear they are running with this", "Some people call it incompetence some people call it having a low paying job with weird hours, and yet more people call it not wanting to try to get to the polls on election day.", "Russian owned press?\n\nReally?", "&gt; Early voting sites have been reduced in democratic-leaning locations.\n\n\nYep here in Wisconsin a collage campus was not allowed to open a polling place because \" too many liberals would vote\".   Republicans in state also fought to reduce the hours of early polling sites because again too many liberals would vote, that it was too much voter access.  ", "Based on the unbiased polling of the_donald subscribers? Or is this based on the unskewed version of the national polls?", "The issue is jobs are going to be eliminated no matter what. The question to really answer is what are we going to do to prepare for that future?", "Everything we know about Trump's success and business empire points to it being somewhat illusory. What he has done is create a myth of Donald Trump billionaire real estate tycoon. The reality is he inherited a fortune and underperformed what a passive S&amp;P500 portfolio would have earned him. His pursuit of \"penny ante\" gimmicks like Trump steaks is damning in this regard; think about how many steaks you have to sell to make that a million dollar business. Or what it take to produce a superior product. It's not as if he is a legendary bovine breeder who produced a superior bull through his own hard work and ingenuity. I'll grant that he's a leading expert and practitioner in bullshit however.  \n\n(Of course, he could release his tax returns and prove this all wrong.)\n\nAs for Hillary, she is ambitious, but so is every man who has ever pursued the presidency. Obama's ambition prior to winning the presidency place considerable strain on his marriage, I recall reading. \n\nMost politicians do accept campaign contributions from donors who expect favors in return. There is a way to fix - public financing and spending limits, her party being the only one consider that. Hillary has been the subject of far more intense scrutiny than most politicians and there is no smoking gun. She sent some emails. Her foundation accepted donations and prove it made a positive difference in the world. She hasn't always been careful to manage potential conflicts of interest but if you scratch any politician or business leader enough you'll start to find such issues. This is not so much in her defense as to say it is ordinary politics. \n\nTrump's foundation is a slush fund and he used it to bribe the Florida attorney general to not sue his fake university. \n\nTrump has never acted in a way other than advancing his own interests and glory. Never. There's no evidence that he'll be able to aggrandize something other than himself, because self-aggrandizement is his only skill. ", "Sorry but the Clinton's policy of data retention had not been followed by the tech and he deleted the data because he was in breach of contract. The fact that he did this before any preservation order could come down is not Clinton's fault. \n\nI'll say it again...If anyone could prove that Clinton ordered the destruction of documents under subpoena she would be under indictment. They can't, she's not, you should probably stfu.", "&gt; The guy in Reno was pushing people around. Big difference.\n\nNo he was not.  ", "&gt;Yeah its an established fact, because Stonetear asked reddit how to use bleachbit, then Gowdi asked Comey if there was in fact destruction of evidence (there was), and why comey decided to hand out immunity.\n\nI'll say it once again...slowly. The tech realized he was in breach of contract based on the data retention policies set forth in said contact. He panicked and deleted his archive, even though there was a order to retain that he was unaware of.\n\n If you have any evidence that Clinton, or anyone associated with her, ordered that destruction you will be the hero of the Republican Party and should get Gowdi on the phone immediately. \n\nWhat we have here are a bunch of politicians who are incredibly not tech savvy and an incompetent IT contractor.\n\n If there was any meat to this story Clinton would be under indictment already. Or is it your position that the Republican Committees that have investigated this are so incompetent that they can't make this \"obvious\" charge stick.", "How can she free him from hiding from a rape charge?\n\nHe's not being charged by us ", "yeah so believable. Greetings to Macedonia!", "This doesn't sound far from how it would actually play out. ", "According to these nutters the DNI is in some conspiracy with Chelsea Clinton and 7 other intelligence agencies", "Adding stock to the risotto at once is criminal! It's high time we reckon with that ", "I'd say the Post was getting truly desperate but they haven't jumped into the \"Hillary is an actual Satanist\" pool yet, so I'll say they're just close.", "I'm still 50/50 if t_d is satire or not.", "Trump supporters don't read the leaks they cite and are suspicious of people who can read.", "Sad! Lock him up! ", "Wow you fuckers will literally try anything how bad are the internal poll numbers in Trumplandia?", "There are tests done in some Finnish communes right now. \nIt's a well meant idea but there's legitimate worry that for example giving 1000$ to everyone every month would inflate the costs of living that much that people only relying on that will still be poor and unable to afford a decent lifestyle.\n\nBut some sort of distribution has to be done in future that's for sure and even cooperate ultra capitalists will soon demand it since a market where 50% of people are struggling isn't very valuable.", "&gt; the man was assaulted when people shouted gun\n\nPeople shouted gun *after* he was already being attacked. Probably actually saved the dude's life.", "It's funny from an outsider perspective, purely objective here, he's probably considered the best president you've ever had. \n\nThat such a large portion of your population can't/won't see that is bizarre. I get that you can't please everyone but considering he was blocked at nearly every turn, he's done so much. \n\nSaw a video posted earlier about civic engagement and political/judicial education and it made a lot of sense. You just need to look over on that other sub to see how ignorant of how the system works (and is designed to work) people are. ", "What law did he violate by holding a sign?", "(this means providing facts)", "The video seems edited. Everyone knows only citizens can vote how can you all be so uninformed to not know your own nations voting laws to this degree? \n\nHave any of you Trumpers actually voted before or you all just Russian script kiddies?", "Nevada has no laws against open carry which means it's legal there.  The GOP is BIG on second amendment rights.  So why wouldn't people assume gun-guy was simply exercising his second amendment rights, and, as a red-blooded 'Merican, was most likely there to protect Trump?  Why weren't they applauding him?  According to the Republicans, no place is safer than a place full of gun-wielding second-amendment advocates, so why wasn't the place packed with right-wingers exercising their right to carry a gun since it's legal there?   ", "No only they can have guns if you support their message. Just like tyranny is bad except when it's their tyrant. Then it's cool. ", "Assange is just going insane because he's trapped in an embassy for the rest of his life and starting to feel the pressure. I always thought he came off as deceptive but now I know he is little gossip profiteer not a person interested with preserving and sharing data and knowledge. \n\nInstead Assange hyped up data to make it say what he wants it to say. Wikileaks is a leak/tabloid these days and that's just not useful because you can't trust the leaks if they are being marketed.", "&gt;No it proves that he's an agitator and came to the rally with an agenda of making a scene/being a victim.\n\nNo it doesn't. It proves you didn't read the leaks.", "You mean if he loses.\n\nThe race isn't over yet. He still has a chance of winning unfortunately.", "Somewhere between points 2-3 trump might've been the one who incited it by saying [\"take him out\"](http://youtu.be/eemJPPb8Otw)", "Oh I get it. Since he's on a list of names, he must be guilty of something. Gotcha. ", "I've been seeing a surprising number of comments pointing out that he wasn't a liberal and he didn't even have a gun.  Mods must be having some serious trouble keeping up with this one.", "It seems like trump might've been the one who incited it by saying [\"take him out\"](http://youtu.be/eemJPPb8Otw)", "Two months in after the majority of America begins to look like the Great Depression:\n\n\"Are we the baddies?\"", "He is a never Trump Republican.  Also I searched facebook for that guys page and never found it.  ", "Great headline.", "Uday or Qusay?", "it isn't the reporters dude. It's news editors and the money men who puts their asses there. Until one of them stands up for this shit."], "links": ["5bebz1", "5be465", "5bebz1", "5bebz1", "5bebz1", "5bdx22", "5begx2", "5bebz1", "5bdx22", "5bebz1", "5bebz1", "5bdx22", "5bdx22", "5bdx22", "5bebz1", "5be465", "5bebz1", "5bebz1", "5begdx", "5bdx22", "5bdx22", "5bdx22", "5bebz1", "5bdx22", "5bdx22", "5bdx22", "5bdx22", "5bdx22", "5bdx22", "5bdx22", "5bdx22", "5be3rr", "5bdx22", "5bdx22", "5be465", "5bebz1", "5bdx22", "5bdx22", "5be465", "5be3rr", "5bdx22", "5bd999", "5bdx22", "5bdx22", "5be465", "5bebz1", "5bdx22", "5be465", "5be9i5", "5be465", "5bdx22", "5bdx22", "5bdahi", "5bdx22", "5bdx22", "5bebz1", "5bebz1", "5bdsof", "5bdc5z", "5bdx22", "5bd4fq", "5bebz1", "5be465", "5bc25u", "5bebz1", "5bdsof", "5bdx22", "5bdsof", "5be465", "5bebz1", "5bdx22", "5bd999", "5bdx22", "5bd6ez", "5bdx22", "5bcjgr", "5be465", "5be465", "5bdsof", "5be465", "5bdx22", "5bd4fq", "5bebz1", "5bdahi", "5bdx22", "5bebz1", "5bdx22", "5bdsof", "5bedql", "5bd999", "5begx2", "5bd6ez", "5begdx", "5be3rr", "5bebz1", "5bebz1", "5bdx22", "5bebz1", "5bdx22", "5bebz1", "5begx2", "5be465", "5bdx22", "5be465", "5bdx22", "5begx2", "5bdx22", "5bebz1", "5begx2", "5begx2", "5bdx22", "5bebz1", "5bdx22", "5bebz1", "5begx2", "5be465", "5bebz1", "5begx2", "5bebz1", "5bdx22", "5bdx22", "5bdx22", "5begx2", "5bebz1", "5begx2", "5bdx22", "5bdx22", "5bebz1", "5begdx", "5bdx22", "5begx2", "5bdx22", "5bebz1", "5bejcn", "5bdx22", "5bdx22", "5bdx22", "5bdx22", "5bebz1", "5bdx22", "5be465", "5begx2", "5bdx22", "5begdx", "5be465", "5begdx", "5begx2", "5begdx", "5bebz1", "5bchyj", "5bebz1", "5begx2", "5bdx22", "5bebz1", "5bdx22", "5bdx22", "5be3rr", "5be465", "5begx2", "5begx2", "5bdsof", "5bejcn", "5begdx", "5bdx22", "5bd999", "5begx2", "5be465", "5begx2", "5bebz1", "5bdx22", "5be465", "5bdx22", "5bdx22", "5bebz1", "5be465", "5bdx22", "5bd999", "5begdx", "5bdx22", "5bd999", "5bejcn", "5bdx22", "5bdsof", "5bdx22", "5behtz", "5bebz1", "5be3rr", "5be465", "5bejcn", "5beipy", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5be465", "5bebz1", "5bdx22", "5bebz1", "5bdx22", "5bebz1", "5begx2", "5bebz1", "5bebz1", "5bdx22", "5bebz1", "5bebz1", "5bebz1", "5bdx22", "5bebz1", "5be465", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bdx22", "5bdx22", "5bdx22", "5bdx22", "5bdx22", "5be465", "5bdx22", "5begx2", "5be465", "5begx2", "5begdx", "5bebz1", "5besuy", "5be465", "5bebz1", "5bdahi", "5begx2", "5be465", "5be3rr", "5bebz1", "5be465", "5bebz1", "5beqoq", "5begdx", "5be465", "5bcyxv", "5begx2", "5bd6ez", "5bebz1", "5bebz1", "5bdx22", "5bdx22", "5bdx22", "5bebz1", "5bdx22", "5bdx22", "5begdx", "5be7bd", "5bdx22", "5bebz1", "5begdx", "5bdsof", "5bebz1", "5be465", "5bebz1", "5bdx22", "5bebz1", "5besuy", "5begdx", "5bdx22", "5begdx", "5begdx", "5be465", "5bdx22", "5bd999", "5bercc", "5bdsof", "5begx2", "5bebz1", "5bebz1", "5bdx22", "5bdx22", "5bebz1", "5beqoq", "5bebz1", "5bd74t", "5bebz1", "5be465", "5bejcn", "5bcv55", "5bdsof", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5be465", "5bebz1", "5bebz1", "5bdx22", "5bebz1", "5be465", "5be465", "5be465", "5be465", "5bebz1", "5bebz1", "5bdsof", "5bdx22", "5be465", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bdsof", "5bebz1", "5begdx", "5be465", "5bdx22", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bdx22", "5be465", "5be465", "5bebz1", "5bebz1", "5bebz1", "5bdx22", "5bebz1", "5be465", "5bebz1", "5bdx22", "5bdx22", "5besuy", "5bebz1", "5betjg", "5betjg", "5bdx22", "5bebz1", "5bebz1", "5bd999", "5bebz1", "5be465", "5bebz1", "5bebz1", "5bdx22", "5bebz1", "5bebz1", "5betjg", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bdx22", "5bdsof", "5bebz1", "5bebz1", "5begdx", "5bebz1", "5bdufc", "5bev8z", "5bdahi", "5bdsof", "5bebz1", "5bdx22", "5betjg", "5bcffe", "5bev8z", "5bebz1", "5bebz1", "5bdx22", "5bebz1", "5bettl", "5be3rr", "5bdx22", "5bebz1", "5bebz1", "5besuy", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5be465", "5bebz1", "5bebz1", "5bebz1", "5bev8z", "5bdx22", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bdx22", "5bebz1", "5bdx22", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5be465", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bev8z", "5bebz1", "5bebz1", "5bdx22", "5bebz1", "5bebz1", "5bebz1", "5be465", "5bcg11", "5be465", "5bdsof", "5bebz1", "5bf37x", "5bebz1", "5bebz1", "5bf0oc", "5bebz1", "5bebz1", "5bebz1", "5bdx22", "5bev8z", "5beqoq", "5bd6ez", "5bebz1", "5be465", "5be465", "5bebz1", "5bdpna", "5be465", "5bebz1", "5bdx22", "5bdsof", "5bebz1", "5be465", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bdx22", "5begdx", "5bd74t", "5begdx", "5bebz1", "5bebz1", "5bebz1", "5beqoq", "5bf0oc", "5bdx22", "5bdahi", "5be465", "5bdx22", "5bebz1", "5bebz1", "5be465", "5bebz1", "5bebz1", "5bcg11", "5be465", "5bev8z", "5be465", "5bd6ez", "5bebz1", "5betjg", "5bebz1", "5beqoq", "5be465", "5bdx22", "5bdahi", "5betjg", "5bebz1", "5bf6ti", "5bf6ti", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bf6ti", "5bebz1", "5bf6ti", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5be465", "5bebz1", "5be465", "5be465", "5bf283", "5bebz1", "5bebz1", "5bebz1", "5bdsof", "5bebz1", "5be465", "5bebz1", "5bebz1", "5bebz1", "5bd999", "5begdx", "5begdx", "5bdahi", "5begdx", "5bf6hz", "5bebz1", "5bebz1", "5be465", "5begdx", "5bebz1", "5be465", "5begx2", "5begdx", "5bf6mf", "5bebz1", "5bebz1", "5bebz1", "5bdsof", "5bcyxv", "5begx2", "5bebz1", "5bf5dg", "5bdufc", "5bf37x", "5bdsof", "5be3rr", "5bdsof", "5bf5dg", "5bdsof", "5bdx22", "5bf6mf", "5be3rr", "5bev8z", "5begdx", "5bev8z", "5bf5dg", "5bf7cp", "5bd999", "5bf283", "5bf5dg", "5bf6yg", "5bebz1", "5bebz1", "5begdx", "5bf7cp", "5bf6mf", "5bdx22", "5bebz1", "5bebz1", "5be465", "5bf37x", "5bdx22", "5begdx", "5bf5dg", "5bebz1", "5bdx22", "5begdx", "5bebz1", "5be465", "5be3rr", "5begdx", "5begdx", "5bf6hz", "5bebz1", "5be465"]}