{"comments": ["I have always wondered how people get involved in things like cults and pyramid schemes and unfortunately now I see how. What is really a shame is there seems to be no way to show them their emperor is wearing no clothes. ", "We need stronger false advertising laws.", "Motivating Latinos to start voting for Democrats en masse will be Don's political legacy.  \n\nThat and turning Presidential debates into episodes of The Jerry Springer Show.", "Surprise surprise a tactic the Russian government used during the Ukraine crisis is also being used by the Trump camp.  ", "&gt; while Trump is ushered off stage.\n\nLet's be fair to the secret service here. If someone actually yelled \"gun!\" like people are reporting secret service hardly had a choice in the matter. ", "Entering the race with a lie ending the race with a lie. At least he's consistent. ", "It's sad how a publicity stunt by one fascist has been recycled by at least two others (Farange and now Trump).   Orbán sure knows how to put on a show.", "How about because he's a vile piece of shit?  Isn't that reason enough for them?  Isn't it reason enough for everyone?", "He wants to deport their fathers and cousins and then is surprised that they might not want that.", "The Donald is literally making it sound like he is a hero for telling his supporters to take out a protester. Not only that but someone shouted \"gun\" when there was none and these people almost killed him.\n\nFor what? Protesting against Trump...\n\nPeople are still going on and on about how the guy had a gun even when the Secret Service has confirmed he didn't.", "This isn't fascism in action. It's populism and nationalism which easily convert into fascism when an authoritarian takes the reigns.", "That was Professor Obama sneaking back out.", "Part of me wishes you could vote him in a third term because he isn't a complete fuck-up.", "Today I Learned:\n\n&gt;Not to mention the fact that Latinos are an ever-increasing share of the global Mormon population. Here in the United States the percentage of Mormons who are Latino is 7 percent and growing.\n\n[...]\n\n&gt;In case one thinks that Muslims were somehow not included in this sentiment, in 1841 the city of Nauvoo, Illinois—the headquarters of Mormonism at the time—explicitly mentioned “Mohammedans” (that is, Muslims) in a statute guaranteeing “free toleration and equal privileges.”", "Seriously. Who throws a shoe? I mean honestly.", "I was absolutely sickened by waiting hours for TV news (several networks) to drop the assassination narrative and cover the actual guy who had no gunwas not detained by the secret service or cops and who's struggled not to suffocate as he had shit kicked out of him by people reportedly reacting to his sign being added to by people assuming the commotion was about something serious like a weapon. In meantime dangerous bloodthirsty fools on here (not this sub) were trying to get the guys personal details because they wanted him beaten, killed or 'prison raped' \n\nSame time Trump sycophants are tweeting about the assassination and Donald Jr is retweeting it, Trump snr corrected *nothing* and at a parallel rally a priest said an attempt had been made to murder trump because the media are so mean to trump!", "Spectre? The KKK is endorsing Trump. He has Steve Bannon on his payroll. He has retweeted white nationalist propaganda.\n\nYou don't need a spectre when you have the real thing.", "Almost everyone.\n\nNice thing about this election lot of shit heads exposed.\n\nHuh, a swamp was drained afterall.", "Gary Johnson 8% Stein 4%\n\nthats not going to happen", "Yikes calm down. It'll be ok.", "He's classI'm going to miss Obama", "And if you watch the whole video this is a thoughtful and well-spoken Republican who said that he doesn't hate the Trump supporters because they're good people who are being manipulated by Trump, and this is why he's against him. This stand-up guy is the guy they're attacking and doxxing. Bravo.", "PLEASE incite the Beyhive.", "So what you're saying is that I've been brainwashed and you're the one seeing the truth? I'll tell you what: there's one refugee shelter 60 meters from my house another one 400. One is for families, one is for young males. We've never had problems with any of them and all we receive is gratitude for giving them a safe place while their country is a war zone. ", "Find me Obama or Hillary reminiscing about the days protestors or people who weren't fans would leave a crowd on a stretcher or after getting punched in the face. trump romanticises this shit with alarming regularity or did back when people thought they could enter his rallies and make it out unscathed", "It will take years for people to realise that an overwhelming majority of humans want a job or to do some kind of other work for self worth and feeling part of something bigger. I became disabled and had to stop work a handful of years ago and desperately miss the worth and social place that came from.my job. Miss my colleagues and being able to make a difference too (was in education) \nI have a pension and it barely covers medical costs - I am so ready for new technology and medications to be created so I can get back out there again.", "I get what was meant but that's a macabre and hilarious mistake ...gallows humour in context of this election", "Cameraman is a boss stood his ground.", "Yeah that's a strange source to pull from. I understand the massive immigration line tying into it, but it feels dishonest to use a video from another country, when talking about US immigration. ", "I'd love to see an art installation post election with one million rejected hats stacked high and then shredded after Trump himself moves on ( I don't believe he has actual political convictions just an ego with aspirations to level up his status and get revenge on Meyers and Obama)", "Upvoting because the title made me laugh. ", "Vote. If you were planning on voting for Clinton vote even if you think she's already won. You will either run up the score, help down ballot Democrats in your district or state, or best of all: you will help establish your Demographic as important for wlectoral victory, and politicians tend to work hard to keep those viting blocs happy while in power.", "Republicans voted him as the leader of their party.  Do not let them uncouple that.  They are trying to cozy up to him when they think he will win and run away when he is going to lose.  Hold them accountable for this horrible person.", "Just ignore him people like him are the ones standing in the busy streets yelling about the impending doom because of birth control. Or how Obama is the anti-christ.\n\nGiving them attention is the wrong thing to do, because logic and rationality is something they cant comprehend. Have a discussion with them would be like having a discussion with a cow. They just want to spout off their illogical vomit, and feel \"superior\" about how they know something that 99.9999% of the world doesn't.\n\nJust downvote, ignore and live your life.", "Yeah. Try Alabama. Where its like that *and* you get humidity. Its like a hot shower out here all the fucking time. ", "he planned it for close to a year too and was in the us illegally", "This is just so fucking heavy. Those comments are so depressing and scary to read. There seems to be this underlying theme of fetishised violence towards people who aren't on their 'team' (in a political or racial sense).\n\nAll bullshit aside and I know at this stage commenting on the behaviours of Trump supporters is a pretty played-out trope, those comments honestly make me worried for your country. The level of detail they go into when discussing their violent fantasies is particularly scary. It's not a case of:\n\n&gt; Man, I wanna hit that guy!\n\nIt's\n\n&gt; I want to hit that dude's *kneecap* with a *baseball bat*\n\nIt's not:\n\n&gt; Hillary should be executed\n\nIt's:\n\n&gt; Hillary should be executed *via firing squad*, ordered by *Obama*, on the *White House lawn*\n\nNot to excuse the 'tamer' examples, as they're still fucking outrageous things to be in favour of, but the fact that these little scenarios have played out so thoroughly in their head that they're able to go into very specific detail about it is...  well, fucked up. Just fucked up.\n\nHonest to God, America, please don't validate these people. They are enemies of your way of life. They are enemies of Democracy. Fuck, they're enemies of humanity. Please don't allow them to feel like they are justified in thinking this way. They're going to be difficult enough to deal with if Trump loses, imagine how smug and righteous they're going to feel if he *wins*.\n", "Weird you don't sound enlightened.", "OR. OR. Trump told an angry crowd to fuck him up and the Secret Service stepped in when Protesters had their hands around his throat and on his balls.\n \nYou know that thing that actually happened.", "They should with what [Univision put out](http://www.univision.com/noticias/elecciones-2016/nueva-encuesta-nacional-del-voto-hispano-en-los-swing-states-hillary-clinton-vs-donald-trump-elecciones-presidenciales-eeuu-2016-definiran-nuevo-presidente-de-los-estados-unidos) they [should be scared of the coming wave that will come.](https://www.youtube.com/watch?v=gjufSnSCyZs)", "Oh lol I forgot that lovely detail. A year's worth of planning foiled by a fucking holster it's rich.", "Yeah well it's the America trump wants to get rid of and people like you are to blame. ", " But the E MA AA AIILL SSSS", "Which final poll said remain was favored by 10 points?", "Or the guy who rushed him with a knife.", "According to Breitbart.com Don is leading in every poll.  ", "May I ask why you don't care about how sensitive information is handled in your government? If you aren't american I question why you're in a sub devoted to american politics. I just want to know your reasoning. Everyone is entitled to their own thoughts, and you can't make yourself care, just as I can't make myself care for things. ", "He has the best drug test. The greatest. It's positive for EVERYTHING. Only the best drug tests no loser negative drug tests.", "I for one look forward to Republicans humiliating themselves in defense of DST with sob stories about farmers and children going to school in the dark. ", "They made a decision the night of the inaugural balls to sit and plot on how to obstruct the first black president instead of getting shithoused drunk and trying to figure out how to do better next time. \n\nThey shouted You Lie! during his SOTU and he had to fucking respond to claims about his citizenship.\n\nThey made the decision 8 years ago there is no redo bitches ", "A campaign fronted by half the government to sore-loser de-legitimize our sitting president should be expected by now. Republicans were openly obstructionists for Bill Clinton and Obama setting fires instead of helping run the country.", "How is that even remotely legal? ", "I'll never understand people who choose to live in Arizona. Why would anyone want to be somewhere where it's 100+ degrees for *months* at a time? Sounds friggin miserable.", "He bought a book. Can you read or just parrot what your see on T_D?", "As opposed to trump's klan rallies", "Does this mean that Trump owns Reddit Facebook, Fox News, the WSJ, 20th Century Fox and the NY Post?", "Shhh Trumpfart only dreams now.", "Not almost he 100% didn't have a gun.", "Source that he worked for her campaign?", "Go Mormon McMuffin!", "&gt; What the fuck causes this?\n\nBill Weld pointed this out recently.\n\n&gt; \"The horrible thing about the Two Minutes Hate was not that one was obliged to act a part but that it was impossible to avoid joining in. Within thirty seconds any pretence was always unnecessary. A hideous ecstasy of fear and vindictiveness, a desire to kill, to torture, to smash faces in with a sledge hammer, seemed to flow through the whole group of people like an electric current, turning one even against one's will into a grimacing, screaming lunatic. And yet the rage that one felt was an abstract, undirected emotion which could be switched from one object to another like the flame of a blowlamp.\" - *1984* by George Orwell\n\nExcept the Two Minutes is now more bigly. It's Forty Minutes of Hate at each of his rallies.", "Wasn't that guy from Iowa a trump supporter...?", "Tons of people interrupt Clinton rally with \"rapist Bill\" \"Hillary for prison\" signs and it never go violent ", "And admitted when he was wrong. Camacho would be a great president ", "I find it amazing how extreme the hyperbole is around Clinton.\n\nIn no way is she anywhere near as bad as Donald Trump is on literally any level.\n\nThe media is pushing the limits of how far you can take a false equivalence.", "He was like a tough favorite teacher dealing with rowdy high school students.  Losing one's cool &amp; yelling doesn't work.  \n\nBesides the tone of the two rallies was totally different.  In the Trump rally, he had primed &amp; roused the rabble to get aggressive. Obama was speaking positively, to goad his crowd to do better, be better. The Obama crowd hadn't been whipped into a mob.  ", "Incompetent and careless", "*He says looking down at the ground forlornly, as \"All by myself\" begins to play over the speakers. A single tear forms in the corner of his eye and rolls down his cheek.*", "No it's because Trump's followers are idiots and the Trumps know this.", "Secret service did not shout gun the mob attacking the dude did. \n\nThey also then attacked a reporter who tried to film it \n\nhttps://twitter.com/noahgraycnn/status/795078955493490688\n\n", "He didn't have a gun.", "Hillary would be a normal politician over here. I'd prefer her to Merkel Hollande or Juncker.\n\n\nNo one as extreme as Trump has gotten such a vote share in Europe since before WWII.\n\nStop with the false equivalencies.", "Did you know that people resigned from ACORN despite 5 investigations  (2 state 2 federal, 1 private) determining that no illegal activity had occurred? And oh hey, O'Keefe made that video too!\n\nThat people were fired/resigned proves nothing. It's damage control to escape negative publicity. We will only know if illegal activity happened if the people in the video are convicted of a crime.", "Sounds like a new fall show that would be canceled after 3 episodes", "Only one of them did. The average of the polls would have had it at 50/50 almost. ", "So... no poll?", "Remember how she was on drugs during the one debate? ", "A spinoff sub r/IDontLikeRPolitics was started friday night and its 3rd post had 1100 upvotes at ~60% while the sub had 70 online and ~100 subs\n\nThe mod posts in redpill and t_d", "Should we take a page from you guys and shoot for a KKK endorsement?", "They can't let anyone see the real fight either\n\nHere is the mob attacking a CNN reporter\n\nhttps://twitter.com/noahgraycnn/status/795078955493490688", "Most of \"these people\" that we're taking in are women and children who have gone through a multi-year vetting process.", "\"Credible\". He keeps using that word...", "I think one of the best ways to respond to Trump is to laugh. Laugh at his absurdity and don't give it any form of legitimacy or analysis. Treat his ideas for what they are; based upon a crazy entitled and sheltered made up reality in Trump's head.\n\nObama is really good at putting people in their place this way and Hillary has her stoned faced cold look. ", "Make America GMT Again!", "You made a demonstrably false claim and we're called out on it. Own up and apologize or back off.", "He violated trump supporters safe space.", "I am a Republican and supported trump most of the time but I'll give it to Obama he is like Bill Clinton levels of smooth in his speeches, just the whole way he handled it took all the air out of the protestor and in the end he quietly walked out. \n\nThat is the America I want. ", "Yeah we shouldn't throw words around and neither should we throw out words because they make us feel emotionally uneasy.\n\nAttacking federal judges - check\n\nAttacking journalists - check\n\nThreatening to imprison political opponents - check\n\nThreatening to imprison attorneys acting for political opponents - check\n\nDenouncing elections as rigged - check\n\nFomenting violence at election stations - check\n\nFomenting violence at political rallies - check\n\nFomenting violence against political opponents - check\n\nStrong obsession with crime and punishment  - check \n\nDisregard for endangering human rights - check\n\nHeavy fear mongering - check\n\nIdentification of scapegoats/enemies as a unifying cause - check\n\n\n\n**All of this before he has even gained access to the levers of executive power.**\n\nSo please, by which metrics are you *not* labeling him as fascist?", "The title is devised to make it seem hypocritical of Obama for calling out Trump. ", "He had a sign saying \"Republicans against Trump\" that brutal weapon slayed thousands of delicate Trump supporters feelings. Hence why they beat the shit out of him.", "This post has my upvote.\n\nWe need Trump to lose in a complete landslide after the shit he has pulled and a democrat majority senate. Anything else is a loss.", "Thinking back to 2008 he wasn't losing his cool then either.  The guy is a chill dude.  ", "Wow a republican that doesn't like Trump and is voting for Hillary? There must be a few million of those. HW Bush, for one.", "Says every jilted ex-boyfriend ever...", "Is this still a tracking poll? Why yes it is.", "On every corner Donald.  Every fucking corner.", "Private sector job growth after eight years Bush: ↓ 396000; after eight under Obama: ↑ 11,243,000.\n\nWhat is it that republicans are always saying, that Clinton would just keep on pushing Obama's policies?", "Somehow a large chunk of America is convinced that jobs have disappeared over a period of 70+ months of job growth...", "People have liked this article when I've posted it before:  \n[How to build an off-ramp for Trump supporters](https://hbr.org/2016/10/how-to-build-an-exit-ramp-for-trump-supporters)", "The economy in general has improved but people still think it's gotten worse.\n\nThe media just loves to push the \"everything is falling apart\" narrative.\n\nIt's why most people think crime rates are increasing when they've done nothing but decrease.", "Once they feel the power of their vote by sending this clown packing, they will vote in every election for the rest of their lives. They also won't forgive the Republican party for nominating him for a LONG time.", "Jesus Christ the Hispanic number  is +48 for Clinton.\n\nUnbelievable. ", "Bad Hombre Mobile Tacos™\n\nEdit: Kickstarter just needs to approve it. ", "Just note that his audience is a willing and eager participant they have more than half the country telling them their candidate is filling their ears with dogshit and they'll attack you for saying it. Yes he's grasping for fascism, but his people WANT IT. THEY are the problem, he's just one shithead. ", "Twenty years from now when kids learn about Trump and Birther movement in school, they will be shocked and amazed; they will think more highly of Obama because of the obstructionists.\n\nThink of it this way, when was the last time you saw a movie about the Red Scare where McCarthy was a hero?", "At the polling place I went to they told me it was a 90 minute wait all day from start until close.  The polling people joked there couldn't be anyone left to vote come election day", "That is an excellent article. It is almost like deprogramming someone from brain washing. We have so much work going forward trying to heal and move our nation forward especially if things get crazy after Tuesday. ", "Like that old saying goes: \"As goes Scotland so goes the nation.\"", "There's actually some interesting research but I can't find it right now it was on gender differences in our primaries.\n\nSo when a woman runs as a democrat she's just as likely to win her primary and just as likely to win her election as a man is.\n\nBut when you look at republican primaries women are viewed as more \"moderate\" and get less help from the GOP for a number of reasons.\n\nIf republicans fixed their primaries they'd probably be getting more diverse as well.", "People have to deradicalise millions of family members and friends once this election is over.", "What if after everything this campaign has been through, it turns out that none of it actually mattered. Emails didn't matter. Pussy grabbing didn't matter. Everyone just made up their minds a year ago and the final result has been locked in since then", "now if only us minorities can take this fire we have for voting into mid term elections too so we can make changes that really matter.   \n  \nthe only depressing part is its inevitable this progress will be unfairly scrutinized by republicans as illegals immigrants voting and voter fraud because they just can't help themselves and refuse to acknowledge that beyond the religious base they offer nothing to any minority so they don't get votes. they will blame voter fraud and a need for a voter ID laws even though around me i can only vote at the place im registered and i have to sign my name next to my printed name on a form indicating i have voted and can't vote again ", "Taco trucks forever!", "To be fair they had just done like a 12 hour shift so I think it was more of a joke to help them get through the final days of that madness ", "Hoo boy I'm *certain* they couldn't be anymore wrong and I hope they're ready. ", "And here come the compassionate Christians to shit all over this pope", "Guy is sure capable of making a point. ", "&gt;“What’s telling is that in terms of early voters, Fulton and DeKalb are far ahead of their early voting numbers from the last election,” said Emory professor of political science Alan Abramowitz. “If early voting is an indicator of actual turnout, it could mean we’ll see a high turnout from Georgia’s two most heavily Democratic counties.\n\n", "&gt; it feels dishonest to use a video from another country when talking about US immigration.\n\nIt is dishonest, but it goes further than that. He would have happily used video of the US, but nothing comparable exists. It's not a case of simply showing the wrong country, it's a case of showing a problem that doesn't exist in this country in the first place.", "Last election I put together a demographic study of members of Congress and the discrepancy between democrats and republicans in almost all demographics was amazing.  \n\nDemocrat women accounted for  ~~80%~~  75% of all women in Congress.\n\nBlack democrats were 95%.\n\nLatino democrats ~~the same~~ 70%.\n\nSame for Jews in Congress.\n\nAsians in Congress. \n\nOnly demographic republicans dominated was white males.", "But he already wished them \"[Happy #CincoDeMayo!](https://twitter.com/realdonaldtrump/status/728297587418247168?lang=en)\" said he loved Hispanics, and appeared* to be eating from a taco bowl. What more do they want!\n\n\n**I say 'appeared,' because I can't tell if he actually ate  any.*", "Thanks for the laughs.", "&gt;fascism is \"a form of political behavior marked by obsessive preoccupation with community decline humiliation, or victimhood and by compensatory cults of unity, energy, and purity, in which a mass-based party of committed nationalist militants, working in uneasy but effective collaboration with traditional elites, abandons democratic liberties and pursues with redemptive violence and without ethical or legal restraints goals of internal cleansing and external expansion.\"", "HOPEFULLY... people will have to go back to their jobs.  They will continue to bitch and moan about Obama being a Muslim or Hilary being a nasty woman... but that'll be it.  Hopefully the air will be let out of them and they will be defeated.  \n\nUnlesss someone fans the fire.  Which is why i believe everyone was so pissed about Trump saying he may not accept the results of the election.  Aka he might fan the fire.  And after you've lost... well shit, what do you do now?  That's what is scary. ", "You've got 99 problems but a switch ain't one.", "\\*timidly raises hand\\*\n\nAm a Christian. I love this Pope. He's a good Pope. ", "Watch for places like the suburbs  in Cobb County to have a higher margin than usual of Republicans crossing party lines at the top of the ticket.  Lotta college educated voters in those areas that just can't stomach Trump ", "[will this do?](http://static1.gamespot.com/uploads/original/608/6081318/3101921-make-america-great-again-hat-donald-trump.jpg)", "[In a country that is ~63% White](https://nrelecopress1.files.wordpress.com/2014/05/figure-1.jpg)\n\n* [95% of the GOP congress  is white.](http://talkingpointsmemo.com/dc/breakdown-114th-congress-demographics-gender)\n\n&amp;nbsp;\n\n[In a country where ~70% of *voters* are White:](https://www.washingtonpost.com/blogs/plum-line/wp/2015/07/10/the-demographics-of-2016-look-brutal-for-republicans/)\n\n* [90% of all GOP voters are white.](http://www.gallup.com/poll/142826/republicans-remain-disproportionately-white-religious.aspx)\n\n* [95% of all GOP congressional districts are majority white](http://www.washingtonpost.com/news/wonkblog/wp/2014/08/12/95-of-republican-house-districts-are-majority-white/)\n\n&amp;nbsp;\n\nIn the 2014 Midterm election:\n\n* 100% of the new GOP senators were white.\n\n* 96%  of the new GOP House members were white.\n\n&amp;nbsp;\n\n\nIn the 2016 GOP presidential primaries: \n\n* [95% of Republican primary voters are white.](http://blogs.wsj.com/washwire/2015/03/16/fallout-from-the-gops-lack-of-diversity/) \n\n&amp;nbsp;\n", "Plus they were blocking the guys shot with their signs.  Those supporters knew damn well that guy didn't have a gun and they attacked him for his sign.  When the press showed up to film it they blocked him and attacked him as well.\n\nTrump supporters are the scum of the earth.", "Harry Enten predicted this exact margin in Sunday's poll days ago...\n\nSpooky...", "Their mental gymnastics are getting more and more elaborate. They can't for a moment look themselves in the mirror and see that there is a hateful violent streak in their campaign. ", "Remember all the shit the right threw at Obama? Now they're doing the same thing to Hillary and it makes me think she's probably not nearly as bad as they say. I don't expect great things from her presidency but I also don't expect her to be a complete fuck-up.", "http://www.nydailynews.com/news/politics/donald-trump-caught-creeping-ex-wife-cinco-de-mayo-tweet-article-1.2626635\n\nTrump manages to have bikini picture of ex-wife in pic of him eating from taco bowl.\n\nTrump cannot stop screwing up", "Build a wall to keep away from thy neighbor. Then make them pay for it. - Antichrist", "It's okay. This was Trump supporters favorite poll this week. \n\nI wonder if they will still mention it every chance they get?", "Trump is telling them that the jobs reports are all false and up to 40% of Americans are unemployed and since they believe everything he says it's true.", "The least I can do for such a good president is vote for his chosen successor.", " Trump endorsements:\n\n* Andrew Anglin Publisher of the neo-Nazi website The Daily Stormer \n\n* Matthew Heimbach,  founder of a white nationalist group; the Traditionalist Worker Party.\n\n\n* Rocky J. Suhayda, chair of the American Nazi Party\n\n*  Don Black: Former KKK grand dragon and founder of the white supremacist website Stormfront \n\n\n* Brad Griffin, writer  for the white nationalist blog Occidental Dissent\n\n* Peter Brimelow, the founder of the extreme anti-immigration Vdare.com \n\n* Earl Holt, the president of the Council of Conservative Citizens\n\n* Jared Taylor, who runs the site American Renaissance\n\n\n* John Friend, far right radio show host, Holocaust denier.\n\n* Richard B. Spencer, the president of the white nationalist National Policy Institute\n\n*  Alex Jones: birther, 9/11 truther, infowars.com\n\n* White Supremacist, former Klan leader David Duke \n\n* Hal Turner, white nationalist, holocaust denier, radio host\n\n* White nationalist leader James Edwards. \n\n*  Rachel Pendergraft, National organizer for the KKK-affiliated Knights Party\n\n* Alex Linder: Vanguard News Network, former member of the Neo-Nazi National Alliance \n\n* Vanguard News Network: \"Trump is the Last Hope for Whites before America turns brown\"\n\n\n\n\n\nInternational:\n\n\n* [Jean-Marie Le Pen, leader of France's National Front party](https://www.theguardian.com/us-news/2016/feb/27/jean-marie-le-pen-endorses-donald-trump)\n\n* [Nigel Farage, Leader Britian's UKIP, far-right anti-immigrant, anti-EU party](http://www.cnn.com/2016/08/24/politics/donald-trump-nigel-farage/)\n\n* [Serb Who Inspired Ethnic Cleansing of Bosnia Leads “Vote Trump” Rally in Belgrade](https://theintercept.com/2016/08/16/serb-inspired-ethnic-cleansing-bosnia-leads-vote-trump-rally-belgrade)\n\n* [Czech Anti-Muslim Parlimentary Party](https://www.youtube.com/watch?v=GbzB5f3v_18)\n\n* [Vladimir Zhirinovsky, Russian anti-immigrant, nationalist, anti-American](http://www.bloomberg.com/news/articles/2016-08-03/russian-maverick-prays-for-trump-win-to-cement-new-global-order) \n* \n[Italy's pro-Fascist party](https://twitter.com/matteosalvinimi/status/724874376269692928?ref_src=twsrc%5Etfw)\n\n* [Greece's neo-nazi Golden Dawn party](http://www.timesofisrael.com/greek-neo-nazi-party-golden-dawn-endorses-trump/)", "Maybe he should warn churches not to call voting for dems a guaranteed path to hell.", "The way the entire migration crisis was handled in Hungary was one of the lowest points in the recent history of the country absolutely appalling, filled to the brim with demagogy. \n\nI really hope the US doesn't go down a similar path.", "Swamp not yet drained. But they removed all the grass and bushes that prevented us from seeing and noticing that swamp.", "Yes please lets pretend both sides are doing it equally.", "Honestly I don't think Professor Obama ever really left. That's always seemed to me to be the embodiment of his style. Man I can't wait until that dude is old as fuck telling this country what time it is.", "Gah another freaking tracking poll!", "Please I saw a grand total of like 3 people with facial hair. Don't turn this into a beard thing. My decision not to shave has nothing to do with the trump camp.", "I agree... but... can we just be careful about phrasing since Trump is a master misinterpreter? He probably read that as:\n\n&gt;Barack Obama'\u0080\u0099s Criminal~~ly Underrated Jobs~~ Record.", "Kinda' funny how Trump would claim that a man an American born man for that matter, can not do his job as a judge because of his Mexican ancestry.\n\nTrump is no friend to any Hispanic person, be they documented, undocumented or natural born citizens.", "Remember when this was satire?", "&gt; Does anyone know what these two assholes have actually promised\n\nYes actually. Hillary Clinton has a website that is filled with pages and pages of her policy plans and ways to implement them. \n\nDrumpf has promised to....make America great somehow, but he says he needs to keep it a secret.\n\nGet the fuck off the planet with your \"both sides are the same\" bullshit.", "He was being pressured and twisted by the GOP and Trump camps.   Keep in mind however he is a staunch Republican and in the end will put party before country.   ", "&gt; Violence comes from both sides. \n\nDon't pretend both sides are equal.\n\nViolence is only *sanctioned* by one side. Clinton opposes violence.\n\nTrump openly *calls* for violence.", "They're both the problem.", "I believe you trumpets like this phrase so I'll use it since it fits you so well. \n\nLol u triggered? ", "yeah you still have to vote. this is not a done deal by any means.", "I wonder to what degree, that's because democrats dominate those demographics overall.\n\nThe latino one is a bit sketchy considering the GOP was winning about 30-40% of latinos until Obama, you'd expect to see more.\n\nI'm guessing a lot of GOP districts suffer from extreme racism still and it's basically impossible for a black/latino to win a primary.\n\nAt some point, the GOP is going to have to try to appeal to more than 1 demographic. The demographic crisis they're facing is extreme.\n\nThey lose women.\n\nThey lose latinos.\n\nThey lose African Americans.\n\nThey lose college educated.\n\nThe only demographics they do well with are older white people. But the dems are winning this generation like 60-40% which is fatal to them if it stays that way.", "Just Rudy Giuliani... and that's all I need. And Ted Nugent. Just Rudy Giuliani and Ted Nugent that's all I need. I need Scott Baio! Scott Baio, Rudy Giuliani.... and Ted Nugent. And that's all I need. ", "That picture's composition is fantastic. ", "They flood online polls with bots and then brag about it so it's not too surprising.", "Yes. Domestic terrorism. Scum of the Earth. See Oklahoma City Bombing. \n\nPeople also forget that George H. Bush broke with the NRA when they called federal agencies \"Jackbooted thugs.\" There was a time when Republicans stood up against crazy idiots because that's what True Americans do. Country before party. ", "&gt;Ultimately Latinos will vote for Trump because he is the candidate that will create jobs for them.\n\nPlease inform Univision because [they're saying something different](http://www.univision.com/noticias/elecciones-2016/nueva-encuesta-nacional-del-voto-hispano-en-los-swing-states-hillary-clinton-vs-donald-trump-elecciones-presidenciales-eeuu-2016-definiran-nuevo-presidente-de-los-estados-unidos)", "&gt;The GOP nominee was complaining at a rally in Denver Colorado that the language at a get-out-the-vote concert headlined by Jay Z and Beyonce was \"filthy\" by \"any standard.\"\n\nTranslation from Dog Whistle: \"Black celebrities are bringing down White culture with their hip hop music, which is worse than good ol' wholesome country music songs about shooting your spouse.\"", "you could say it was...\n\nRIGGED", "It does and the tanking of his polls was unprecedented.  ", "False equivalency is really the devil of this election. Claiming that both sides are just as bad as the other only makes everyone cynical about the system and benefits one side, the \"Let's blow everything up\" side, more than the other.", "Funny story about that guy. That account used to be called \"AngryGOTFan\" run by the same guy and he'd get very mad whenever Game of Thrones would deviate from the books and he worships GRRM. He follows me still and I've considered spamming him with the article where GRRM denounces the republican nominee but I don't have the will.", "&gt;It seems possible however, that the ad is intentionally misleading, and hopes to conflate the situation in the U.S. with the huge number of migrants seeking refuge in Europe from wars in Syria, Iraq and Afghanistan.\n\nWell, no shit. There isn't crowds of tens of thousands walking from Mexico or Canada in broad daylight, crossing into the US. So where else is Trump going to find such clips other than lifting videos of what's happening in Europe?", "Normally a group like the Klan would keep a presidential endorsement quiet because most of them are aware that it could hurt the candidate they prefer. Not this time. This time they are open because they believe it *won't* hurt Trump. Trump has been normalizing bigotry and that is scary no matter what color religion, or orientation you happen to be.", "He mad", "Son we're talking about your lot attacking a protester.  Now isn't the time for you to deflect, now's the time for you to shut the hell up and pretend it isn't happening.", "The man was released without charges because carrying a sign is not illegal ", "Well we don't burn down Democrat state headquarters and attack people with Hillary signs. Unlike Clinton supporters. ", "considering trumps track record i highly doubt he will create more jobs. Because of his history the important part to ask is if those jobs actually pay money since he is known to not pay workers and has to be sued to get the money if he doesn't declare bankruptcy first ", "He VERY mad. He comment history scary.", "Orban is a fascist through and through no dog whistles with that guy.", "You mean the wall that was built centuries ago? God damn it why doesn't the Pope just bulldoze historical artifacts?!?!", "You're right. He could just be dangerously incompetent and politically cowered.", "Pope &gt; Pepe.", "Check his comment history. He so triggered Smith and Wesson are hiring him to fill factory orders.", "Let me know when politics starts doxxing people and planning armed attacks if they lose. It's bad enough  the_donald gets away with brigading and suppressing any and all reasonable voices but that at least doesn't do any real harm. \n\nIt's weird how desperate people are to harp on the \"both sides are the same\" meme when it hasn't been true for a long time and it's never been more obvious than now.", "I know you jest  but it's so entertaining to me that the central controversy of this campaign season has been something as mundane as emails. Not drugs or hookers or really anything interesting, but emails.", "He's actually underperforming Brexit as Leave was tied with Remain", "&gt;Straight out of /r/conspiracy.\n\n&gt;Honestly I am surprised he hasn't claimed Obama is a Satan worshipper because he had a bandaid on yet. That got upvoted on both /r/conspiracy and /r/the_donald.\n\n...Y....you're fucking kidding right??", "\"What is even a Putin?\"\n\nTopped off by the on the lips kiss is my favorite of the night ", "Ima let you in on a secret. \n\nBeing a fan of a musician has no bearing on intelligence. This might be shocking to you but think it over for a while. ", "Shut your mouth.\n\nPlease.\n\nDon't do that.", "They told you to vote no who to vote for.", "Even 1 significant bad one...  Like saying a murderer didn't murder 95% of people they knew", "That is insanity. Hillary has put out so much policy the press won't even read it. \n\n", "Reluctant Germans let people get gassed.", "I hope so. I do wonder and worry how many whites that typically don't vote have registered and will vote because Trump brought them out. ", "Allow me to propose a solution to these long lines:\n\nOpen more polling stations! \n\nLong lines are a sure sign of voter suppression.", "&gt; “Last night in Clark County, they kept a poll open till 10 o’clock at night so a certain group could vote,” said McDonald at a Trump rally in Reno. “It wasn’t in an area that normally has high transition. The polls are supposed to close at 7. This was kept open till 10. Yeah, you feel free right now? Think this is a free or easy election?”\n\nNo, you piece of shit, you keep the polls open until everyone has voted- everywhere. Nevada, North Carolina, Maryland, Oklahoma. You're supposed to give everyone as much of a chance to vote as you possibly can, and if that means holding the polls open late, *tough shit*, you respect the fact that your citizenry actually want to engage in the democratic process. You buy your poll people extra coffee and donuts and you hold the polls open past their planned closing time until the line dwindles to nothing.", "Given Obama's well, entire elected history. I just can't see how Trump thinks this is even remotely going to stick.", "In conservative mythology Obama is an elitist condescending jerk who talks down to \"real Americans.\" So yeah, this narrative will stick to the base.", "If you're a candidate complaining about \"certain\" voters and trying to close down polling stations early that is a bad sign.\n\nTrump is all about voter suppression and he doesn't seem to care that anyone knows it.  It's so anti-freedom and anti-American.  \n\nIt's baffling to me.  Is he that stupid? \n\n", "Just two more days until this nightmare is over and I can breathe easily. I am so glad that I voted early.", "[Here's the interview with Megyn Kelly where Giuliani say FBI agents are talking to him.](https://www.youtube.com/watch?v=Kvo5N1kz-Tk). He's very clear about it. So he's either lying out his ass in this interview or he's lying out his ass now. \n\nOr, you know, Rudy is an attention whore who lies as much as Trump, and for the same reasons.", "*\"personality concerns\"*\n\nHe is one of the most dreadful people ever to be given attention to", "Damn those legal immigrants. ", "It would be amazing if the quiet vote all turned out for Hilary and absolutely annihilated the Trump once and for all.", "So Obama raised overall employment massively while shrinking government? Thanks Obama!!!\n\nOut of curiosity does that stat include military? Because that would about account for most of it.\n\n", "This trend of early voting needs to continue. Every citizen should have ample opportunities and multiple methods available to them for casting their vote. It blows my mind that voter suppression is not a bi-partisan stance", "Princeton with less than 1/100 chance for Trump\n\n538 with over 1/3 chance for Trump\n\nHow can 2 groups of smart people come to such different conclusions with the same data? ", "Trump didn't just piss off Latinos for this election.  I think he created an enemy for generations to come.  For your party to endorse someone who called an entire race of people rapists?\n\nWow.  ", "It would also be nice if it were millennials in record turnout.", "The GOP is going to double down on the bigotry even if Trump loses aren't they?", "Combined with +90 AA and +13 women. It's not over until it's over but as long as everyone votes, it could be a landslide", "There is also the fact that non-college educated white males were seen as default second to educated ones this group has lost jobs while others are gaining them. \n\nI know out of college I worked with some guys who had lucked into systems jobs before computer science degrees were needed, now they're taking orders from 21 year old women with master's degrees. \n\nIt *feels* bad \n\n\nEdit: oh wow haha \"srssucks\" posted this and I have people calling me anti-white", "In the end he will make America great again by starting the destruction of the republican party. Donaldo, the true hero. ", "From another comment I made.\n\nI am really starting to understand how Nazi Germany happened.  There is a section from They Thought They Were Free that fits well.\n\nNow I see a little better how Nazism overcame Germany - not by attack from without or by subversion from within but with a whoop and a holler. It was what most Germans wanted - or, under pressure of combined reality and illusion, came to want. They wanted it; they got it; and they liked it.\n\nI came home a little bit afraid for my country, afraid of what it might want, and get, and like, under combined pressure of reality and illusion. I felt - and feel - that it was not German Man that I met, but Man. He happened to be in Germany under certain conditions. He might be here under certain conditions. He might, under certain conditions, be I.\n\nIf I - and my countrymen - ever succumbed to that concatenation of conditions, no Constitution, no laws, no police, and certainly no army would be able to protect us from harm.", "\"What is even a Putin?\" *Putin kisses him on the lips*\n\n\nIt was fantastic ", "If we dont make this guy pay after the election and I mean pay with every cent he claims he has, we have failed as a country. ", "Latinos are lining up like it's Black Friday Sales and they're not buying what Trump is selling.", "Indeed. It's frustrating that there are no restrictions on distorting the truth. The deregulating of the FCC in the midst of the information age is just such a bad idea. All these phony websites and news outlets that stretch the truth are likely leading to the spread of misinformation and  the increased polarization of politics.", "Who proposes national stop and frisk? Donald Trump. \n\nLaw and order unless the courts rule one way then it is wrong and stupid.", "Every time you suggest that Trump and his tactics are similar too Hitler and his rise of authoritarian racism on an angry and accepting population you get someone who's argument is, \"That couldn't happen here because ___________ wouldn't let it.\"\n\nIt's super important to note that the United States doesn't have some magical built in anti-dictator device. Romans didn't think letting Caesar enter Rome with his army was going to end their proud republics, but it did. Germans didn't think appeasing Hitler's angry followers would lead to the end of their republic, but it did. \n\nThe United States isn't immune to some jackass deciding to pursue the same path. Our only defense is to recognize an authoritarian demagogue and to vote against him in a landslide. Trump has convinced 40% of this country that has not a wolf in sheep's clothing, the 60% cannot be fooled. ", "Trump seems to have a loose connection with reality.\n\nHe's also still claiming someone tried to kill him.", "Wang [tweeted](https://twitter.com/SamWangPhD/status/795007244756799489) yesterday that his model probably should be recalibrated leading to about a 91-93% chance. Pretty big difference from losing 1 in a 100 to 1 in 11.", "Yeah but according to r/the_duckfucker Latinos were all super excited when Cheesus Christ called their brothers/fathers/uncles/friends murders and rapists and are all super excited to elect someone who is ready to call out their members based on no factual evidence\n\nNo...seriously... They've repeatedly said this... ", "I posted in a thread on the_donald and questioned their sensationalism with the assassination headline. It seems a bit hypocritical to cry about the media being corrupt and then up vote baseless claims that are absolutely fabricated.\n\nI was promptly banned from posting there. Pretty much exactly how they handle any differing opinion in real life too apparently.", "NV GOP have actually just caught onto what has been happening in early voting. Now they want to cry foul because they probably lost NV through the DEM ground game.  ", "I think the challenge this year is to recognize that a lot of Trump supporters have a legitimate grievance (the system is rigged things are not getting better for a lot of people) and to them the status quo (Clinton) doesn't feel right. Those will be the people to reach out to.", "Who's bright idea was it to let brown and black people vote anyways?  #sarcasm.", "&gt; If someone actually yelled \"gun!\" like people are reporting\n\nYeah they did. It's audible in the videos. I agree the secret service just did their jobs.", "I'm glad. This election is a semi-truck filled to the rim with implications that could potentially affect every person living and yet to be alive in this country for ages. We need to put forward a serious message to every person we can. We have a man who is beyond insane by every objective standpoint in a position to potentially become the most powerful man in the world and people need to understand this to the greatest extent we can put across. People need to understand the amount of blood, effort and time that thousands and thousands of people have spent exerting for hundreds of years to make this country the tolerant place it is, and how all those lives and years of trying can be wasted with the cast of a vote. This is more than a petty election, this is a decision that a handful of people will make that can either save or ruin the world for everybody else and either realize or nullify the progress granted by thousands of selfless individuals over time. \n\nVote responsibly. ", "When the story of this election is written it will be noted that Trump's campaign started on an escalator in Manhattan, and died in a Latino Grocery store in Clark County Nevada.", "Yes... yes... trump is going to overtake Clinton.  No need to go out and vote Trump supporters.  He's already got this.", "If I understand it correctly 538 assumes that, should a state move towards one candidate, similar states will as well. Princeton's argument is that this shouldn't make a difference on election day so states can be treated as independent probabilities (giving Clinton a very good probability of winning).\n\nThe main argument for 538s uncertainty is that there could be systemic polling biases (ie. Hispanics underrepresented, Trump supporters who are afraid to admit it, etc.) - which would likely result in *all* the polls being off in one direction.", "There is no way to know voting totals yet. I am a Hillary supporter but this is bullshit and we don't need to post it. JUST VOTE.", "But public sector job growth under Bush was impressive.\n\nBush:  ↑ 1744,000\n\nObama: ↓ 503,000\n\n[sauce](http://www.calculatedriskblog.com/2016/06/public-and-private-sector-payroll-jobs.html)", "I've tried and failed. My uncle is a retired multimillionaire and while most of his money is in bonds he still has five million dollars in stocks. I tried explaining that the market already priced in a Hillary victory and Trump winning would be an immediate 5-10% fall in the market. Then I explained how his economic policies would lead to recession and set the economy back years. He simply responded with \"but I'm worried about the Supreme Court\" and then changed the subject. I just don't get it. I guess some people prefer to deprive others of their rights instead of improving their own economic situation. ", "Found the Trump voter.", "Except in Brexit", "Dem ground game plus extreme motivation constantly being provided by the Reps equals a huge turn out.", "I actually want constant daylight savings time", "She's the liar! She's corrupt! Now listen to my lies to cover up my corruption.", "Convinced someone to vote Democrat yesterday:\n\n\"If you want the unemployment rate to stay below 5% then you should support the same economic system that got us here and out of the recession.\"", "Leading up to the election we heard that voter apathy would be at an all time high it's good to see that's not the case.", "Their answer appears to be to stop those people from voting whenever possible instead of considering that they might be the problem. ", "Amen brother.  I made sure everyone I knew went out and early voted against him ", "I hope you guys don't let him win your state.", "inb4 \"uhh actually, he meant only the ILLEGAL ones.\"", "Hopefully this is blasted on all Spanish speaking media for the next 2 days. Get that turnout even higher.", "I did the same thing.\n\nHere's an interesting anecdote.  The biggest minority group within the GOP was Hispanics at 13/300 congressmen and senators. (4%)\n\nOf those 13 9 come from a single national origin; Cuba.\n\n\n&amp;nbsp;\n\nAlso, you mentioned Jews. As white as the GOP is (95%), it's even more christian.  There is a single non-christian among the 300 republicans serving in Washington.  (99.4% christian)", "I hope millennials take their passion and organize to run down ballot candidates they can agree with. Those people become the Presidential  candidates in the future.", "When is the last time SNL did anything like this? I feel like it's unprecedented", "How fitting it would be for the Latino community to rebuke Trump this cycle...\n\nI come from an immigrant background -- not Latino but close culturally -- and the immigration debates this cycle have really bothered me. I could only imagine how our Latino brethren feel.", "Damn that is pretty ominous. I've never seen the media be so serious regarding an election. It's either that or we're just reaching a point where everything has to be hyperbole in order to get any attention", "This is the correct position.  More day late during waking hours please.  If we're going to stay on a 40 hour 9-5 work week standard it might be nice if for large parts of the year we could, you know, see daylight for a bit.", "Let's not even try to hide it anymore.  Nobody cares about facts.", "Because Trumpists believe literally anything their God Emperor says even if their own eyes and ears tell them otherwise. They've completely subsumed themselves to his will. In any other scenario it'd be pitiable.", "This kills the Fox News.", "Minorities love our racism!! -r/the_dumpsterfire", "Personally nothing in either campaign has made me even slightly reconsider.", "Trump's willingness to lie continuously should be disqualifying.", "Some of them were born here and Obama is letting them stay and take jobs from real Americans. Build the wall! ", "My dad actually did not go out and vote for Romney because he was so sure there was noway he could lose. ", "A hundred years taco trucks! ", "Relevant:\n\n&gt; [Nate Cohn ‏@Nate_Cohn 26 minutes ago](https://twitter.com/Nate_Cohn/status/795252390199001088) \n\n&gt; NC early vote near final tallies:\n\n&gt; 3.098m\n\n&gt; D 41.7, R 31.9\n\n&gt; W 70.7, B 22.2\n\n&gt; F 55.5, M 42.2\n\n&gt; 18-29: 13.1\n\n&gt; 65+ 27.6\n\nI hope everyone makes sure they do their bit. \n", "FYI America is ripe for Facism. ", "If it doesn't flip this election you can be damn sure it'll be purple in 2020.", "You see if it's a legitimate Mexican, North Carolina GOP will find a way to shut that down.", "We need stronger laws controlling the frequency of political ads period. I feel like a prisoner in my own home; bombarded with the same nonstop TV ads, fliers in the mail, and phone calls. \n\nThere needs to be a limit to the number of political ads shown over the course of a day, and the number of times a party can call someone. \n\nIt has reached a point where it is truly maddening. ", "They're just mad that they put all their effort into suppressing votes in North Carolina.", "Concerned Republicans. Where serial sexual assault is merely a character defect. Classy. ", "I'd assume so. Federal workers weren't really let go while the military took an active roll in trying to shrink itself through disciplinary actions. Separating members for what most would consider minor infractions. By mid of 2013 it was possible you could be kicked out for failing a PT test twice in a row. It was pretty fuckin bad. ", "Kicked and punched the dude.  And he's a republican.  ", "Is this a satire account?\n\nYou know Trump is the most economically illiterate person to ever run for office right?", "Ugh the God Empepror part really makes me sick....\n\nMost of the \"patriots\" posting in r/The_Donald are all about their freedom and liberty but apparently don't see the irony in their leader being an authoritarian.", "RCP has no methodology other than taking an average...  I never put much weight into their numbers but it's good if you just want to see an easy aggregate.  ", "They will quietly transistion the hotels etc to Ivanka and Trump himself will the face of TrumpTV.", "How in the world will the GOP be even competitive in this country for presidential election if they've already lost the demographic battle which is widening every year?", "Manufactoring jobs aren't good jobs. They are shit jobs that are being automated.", "Still very confident. Especially with the news that Schale told Obama that Hillary is cruising to victory in Florida\n\n", "Thank you. We don't want to lose America.", "That is such garbage logic and in no way a defensible position ", "The problem isn't \"new jobs\" being added it's that the good jobs are gone and the \"new jobs\" are shit.\n\n&gt;That same year saw new lows, with 17,000 manufacturing workers losing their jobs in one blow. [**For every manufacturing job that was added, 26 new bartenders, waitresses and cooks donned their aprons**](http://www.investopedia.com/articles/markets/042716/more-waiters-and-bartenders-manufacturing-workers-spells-trouble.asp)  In short, America gained 1.5 million waiters and bartenders since the millennium, and lost 1.4 million manufacturers over the same period.\n\n\n", "Not bullshit. TargetSmart has a model that correlates publicly available information about who has voted with polling data which provides insight into who they're likely to have voted for. The model might turn out to be wrong but it's a rigorous methodology.\n\nIf you're concerned that information that Clinton is doing well will lead to complacency, there's no evidence that that's the case, and there *is* evidence to the contrary - I.e., that learning that a candidate is doing well helps drive overperformance.\n\nMore here: http://election.princeton.edu/2016/11/05/confidence-is-associated-with-increased-turnout/", "That's hilarious -- 30 year old pictures of his ex-wife on his desk. \n\nSays a lot about the man", "This is without a doubt the ugliest and most embarrassing election I have ever seen.", "Reminder that RCP's average had Obama up 0.7 right before the 2012 election and he ended up winning by 3.9. RCP currently has Hillary up 1.4.\n\nhttp://www.realclearpolitics.com/epolls/2012/president/us/general_election_romney_vs_obama-1171.html", "I am just imagining two old white guys sitting at a table.\n\n\"We have successfully blocked African American voters. The Presidency is ours.\"\n\n\"The Mexicans! We forgot the Mexicans!\"", "&gt;  but his people WANT IT. \n\nWithout Trump this would have never happened. Yes the people want it (they probably wanted it in 2004, 2008, and 2012 let's be honest), but no elected republican would go for it. You saw how appalled everyone in the primaries where at Trump (well, all the serious candidates. Again, previously elected officials, I'm ignoring obvious scams like Carson), and how shocked they were that his methods where winning. JEB even called it fascist very early on, straight up. \n\nThe problem is now the beast has been unleashed and opportunistic bastards everywhere will be trying to emulate Trump's behavior, and hopefully, Trump's success. ", "This is the most accurate statement I've ever read on Reddit. Thank you. ", "I never thought about it like that that's a great analogy. ", "I still marvel at the power the right wing media seems to have over otherwise intelligent and educated people. ", "[Donald Trump warns that 650 million immigrants could come to the U.S. in a week....](https://www.washingtonpost.com/news/the-fix/wp/2016/10/31/donald-trump-warns-that-650-million-immigrants-could-come-to-the-u-s-in-a-week-lets-do-the-math/) thats right even though it took us 200+yrs to reach 319m in this country.\n\n", "In Trump's America any dissent against the Orange King must be handled violently. ", "To any disaffected Dem or Liberal considering not voting for Hillary I'm not going to try and change your mind with HRC's qualifications or what a disaster Trump will be.\n\nInstead:\n\nThink about Wednesday, if Trump wins and Republicans hold the Senate and Congress.\n\nThe day after the election, Republican Speaker of the House Paul Ryan and Republican Senate Majority Leader Mitch McConnell will hold a press conference.\n\nThe theme of their speech is going to go something like this:\n\n\"With President-Elect Donald Trump and the Republican victories in both the House and the Senate, the American people have sent a clear message rejecting the past 8 years of liberal policies and the Obama/Clinton vision for America.\"\n\n\"America is a Center/Right nation, and the people have spoken. We have been given a clear mandate to repeal Obamacare, roll back job-killing regulations, cut high taxes, and get rid of liberal social programs.\"\n\nExpect also stated plans to immediately confirm Trump's Supreme Court nominee right after the Inauguration, an intent to defund PBS, revamp Social Security, and cut all federal funding to Planned Parenthood. Oh, the Filibuster? Well, payback's a bitch. Good luck obstructing anything, Senate Dems.\n\nImagine that smug look on both of Mitch and Paul's faces, the empowerment of Congressman like Ted Cruz, and the condescending and self-satisfied tone of every conservative talking head you see on TV for the next few years.\n\nAlso imagine all the \"told you so\" language coming from /r/the_don because this scenario is basically their wet dreams come true.\n\nIf you vote for a third party, you don't exist to this new Republican supermajority. They're not going to say \"thanks Bernie or Jill supporters, we hear you and are gonna consider your wants.\"\n\nYou can help prevent all of this from happening. President Trump is one thing, but if they control the White House, the Senate, and the House, they're going to exact payback on Obama and everything progressives have fought for.\n\nDemocrats will have no voice or seat at the table.\n\nThis is going to be a close election, like Florida in the year 2000 close. I know HRC isn't perfect and the DNC has had problems, but you have two choices for the next 4 years:\n\nBe frustrated your President isn't liberal enough and work to pull her to the left, or be ignored entirely.\n\n\n\n", "I feel like Alec Baldwin put it best: \"It doesn't matter. I said it and now half the country believes it.\"", "&gt; Long lines are a sure sign of voter suppression.\n\nExactly. I live in the Netherlands and never in my life have I had to wait longer than 3 minutes in line to vote. Now I fully understand that in a large country that is not as densely populated as the Netherlands it's a more complex logistical challenge to set up enough polling places, but **hours** is nothing less than disgraceful.", "To be fair I recall during the Romney/Obama race, economists predicted that roughly [12 million jobs would be created no matter who was in office](http://www.npr.org/sections/itsallpolitics/2012/10/26/163719000/economists-romneys-12-million-jobs-target-realistic-even-if-he-loses). I miss those days when even when I disagreed with a GOP candidate they were most likely still competent.", "So delicious.\n\nOh and Republicans?  Fifty thousand latinos turn 18 EVERY MONTH.\n\nThis is your nightmare, and you did it to yourself.", "Truly ironic too, since Trump meant buy the guy a nice dinner.", "I saw an interview with her predecessor Alex Salmond, right at the start of Trumps campaign where he was asked where he'll be if Trump gets elected? His reply was 'probably Antarctica, a long way from where the nuclear missiles are pointed' \n\nHe was in charge when Trump wanted to build his controversial golf course... something which he and everyone involved seems to regret ", "You see one thing minorities (I'm latino) hate the most is being told who we are/aren't. Nothing will motivate us more to vote than someone telling the world we are bad people, we will show the world otherwise. We love this country just as much as any other group, and I will defend it against a racist clown any day. Go out and vote!", "I went from hesitantly supporting Hillary to actively supporting her. If she is able to stay calm in all of this I think she would be a great president.", "He assumes there's an express lane for white voters.", "Is it true that the numbers coming out are only showing the registered Republicans and Registered Democrats?\n\nIf so I'm a registered Republican and I voted for Hillary....proudly.      ", "So basically, our allies are all against Trump, and the one in favor is Putin. Who's comfortable with that?", "Oh yeah the Trump brand is, as the French say, le fucked.\n\nHe's also exposed himself in so many ways, I imagine the IRS for one is going to be digging deeper into his shit than ever before.\n\nRunning for President may be the stupidest thing he's ever done.", "Well he just called the Pope's \"build bridges, not walls\" remarks \"disgraceful,\" so that should help.", "&gt; While he was surprised at what occurred at the rally Crites he said he did not blame the crowd for his treatment. “I like these people,” he said. “These are my fellow Americans. I love these people. I understand that they came here because they’re patriotic, they want to do good for their country.”\n\n&gt; He added: “The people who attacked me – I’m not blaming them. I’m blaming Donald Trump’s hate rhetoric.”\n\n&gt; “My heart still aches for what this nation could potentially do by electing him,” he added. “That hurts me much more than any of this violence.”\n\n&gt; “The fact that I got beat up today, that’s just showing what he’s doing to his crowds. But I just want people to understand I’m going to be OK, but now what’s more important is if the country going to be OK? So do your part and vote.”\n\nThis is what greatness means in America. \n\nThuggery is the opposite of this. ", "If Obama was a Republican he would be treated like St Reagan on steroids.  ", "It will be so sweet to pay $8000 a year in tolls! And we will get a $500 tax cut that should cover it...winning!", "Republicans with functioning brains usually are. There are just so few left in the wild. And now it seems they're being hunted to extinction.", "&gt;What McDonald failed to explain is that some polling places were open later than 7 p.m. and polls routinely stay open late to allow anyone waiting in line when they close to cast their ballots.\n\nThis is why this line of complaining is such bullshit.  I voted in a part of Indianapolis where 90+% of the people waiting in the 3.5 hour line were white.  I spoke to a poll worker, who told me that the previous night they closed at 7, but took votes until 11 because they don't turn people away from the line until the poll closes, then they let everyone remaining vote.\n\nTo complain about the same rules in Nevada just because more of the voters happen to be Hispanic is the height of hypocrisy and amounts to little more than convenient racism.", "Pretty much matches the middle too which was full of lies.", "I just hope y'all pull through with that taco truck on every corner thing when Trump loses.", "&gt;He's also exposed himself in so many ways\n\nSome women are saying this. Many smart women.", "If the people affected by voter suppression were equally voting for both parties it would be. But why would replubicans try to make it easier for minorities to vote when they're current platform is based on attacking those same minorities?", "Let's nip the 'bad jobs' arguments that always pops up.\n\n[47% of the jobs created are high-paying jobs ($58k+).](http://money.cnn.com/2016/11/04/news/economy/jobs-under-obama/index.html?iid=surge-stack-dom) ", "Latino Americans are going to SAVE THE NATION!! What an AMAZING chapter in American history if this pans out...The Most Racist Sexist Candidate in HISTORY gets DEFEATED by A WOMAN and HISPANICS!! GO America WE ARE ALMOST THERE!!!", "\n\n&gt;It's baffling to me.  Is he that stupid? \n\nForget about elections for a second. Is there any single event in Trumps life that has come to light so far, that makes you think - if I did that I would be proud of myself. \n\n*Okay the wife doesn't count.*\n", "Can't wait till Trump gets his finger on nuclear weapons. Threaten someone with physical violence for holding up a sign.  I wonder what Trump will do when Iran annoys a US ship.  ", "I am so so nervous about New Hampshire. ", "To be fair he may have never voted before. ", "My wife managed a team that is close to twice her age. One guy has been at the company longer than her life. But that is what happens when the company practices meritocracy vs seniority.", "Never fuck with a Latino's pride. We are a people who will vote for a party for 50 years because one guy fucked us over", "Trump campaign literally mad at Americans being able to vote.", "Tell your dad thank you from me and re-enforce that habit.", "Olbermann is definitely in the \"this guy's a threat to the survival of the Republic\" camp and has been for some time. It's a theme throughout his numerous videos. [Here's one he did on comparisons to Hitler.](https://www.youtube.com/watch?v=VT90j5-1rXY&amp;list=PL0hKMB1-xkc_5ES_PEDgr8VjMpQ5haPD6&amp;index=3) It's worth watching at least for what he does with one specific quote. \n\nIt's easy to dismiss this as hyperbole, but what *does* it look like when a fascist dictator comes to power? Maybe the worst will happen, maybe it won't, but we'd never be able to say that all of the warning signs weren't there: the grousing about the unfair electoral process, the threats to jail political opponents, the threats to blacklist the media,  the cultivation of political violence, the cult of personality.\n\nIt's really not something you want to roll the dice on, because if you get it wrong, there's no going back.", "I went to HS in a very redneck/rural area but we happened to have a decent Mormon population of around 15%.  I'm half Jewish and I grew up in the NYC area, needless to say I did not fit in.  I got beat up once when I first moved and then word spread I was Jewish (even though I've never practiced) and people would throw pennies on the ground in front of me to see if I'd chase them I guess.  The only accepting people at that high school were the Mormons.  They thought it was cool I was Jewish and asked me questions when holidays rolled around, which is good because that was how I kept track of the Jewish holidays so I'd remember to call my grandparents.  They thought it was cool I'd lived near New York.  \n\nI'll never forget how accepting the Mormons were.  All my friends in high school were Mormon.  My first girlfriend was Mormon, although we'll say she played a little fast and lose with some of the rules.  I don't agree with any of their religious teachings and I wish they weren't so sex negative, I think it really harms Mormon children to be like that.  But when I get Mormons at my door I treat them with respect because of the hospitality they granted me when no one else would.", "It refers to experiences of working together with Trump on casinos (which Trump later crashed) in the 1980s. The executive talks about Trump's lousy temperament and confrontational style and it seems to connect very well to what we see now 30 years later. He has not changed and will most likely not change.\n\n", "Republicans often claim Obama is the \"divisive\" one which has lead to gridlock in government and crime in the streets.  I guess it's true considering he had the audacity to be a Democrat and black.  So divisive!", "No they said vote *responsibly*.  ", "I couldn't believe he insulted the Pope.  I'm not Catholic but I really admire this Pope and so do lots of non-Catholics.  It just seemed like a good way to anger a lot of people.\n\nThat there's a group called Catholics4Trump that boggles my mind.", "That was worth the watch.  It's like there are two Giuliani...the Fox Version where he openly admits his connections with retired and active FBI agents on Fox and then the reserved defensive \"I misspoke, never said that\" on MSNBC Giuliani. ", "Just vote. That is all we can do at this point. We can see whose model was right afterward. ", "[\"You will all bow down to President Trump.\"](http://thehill.com/blogs/in-the-know/in-the-know/297430-omarosa-trumps-haters-will-be-forced-to-bow-down-to-him)", "See the thing is that you have to place yourself in their world view to fully understand what he is saying. In this case his message is:\n\n\"In Nevada *the establishment broke the rules* by keeping the polling places open in order to allow people to vote against me. **This is a clear example of the elections being rigged because they would have never kept the polls open for voters that would want to vote *for* me.**\"\n\nThat last line is important, because he never actually says it. That is just the assumption that lies in the world view of him and his supporters. He doesn't have to say it, they just *know* it is that way. Suddenly, it's not about voter suppression or anti-freedom, it's about not getting a fair shake. \n\nThat is the problem with Trump, so much is reasoned from his world view that it often seems incomprehensible to some people. There is literally no common ground to speak from, it's two different universes. You cannot however, have large parts of your population exist in separate universes as long as they are expected to live in the same country, with the same rules and the same government. \n\nHillary's message of wanting to be the president of 'all Americans' becomes more powerful in that way. I hope it means that she will try to engage that part of the population that exists outside of her own universe, that she will truly try to build bridges and create a common ground. Not to 'agree' with each other, but to just be able to *speak* with each other and know what everybody truly is saying.\n\n\n\n\n", "If the Latinos are the reason Trump looses America might just have a future.  In America you don't get to demonize an entire culture because in America everyone can vote.  ", "The virtues of democracy should supersede party politics", "He's polling 50-26 Clinton with 18-29 year olds. The republican party is dying. This is the generation that is going to be making the major voting decisions for the next few decades. They've pushed away minorities young people, and all women. What did they expect?", "[Wikileaks is to the point of using things said on /r/the_donald as facts](https://mobile.twitter.com/wikileaks/status/794247777756860417) [the subreddit is full of people who believe all the conspiracies](https://np.reddit.com/r/WikiLeaks/comments/5ayjwz/wikileaks_twitter_significant_if_partisan_find/), and [even the mod team tried to cut down on the /r/conspiracy level bullshit.](https://np.reddit.com/r/WikiLeaks/comments/5b4or0/stop_with_the_pedo_conspiracy_theories_and/)\n\n[They even sold Bill Clinton bimbo shirts.](http://www.salon.com/2016/10/14/bill-clinton-bimbo-poll-wikileaks-merchandise-shows-the-websites-real-bias/)", "Honestly if I started one right now I'd probably be able to make it happen. I live in South Florida and have worked at Chipotle so it's entirely feasible. \n\n.... Should I do it? ", "The reason for this is that Trump promised massive investment into the area if he was allowed to build his golf course there after eventually being allowed to build the golf course he started to get upset about several ridiculous things (such as wind farms and farmers not selling him their land) and ended up never actually building most of the things he promised.\n\nIt's not too dissimilar to a lot of stories about Trump promising the world and then delivering a portion, apparently it is a beautiful golf course though.", "To be fair Obama started it by not being white", "Romney by a landslide.\n\nKerry wins Ohio. \n\nEarly voting exit polls also predicted those two things. So yeah vote.", "Even if that was all 100% true can you really say it's a worse option than giving Trump our nukes?", "Jellyfish also only have one orifice so they eat and poo through the same hole. Seeing all the shit coming out of Giuliani's mouth, your comparison is even more on point.", "My sistas ", "Fun fact: the LA times poll with Trump +5 shows Trump only down 2 or three points with hispanics.", "It isn't a real subreddit. It's a hate speech sub. It would be quarantined in any other universe where the admins weren't entirely complicit in the bigotry on their front page daily. ", "Titled *Thanks Obama*", "Thank you for being one of the few remaining level-headed Republicans &lt;3. I may not agree with you on many policy issues but I'm glad we can agree that Trump is a disaster. ", "I have a feeling the nightmare will not be over by Nov 9.  Trump has created such a shit storm his cult will definitely cause problems after the election.  I live in a red state, in a very red area, and I fully expect several acts of crazy after his loss.  Trump could calm them down with a concession, but all know that won't happen.  \n\nIf trump wins, God help us all...\n", "And the other 53% were still jobs.\n\nThere is a staggering number of people out there who complain about being unemployed refuse to take jobs they deem beneath them, and then complain when immigrants take those jobs instead.", "And he will say fuck it and change the makeup of the court so that it magically becomes legal.\n\nThis election has real consequences.  Anyone who thinks it doesn't has their head up their ass.\n\nBut here I am with some idiot on another thread telling me that it won't be bad - that he will get impeached if he does something illegal.  What a crock of shit LOLZ not with these fools enabling him.\n\nThe best check and balance we have is at the voting booth.  I hope we fucking use it.", "You don't gotta ask. Make it happen. Make America great again. ", "I don't disagree with you but this is a really obnoxious form of posting ", "Or they just find a Trump-esque candidate that actually has a modicum of self-control.", "Related because the article also talks about it but I followed the tweets to the fake assassination attempt they are lying about, and Trump supporters are so weird.\n\n\"I LOOKED AT HIS FACEBOOK PAGE AND HE'S SUPPORTING HILLARY!\"\n\n\"Yes...I could probably have guessed by the fact he held up a 'Republicans Against Trump Sign'. How does that change what happened?\"\n\n\"HE'S SUPPORTING HELLARY!\"\n\n\"But he didn't have a gun and he was the one assaulted\"\n\n\"HESSUPPORTINGHELARY\"", "If he is worried about the Supreme court because of abortion and he truly thinks abortion is killing babies then that may be what is hoding his logic up in his mind.\n\nAnd if that is the case, you are essentially arguing to him that his own financial situation outweighs the murder of innocent children.\n\nIf his supreme court reasons are something else, then I'm not sure where his logic goes.", "Da comrade, seems fine to me.\n\n/s", "&gt; There is no fucking way that the millions of trump voters are suddenly going to become rational.\n\nThis is what keeps getting lost here.  These Trump supporters aren't going to magically vanish.  \n\nIt's going to be a generation-long fight to keep the Neo-Fascists out of power.", "@mmurraypolitics\nFinal national NBC/WSJ poll of '16 race\n\nClinton 44\n\nTrump 40\n\nJohnson 6\n\nStein 2\n\n----\n\n2way\n\nClinton 48\n\nTrump 43", "Yes. Republicans understand that the harder it is to vote the more likely they will stay in power. ", "Well said!  The only way they have a these pieces of shit have a chance is by suppressing the vote.  God I wish people were more informed the Republican Party would have been disbanded years ago.  ", "Pfft. Farmers just complain about \"water\" drought and weather, ... all they'll need to do is pop open a few million bottled waters from Nestle (/s).  Trump is the best farmer..", "Nobody is ragging on the secret service. Just those that claim Trump was heroic for what he did while Obama was screaming and censoring protesters. ", "Here's the thing he didn't realize. Puerto Ricans don't like all the rhetoric since they are Americans. Bitching about amnesty and breaking the embargo both pisses off Marielitos who did get sent from the dregs and old exiles who any business with Fidel is a cardinal sin, and that many many Venezuelans are visa expirees and that illegal immigration is what's protecting their cousins and parents from being sent back to what is looking like a failed state.\n\nHe pissed off basically.the entire latino Republican base \n\nAlso acting like Chavez does not help\n", "Secret service eyewitnesses, and the protestor who was arrested all confirm it was the crowd that yelled 'gun.'\n\nThe bigger story here is the crowd at a Trump rally willingly putting a protestor in potential grave danger by yelling he had a gun to a secret service detail.  Frightening the levels Donald trump crowds will go to to silence dissent ", "Yes but Clinton overperforming means a landslide which buries Trump and hopefully his message forever.", "I'm an atheist and I love this Pope. ", "I waited over an hour in a red county just south of Atlanta. It was a pretty diverse group of people. There are Hillary ads running which is rare for a presidential election here. It's kind of exciting, even though she probably won't take Georgia. ", "Things are looking better!!!", "UK goes out Scotland goes out.", "\"A vote for Jill Stein or Gary Johnson is a vote against Hillary Clinton\"\n\nBut all the Trump people told me my vote for Johnson was a vote against Trump. ", "I was Bernie or Bust as recently as the DNC but Trump's attack on the Khans pissed me off. And hardly a day has went by that he hasn't done something insane since. I voted early for Hillary and I don't feel bad about it at all. I know she can do a good job of being President; I don't trust that Trump could literally do the job, if not outright destroy us all for his own ego. \n\nIt's an easy choice honestly because I like living here. ", "\"In 2016 he pledged to grab 'em by the pussy. This Christmas, he will grab you by the heart.\"\n\nEdit: A word to make it sound more trailer-y", "&gt; If Obama was a Republican he would be treated like St Reagan on steroids.\n\nIf Obama was a Republican he would be treated like St Reagan on steroids riding bareback on a wild bronco, with an AK47 on each arm, and smoking a cuban cigar like Schwarzenegger. The confetti would be raining down on him. Congress would pass a law to allow for a third, and possibly fourth term for him. Interstate highways, an aircraft carrier, national parks, even one of the Great Lakes would be renamed after him. His birthday would become a new national holiday. The GOP would be renamed the Grand Obama Party!", "Trumps base who are totally comfortable with saying \"fuck our allies AMERICA FIRST USA!!\"", "Its crazy we even have to have this conversation.", "That's very encouraging. Someday there will be Oscar bait about this shitty election.", "They are not allowed at all in the UK. Political parties do get pre-assigned TV 'slots' in prime-time to put their message across but they are well prefaced by \"This Is a party political broadcast on behalf of the x party\" so viewers have the opportunity to take 'appropriate' action. :)\n\nThe other stuff can be curtailed by having strict spending limits and having *much* shorter campaigns. ", "He makes them feel safe validated and important. They don't mind giving up freedom if it improves their feels.", "No Trump says building a giant wall in Texas and nuking some brown people in Syria should help people in Detroit better. ", "This right here... fucking amazing! Where's the link to your Kickstarter hombre??? Lol", "I have an uncle who only watches FOX News. The most terrible thing they have done is to convince him that **all other media** are lies.\n\nHe won't even watch entertainment television.", "*\"Reality has a well known liberal bias.\"*\n\n- Stephen Colbert", "Our media is failing us *on purpose* because it's profitable.\n\nThey are intentionally driving a wedge between people and ideologies because it helps their bottom line. It's one of our biggest national tragedies. Both sides agree that our media sucks but both sides seem to have different reasons for thinking this.\n\nRight Wing media; Fox, AM radio, Breitbart, Drudge, etc. Is ramping up the hate and division and fully embracing conspiracy theories more and more. Infowars, RT and Sputnik are being increasingly referenced by the right...\n\nLeft Wing Media; everything that's not 100% right Wing, apparently. While being biased too, Is also increasingly playing the [\"Balance Fallacy\"](http://rationalwiki.org/wiki/Balance_fallacy) and [\"False Balance\"](https://en.wikipedia.org/wiki/False_balance) narrative out of fear of being called biased. Causing some serious problems with people differentiating between fact and fiction.\n\nBias *is* a problem. But the fact that it's incredibly popular and profitable says a lot about us.\n\nI don't know if it's even fixable. We are welcoming this disaster and seem to want more.", "With the looming ~~possibility~~ threat of a President Trump the most salient thing about this interview is the calm, rational mind Obama's side of this conversation reveals. His words expose a diplomat of the highest order, precisely what we *must* have in the Oval Office. Obama has not only grown on me over the last eight years, but I have grown to *admire* him and I regard him as one of the most intelligent men to ever hold that office. Juxtaposed against Obama, one must wonder how anyone can consider Trump presidential.", "Radicalisation.\n\nAn awful lot of Islamic extremists for example are engineers. It's not necessarily an issue of intelligence.", "&gt; How would you describe how the crowd were treating you?\n\nThe dude just described for a minute how they strangled kicked, and grabbed his balls, and this is the question you decide to ask?", "Inciting a crowd to cause harm to an individual. \n\nIs this not an actual crime? Has he finally gone too far?", "Because the Republican base has been living in a fact free zone for a decade.", "Let me translate that for you: Neighborhoods with non-white folks in areas where Republicans control the election offices.", "It was really some unhinged Trump supporter choosing to shout \"Gun!\" in the middle of a political rally when there was no gun present. ", "Yes and no. A halfway decent lawyer will be able to argue that \"take him out\" meant \"remove him from the venue\" and didn't mean \"kick his ass.\"\n\nIt's could be hard to prove intent in this particular case.", "Because they think the people Trump screws over deserved it some way or weren't screwed over to begin with and that Trump won't screw them over because they're \"his people\" and exempt from being screwed over by Trump.", "Yeah this should be a message to any Trump supporter who is still delusional about Trump \"fixing\" the economy.  Let me break it down in simple terms:\n\nThank God Trump is in real estate because it's the one asset that typically appreciates no matter who owns it and what decisions are made.  Because this portfolio is the only thing that covers up for his rookie league piss poor batting average.  His failures far outpace his successes and he is literally now forced to borrow from and do business with banks that are the financial institution versions of a Rentacenter, many controlled or influenced by foreign powers \"resistant\", shall we say, to American influence.  Russia, for example.\n\nAnyone who thinks he'll make America Great again needs to get their head examined.\n\n\nEDIT: TL;DR he is not good for the stock market at all.\n\n", "I just like that we got to see a clear and direct difference in approaches between Obama and Trump that created very different outcomes. \n", "First hand account of how Trump the businessman made good deals and made a casino great again.\n\n&gt; Harrah’s at Trump Plaza opened in 1984 and within a year we were in litigation with Trump. In 1985 I filed an affidavit with the court over Trump’s claims of mismanagement: Referring to Trump I said, “His written response to my letter of May 10 is characteristic of the bluster, threats, intemperance and unsupported and unsupportable falsehoods that have permeated the correspondence we have received from him and his key management employees almost since the beginning of our partnership.”\n\nTrump is such an excellent businessman, he took over the reins of control, and then this happened.\n\n&gt;In 1986 we terminated the partnership by selling our half of Harrah’s at Trump Plaza back to Trump. He promptly changed the name to Trump Plaza and took over operations. Trump Plaza filed for bankruptcy in 1992. It closed in 2014 after additional bankruptcies. In contrast, Harrah’s flourished during this same period, and I retired as Chairman in 2005. If an investor had purchased $10,000 of Harrah’s/Holiday Inn stock in 1982 and held onto it until 2005, it was worth over $1 million. As the New York Times said in an article in June, there is “little doubt that Mr. Trump’s casino business was a protracted failure.” His employees, shareholders and bondholders suffered.", "I love Bill Maher. I wish I could vote for Obama again. I enjoyed seeing the two of them talk in that interview.\n\nObama won't fully be appreciated for another 8-10+ years but history will view him favorably. ", "It's not even worth arguing at this point over the fact that her voting record in the senate is *actually incredibly liberal* as are the bills she has sponsored and cosponsored. People who have decided she's a secret neocon are not going to be swayed by silly things like lists of the things she supports or says she supports.\n\nThe fact of the matter is, Trump is invading hell, so you need to have a chummy conversation with the devil.", "If that same guy was beaten up by BLM protesters instead Trumplings would be losing their shit right now in his defense.", "But some actually truly, deeply believe what they're fed even when a trivial amount of research would show it to be manufactured propaganda. That's the scary thing. It doesn't bode well for democracy.", "Also the tactic wealthy fascist Nigel Farage [used to scaremonger](http://i.imgur.com/18jc4LOh.jpg) Britain into voting for Brexit. He also stole a photo taken in Hungary.", "Yeah I should have emphasized this: this really only happens in one direction. Democrats don't make it hard to vote in middle class and/or upper class and/or White areas. Say what you want about the Democratic Party, they do fight for the right of everyone to vote. ", "They also think they have nothing to lose (they do).", "Barack Obama on protestors:  \"First of all we live in a country that respects free speech ... don’t boo—vote!\"  \n  \nDonald Trump on protestors:  \"How much are you being paid, $1,500? All right, take him out.\"  \nThen brags about how survived an \"assassination attempt\" while his supporters assault and choke the protestor for holding a sign.  \n  \nFuck Trump.  Fuck Trump so much.  If you vote for that you're just completely mental.  ", "If the green party wanted to be taken seriously they would have put Al Franken as president and Jill Stein as vice president so they could be the green Frankenstein ticket.", "If it helps you feel better most places in America aren't that bad. It's just specific neighborhoods and areas that tend to have certain demographics which have the most problems. ", "Good news for Trump since nobody has more respect for women than him and he's going to win women bigly!", "Because the GOP led legislators have been desperately ramming through laws and policies which restrict early voting defund voting locations, restricting absentee voting and purging voter rolls under the banner of \"VOTER FRAUD\" which has proven to be a false flag.   \n\n\nThe reality is that VOTER SUPPRESSION by the GOP is a far greater crime.\n\nIf you don't like what has become of this election, you can point your finger straight at Mitch McConnell, John Boenher, Reince Pribus and every GOP legislator and operative who has worked over the past 20 years to gerrymander and suppress voter turnout.\n\nVote Democrat all the way down-ticket if you want to see change.\n\n&lt;Source;  I am Former hardcore Republican who is disgusted with the GOP&gt;", "I'm not saying you're wrong. I'm saying any lawyer would easily establish reasonable doubt in this particular case.", "BUT I saw 2 black guys who say they voted for Trump on that cesspool sub T_D the other day!! ", "We already view him favorably at least 55% of us.", "I completely agree with this. I feel like the right wing media is essentially using a variation of the Gish Gallop as a media tactic. They dump so so, so many bombshell conspiratorial scandals and then immediately ask \"Why isn't the mainstream media covering this? Because they're part of the liberal media.\" And if their viewers/listeners look, they'll indeed find that the mainstream media isn't covering or even addressing most of those stories.\n\nOf course these people will never consider that maybe the mainstream media doesn't have time to address and debunk every completely non-credible story that Infowars can come up with, but the fact that they don't is \"evidence\" of their bias to their right wing followers.\n\nRegardless, as you point out, some of these stories have become so pervasive and spread through social media that the mainstream media DOES talk about them, even if only to dispute them. Once that happens, you have a new problem in that you're entertaining both sides of an issue even when the overwhelming evidence and credibility is only really on one side. As you linked, the false middle.\n\nAnd unfortunately I don't grasp how it can be solved either. It feels like this problem is in a feedback loop.", "How does it stick when what Obama said is on video and can be compared to what Trump is saying? ", "I don't know whether to laugh or feel bad for what is going on in the Trump subreddit lately. It has become the second coming of /r/conspiracy. Every day they post a new \"smoking gun\" which each time is just a new alt-right narrative superimposed on top of the old three degrees of separation game. Some of the \"connections\" they make are things like \"X is Y's cousin\" or \"X and Y both worked for Z company in the 80s,\" and in all cases, it is supposed to represent irrefutable evidence that X and Y are currently colluding to propagate the biggest conspiracy of all time against America. It must be such a confusing and stressful life to perceive the world in these ways. \n\nLike, if they weren't already convinced that Donald Trump was the messiah and Barack Obama's disgruntled half brother truly hates liberals, they would absolutely pass off the alliance between the two as evidence that the Republicans and Democrats are colluding against the American people, because the two Obamas are related and it is apparently impossible for blood relatives to not be part of the same underhanded conspiracy.", "But he had a sign! Made of paper! And paper can contain Emails!!!", "&gt;Exactly. I live in the Netherlands and never in my life have I had to wait longer than 3 minutes in line to vote. Now I fully understand that in a large country that is not as densely populated as the Netherlands it's a more complex logistical challenge to set up enough polling places, but hours is nothing less than disgraceful.\n\nThe irony is that India --- population 1.25 billion --- does a better job making it easier and quicker to vote than we do. (US population 320 million)\n\nCheck this out..........\nhttps://www.youtube.com/watch?v=5kWK0_BPsDA\n\nThat part about a polling station every 2 km ---- we've got people who have to drive 200 miles (one way) that's 322 km to vote. (EDIT: I just pulled up a map of your country. It looks like you can't go a straight 322 km in the Netherlands without leaving your country. So imagine if you had to drive across your country to another country for your nearest polling place..............but that's what we've done here in the United States. Oh, and election day is a working day, not a holiday.) \n\nIt's not the size of our country or our population that causes our problems here. It's the idea that the people in power don't want certain people to vote.", "Except that he has a history of encouraging violence at his rallies going so far as to promise to pay the legal fees of anyone who is charged with assault for attacking a protester. ", "can't wait until conway gets off my tv screen good riddance in 3 days.", "Never forgive never forget.\n\nWe also hold grudges ", "No. The average income of his supporters is 70k. They aren't being 'left behind'; they just don't want others catching up. ", "Literally. They're the ones pushing all the lawsuits that are exposing conservative tactics. Marc Elias Hillary's general legal counsel, even came on Reddit to try and garner support for their work. Unfortunately he mostly got shit on, downvoted and censored at the time. \n\n", "Progressive voters that are still refusing to vote Clinton please take note. A Trump victory may trigger another stock market crash. And we're not talking about months or years into his presidency it's possible it might happen immediately after the election before he's even inagurated.", "They should but they don't.  You have to remember we're talking about a party that threatened a default on America's debt obligations just to get leverage on abortion and the Health Care law something more akin to a kamikaze attack than good leadership. ", "Look at the power church has over otherwise intelligent people.", "If you only look at 538 then New Hampshire will scare you. But nearly every poll has Clinton winning so that may ease your mind. ", "Republicans. It's the only way they can win.", "There really needs to be a full investigation of what's happened in the FBI over the last 2 weeks including but not limited to Comey. My hope is that there will be, but they can't announce it till after the election - since of course saying anything this close to an election would be improper...", "He's awful. Even his marriage of 40 years is ending. He won't visit anywhere if they don't have FOX on cable. Cult-brain.", "Yes research and a bit of critical thinking! They seem content to just absorb and then amplify messages that 1. Are not true, 2. Don't make sense and 3. Can't be defended because of the first 2 points.  ", "Those pesky democrats wanting us all to have democracy", "Making a cameo in Home Alone 2. I would be proud of that.", "They *grabbed him by the testicles*.\n\nNo really. They did.\n\nhttp://www.foxnews.com/politics/2016/11/06/trump-hustled-offstage-in-nevada-after-security-scare-returns-shortly-thereafter.html\n\n&gt;Crites went on to claim that members of the crowd kicked and punched him, while at least one person grabbed his testicles. He said he was relieved when authorities put him in handcuffs and escorted him from the arena.\n\nThey're really taking Trump's words to heart", "From a white person THANK YOU for saving my country from my idiot Ethnic group. I love you my Hispanic brothers from other madres.", "Honestly if Clinton were capable of pulling that off, she would be the greatest leader the world has ever known.", "Its not so much that the emails are fake. Its the headlines. Wikileaks tweets a link to the artistic Spirit Cooking dinner and says it involves blood...Headlines: SATANIC RITUAL!! This is the pattern. ", "As President Trump will screw the US and its allies as hard as he has screwed his business partners and contractors.   Come to think of it, I have not seen a business partner or contractor who provides examples of Trump being a great business leader.", "I'm in the exact same position. Since the DNC I've been firmly in her corner. TBH, I didn't even consider Trump a \"real\" candidate until he won the nomination, which in and of itself blew my mind. \n\nRemember, the Republicans had SEVENTEEN people in the primaries - and they chose the racist, sexual assaulting, misogynistic, xenophobic narcissist as the person who best represents their views.", "I can't wait to see if she gets paid or not.  I'm assuming she got something up front but it would be glorious if she sued Trump because he refused to pay her after losing.", "wrong.", "People said the same thing about Obama; that didn't even come remotely close to happening even after a class of six year olds was executed. Anybody who thinks their guns might be taken away is just reaching for reasons to dislike someone.\n\nAlso, to be honest, if \"I want to be able to go to the shooting range\" is anywhere remotely close to your list of \"Biggest Political Issues,\" you're not responsible enough to vote. \"What I want in a world leader is someone who will let me play with my toys.\"", "Both of your examples favor the right wing. Right wing news outlets make shit up and cite unreliable sources. Left-leaning news outlets apparat to be balanced by airing the right wing bullshit half the time. ", "You overestimate their education.  Many of the educated viewers have a very narrow education and life perspective.  They are naive to the lives of those unlike themselves.", "And all entertainers are commies.", "Could not have put it better! If you supported Bernie you will be completely ignored in Trump's America. The choice could not be more clear!", "That's so fucking ridiculous.  In Colorado I get a ballot in the mail 3 weeks before Election Day that I can fill out at my convince at home at drop it off or mail it in anytime before Election Day.  No waiting. \n\nWhy isn't it like that everywhere?", "I personally think most Trump supporters are in a cult of their own.", "Be patient. 20 years ago California had a controversial anti immigration proposition on the ballot, championed by republican governor Pete Wilson. As a result, California Latinos are far more politically active today, with many not only voting, but serving as elected officials in local and state government, and the state has been reliably blue ever since. Trump could be the catalyst that kicks Latino political involvement into high gear at the national level. ", "The wait is by design. It's intended to make it more difficult for poor people to vote. Southern states closed nearly a thousand polling stations this year now that the Supreme Court has ruled the Voting Rights Act unconstitutional. If they can't get a plurality of voters to support them then they have to make sure their opponent's supporters can't vote. ", "People act like it's all a big joke but Clinton has been photographed literally consuming the flesh of dead animals. Study it out.", "*sniff*", "Bush was a mess as a President... but I sincerely believe he recognized outreach to all Americans as being important to the GOP's future. He has Latino family members was comfortable working with a number of powerful African Americans, has a great relationship with the Obamas, called for support to Muslim Americans after 9/11, and sold the idea of \"compassionate conservativism.\"\n\nThis does NOT excuse his myriad of mistakes. But I don't think he was a hateful man.", "Every time I watch her I can't imagine how she can justify spreading this level of cognitive dissonance.  ", "This is America.\n\nNo one is going to attack you while you're in line to vote.", "To simplify: It's been made intentionally onerous for urban Black and Brown people to vote. If you live in a mostly White neighborhood this doesn't happen. ", "That's because you can't see her bank statement.", "I'm not Mexican but yes taco trucks in every corner por favor! Make américa eat tacos again lol", "Stephen Colbert is an \"entertainer.\" A source of \"truthiness.\"", "Whoever shouted \"gun\" needs to go to jail.", "Keep preaching. If she's twice as evil as alleged she's still a safer bet than the Orange one. ", "Even if she's *as* evil lawful evil is miles better than chaotic evil. ", "&gt; Conway deflects\n\nAs usual.\n\nThe thing is though - she's good* at it. Her and Kayleigh Mcenany have done tremendous jobs with the shit sandwich they're given daily.\n\n*it could be a lot worse.", "You are a caring individual have an upvote\n\n", "It's like a live example of how Sun Tzu pretty much has chapters about allowing your enemy to destroy themselves. They are so focused on 'destroying' Hillary that they're not realizing that they're destroying themselves. ", "But hey at least Republican voters are not old people that are dying off by the thousands every month", "The \"Miss Housekeeping \" thing pissed off Latinas to no end too. ", "Thanks ~~Obama~~Reagan", "These final national polls are basically saying Clinton up 3-5 which means we're basically back where we started in June \n\nCan we please consider this and shorten  our general election campaigns  to just like 3 months now?", "It's a hell of a thing being told your vote might matter this year. ", "Trump supporters always argue that but his grammar shows that the subject of his sentence is \"Mexico,\" and by proxy, Mexicans. \n\n&gt;\"They [Mexico] are sending crime, they [Mexico] are sending drugs, they [Mexicans] are rapists, and some, I assume, are good people.\"", "Oh I want to see her meltdown on Wednesday, so 4 more days please!", "Americans have the right to vote and that's all you need to know.", "Whaaaat? Trump is not the composed professional, wise, measured, thoughtful statesman he purports to be? Can I have my vote back?", "He was telling security to escort him out. He wasn't asking his supporters to murder a man live on television obviously.", "That alcoholic tosser still makes my blood boil. I bet in a few decades time they'll burn straw figures with his, Boris Johnson's and David Cameron's faces in the streets on Guy Fawkes day... ", "Damnit election over", "Bigly", "What's most ironic about this is the stark contrast with how President Obama dealt with a protester at a Hillary rally. Obama overruled the crowd saying the guy was a vet, and an elder, who was exercising free speech and so deserved respect. He said the way to deal with the situation was to vote for Hillary.\n\nTrump characterized this as Obama becoming \"unhinged,\" and continues to say that Obama was \"screaming\" at the protester.  (Because... he was.... talking into a mic?)\n\nBy contrast, Trump's own nonviolent protester gets beaten up by the crowd for holding a sign.  Yet, Trump's campaign keeps calling the incident an \"assassination attempt,\" despite the lack of any weapon. \n\n----\n\n[*Edit*:]\n\n[Here's a video juxtaposing Trump's false statements with what Obama actually said and did.](https://youtu.be/EHoNTYqyHI0)\n\n[Politifact has also rated Trump's comments pants on fire.](http://www.politifact.com/truth-o-meter/statements/2016/nov/06/donald-trump/donald-trumps-pants-fire-claim-obama-screamed-prot/)\n\nThe Clinton campaign should cut a new \"in his own words\" ad.\n\n[**TL:DR: Trump again shows that he's a pathological unrepentant liar.**]", "On a related note Hannity the other day said this verbatim \"You won't hear about this anywhere else I am the only one you can trust I won't lie to you\" Rush Limbaugh had a line last week that was\n\"Democrats want to keep people poor and uneducated so they will vote for them and be reliant on the government\"", "*\"Even regular shows like The Big Bang Theory have a liberal bias.\"*\n\nOP's uncle", "No wonder he thinks he's a millionaire. ", "Cult culter and cultest.", "I just realized this while talking to my father who voted early for Trump (sorry guys I tried, at least it's just MA).\n\nI was explaining calmly that most national polls have Hillary up, and he came back at me saying, \"What news are you watching? Because you better watch something else.\" I don't know what is going to be in his head Wednesday morning if Clinton is victorious, but I doubt it will be anything along the lines of \"Well my sources and research were faulty, better improve next time.\"\n\nIt was a really depressing conversation, not because of his confidence in a Trump win, but because of the exact point that OP is making, that my father, an otherwise intelligent man, seems now to believe that every news source is lying except the ones he likes. And, moreover, that poor suckers like my mom, sister, and me are somehow falling for it all. How am I supposed to deal with this?", "And that is a powerful weapon bc it represent a freethinking movement", "He had a \"Republicans Against Trump\" sign according to what I have read.", "It was a *Republican* protester. He had a sign not a gun.", "Hey man he's just exercising his freedom to yell \"Fire\" in a crowded room.", "So just over 1k every second? :D", "It has to do with anti-intellectualism. Being an expert in a field is incredibly aggravating these days.\n\nA) because there are those willing to sell their impressive credentials to the highest bidders and then go on national TV to discredit actual experts (i.e. Climate deniers)\n\nB) because these reckless pundits have created an abundance of armchair experts who think they know more about foreign policy economics, and science than do the actual experts in the field.\n\nIf the Republican's blatant disregard for facts and general disrespect for the educated doesn't doom their party, it will doom America.", "A literal flood.  We'll be drowning and abandoning buildings due to the rise in immigrant levels along the coasts and low lying areas.  Head for the hills!", "Lol..\n\nI tell ya I just grab 'em by the balls. And they let you do it because i'm a star.", "Not disagreeing with the idea that politics has an impact on the stock market but it's a bit misleading to say that Clinton's rise in the polls *definitely* was the reason that the S&amp;P 500 closed higher. November 4th was also the day of the Obama jobs report, and that news certainly had something to do with it.", "The sign might have had facts on it.  That's just as dangerous to trump as a gun.", "I honestly wanna see someone try to get 650 million people into the US in a week...that would be a logistical accomplishment the likes of which humanity has never seen before", "Even if it looks like Clinton is gonna win still show up and vote. If for nothing else than to run up the score and watch Trump shrivel.", "https://hbr.org/2016/10/how-to-build-an-exit-ramp-for-trump-supporters\n\nvery slowly and carefully your dad has become a member of a demagogue unfortunately, but he can and will be pulled out as long as you don't give up on him.  It may take months or years, but he is family and you can't give up hope", "Don't let this get anyone complacent.  Your vote is your voice", "Oh the horror! It probably brought back all those painful memories of Trump's personal Vietnam all over again. Quick someone give him another purple heart!", "Look at his rallies. It's mostly white middle class types with middle class jobs. And seniors on Medicare and social security. These people have so much to lose from a Trump presidency it's not even funny.", "Free speech _is_ a threat to Trump.", "Seriously the brilliant businessman thing is such a joke. How many people are there that lost money buying up luxury Manhattan properties over the last 40 years?", "Last night my girlfriends mother was reading her Facebook feed and told us about how Hillary said nurses were \"overrated and paid babysitters who's job don't really matter\". She didn't even read the article just repeated the headline as fact.\n\nSome people just read whatever comes up on facebook as if it's law", "He went into a Trump rally as a republican to protest Trump.  Given the size of this guy's balls is it really a surprise someone accidentally grabbed them?", "Consider the following:\n\nObama's heckler was former military and is part of a historically violent group of political support.\n\nTrump's heckler was a dude holding a sign.\n\nSee? I can do it too.", "I was wondering about this.  The article also makes no effort to show what Obama had to do with it.  I'm not trying to bang on Obama but the president has less influence on the economy than a lot of people think (especially when congress is gridlocked anyway).\n\n\nEdit:  Yes, the bailout was an important move by Obama.  Even though some Republicans opposed it, I think a Republican president would have had a hard time doing any differently considering how many people would have been immediately unemployed otherwise (and also considering the finance industry lobbies both parties just as hard).  And no, this doesn't mean I think Republican policies would have worked better. ", "Trump is the pussiest presidential candidate.", "*The facts of life are conservative*\n* Margaret Thatcher\n", "I live in a Muslim country and I've just realised that most of the crazy, extremist Muslims that I know are engineers/engineering students. Very rarely do I meet one with an economics background and almost no one from medicine or law. I've got no idea why though.", "Personally I love their repeat use of \"SMOKING GUN THIS IS IT\" and \"NOT A DRILL CLINTON TO JAIL\" and \"DEVASTATING EVIDENCE DESTROYS CLINTON\" and bla bla bla.\n\nEvery day on /r/the_donald they find another piece of \"evidence\" so incredible that Clinton's campaign will surely be over in a few hours.", "No women. No women. You're the women. ", "Honestly this is what he always says to his security, so the can remove protesters from the crowd.", "Why are we talking about 1st amendment rights while Obummer literally takes our guns away? /s", "Years?\n\nAbout 50 years ago Goldwater ran against the Civil Rights Acts. Prior to 1964, to about 1900, the black vote was about roughly 50/50, Republican/Democratic. It usually skewed slightly more Democratic once FDR took office, but it was still fairly even.\n\nThen, Goldwater comes along and suddenly blacks are voting 90/10 Democratic/Republican. Have been ever since. \n\nTrump will be lucky if he hasn't ruined the Republicans for Hispanics, Muslims, and Women for generations to come. ", "This election may be simultaneously the worst and best example of a functioning democracy. A populist movement led by a demagogue, rises up through fear and ignorance, but is successfully stamped out by a majority that sees through the fearful rhetoric and understands that important positions should be filled by competent, experienced leaders. Let's make this happen people! Go vote! ", "It terrifies me that these would probably be part of TrumpNN if he won a state run media program to get rid of the  \"liberal bias\"", "They will say things like \"the polls are open until 7 so if you want to vote you should get there earlier.\"\n\nIf Democrats ever tried to disenfranchise Republicans they way they do it, they would be screaming from the highest hills.  And rightfully so.", "I'm going to preface this with a bald acknowledgement that I really fucking dislike what Comey did and I think it was *at best*, a mistake.\n\n**But**\n\nCan we tone down the Comey hate a little?  Everyone seems to have come to the conclusion that his letter was a deliberate and hostile act, and I just don't think that's being particularly fair.\n\nConsider, for instance what we *now know*, but did not when this whole thing first exploded last week, which is that the existence of the \"new\" emails *had already been leaked*, to the Trump campaign no less.  \n\nLet's imagine for a second that you're James Comey, and you're **not** a partisan hack, you're just a guy trying to deal with a really difficult situation at the best of times who has spent months being shit on in public by GOP officials for not recommending an indictment of Hillary Clinton.  \n\nSomeone tells you about these emails.  What on earth do you possibly do at that moment *that isn't going to be considered partisan*?  \nAdd to that, the fact that Comey probably knew full well that there were firebrand agents at the NY field office with ties to Guliani and an axe to grind.  Knowing that, he's got to feel like staying silent on the matter is going to make his situation far worse, because *not only will the news leak out, causing the same huge furore and influencing the election*, but also he will instantly be pilloried as a partisan hack protecting Hillary Clinton.  If he tells congress, which he did publicly commit to doing, then he knows for a fact it's going to instantly be leaked to the press, and he's going to be pilloried as a partisan hack trying to help Trump into the Whitehouse.\n\nThere's really no good option here, no move that can be made that isn't immediately going to allow people to assign partisan motives and flip their shit.\n\n**Now**\n\nLet's not forget that *Comey is not entirely without blame here*.  His decision to publicly explain his decision not to indict Clinton was his own.  And he did throw the Republicans plenty of bones, which *he was not obligated to do*, by going on the record excoriating her for the personal server.  In the process, he made the commitment to keep Congress appraised, which he could have avoided if he had simply issued the recommendation and stayed quite which would be the normal move.\n\nSecondly, the letter was simply awful in terms of vagueness, and wide open to wild misinterpretation.  It seems like possibly Comey was totally naive, or perhaps wilfully irresponsible in sending a letter about a rather sensitive, complex and deeply volatile legal matter in language that failed, spectacularly, to convey the nuances involved.  He definitely could have ameliorated some of the blowback by letting someone with a bit more PR savvy help draft a letter that included the salient details that dripped out over the course of the weekend from the outset, and that is 100% on him.\n\nTL;DR - James Comey screwed up, but if your assessment of the situation begins with an assumption of his motives, then you're basically being pretty unfair to a dude who may well have lost his career because of a situation which was *largely* (but not totally) beyond his control and *largely* (but not totally) not of his making.", "Nate Silver admits that his model probably overestimates Trumps chances due to the lack of Trump's ground game.", "It is Trump and his campaign that are playing up the 'assassination attempt' now though after it has been proven there was no gun and there was simply a protestor with a sign.", "I am inclined to agree with your assessment of him personally but beyond his own poor judgment, he's lost control of his agency. There has been pure partisanship in the leaking... He's responsible there in a 'buck stops here' sense; he has responsibility to set the tone and enforce expectations, and he's failed.", "What he did to the GOP was air publicly what they've been about for decades. ", "Considering there was a \"Blacks for Trump\" being held by a white lady last week it's certainly not impossible that it's fake.", "I mean reddit isn't really that much better in that respect.", "There are more Democrats than Republicans and they both know that. If everyone voted, Republicans would hardly win anything. Their only hopes are voter suppression and gerrymandering.", "Well he was tax dodging and he was sexist, he just wasn't \"I 'lost' a billion dollars running a casino, got a massive tax break for it, then double dipped and wrote the loss off as business investments and loan forgiveness all while raping teenagers and groping random women and beating the fuck out of my wife\" levels of fucked up. \n\nHe was just \"normal\" republican fucked up.", "Yeah no, totally, that sign looked pretty dangerous too, sharp edges and such. Who knows, it's maybe even painted with lead based paint. What a monster. They should have killed him. That'll show america what freedom looks like.", "I'm loving that every post about polls just has people screaming go vote. It's true and it can't be said enough.", "It'd be like in the WWZ movie", "Because he is now so socially isolated and hostile.", "As a Christian this makes me sad... I don't see how anything the Republican Party stands for aligns with the teachings I thought were Christian values. Reddit by and large has a pretty negative view of Christianity and it's totally understandable, the way Christians as an overall group carry themselves publicly is shameful, and I don't blame anyone who dislikes Christians or Republicans. I just wish it weren't this way...", "Transporting 650m dead mufuckas would be an even more impressive logistical achievement.", "My sister actually told me that because Donald Trump is a billionaire he'll be able to use his money to get the country out of debt. I was speechless. \n\nTh... that's not what is going to happen.", "Just an FYI Kate's line 'we get to choose what kind of country we want to live in' is almost verbatim of an oft repeated Hillary line. Just saying. ", "Yep. The politicization of the news is a gigantic problem and it is tearing the country to pieces.\n\nI don't know if it's fixable but a start would be to bring back [fairness doctrine](https://en.wikipedia.org/wiki/Fairness_Doctrine).", "Holy shit really? That's full-blown addiction. ", "They already scream it from the highest hills and it's not even happening. Their central theme is that Democrats are rigging the election and committing voter fraud meanwhile Democrats are fighting their asses off to try to fix the Republican electoral fraud.", "Yes. They are fake. At rallies there's usually a couple of volunteers passing out signs and people are encouraged to grab ones that don't apply to them. ", "He can't. They're tekin our jawbs and its unsafe  to walk down the street.  Did you know crimes at an all time record high. ", "&gt;Imagine how cavalierly Trump would order extrajudicial killings if he had that power.\n\nYou don't have to imagine. You can see with your own eyes. The Philippines is currently experiencing a Trump presidency, with President Duterte basically changing the country from a democracy to an intolerant populist dictatorship in the course of just a few months. ", "Yup. They go out for dinner he just sits and watches FOX on TV. They travel to family for holidays, the same thing. ", "I can't even deal with people who still insist that Trump is more honest than Clinton. He's been lying to their face at a level never before seen in politics and she's been for the most part, telling the truth this campaign season and she's still considered less honest.\n\nAt this point it's either pure partisan bullshit or sexism. It's clearly not reality. ", "Yes because voter disenfranchisement is just a partisan issue and not an attack on our core values as the world's oldest modern democracy.", "*I* don't. But lots of people have family and ex-friends, to no effect. Cult-brain.", "Beautifully stated.  ", "^under rated comment", "Yup. Brainwashing.", "To quote Bill Maher \"Please Jesus\" let her win.", "America's created more jobs while [the actual value of employment has gone down](https://www.advisorperspectives.com/dshort/updates/2016/09/15/u-s-household-incomes-a-49-year-perspective) for everyone [but the richest members of society](http://www.cnbc.com/2015/05/18/why-corporate-ceo-pay-is-so-high-and-going-higher.html). This somewhat misses the point - you could hypothetically re-implement slavery or a serfdom and it would rapidly *employ* most of the population if you totally disregard what a job means as a means to an end in a modern economy. People don't want jobs just to have something to do you know they want to earn a living. \n\nThis is why the numbers betray how things actually look at ground level. People just have to look out their windows to get the impression things still suck despite the government's somewhat desperate efforts to prove otherwise. The US isn't the same as it was before the recession and people recognize that for themselves - most of the economic wealth was regained at the top level and many the \"jobs\" developed below that are stagnant, dead end remedial labour that pays less for more and offers only a token of the security, opportunity for growth and flexibility as the jobs they replaced. ", "Honestly though it doesn't even matter. There's absolutely zero evidence that illegal immigrants have higher rates of sexual assault than the general population, and plenty of evidence that they don't. It's simply racist fear mongering, regardless of which group he's talking about. ", "Of course he wasn't sexist he had binders full of women!\n\n\nGod I miss those jokes. They seemed so much more innocent than what we have today.", "https://www.washingtonpost.com/news/monkey-cage/wp/2015/11/17/this-is-the-group-thats-surprisingly-prone-to-violent-extremism/", "I agree.  A felon who has paid his or her debt and served his or her time should in no way be prevented from voting. It's the rights method of going after as many minority voters as possible to lock them up change laws to keep them there for longer and push for more laws that sentence people through the private prison complex and then disenfranchise them even when they get out. All these people can't vote because they smoked a little pot? It's disgusting. ", "Yeah no.  I haven't seen anywhere near the same level of willful delusion.  Fox news/Rush/info wars have given up on reality and are more concerned with telling their followers what they want to hear.  Trump's popularity despite his gross lies are proof of that.", "You can't joke about reddit calling Romney \"literally satan\" when there is an actual and factual witch hunt occurring right now in T_D.", "These guys became so accustomed to their safe space over at the_cheeto that they threw a temper tantrum when confronted with a dissenting voice that they couldn't just delete and ban. Pathetic.", "I'm absolutely baffled by the gays for trump sign. Are those fake signs? ", "This is a really good point. If you offer someone a job and offer $200000/yr for it, but they see others making $250,000 or more, they're more likely to feel wronged by that than if you offer them a job for $70,000 while those around them are making $35,000.\n\nIt's all about pecking order. And what we see with a lot of Trump supporters is that they aren't as high on the pecking order as they want to be. So they look at Trump as a wealthy business person who they want to be like and can get them there.", "Don't forget that they would also get at least 1 Supreme Court justice thus controlling every aspect of the federal government. ", "Feelings are more important than facts. Facts tell us that Obama made America better. But dues it *feel* that way though? Nah so I am going to make up some talking points over here for why he made it a lot worse. You can take your facts and do what you want with them.", "What do you mean \"considering our options now\"? Even if you don't consider our current options he's one of the best presidents this country has ever had.", "I have a gay friend who is full on 'Kool aid' drinker for trump. Last night he was writing his trump survived yet another assassination attempt. When anyone told him there was no gun found he just repeated \"I don't trust the Hillary media\". ", "It's disgusting that the same people who yell about america's freedoms the loudest actively work to silence anyone who doesn't share their views that hardest.", "People are saying that Donald Trump literally can't read?\n\nAll the the best people are saying that. It's horrible I hope it's not true and don't think it's true. But people are saying it and I don't know.", "It's worth noting that is probably because he *is* the person who best represents their views. It's much more an indictment of the Republican base than anything else. ", "As someone who works in advertising it disgusts me that we care far more about truth in advertising for our products than our politicians.", "I didn't think he'd actually say something that fucking ludicrous | Trump/Pence 2016", "Sexism can be expressed in many ways other than malice.  Romney has expressed the belief that women need to be \"cherished\" and \"protected\" by men.  It's the old \"That woman that was assaulted was somebody's mother, sister, daughter, etc.\" type of paternalism.   It's not malicious, but it's clearly in line with the LDS view of gender where women are defined primarily by their relationships with men and should be more focused on home life than public life. \n\nTrump has done a pretty damn good job at making the type of paternal, benevolent sexism practiced by traditional Christian conservatives look pretty appealing, though, I will give you that.", "I have a feeling there will be more than just a few Republicans who vote for Hillary. And let's be honest Donald Trump has no loyalty to the GOP or conservative values or even basic decency. I doubt there is much inner turmoil amongst Republicans who cannot vote for Trump. It's clear to everyone with the ability to think critically that Trump is an amoral ignoramus with the temperament of a chihuahua. ", "To me the crazy part of this isn't that the Trump is campaign lying so blatantly here -- they've proven themselves to be inveterate, remorseless, unrepentant liars over the last year or so, which just makes this ad par for the course. \n\nThe crazy thing to me is that in the context of all these totally manipulated and fabricated statements, rebuttals and advertisements, all this indisputable lying, Trump's followers aren't just supporting him, they're *fervently* supporting him, like a religious figure. \n\nIf this doesn't throw up a million red flags for you about how dangerous Trump is nothing ever will, but allow me to spell this out: Trump's constituents are de facto cult members, and he is playing each and every one of them in precisely the same way as a cult leader would. Please remember this fact if you're considering voting for Trump, and please realize the devastating effect this would have on our country if he were to win. ", "I think he just repeats whatever people tell him. ", "Most of the time you don't need to read the article on Reddit until the comments tell you it's worth it or not", "I thought he misspoke meant to say thousand instead of million. No. He literally says it would triple our population in one week. What a moron.", "I want to believe so bad...", "To be fair there are a shit load of Catholics who so not like the current Pope because he, incidentally, espouses the words of Jesus and he lives his life based on compassion and empathy. Many of them prefer the fire and brimstone God, not the loving New Testament God. Which begs the question, why are they Catholics at all, then, but that's another story.\n\nI grew up Catholic and abandoned that as soon as I could. But much of my family and extended relations are either Irish or Roman Catholic to a tee, and they don't like this modern Pope. I love him. I'm not religious at all, but I read his newest book and really think he's got an important message for those who live their lives in faith. It's a shame that so many people would rather hate than love, even when their faith tells them not to.", "Florida"], "links": ["5bf6ti", "5bf6ti", "5bfdnl", "5bf6ti", "5bebz1", "5bf6ti", "5bf6ti", "5bfda6", "5bfdnl", "5bebz1", "5bebz1", "5bebz1", "5bebz1", "5bfda6", "5be465", "5bdx22", "5bfatt", "5bfda6", "5bf99x", "5bf9pj", "5bebz1", "5bebz1", "5bf9pj", "5bf6ti", "5bebz1", "5bf6mf", "5bdx22", "5bebz1", "5bf6ti", "5bebz1", "5bf6hz", "5bdpna", "5bebz1", "5bf6ti", "5begx2", "5bdx22", "5be465", "5bf6ti", "5begdx", "5bfdnl", "5bdx22", "5begdx", "5begx2", "5bf99x", "5bdx22", "5bfd4j", "5bf6yg", "5bebz1", "5begx2", "5bfcpi", "5bdsof", "5begx2", "5begx2", "5bebz1", "5bf9pj", "5bdsof", "5bfd4j", "5bf6hz", "5bebz1", "5bfda6", "5bdx22", "5bf9pj", "5begdx", "5be465", "5bfd68", "5bebz1", "5bf6yg", "5bf9pj", "5be465", "5bf6hz", "5bf6hz", "5bebz1", "5bebz1", "5bdufc", "5bf99x", "5bf99x", "5be3rr", "5be465", "5bf9pj", "5bf6hz", "5bf6ti", "5begdx", "5bdsof", "5begx2", "5bdsof", "5bebz1", "5begdx", "5bebz1", "5bfc6g", "5bdx22", "5bfb7t", "5bebz1", "5bebz1", "5bf9pj", "5bfb7t", "5bfdnl", "5bfim4", "5bfim4", "5bf6ti", "5bfim4", "5bfdnl", "5bfdnl", "5bfdnl", "5bebz1", "5bfim4", "5bfhua", "5bf6ti", "5bfiax", "5bfgnk", "5bf6ti", "5bffcj", "5bfi92", "5bfdnl", "5bfhua", "5bfhua", "5bfgsf", "5bebz1", "5bfhua", "5bf6ti", "5bfgnk", "5bfdnl", "5bfi92", "5bebz1", "5bebz1", "5begx2", "5bfgsf", "5bfhua", "5bebz1", "5bfgnk", "5bebz1", "5bffcj", "5bebz1", "5bebz1", "5bfdnl", "5bfgsf", "5bffcj", "5bfim4", "5bebz1", "5bfatt", "5bfgsf", "5bf6ti", "5bfda6", "5bebz1", "5bebz1", "5bffcj", "5bebz1", "5bfim4", "5bebz1", "5bfgnk", "5bf6ti", "5bfjhg", "5bebz1", "5bebz1", "5bf9pj", "5bfdnl", "5bfgnk", "5bf9pj", "5bebz1", "5be465", "5be465", "5bfi92", "5bdx22", "5bffcj", "5bffcj", "5bebz1", "5bebz1", "5bf6ti", "5bfatt", "5bf9pj", "5bebz1", "5bdx22", "5bdx22", "5bfi92", "5bf9pj", "5bf6ti", "5bfgsf", "5bfjhg", "5bfgsf", "5bf9pj", "5bebz1", "5begx2", "5bffcj", "5bdsof", "5bfd4n", "5bf9pj", "5bffcj", "5bfd4n", "5bev8z", "5bfatt", "5bcyxv", "5bfhua", "5bfogk", "5bfdnl", "5bfnnp", "5bfnnp", "5bfogk", "5bfn98", "5bfq5o", "5bffcj", "5bfogk", "5bfp9f", "5bfim4", "5bfn98", "5bfn98", "5bfn98", "5bfp9f", "5bfogk", "5bfdnl", "5bfim4", "5bfdnl", "5bebz1", "5bfnqp", "5bfnnp", "5bfogk", "5bf6ti", "5bebz1", "5bebz1", "5bfnnp", "5bfn98", "5bfdnl", "5bebz1", "5bfogk", "5bf6ti", "5bfogk", "5bebz1", "5bfnqp", "5bfogk", "5bfn98", "5bfn98", "5bfp9f", "5bfim4", "5bf6ti", "5begx2", "5bfiax", "5bfogk", "5begx2", "5bfq5o", "5bfim4", "5bfhua", "5bfn98", "5bfhua", "5bfhua", "5bfn98", "5bfogk", "5bfgnk", "5bfp9f", "5bfnqp", "5bfdnl", "5bfnm3", "5begx2", "5bf6ti", "5bfnnp", "5bf6ti", "5bfdnl", "5bffcj", "5bfnnp", "5bfogk", "5bfn98", "5bfdnl", "5bfhua", "5bebz1", "5bfhua", "5bfn98", "5bf6ti", "5bfogk", "5bffcj", "5bfim4", "5bfnnp", "5bfi92", "5bfnnp", "5bfn98", "5bfnnp", "5bfn98", "5bfim4", "5bfn98", "5bfhua", "5bf6ti", "5bfim4", "5bfp9f", "5bfdnl", "5bebz1", "5bfn98", "5bfogk", "5bebz1", "5bffcj", "5bfim4", "5bfz5d", "5bf6ti", "5bfwjg", "5bfn98", "5bf6ti", "5bfogk", "5bfim4", "5bfi92", "5bfwjg", "5bfiax", "5bfogk", "5bffcj", "5bfdnl", "5bfv6p", "5bfiax", "5bf6ti", "5bfdnl", "5bebz1", "5bfim4", "5bfvor", "5bebz1", "5bfogk", "5bf6ti", "5bfogk", "5bf6ti", "5bfn98", "5bfim4", "5bfi92", "5bfogk", "5bfwjg", "5bfn98", "5bfdnl", "5bfim4", "5bfogk", "5bfogk", "5bfn98", "5bfnm3", "5bfda6", "5bfzt6", "5bfnnp", "5bfnqp", "5bfdnl", "5bfq5o", "5bg1s4", "5bfwjg", "5bfogk", "5bfrt9", "5bfn98", "5bfdnl", "5bg2di", "5bfdnl", "5bfiax", "5bfnnp", "5bfp9f", "5bfdnl", "5bfq5o", "5bfn98", "5bfn98", "5bebz1", "5bfim4", "5bfv6p", "5bfn98", "5bfim4", "5bebz1", "5bfdnl", "5bfi92", "5bfn98", "5bfogk", "5bf6ti", "5bfiax", "5bfdnl", "5bfn98", "5bfogk", "5bfdnl", "5bfvor", "5bebz1", "5bfdnl", "5bebz1", "5bfn98", "5bfgsf", "5bfhua", "5bfv6p", "5bfiax", "5bfnm3", "5bfnm3", "5bfim4", "5bfim4", "5bfiax", "5bfhua", "5bfim4", "5bf6ti", "5bfnnp", "5bfim4", "5bfdnl", "5bfz5d", "5bfz5d", "5bfz5d", "5bfz5d", "5bfz5d", "5bfwjg", "5bfwjg", "5bfnnp", "5bfogk", "5bgdfv", "5bfwjg", "5bf6ti", "5bg9h3", "5bfwjg", "5bfzt6", "5bfz5d", "5bfn98", "5bfwjg", "5bfz5d", "5bf6ti", "5bfogk", "5bf6ti", "5bfnnp", "5bfn98", "5bfogk", "5bfn98", "5bfhua", "5bfwjg", "5bfdnl", "5bfz5d", "5bfz5d", "5bfnnp", "5bfnnp", "5bfwjg", "5bfogk", "5bfwjg", "5bfn98", "5bfi92", "5bf6ti", "5bfogk", "5bg9h3", "5bfn98", "5bfz5d", "5bfn98", "5bfogk", "5bg9f4", "5bfz5d", "5bfz5d", "5bfogk", "5bfogk", "5bfnnp", "5bfdnl", "5bf6ti", "5bg2di", "5bfzt6", "5bffcj", "5bfn98", "5bfn98", "5bf6ti", "5bfz5d", "5bfz5d", "5bfz5d", "5bfn98", "5bfhua", "5bfz5d", "5bfi92", "5bfogk", "5bg2di", "5bfn98", "5bfn98", "5bg906", "5bfn98", "5bfogk", "5bg906", "5bfogk", "5bfz5d", "5bfwjg", "5bfdnl", "5bfdnl", "5bg906", "5bfn98", "5bfq5o", "5bfi92", "5bfdnl", "5bf6ti", "5bfn98", "5bfhua", "5bfn98", "5bfn98", "5bgakj", "5bfzt6", "5bfwjg", "5bf6ti", "5bfdnl", "5bfwjg", "5bgdfv", "5bfz5d", "5bfz5d", "5bf6ti", "5bfz5d", "5bfz5d", "5bgdfv", "5bgdfv", "5bgdfv", "5bgdfv", "5bf6ti", "5bfz5d", "5bf6ti", "5bfwjg", "5bg9h3", "5bgdfv", "5bf6ti", "5bfp9f", "5bfz5d", "5bghqb", "5bgdfv", "5bf6ti", "5bgdfv", "5bg9h3", "5bfz5d", "5bfwjg", "5bfwjg", "5bfim4", "5bgdfv", "5bfz5d", "5bfz5d", "5bfnnp", "5bfn98", "5bfwjg", "5bgdfv", "5bghqw", "5bfn98", "5bfz5d", "5bfogk", "5bg9f4", "5bfn98", "5bg906", "5bg9f4", "5bghqw", "5bf6ti", "5bfz5d", "5bfogk", "5bfim4", "5bfwjg", "5bghqb", "5bf6ti", "5bfz5d", "5bfgnk", "5bf6ti", "5bf6ti", "5bfnqp", "5bfz5d", "5bfz5d", "5bfogk", "5bf6ti", "5bfz5d", "5bfwjg", "5bfz5d", "5bfnnp", "5bfogk", "5bfz5d", "5bfz5d", "5bf6ti", "5bfz5d", "5bghqb", "5bfim4", "5bfn98", "5bfim4", "5bfz5d", "5bfn98", "5bfz5d", "5bfim4", "5bgdfv", "5bf6ti", "5bf6ti", "5bfn98", "5bghyt", "5bfz5d", "5bf6ti", "5bgakj", "5bfdnl", "5bffcj", "5bf6ti", "5bf6ti", "5bfim4", "5bfv6p", "5bf6ti", "5bfnnp", "5bfz5d", "5bf6ti", "5bfn98", "5bfdnl", "5bf6ti"]}