{"comments": ["\"Fact checkers are scum\"\n\n-- Donald J. Trump", "Two things about this interview:\n\n1. Bill Maher gave an excellent interview and pushed the President to answer tough questions; and you can see some were difficult for the President to answer i.e. size of military. Both Bill Maher and his show are a ray of light in the mud of modern day politics.\n\n2. Whether you like President Obama or not, or agree with his decisions; you have to appreciate how he approaches solving problems, and leading the nation. He is thoughtful, considerate, and very educated on all issues and tries to make the best decision. This is all you can ask for in a leader.", "Coulter*", "I was REALLY impressed by his discussion of GMOs. That's a liberal issue and he basically said that for the most part science is on the side of GMOs and that we should be humble in front of hard science.\n\nI was really impressed by this... We need more leaders like him.", "\"As a political candidate I'll go with how people feel and I'll let you go with the theoriticians,\" Newt Gingrich", "It must infuriate Trump that his money could never buy him a fraction of the class Obama shows.", "In his defense they are pro science on that show. They don't even try to hide it!", "That's the thing about the right in this country. They *don't* appreciate Obama's thoughtfulness his intelligence, or even his basic decency. They have vilified this guy--who I honestly think is one of the most objectively likeable people to ever be in politics--as a USA-hating, Socialist Kenyan Muslim. I don't even recognize this country as the same one that so overwhelmingly came together after 9/11. I don't know where we go from here. It's sad.", "It should no longer be called a pants on fire claim. It should be called a trumpian claim.", "Here's an [NPR article about this church](http://www.npr.org/sections/thetwo-way/2016/11/03/500496061/fbi-investigating-burning-of-black-church-painted-with-vote-trump). I don't care if the article gets read but the picture it opens with of the destruction caused by this fire is so gut-wrenching. A few days later, a Trump office was [grafittied in Colorado](http://www.9news.com/news/crime/denver-trump-campaign-office-vandalized/348057186). Of course, there was absolute horror from Trump's regime on behalf of their rented office. Compare the two: scrubbing off spray paint, v trying to rebuild a place where people worship, talk, sing, love, cry, tithe...to me, the comparison perfectly underscores the difference between what Trump has to offer and what he's trying to destroy. I despise vandalism on either side, but consider the difference in depth here.", "My grandparents were really conflicted about voting for Trump this election.  They've pretty much always voted Republican based on their views on abortion.  My grandfather watches Fox News exclusively.  My grandmother was considering not voting at all.  Then they heard Trump talk about ripping babies out of the womb one day before the due date (i.e. birth) and saw the faked Planned Parenthood video and went to vote for Trump.\n\nThey voted based on a lie.  People believe the drivel that comes out of the Republican talking heads.", "Fox news is like an abusive SO who tells you everyone else hates you and is a liar so you need to be grateful that Fox is there for you, because they're the only ones you can trust. ", "AND for claiming there was an assassination attempt on his life from a guy holding a paper sign.", "[BUSTED: CNN’s Corey Lewandowski tried to hide his face Saturday as he stepped off Trump plane](http://www.rawstory.com/2016/10/busted-cnns-corey-lewandowski-tried-to-hide-his-face-saturday-as-he-stepped-off-trump-plane/)", "I like to think that Obama's best days have been since Trump announced his candidacy. For every aggressive or spontaneous thing the latter does our President does one level-headed and conscientious. It's easiest to go low when your opponent goes high, but not always the opposite. I think Obama is trying, *really* trying, to be as respectable as possible in his last days of office.", "My dad is convinced fox news has gone liberal since they (excluding hannity Janine, and O'Reilly) have been somewhat trying to get both sides recently. Every time they cover a Trump gaffe he laments that they're giving the Clinton's free advertising, it's sort of hilarious. He also thinks that Trump is sure to win in a landslide vote, \"because the middle class is tired of it\". \n\nPoor father has lost his political marbles. He basically doesn't trust anything that isn't Breitbart or drudge report, and he wasn't always this bad either.", "He used the Casino company as a personal piggy bank forcing it to take on his personal debt by buying assets away from him and taking out bonds to do so. Then, he declared bankruptcy, so he didn't have to pay the bondholders back, and finally, he declared this all as a loss for himself, despite him not losing the money because of the aforesaid bankruptcy. That's why he's been able to not pay taxes for years.", "I'm in exactly the same boat. My dad thinks that anything that isn't conservative media is filled with lies and can't be trusted while anything that claims to be conservative is automatically correct.", "I watched almost every episode of that show and I think Margaret Thatcher is wrong.", "It doesn't matter what the claim is it was repeated on FoxNews ad nauseam, and that's where Trump got it.\n\nThe one thing Trump's candidacy has proven is that you can be effective in politics while *constantly* lying. Nobody gives a shit about the truth anymore.", "&gt; but consider the difference in depth here.\n\nnah man all lives matter\n\n", "Hey it took *skill* to bankrupt a large casino resort in the '90s.  That's why he's better than Steve Wynn,  Kirk Kerkorian, and Sheldon Adelson.  He managed what they couldn't, and did it bigly. ", "[This is what a white middle class man whom we've known for over twenty years, posted on my wife's Facebook page before he unfriended her.](https://i.redd.it/xdana36jdxvx.png)  Trump &amp; Co. have driven half this country insane.  Literally, not figuratively.", "I have never seen any democrat (not to mention your comparing a comedian to talk show guys) say anything like \"You cant trust the other media because they all lie but me\" that was my point and given Trumps lack of self restraint I don't think I would feel very safe if he had the US military behind him", "Yes Trump had no control over the actions of the Secret Service (who, incedentally, did a fine job). What Trump *does* have control over is his reaction afterwards. Continually trying to frame a protester with a sign as a legitimate assassination attempt is pathetically deceptive.", "Pence a man of \"faith,\" must be so proud of himself. ", "I saw a white lady holding a \"Blacks for Trump\" sign the other day!", "Say it with me everyone: Radical. Trumpist. Terrorism.\n\nIf you refuse to say the name you're part of the problem.", "That should just be a new rating  ", "The front of r/all just an hour ago was led by r/The_Donald proclaiming that it had been proven by the Podesta emails that the protester who was thrown out of Trump's rally was a Hillary plant and the only proof offered in the linked article was people speculating in tweets that that was what was happening.", "The difference is that with Romney McCain, and even Bush I wasn't thinking \"what sort of human garbage would vote for this person?\"\n\nThat fact that he still has this much support has honestly changed how I see the world.", "Here someone who is actually a pro-life Christian does a much better job of explaining why it can be okay if not *better* to choose a pro-choice candidate than I ever have been able as an atheist.", "Interesting though general article. It would tentatively make sense that the \"engineering mentality\" doesn't translate over into abstract reasoning (viz. on the level of abstr. verbal reasoning required for ideological nuance): \n\n&gt;Gambetta and Hertog speculate that engineers combine these political predilections with **a marked preference towards finding clearcut answers.** This preference has affinities with the clear answer that radical Islamist groups propose for dealing with **the complexities of modernity: Get rid of it.** They quote the famous right-wing economist Friedrich von Hayek who argues that **people with engineering training “react violently against the deficiencies of their education and develop a passion for imposing on society the order which they are unable to detect by the means with which they are familiar.**”\n\nEngineering students. The worst.", "Did Trump claim it was an assassination attempt? I thought that was just r/the_donald over reacting to the fact that someone yelled out \"gun\".", "I've honestly started viewing this situation -- specifically the conditions that led to it -- as a national crisis. That such a huge chunk of our population is so removed from reality and completely brainwashed about things which are factually incorrect. This really is the greatest threat to our country (besides climate change).", "Pretty much any time you have Donald Trump talking about Obama you know he's lying.", "How about the Trump nazi that murdered two police officers in Iowa that week?", "I have a PhD in molecular biology and will never forget the time I entered the lunchroom to hear two colleagues (with my same educational background) discussing the new pope's views on abortion homosexuality and creationism and  agreeing at the end of the conversation \"whelp, I guess we will just have to wait to see what he tells us.\"\n\nSimply out of curiosity, I inquired what exactly they meant and listened as politely as I could. \n\n{Of note: one was a woman who I personally know to have had an abortion, and the other a gay man in a very loving relationship. Both are experts on bacterial antibiotic resistance which is the very definition Darwinian evolution and survival-of-the-fittest...}\n\nThey explained to me very clearly that they would HAVE to believe whatever the new pope told them to believe. End of story. \n\nI left the room wondering if I actually understand what the word \"believe\" means. \n\n*edit:\nTLDR: my colleagues taught me that for some, facts are irrelevant to \"belief\", regardless of education, lifestyle or experience. ", "Really hoping trump loses in a landslide in the hopes that maybe it wakes these people up.", "Aye [this](https://www.youtube.com/watch?v=sfkVLcZuCA4) was definitely one of Obama's finest moments, and that was just two days ago. Really gave a clear demonstration of just how much the crowd respects him as well. ", "This  is partly why I feel the humanities aren't nearly as useless as people make them out to be", "r/The_Donald likes to use the word \"proof!\" when they really mean \"unsubstantiated wild guess!\"", "&gt; The dude just described for a minute how they strangled kicked, and grabbed his balls, and this is the question you decide to ask?\n\nThey didn't get one of the people assaulting him to give their point of view for an equal amount of time and position it as two equally valid points of view? Unfair!", "Weapon of mass education", "When you cannot attack the facts attack the messenger I guess.\n\nWe've all seen the video of Obama. We've all heard what Trump said. Only a fucking idiot would believe Trump.", "SNL writers have to appear not to have a preference but they do. Of course they do. It's apparent in their portrayal of the election, especially in this skit. I happen to agree with them. \n\nThat being said, the fact that it's a Clinton line doesn't make it less true. It's not something you can really debate; the two candidates represent two very different ideas of America. \n\nOn one hand, we have Clinton, who, despite her faults (and *everyone* has faults, especially after 30 years of being in the limelight) is a devoted civil servant who has gotten high ratings while in office and accomplished good things for her communities. \n\nOn the other, we have Trump, who has *no* experience in government (which I can't see as a plus the way some people do), seems to have no sense of diplomacy, who agrees with dictators and is endorsed by the dregs of American ideologues. He's openly misogynist and is supported by racist, anti-Semitic, white supremacist, and fascist groups. \n\nSo it really is a choice between two Americas, and I don't fault the SNL writing staff for using a line that is true. ", "&gt;CNN commentator Peter Beinart lost it on Corey Lewandowski on Tuesday night.  \n\n\n&gt;“Don’t give me this nonsense” an exasperated Beinart told Donald Trump's former campaign manager on “CNN Tonight.”  \n\n\n&gt;“Corey, listen,” he added a moment later, “I’m not getting paid by one of the candidates, okay?”  \n\n\n&gt;Technically, Lewandowski is not being paid by a candidate, either, but he remained on the Trump payroll during his first three months of employment at CNN and would have been paid by the Republican presidential nominee through the end of the year, except that the campaign agreed to buy out the balance of his contract in September.  \n\n\n&gt;Beinart's outburst — triggered by one of Lewandowski's trademark off-topic, off-base claims — typifies the frustration many journalists feel as Lewandowski continues to act like a Trump aide rather than a political analyst.  \n\n[Journalists are running out of patience with Corey Lewandowski, even at CNN](https://www.washingtonpost.com/news/the-fix/wp/2016/11/02/journalists-are-running-out-of-patience-with-corey-lewandowski-even-at-cnn/)", "Nobody is mad about the immediate on stage reaction.\n\nPeople are mad that they are continuing to push the bogus \"assassination attempt\" line _before_ there were any hard facts. We are also mad that they continue to push that line _after_ there were facts disproving the idea.", "I was surprised to see a very conservative cousin of mine post on facebook that she'd rather see a third Obama term than have either of the two current candidates as president.", "Holding up a poster = inciting violence. Okay.\n\nNot sure what that has anything to do with this anyways.", "In some other parallel universe Comey didn't release the information it was leaked anyway and a Republican on CNN demands a senate hearing. ", "I hear this shit every day.\n\nI had a guy at my bar the literally said \"If you support Hilary then you're voting for Trump. Her VP is exactly the same as Trump, and she's going to jail. So you're voting for Trump because her VP is the same kinda guy. And Trump's VP, he sounds great. He's a good man.\"\n\nI stopped washing glasses and said \"I'm sorry, I try to stay out of these conversations but...do you know anything about Tim Kaine?\"\n\nHe said \"I don't like him. He sounds just like Trump.\"\n\nAnd I just walked away, figured I'd do some restocking in the back instead.\n\nThis guy was about 50 and talking about how he's 600K liquid right now and that's why he's voting for Trump.", "How?\n\nSeriously how can you lose nearly a billion dollars in one year, when all the other casinos are making huge profits? How did he do it?", "Fox convinced my parents and I quote, \"Obama is ISIS.\" So indeed, it's toxic and depressing, to see people completely taken over by that. Not to say that I trust any major media news source but certainly not the one which puts one of the craziest things I've ever heard on a podium.", "This is what I haven't gotten about Trump the whole race....they talk about all this great business success this guy has had....yet they couldn't produced a single person who was happy to have done business with the guy. \n\nNot a single person stepped forward and talked about how working for or with Trump was beneficial for them. The Trump people literally couldn't find a single person to say that....after 30 years in business.\n\nMy father was a business man well liked mostly, ran a small local car spot. When he passed, people talked about how nice of a person he was and that he was always fair in his business affairs. To me it's very striking that a no one like my dad could have people say that about him, but this supposed billionaire, who's an expert at deals, can't produce a single person to say the same thing about him.", "\"Liberalish magic it burnssss usss.\"", "Bazinga.", "Is it misleading to say that Trump closing in the polls since the Comey letter was a major cause of the 9 day decline? Genuinely asking.", "Filmed by Darth Vader.", "Good lord... that's 2.4 million more latinos who can vote by 2020. \n\nCan't wait to see the feeble GOP autopsy report out of this election ", "Is that code for the gays hippy immigrant liberals to take away our gunz!?", "That's after he told the crowd to \"take him out\". ", "I mean it's certainly a possibility, and one that makes sense. But this article reeks strongly of a correlation leading to a causation, based on a small subset of data, where the rest of the data doesn't show much of a trend at all. Compare these two charts and you'll start to realize that this conclusion doesn't make any sense:\n\nhttp://www.macrotrends.net/2490/sp-500-ytd-performance\n\nhttp://projects.fivethirtyeight.com/2016-election-forecast/?ex_cid=rrpromo\n\nPolitics does have an impact on the stock market, but the relationship between polling numbers and stock index is not quite clear, if one even exists.", "CNN was perfectly fine with Brazile being on the Clinton payroll she was 100% going right back on CNN after the campaign was over if she so chose and she was only off because she chose to do so to dedicate her time to the Clinton camp and avoid conflicts.\n\nProblem is, it was proven she leaked debate questions to the Clinton camp and that is 100% unacceptable and why she got the boot and will not be back.  CNN was never \"hot\" on her for working for the campaign, they got \"hot\" on her for leaking questions.\n\nUntil the Corey guy does something like this, the two are not even remotely comperable.", "I'm in college and the sustained passion even for Hillary,at least where I'm at, has been unexpectedly high. I know no one who is not voting and of them a sizable margin are voting for Clinton. ", "Watch the whole interview guys. It's much better than just this one quote.", "For someone whose only qualification is his supposed business acumen it really is remarkable. Mitt Romney may have been a \"vulture capitalist\" but he at least was undeniably good at what he did. Meanwhile with Trump, we have story after story of partnerships fractured by his mismanagement, investors screwed when failing companies acquired his personal liabilities, and small businesses being stiffed or bullied into accepting less than agreed upon for their work.", "The weird thing is that any one of those rabid supporters would not be safe either if Trump called them out. Crazy that they don't make the connection.", "https://finance.yahoo.com/news/clinton-daily-dose-faith-along-politics-144655862--election.html\n\nAt about 5 a.m. each day — maybe a little later on weekends — an email from the Rev. Bill Shillady arrives in Hillary Clinton's inbox.\n\nThe contents? A reading from Scripture. A devotional commentary. And a prayer. They're sometimes inspired by the headlines — focusing recently for example, on the role of women in the Bible.\n\n\"I know she reads them, because she responds to me,\" says Shillady, executive director of the United Methodist City Society in New York. \"We've had some interesting emails back and forth about some of the concepts.\"\n\nIt's no secret that Clinton is a lifelong Methodist. But Shillady — who officiated at Chelsea Clinton's wedding, led a memorial service for Clinton's mother, Dorothy Rodham, and gave the closing benediction at the Democratic National Convention — feels that many people don't really know how much her faith \"is a daily thing.\"", "That tweet calls the dude an assassin. You can't kill with a sign. ", "&gt;have been ineffective at compromising with Republicans due in part by vilifying the opposition and refusing to meet in a middle ground.\n\nThat moment when you think someone is making point you disagree with but seems to have at least a grasp on reality, and then you get to a statement so fundamentally absurd and provably false that it negates anything else that was said. ", "When you accuse someone of doing something that you do frequently?", "There's a man who watched the VP debate and completely bought the deep voice folksy chuckle act.\n\nVery glad Pence has the weight of Trump around his neck he's a very scary man.", "Of course the guy filming his tv playing FOX news breathes so heavily and laboriously just standing still.", "\"Other people's personal Vietnams was actually Vietnam.\" - /r/CliffsNote5", "Right but it seems that someone at the rally screamed \"gun\" based on the protester holding a sign. The Secret Service took understandable precautions. Afterward, though, the Trump campaign has called this peaceful protest an assassination attempt to score political points despite the lack of any gun. And the protester was beat up by Trump supporters. No condemnation of the violence, even with hindsight.\n\nDisgraceful. ", "Really really good article. Thanks for posting that. \n\nIf you're reading this, read the article above!", "Didn't Margaret Thatcher hate gay people?", "Top post on /r/all is still acting like someone had a gun at that rally. It's not about facts but *feelings*. Even smart people can get overwhelmed by feelings. Take the astronaut who drove across the South to assault her boyfriends girlfriend or something. I mean feelings cause otherwise normal humans to kill those they love in moments of passion. They're strong and dangerous. I think misleading people and using their feelings for your advantage is wrong. But that's how you win when you don't have the facts on your side. That's why you don't see a flood of sensationalist posts about Trump from the other camp. They just post regular articles when he does something stupid because those are facts. ", "The world won't come to an end but America will be severely hurt. Tax policies of trump and the million other social and economic policies he's a proponent of, along with the Supreme Court judge would set the county back 30 years. The damage he will do to US interests in enormous. \n\nUnemployment, the deficit, gay rights, abortion, planned parenthood, net neutrality, the Supreme Court, private prisons, private roads and highways, climate change, the EPA, vaccination, black voter  disenfranchisement, gerrymandering, NIH funding, immigration policy, Drug policy/marijuana policy, money in politics/Citizens United. These are just a few of the things this man wants to destroy.  No the world won't end, but we could loose out big time on all these issues. \n\nIf you need any proof of what a shitty president can do, just look at the state of the country when bush left office.", "Calling it an assassination attempt works too his advantage as though people are trying to stop *his mission.* As if he is Andrew Jackson, Teddy Roosevelt or his \"hero\" Reagan.  ", "Naw I think he still has time to pivot.", "I'm just surprised that there's a group called \"Koreans for Trump\"\n\nLike holy shit wtf?", "De nada carnal. This bad hombre voted on the first day of early voting. Welcomed the stink eye from the old guy wearing the hillary for prison shirt and the two younger guys who tried to hand me republican pamphlets outside the voting site.\n\nMy mom voted for the third time in her life, Obama, Obama, Clinton. Dreaming of a blue Texas.", "What I've never understood about people championing privatization to extents like this are that they don't seem to realize that corporations have to make a profit from this. The government doesn't. Of course toll roads are more expensive of course private insurance is more expensive that single payer, who the hell thinks it wouldn't be? But apparently everyone needs to get their cut, so they spend good money convincing people they're helping them when they're only helping themselves. This is Donald Trump's campaign in a nutshell, convincing millions of gullible voters he's in it to help them when he's only in this to help himself. ", "Post racial society!", "Outside of the fact that it probably would end in the sense of America being *the* superpower of the world Maher also did say that he and other liberals had unfairly called past Republican candidates 'the Antichrist' but can look back say that they were good men whom they did not agree on policy or direction they wanted America to go. ", "*head explodes*", "People are always unable to detect bias when they agree with it. It's definitely a two way street ", "1? More like 2 or maybe 3. The age of SCOTUS judges are up there. Retirement or death of 2 more is feasible in the next 4 yrs.", "Somehow Fox news tried to spin that as if he was saying illegal immigrants should try to vote. Wtf??", "He squashed the vicious danger of air traffic being controlled.", "Honestly a felon currently serving time should be able to vote. It would help ensure the humane treatment of prisoners, and it would be a democratic safeguard against political prosecutions. ", "*Some* say that this was all to cover up the poor girl's TrumpBortion. I can't say who but the *best* people, the *smartest* people, people who know what they are talking about.\n\nI wonder if loose talk about this alleged TrumpBortion will affect his chances? How are Evangelicals reacting?", "We have video evidence bruh. All you have is hot gas.", "...have you ever heard of racism? You think racists care about being \"politically correct\"? Or putting on \"a good face\" for the ethnic minorities in this (excuse me *their*) country? The state of Mississippi — where this church was burned — *still has the Confederate cross on their state flag.* Think about it.", "The latest SNL", "Hey look Melania's Anti-Bullying campaign has begun!", "Presidential material right here.", "If his own staff can't trust him with a phone can we trust him with our military?", "\"We don't trust him with Twitter but we trust him with the country\"\n\nAlso:\n\n&gt;...the Times writes that Trump is privately expressing worry about his chances of defeating Hillary Clinton, and always asks for his aides to be talking to him into the night so that he is not “alone with his thoughts.”\n\nThis is hilarious. It's like he needs someone to read him a bedtime story where he wins the election.", "A man lacking the self discipline and common sense to not flame people on twitter wants access to the nuclear codes.\n\nHonestly.", "[Business Insider](http://www.businessinsider.com/conservative-media-trump-drudge-coulter-2016-8) had a great article about this and even conservatives are turning away from Fox. They admit that they can't debunk the Breitbart lies because people don't accept any other source\n\n&gt;\"If you are a conservative talk show host which I am, if you don't accept that it's likely Hillary Clinton has taken part in multiple murders, or that Barack Obama is a Muslim extremist sympathizer who was probably born outside this country — if you don't accept those two things, it's almost as if you're a sellout. You're a RINO. You're somehow part of the liberal elite. It's nuts. It's making my own show very difficult to do. It's almost where to the point where we are not able to function.\"\n\n&gt;He continued: \"It's almost like it's a disease, and it's taken over people. I don't remember this being the case four years ago. But something has happened. Something snapped. But now all of a sudden, if a story comes out, and it's not on Breitbart or endorsed by Drudge, it can't be true. Especially if it's about Donald Trump. Which is flat-out ludicrous.\"\n", "Always loved the way Obama responds to questions. Sometimes it can be long-winded but you always get the sense that he really took care to consider a wide range of concerns on any particular issue before making a decision. And he always communicates that to the people, or to whoever he is speaking with. \n\nAdditionally, he appears mindful of his own biases and imperfections. I don't agree with him on everything, but goddamn I will miss his inclusive style of speaking about policy issues and positions. ", "I'm sure he'll totally be more responsible once we give him access to nuclear weapons.\n\nRight?", "Many Trump supporters have argued he'd be \"stopped\" (which is treason) or outright assassinated by the military if he tried to launch nukes.\n\nNot only do they not understand that Trump can unilaterally command the launch of nuclear weapons but they actually think an argument of \"Yea he might and probably will, but someone will assassinate him if he does\" is actually a pro-Trump argument.", "This reminds me of when Bush Jr. was running for President the first time people realized he was kind of an idiot but some told themselves it would 'be OK' because Cheney was smart and would be there to make decisions if things got complicated.\n\nUnfortunately a lot of people were not aware of what an evil sociopath Cheney was - although it seems they were right about him essentially running the White House.", "mfw this was all Bethesda's super long marketing campaign for Fallout 5.", "And Trump's inner circle is made up of anti-semites racists, abusers, and criminals. That's who would have the real power. People who are even more evil than Trump is stupid.", "To be fair CNN said to not read the WikiLeaks emails and to only get information on it from them.\n\nAll media is biased one way or another.", "*\"It is a standard practice during elections to allow anyone who was in line prior to closing time to cast a ballot so that no one is disenfranchised because they failed to anticipate their neighbors’ interest in the election. \"*\n\nThe GOP just can't stand the idea of non-white people voting, and tries their best to prevent it through voter suppression.\n\nToo bad they haven't figured out a simple solution - *offer a candidate with reasonable policies that more people (including non-white people) will support.*", "And that's the PRO TRUMP argument. Lol.", "Just say \"no\" to this man-child for president.", "Please don't let this child to become president. \n\nVOTE", "AAAHAHAHAHAHAHAHAHAHA\n\n\"it's not for me to take a grown man's Twitter.\" - Kellyanne Conway\n\nBWAAAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA", "I've noticed his Twitter account had been eerily \"sane\" as of late this explains it. This is a great article highlighting how he can't control his own behavior and has to have people try to redirect him like a parent trying to have an infant eat their vegetables. ", "Their argument is basically is that Trump would provoke a coup.", "We are entering the twilight zone folks. A playboy billionaire with a history of failed marriages, cheating on his wives, business partners, admitted on camera to have sexually assaulted women, is worshiped by the religious family-valued party to defeat a woman who has stuck by her husband through hard times, with loads of experience in all levels of national and international politics.\n\nAnd the you have the leftist 3rd-party candidate to attack the Democrat nominee, the rightist 3rd-party candidate to attack the Republican nominee.", "Donald... Donald look at me... loooook... where is your smartphone?\n\nHhppphmm gownooo\n\nDonald... is it in your mouth?\n\nHpppphhhhhhthhss\n\nDonald...\n\nGrup?!?!\n\nSpit it out.\n\nGro.\n\nSpit it out... c'mon... can't have McDonald's if you have a mouth full of phone.\n\nACHTOOIEEE\n\nThere. No more Tweeting... okay?\n\nwhatever.", "The vile lie aside this was just dumb politics.\n\nEven if you're the most frothing, vitriolic, alt-right, PC-hating, Limbaugh/Hannity listening Obama hater, you would know that Obama doesn't scream and has never screamed at anyone publicly.\n\nSaying \"Obama is screaming at someone!!!!\" immediately registers as bullshit.", "Why do so many Americans want a president who is so stupid?  Why do so many people want a president who needs to be restrained to get anything done?  Do people actually see this as a positive quality or am I missing something?", "True but it was NYT, the most hated of liberal news sources, that broke the existence of the private email server.", "My parents are the same way- single issue voters obsessed with abortion. We avoid politics generally because we love each other. However, after the third debate, I tried to explain to them how difficult it would be to overturn Roe v. Wade through the court system, even if Trump was somehow able to appoint a conservative majority in the SC. I also tried to explain that the abortions becoming more numerous and later in development the more reproductive freedoms are restricted. They told me I was lying. Lying! Their own daughter, who they made sure read every book possible, questioned her teachers, and went to the best schools they can afford. That is how brainwashed Fox News viewers are these days.", "I think after the Aleppo moment Weld realized Johnson isn't fit for the Presidency.", "Remember when Hillary Clinton had to deal with a protester who rushed the stage and the Secret Service took him down? A day after Trump suggested 2nd amendment remedies to stop her? \n\nhttps://youtu.be/iatOmZnGxu0", "I mean...CNN hired the guy as he was working for Trump. I don't blame Trump or Corey for that - CNN simply proves themselves to be a terrible joke of an organization and still some people believe they're some bastion of journalism.\n\nThat said world of difference between \"he's working for Trump\" and \"she helped Hillary cheat at debates by leaking her questions\". If Corey did the same, I'm sure they'd fire him all the same, but they also shouldn't have hired him in the first place.", "Booooo! \n\nCome on what good is having Trump running if we can't watch him melt down and self destructively spiral into despair in real time?", "Benghazi*", "Thanks Bill. As much as it sucks, Clinton herself can't say it. In general, *women* can't say it, especially if they attribute some of the \"rawness\" to Hillary's gender. I think a lot of it is because she's a woman. But this is America, so a white man is allowed to say it while women and minorities are not. ", "I was willing to overlook Aleppo. Then he had a fantastic interview with Chris Matthews and at the very end Matthews gives him the softest of softball questions: \"Which foreign leader do you admire?\"\n\nAnd he couldn't answer it. It was so embarrassing. \n\nhttps://youtu.be/ANgcaYfdkGw", "The scariest thing is that you can imagine what this behavior would be like if Trump gains the presidency. Non-events turned into attacks. Charges laid. Scary stuff ", "CNN is a mess.", "Must be someone other than Kellyanne 'It's not for me to take away a grown man's Twitter account' Conway. ", "Report: Aides block Trump from nuclear codes\n\nReport: Aides block Trump from NATO negotiations\n\nReport: Aides block Trump from calling Putin for advice", "Looks like the_donald still believes it was an attack.  \n\nYeesh people.", "I think OP's point is that just because someone says a quote doesn't mean it is true.", "&gt;  I don't know where we go from here.\n\nMars. We go to Mars. ", "Comey's mistake was making it public to begin with (way way back in June/July.) His only job was to report findings to DOJ he decided not to. His massive speech basically raking Clinton over the coals was unprecedented and he set himself up for this awful situation.", "Chickenshit Donald Trump is *TERRIFIED* of people who disagree with him.\n\n(Also thank God for that protester that the Secret Service don't have the same \"shoot first make up fake answers later\" approach that a lot of local police departments seems to favor.)", "They'll just believe it's rigged.\n\nI'm currently in a small town around rural Missouri. I've some triple-digit Trump lawn signs some yards with multiple ones, even flags and giant signs. Alternatively, I can accurately count the number of non-Trump presidential signs I've seen (4, 3 for Clinton and 1 Johnson, interestingly all 4 are on the same street)\n\nIn many of these rural communities, these people have lived in these areas their entire lives and rarely go beyond it. They see Trump signs everywhere, everyone they know is voting for him.\n\nIf/when Trump loses, many of these people are those who ABSOLUTELY will believe his rhetoric about the election being \"rigged.\" And I worry that their response could get pretty ugly.", "and little donald jr. is still standing by his false claim...  the nut does not fall far from the tree", "God dammit it's The Eldar Scroll's turn!", "This is why I laugh most when people claim that we have tipped past the problem of sexism and racism into an era of reverse racism and reverse sexism. Because at the end of the day America still needs to hear it from a white man.", "Yeah but Hilary.  E-mails!  I mean how much worse are e-mails then sexual assault tax fraud, racism, sexism, and being an overall piece of shit!", "Why is it that Republicans oppose giving legal voters full access to the ability to vote?\n\nWhat is stopping them from performing their own GOTV efforts to bring Republican voters to polls and help ensure they exercise their rights?\n\nCould it be because they know if every legal voter cast a ballot they'd never hold national power again? That their only chances of ever winning are by PREVENTING voting from happening, opposing the very foundations of democracy?", "That's what it came down to for my father as well. He wouldn't even consider that the Planned Parenthood video was bogus or manipulative.", "Lived with a guy who only watched fox news and read the drudge report. I slowly watched him go from a decent person to a paranoid hypocritical, racist piece of shit.", "Because Secret Service immediately releases assassins so they can go do televised interviews it's pretty standard when someone tries to assassinate a presidential nominee. First they ask him politely not to do it again, then they let him go.", "I am about as hippy liberal as possible but I can't stand MSNBC, it just feels disingenuous. (Just like Fox News)", "Trump is a threat to free speech.", "Christ if Clinton did something like this just imagine /r/The_Donald \n\n&gt;DAILY REMINDER THAT CROOKED HILLARY DID NOT APOLOGIZE FOR HER SUPPORTERS BURNING DOWN A BLACK CHURCH, UPVOTE THIS PHOTO SO THAT SHE'S THE TOP RESULT FOR 'RACIST' ON GOOGLE", "The problem with the media is not partisan bias. The problem is that they are completely incompetent. ", "\"Christ Joffrey was supposed to be a fictional character only\"\n\n- GRRM", "His answer about Obamacare and why we couldn't do single payer was actually fairly eye opening.\n\nThe jist of it for people that haven't seen the interview is that \"America doesn't do anything from scratch\". That we have a trillion dollar insurance industry that employees hundreds of thousands of people and it's not something we could change over night and start over. The only option as a nation is to figure out how to improve the system. Anything else is too costly.", "This might be useful:\n\n[Enter one of Donald Trump's Twitter URLs to see who likely tweeted it.](https://donaldtweets.com/tweet/?url=https%3A%2F%2Ftwitter.com%2FrealDonaldTrump%2Fstatus%2F790534428942622721#https://twitter.com/realDonaldTrump/status/781788223055994880)", "I predict history will not look kindly on the republicans for vilifying President Obama. They took a young fair and honest person that could have fathered some real growth for our nation, and they chose too demonized him. The fact that he was the 1st black president will make it look even more disgusting for future eyes to look at.\n\nSouthern children are still taught to hate Lincoln. 2 men of Illinois, and now we may have a woman of Illinois join them.  ", "After the Trump campaign we need a national conversation about abusive relationships.", "His campaign manager Kellyanne Conway is refusing to retract the statement.\n\nhttps://twitter.com/oliverdarcy/status/795269793444220928", "This won't make a difference. Trumpists live in a alternate reality. They really are like a cult. I bet there'll be some big money to be made after this election in deprogramming. A lot of families will want their loved ones back.", "\"Post factual\" means you can lie about anything as long as you insist that it's true and repeat it over and over again. Sadly, it works like a charm.", "Consider yourself lucky it's Breitbart. My father jumped ship for Infowars. Now his sole source of political insight is a fat manbaby who thinks the government is trying to control people with toothpaste.", "When Stewart was still on air I used to watch Hannity religiously just so I knew what TDS might cover. I fucking hate Stewart for stepping down before the election but at least I have my sanity back since I no longer watch Hannity and his bullshit.", "If you need more nightmare fuel it's probably more likely that Trump news network will exist if/when he loses and will put fox's propaganda to shame. And guess whose orange face will be center stage in this crazy circus", "~~Pretty much~~ any time you have Donald Trump talking ~~about Obama~~ you know he's lying.\n\nFTFY", "One of the most destructive things happening to our society is people becoming increasingly convinced experts are liars and that education is corrupting or brainwashing our children. (Not to say there might not be some elements of those things that are grounded reality... it's certainly more fiction than fact.)", "[He has Luther for that!](https://youtu.be/HkAK9QRe4ds)", "Can we stop calling terrorists 'militias'?", "The guy was released on the scene not even arrested. It's so crazy that *the police need to rescue protestors* from Trump rallies. But Clinton supporters are the violent ones!", "I don't know. The Republican side has a way of saying \"I would never do that\" and then doing it lately.", "IMO his most embarrassing moment was [this Guardian interview.](https://www.youtube.com/watch?v=vvULsrjLdI4&amp;t=4m34s) He's just too emotional.", "\"I am honored to have the greatest temperament of any human being ever.\" ", "That presidential temperament. ", "Wrong", "A guy opening for him in a rally after the Reno rally described it as such.", "And which party consistently and systemically cuts funding to education.", "But the people who support Trump don't give a shit if what Trump says is true. If they did they wouldn't be supporting Trump.", "You're the puppet.", "&gt; Trump actually spends a lot of time in his rallies reaching out to the African American community too\n&gt; \n\nLike that time he automatically assumed an African American in his crowd wasn't actually a supporter but rather a paid \"thug\" there to disrupt the rally?", "&gt; Jesus fucking christ people stop being obtuse.\n\nYou should be directing this to the Trump supporters who took \"Take 'em out\" as a order from their glorious god to try and murder a protester.", "You're right. Nuclear war is better. ", "&gt;In a statement Lauren Pratapas, a CNN spokesperson, said, “We are completely uncomfortable with what we have learned about her interactions with the Clinton campaign while she was a CNN contributor.”\n\n&gt;Yet, they’re comfortable with Corey Lewandowski, despite Federal Election Commission filings showing that Lewandowski is being paid by the Trump campaign for “strategy consulting.” This is in addition to his cushy CNN contract as a political commentator. Speaking of that commentary, Trump requires everyone who works for his campaign to sign “nondisparagement” agreements. As Nancy LeTourneau notes in Washington Monthly, “Lewandowski is probably legally bound to avoid any criticism of his former boss. CNN is basically granting a microphone to the Trump campaign in the guise of political commentary.”\n\nIt helps if you read the article instead of trying to argue against something that isn't in it.\n\nBTW, the guy I'm replying to [PM'd me to say I was banned from r/politics for my comments.](http://puu.sh/s8BP7/8fc84a13a3.png) It looks like they didn't do a very good job of scaring me off.\n\nedit: included link to image of this guys PM.", "You're right it's how he starts pretty much every one of his events. Such a brave man, removing silent protestors from his rallies. I wish the democrats were as brave and thick-skinned as Donald. Just watch the way Obama defends a protestor's right to protest at a Hillary rally the other day, he's such a pussy compared to Trump. Free speech is such a sham, it's the foundation of a weak and failing country. Real men get rid of all naysayers and surround themselves with yes-men, Trump is so brave. What a great glorious leader he is. I hope my children grow up to be like Donald.", "Can't control his own twitter but wants to control the country.", "&gt; Whether you like President Obama or not or agree with his decisions; you have to appreciate how he approaches solving problems, and leading the nation. He is thoughtful, considerate, and very educated on all issues and tries to make the best decision. This is all you can ask for in a leader.\n\nMy deeply conservative parents have heard him speak somewhere between 2 and 8 sentences in the last 8 years. They turn the channel if he comes on. They would not watch this interview even being on Fox. They literally do not give themselves the opportunity to appreciate *anything* about President Obama. And many others in this country are exactly the same. This is what they mean by \"low information voters\", they explicitly avoid gaining information from primary sources and only allow information to be spoon fed from tertiary+ sources that have radically changed the context and meaning of the original source's comments.", "And Trump's lowest point was how he spun *that* against Obama saying Obama was \"yelling\" at the Trump supporter. How delusional can you get?!? ", "Here's a novel idea: don't hire a campaign manager of a politician as a journalist. Donna Brazile shouldn't have had any sort of position there either quite frankly and this is the problem with news organizations. They try to get people who'll provide highly partisan opinions rather than people who will be non-partisan like before 24/7 news channels became a thing.\n\nThe end result is people get 1, maybe 2 (if \"fair and balanced\") cult perspectives rather than a normal, thoughtful and logical perspective focusing on the facts.", "The tongue thing was the moment for me... like what in the actual fuck was he doing in that interview?", "The Republicans didn't have anyone like Weld even running this time. Maybe Kasich but he was despised by right wing media for expanding Medicaid in his state. \n\nu/OneYearSteakDay [had an excellent post that everyone should see](https://www.reddit.com/r/politics/comments/56k6fd/you_knew_who_trump_was_when_you_endorsed_him/d8k3k8f/)\n#DON'T LET THESE FUCKERS OFF THE HOOK.  \n  \nCongressional Republicans didn't rescind their endorsements [when Donald was calling for killing innocent civilians](https://youtu.be/I1eXRXL0nkk?t=1m13s) or when [he doubled down on killing civilians](https://www.youtube.com/watch?v=m_qEBwwET0s), when [he called African-Americans thugs,](https://twitter.com/realdonaldtrump/status/592910662424223744) when [he asked gun owners to do something about Hillary Clinton,](https://www.youtube.com/watch?v=ELL-aYFgkXI) when [he questioned my President's ancestry and religion,](https://www.youtube.com/watch?v=FlpaEXWe3Zs) when [he implied that vaccinations cause autism,](https://www.youtube.com/watch?v=G23Y8R-KcKA) when [he promised to ban a religion from immigrating to the United States,](https://www.youtube.com/watch?v=eh7XaJlvJIg) when [he invited Russia to hack a US citizen,](https://www.youtube.com/watch?v=gNa2B5zHfbQ) when [he advocated for torture,](https://www.youtube.com/watch?v=oxZv1Wq2c28) when [he demeaned women (pick one),](https://i.imgur.com/sYqvfDR.png) or when [he said that Mexico was sending us rapists and criminals.](https://www.youtube.com/watch?v=apjNfkysjbM)  \n  \nTheir endorsement stood through each and every indefensible thing he's said or done.    \n  \n#DONALD TRUMP WAS UNACCEPTABLE BEFORE THE FIRST ENDORSEMENT WAS EVER GIVEN.\n  \nAny sitting politician who endorsed this man before, during, or after this campaign deserves to lose their job.  Donald Trump has been an unacceptable choice since day 1, since before we heard *any* of this, but they endorsed him anyway.  House and Senate Republicans were willing to risk the wellbeing of the American people, and nominate a madman, in an effort to preserve the appearance of party unity.  They care more about obeying the Eleventh Commandment than they do protecting their constituents.  \n  \nWhat we heard today might very well be his last offensive comment, but it's certainly not his first.  \n  \n#ANYONE WHO SUPPORTS THIS MAN IS WORKING AGAINST THE AMERICAN PEOPLE.  PERIOD.  \n  \nDonald Trump didn't change tonight, he's still the same man he was when Paul Ryan, Mitch McConnell and Reince Priebus endorsed him.  \n  \nIt seems to me that congressional support for Trump is symptomatic of a much bigger problem within the GOP.  \n  \nIs a Republican Congressman endorsing Donald Trump in the name of partisanship and party unity ***that substantially different*** from a Republican Governor turning down a fully funded Medicaid expansion just to spite Obama and the ACA?  \n  \nThe Republican party has been pulling shit like this for the past six years, they've been electing people like Trump since the Tea Party burst out of their chest.  [Donald Trump actually looks normal compared to some of the Republicans on the state level.](https://www.youtube.com/watch?v=UB1bSJB3n10)  \n  \nAt some point you have to put country over party, wouldn't it have been nice if they had figured that out *before:*  \n  \n * [Enacting restrictive voter ID laws.](http://www.latimes.com/opinion/op-ed/la-oe-hajnal-voter-id-research-20160908-snap-story.html)  \n * [Closing schools to pay for tax cuts.](http://www.msnbc.com/rachel-maddow-show/more-kansas-schools-forced-close)  \n * [Detoothing Dodd Frank financial reform.](http://fortune.com/2016/09/13/republicans-dodd-frank-act/)   \n * [\"Papers please\" laws in places like Arizona.](https://www.dailykos.com/story/2012/6/25/1102974/-Supreme-Court-invalidates-most-of-Arizona-s-papers-please-law-leaves-papers-please-intact)  \n * [Cutting public benefits to pay for tax cuts.](http://www.govexec.com/pay-benefits/2016/03/house-republicans-double-down-nearly-300-billion-savings-feds-expense/126952/)  \n * [Firing public employees to pay for tax cuts.](http://www.motherjones.com/rights-stuff/2011/06/who-getting-screwed-ohio-budget-cuts)  \n * [Rolling back abortion rights across the nation.](https://www.washingtonpost.com/news/the-fix/wp/2016/06/01/14-states-have-passed-laws-making-it-harder-to-get-an-abortion-already-this-year/)   \n * [Turning down Medicaid expansions to the states.](https://www.advisory.com/daily-briefing/resources/primers/medicaidmap)  \n * [Refusing to enforce the recent gay marriage ruling.](http://www.politico.com/story/2016/07/trump-vp-pick-mike-pence-evangelicals-225623)  \n * [Cutting infrastructure spending to pay for tax cuts.](https://www.washingtonpost.com/news/dr-gridlock/wp/2016/07/20/the-irony-of-the-gops-new-promise-to-cut-mass-transit-funding-donald-trump-loves-trains/)  \n * [Preventing Elizabeth Warren from heading the CFPB.](http://www.politicususa.com/2013/01/29/gop-blocked-elizabeth-warren-director-cfpb-senior-senator-massachusetts.html)  \n * [Refusing to set up public exchanges on the state level.](https://www.dailykos.com/story/2013/9/29/1241710/-Better-Dead-and-Red-How-the-GOP-blocked-health-care-for-red-state-Americans)  \n * [Remember the trans-vaginal ultrasound laws?  Still a thing.](http://www.forbes.com/sites/davidkroll/2013/07/07/state-mandated-transvaginal-ultrasounds-where-are-the-medical-societies/#be692e26c74f)  \n * [Voting more than fifty times to repeal the Affordable Care Act.](https://thinkprogress.org/gop-lawmakers-vote-to-repeal-obamacare-again-on-groundhog-day-6f0c931a8549#.wrdaey3v3)  \n * [Wasting taxpayer money on repeated investigations into Benghazi.](http://www.nytimes.com/2016/06/29/us/politics/hillary-clinton-benghazi.html)\n * [Appointing Emergency Financial Managers to replace elected officials.](http://www.theatlantic.com/politics/archive/2013/05/does-michigans-emergency-manager-law-disenfranchise-black-citizens/275639/)  \n * [Preventing the most popular of gun reforms...](https://fivethirtyeight.com/features/most-americans-agree-with-obama-that-more-gun-buyers-should-get-background-checks/)  \n * [...or even allowing gun violence to be studied by the CDC.](http://abcnews.go.com/Health/cdc-launched-comprehensive-gun-study-15-years/story?id=39873289)  \n * [Preventing the appointment of a Supreme Court Justice...](https://newrepublic.com/article/131700/republicans-block-obamas-supreme-court-pick-violating-constitution)    \n * [...or any of the hundreds of other Judicial vacancies in our country.](http://www.thedailybeast.com/articles/2016/05/16/it-s-not-just-merrick-garland-republicans-are-blocking-so-many-nominees-it-s-caused-a-judicial-emergency.html)  \n * [Almost shutting down the federal government...](https://en.wikipedia.org/wiki/United_States_debt-ceiling_crisis_of_2011)  \n * [...before ultimately succeeding...](https://en.wikipedia.org/wiki/United_States_debt-ceiling_crisis_of_2013)  \n * [...and causing the first ever downgrade of the United States credit rating.](https://www.washingtonpost.com/business/economy/sandp-considering-first-downgrade-of-us-credit-rating/2011/08/05/gIQAqKeIxI_story.html)   \n * And generally standing in the way of any bill, law, or amendment proposed by someone with a [D] next to their name.  \n\nCongressional Republicans have blocked more bills, and passed fewer, than ***any other Congress in American history.***  \n\nHow many jobs could have been created if Congressional Republicans had allowed proper public investment?\n  \nHow many more Americans would have health insurance if Congressional Republicans hasn't killed the public option?  \n  \nHow much more secured would our infrastructure be if Congressional Republicans hadn't blocked spending on road and bridge repair?  \n  \nAnd this is just off the top of my head.  If someone wanted to take the time and do the research they could easily double or triple the number of things that State and Congressional Republicans have royally fucked up over the past eight years.  It sure would have been nice if they had been working for the benefit of our nation instead of just working to stop Obama.  \n   \n[And](https://leanleft.com/2016/03/21/to-our-conservative-friends-if-gop-policies-are-so-great-please-explain-kansas-and-louisiana/) [Kansas.](http://nymag.com/daily/intelligencer/2016/03/gop-must-answer-for-what-it-did-to-kansas.html)  [Poor,](http://www.chicagotribune.com/news/opinion/zorn/ct-kansas-conservative-brownback-economic-disaster-zorn-perspec-0518-jm-20160517-column.html) [poor](http://washingtonmonthly.com/2016/07/03/kansas-experiment-in-right-wing-economics-is-still-failing-miserably/) [Kansas.](http://www.motherjones.com/politics/2016/05/sam-brownback-kansas-tax-cuts-trickle-down)  \n  \nEdit: Please watch and share the first video in this post.  I could ask the same of all the videos above, as I do think they're all worth watching and sharing, but that first video just sends chills up my spine, and I think it's important that other people see it and understand exactly what he's saying.  It's 40 seconds long.  \n  \nEdit 2: If you have RES, Reddit enhancement suite, you'll see a button at the bottom of this post that says \"Source.\"  Clicking that button will bring up a raw, unformatted copy of my comment that can be copied and pasted for future use, or use in other Reddit threads.  You have my permission to copy or link anything and everything here.  \n  \nEdit 3:  Thank you for the gold!  I love gooooold!  Stop giving me gold.  Seriously, I appreciate the gold, but give the money to hurricane relief or donate to a Presidential candidate that can defeat Donald Trump.  What I want more than gold, far more than gold, is to see these ~~assholes~~ Republican politicians get what they deserve this November: [Unemployment benefits.](http://www.cnn.com/2014/02/06/politics/unemployment-insurance/)  ", "You would think after 8 years of Obama not taking their guns they would figure out the GOP may be misleading them a tad ", "Jesus that Conway lady... She is literally trying to sell stupidity. All of these people act like little kids that get caught in a lie and try to explain though it until they get to something that might resemble the truth. ", "I think the takeaway is that most of the doomsaying about how a particular candidate is going to kill jobs by raising taxes or how Trump keeps pointing at the Obama administration as \"disastrous\" for jobs, is bullshit. The economy is way more complicated than is able to be explained in such simple terms and you can never place blame on a single person or political party when things go south.", "Wouldnt a more effective means to get people to vote for her is offer to release your new book if she is elected and threaten to stop all together if Trump is?", "I really want the Trump aides to let him go free. For once I want to hear what Trump has to say.", "Conway: 'It's not for me to take away a grown man's Twitter account'\n\n**10/25/16**\n\n\nhttp://www.politico.com/story/2016/10/trump-tweeting-kellyanne-conway-230283#ixzz4PG683kQ2 \n", "It gets worse:\n\n\"But offline Mr. Trump still privately muses about all of the ways he will punish his enemies after Election Day, including a threat to fund a “super PAC” with vengeance as its core mission.\"\n\nAlso about those women who have accused him of sexual assault:\n\n\"As the advisers begged him to reconsider — it would make him seem small, they warned, and undermine a pivotal speech — Mr. Trump was adamant. There had to be a severe penalty for those who dared to attack him, he said. He could not just sit back and let these women “come at me,” he told one of them.\"\n\n\nEDIT: \n\nThese are from the original NYT article. Everyone should check it out!\n\nhttp://www.nytimes.com/2016/11/07/us/politics/donald-trump-presidential-race.html?hp&amp;action=click&amp;pgtype=Homepage&amp;clickSource=story-heading&amp;module=b-lede-package-region&amp;region=top-news&amp;WT.nav=top-news", "You know what happened? A black man was elected president.", "They will AFTER the election when hopefully, they will be out of a job. And we are going to see some fireworks. And if he loses, the tirades he will go on will be historical. ", "Too late. That bus left. ", "Arrested Development is a smart show about stupid people. Big Bang Theory is a stupid show about smart people. ", "&gt;\"It's almost like it's a disease and it's taken over people. I don't remember this being the case four years ago. But something has happened. Something snapped. But now all of a sudden, if a story comes out, and it's not on Breitbart or endorsed by Drudge, it can't be true. Especially if it's about Donald Trump. Which is flat-out ludicrous.\"\n\ngoddamn memberberries", "Please don't let this party be in charge in any way. [They are not fit to govern.] (https://www.reddit.com/r/politics/comments/56k6fd/you_knew_who_trump_was_when_you_endorsed_him/d8k3k8f/) credit redditor OneYearSteakDay\n\n#DON'T LET THESE FUCKERS OFF THE HOOK.  \n  \nCongressional Republicans didn't rescind their endorsements [when Donald was calling for killing innocent civilians](https://youtu.be/I1eXRXL0nkk?t=1m13s) or when [he doubled down on killing civilians](https://www.youtube.com/watch?v=m_qEBwwET0s), when [he called African-Americans thugs,](https://twitter.com/realdonaldtrump/status/592910662424223744) when [he asked gun owners to do something about Hillary Clinton,](https://www.youtube.com/watch?v=ELL-aYFgkXI) when [he questioned my President's ancestry and religion,](https://www.youtube.com/watch?v=FlpaEXWe3Zs) when [he implied that vaccinations cause autism,](https://www.youtube.com/watch?v=G23Y8R-KcKA) when [he promised to ban a religion from immigrating to the United States,](https://www.youtube.com/watch?v=eh7XaJlvJIg) when [he invited Russia to hack a US citizen,](https://www.youtube.com/watch?v=gNa2B5zHfbQ) when [he advocated for torture,](https://www.youtube.com/watch?v=oxZv1Wq2c28) when [he demeaned women (pick one),](https://i.imgur.com/sYqvfDR.png) or when [he said that Mexico was sending us rapists and criminals.](https://www.youtube.com/watch?v=apjNfkysjbM)  \n  \nTheir endorsement stood through each and every indefensible thing he's said or done.    \n  \n#DONALD TRUMP WAS UNACCEPTABLE BEFORE THE FIRST ENDORSEMENT WAS EVER GIVEN.\n  \nAny sitting politician who endorsed this man before, during, or after this campaign deserves to lose their job.  Donald Trump has been an unacceptable choice since day 1, since before we heard *any* of this, but they endorsed him anyway.  House and Senate Republicans were willing to risk the wellbeing of the American people, and nominate a madman, in an effort to preserve the appearance of party unity.  They care more about obeying the Eleventh Commandment than they do protecting their constituents.  \n  \nWhat we heard today might very well be his last offensive comment, but it's certainly not his first.  \n  \n#ANYONE WHO SUPPORTS THIS MAN IS WORKING AGAINST THE AMERICAN PEOPLE.  PERIOD.  \n  \nDonald Trump didn't change tonight, he's still the same man he was when Paul Ryan, Mitch McConnell and Reince Priebus endorsed him.  \n  \nIt seems to me that congressional support for Trump is symptomatic of a much bigger problem within the GOP.  \n  \nIs a Republican Congressman endorsing Donald Trump in the name of partisanship and party unity ***that substantially different*** from a Republican Governor turning down a fully funded Medicaid expansion just to spite Obama and the ACA?  \n  \nThe Republican party has been pulling shit like this for the past six years, they've been electing people like Trump since the Tea Party burst out of their chest.  [Donald Trump actually looks normal compared to some of the Republicans on the state level.](https://www.youtube.com/watch?v=UB1bSJB3n10)  \n  \nAt some point you have to put country over party, wouldn't it have been nice if they had figured that out *before:*  \n  \n * [Enacting restrictive voter ID laws.](http://www.latimes.com/opinion/op-ed/la-oe-hajnal-voter-id-research-20160908-snap-story.html)  \n * [Closing schools to pay for tax cuts.](http://www.msnbc.com/rachel-maddow-show/more-kansas-schools-forced-close)  \n * [Detoothing Dodd Frank financial reform.](http://fortune.com/2016/09/13/republicans-dodd-frank-act/)   \n * [\"Papers please\" laws in places like Arizona.](https://www.dailykos.com/story/2012/6/25/1102974/-Supreme-Court-invalidates-most-of-Arizona-s-papers-please-law-leaves-papers-please-intact)  \n * [Cutting public benefits to pay for tax cuts.](http://www.govexec.com/pay-benefits/2016/03/house-republicans-double-down-nearly-300-billion-savings-feds-expense/126952/)  \n * [Firing public employees to pay for tax cuts.](http://www.motherjones.com/rights-stuff/2011/06/who-getting-screwed-ohio-budget-cuts)  \n * [Rolling back abortion rights across the nation.](https://www.washingtonpost.com/news/the-fix/wp/2016/06/01/14-states-have-passed-laws-making-it-harder-to-get-an-abortion-already-this-year/)   \n * [Turning down Medicaid expansions to the states.](https://www.advisory.com/daily-briefing/resources/primers/medicaidmap)  \n * [Refusing to enforce the recent gay marriage ruling.](http://www.politico.com/story/2016/07/trump-vp-pick-mike-pence-evangelicals-225623)  \n * [Cutting infrastructure spending to pay for tax cuts.](https://www.washingtonpost.com/news/dr-gridlock/wp/2016/07/20/the-irony-of-the-gops-new-promise-to-cut-mass-transit-funding-donald-trump-loves-trains/)  \n * [Preventing Elizabeth Warren from heading the CFPB.](http://www.politicususa.com/2013/01/29/gop-blocked-elizabeth-warren-director-cfpb-senior-senator-massachusetts.html)  \n * [Refusing to set up public exchanges on the state level.](https://www.dailykos.com/story/2013/9/29/1241710/-Better-Dead-and-Red-How-the-GOP-blocked-health-care-for-red-state-Americans)  \n * [Remember the trans-vaginal ultrasound laws?  Still a thing.](http://www.forbes.com/sites/davidkroll/2013/07/07/state-mandated-transvaginal-ultrasounds-where-are-the-medical-societies/#be692e26c74f)  \n * [Voting more than fifty times to repeal the Affordable Care Act.](https://thinkprogress.org/gop-lawmakers-vote-to-repeal-obamacare-again-on-groundhog-day-6f0c931a8549#.wrdaey3v3)  \n * [Wasting taxpayer money on repeated investigations into Benghazi.](http://www.nytimes.com/2016/06/29/us/politics/hillary-clinton-benghazi.html)\n * [Appointing Emergency Financial Managers to replace elected officials.](http://www.theatlantic.com/politics/archive/2013/05/does-michigans-emergency-manager-law-disenfranchise-black-citizens/275639/)  \n * [Preventing the most popular of gun reforms...](https://fivethirtyeight.com/features/most-americans-agree-with-obama-that-more-gun-buyers-should-get-background-checks/)  \n * [...or even allowing gun violence to be studied by the CDC.](http://abcnews.go.com/Health/cdc-launched-comprehensive-gun-study-15-years/story?id=39873289)  \n * [Preventing the appointment of a Supreme Court Justice...](https://newrepublic.com/article/131700/republicans-block-obamas-supreme-court-pick-violating-constitution)    \n * [...or any of the hundreds of other Judicial vacancies in our country.](http://www.thedailybeast.com/articles/2016/05/16/it-s-not-just-merrick-garland-republicans-are-blocking-so-many-nominees-it-s-caused-a-judicial-emergency.html)  \n * [Almost shutting down the federal government...](https://en.wikipedia.org/wiki/United_States_debt-ceiling_crisis_of_2011)  \n * [...before ultimately succeeding...](https://en.wikipedia.org/wiki/United_States_debt-ceiling_crisis_of_2013)  \n * [...and causing the first ever downgrade of the United States credit rating.](https://www.washingtonpost.com/business/economy/sandp-considering-first-downgrade-of-us-credit-rating/2011/08/05/gIQAqKeIxI_story.html)   \n * And generally standing in the way of any bill, law, or amendment proposed by someone with a [D] next to their name.  \n\nCongressional Republicans have blocked more bills, and passed fewer, than ***any other Congress in American history.***  \n\nHow many jobs could have been created if Congressional Republicans had allowed proper public investment?\n  \nHow many more Americans would have health insurance if Congressional Republicans hasn't killed the public option?  \n  \nHow much more secured would our infrastructure be if Congressional Republicans hadn't blocked spending on road and bridge repair?  \n  \nAnd this is just off the top of my head.  If someone wanted to take the time and do the research they could easily double or triple the number of things that State and Congressional Republicans have royally fucked up over the past eight years.  It sure would have been nice if they had been working for the benefit of our nation instead of just working to stop Obama.  \n   \n[And](https://leanleft.com/2016/03/21/to-our-conservative-friends-if-gop-policies-are-so-great-please-explain-kansas-and-louisiana/) [Kansas.](http://nymag.com/daily/intelligencer/2016/03/gop-must-answer-for-what-it-did-to-kansas.html)  [Poor,](http://www.chicagotribune.com/news/opinion/zorn/ct-kansas-conservative-brownback-economic-disaster-zorn-perspec-0518-jm-20160517-column.html) [poor](http://washingtonmonthly.com/2016/07/03/kansas-experiment-in-right-wing-economics-is-still-failing-miserably/) [Kansas.](http://www.motherjones.com/politics/2016/05/sam-brownback-kansas-tax-cuts-trickle-down)  \n  \nEdit: Please watch and share the first video in this post.  I could ask the same of all the videos above, as I do think they're all worth watching and sharing, but that first video just sends chills up my spine, and I think it's important that other people see it and understand exactly what he's saying.  It's 40 seconds long.  \n  \nEdit 2: If you have RES, Reddit enhancement suite, you'll see a button at the bottom of this post that says \"Source.\"  Clicking that button will bring up a raw, unformatted copy of my comment that can be copied and pasted for future use, or use in other Reddit threads.  You have my permission to copy or link anything and everything here.  \n  \nEdit 3:  Thank you for the gold!  I love gooooold!  Stop giving me gold.  Seriously, I appreciate the gold, but give the money to hurricane relief or donate to a Presidential candidate that can defeat Donald Trump.  What I want more than gold, far more than gold, is to see these ~~assholes~~ Republican politicians get what they deserve this November: [Unemployment benefits.](http://www.cnn.com/2014/02/06/politics/unemployment-insurance/)   ", "The man is a constitutional scholar. One of the brightest minds in the county. This has always been my favorite aspect of Obama and his administration. He doesn't blindly accept the opinions or statements of others and lets science and reason dictate his decisions. Although I may not be completely happy where we stand as a country today after his administration I can confidently say that I believe every decision he has made for this country has been diligently thought out. And that is exactly what I look for in a leader. ", "And gave back the COINTELPRO docs and hid the NSA revelations, and cheerleaded for the Iraq war.\n\nHow can they think the NYT is liberal?", "[Calls by women to boycott her brand have been heard for a while.](http://www.dailymail.co.uk/news/article-3865746/Women-boycotting-Ivanka-Trump-s-brand-continue-supports-father.html)  The fact that she's taking notice only now doesn't speak highly of her business acumen.  If this keeps up she'll be lucky not to see her shit relegated to the discount aisle at Walmart.", "I remember CNN saying that hispanic enthusiasm seemed lower than 2012 last week. I remember saying, \"yeah right wait until closer to election day.\"\n\nThe vitriol Mexicans have (which of course make up the majority of hispanics in the U.S.) for Trump is insane. \n\nNever seen anything like it on my facebook feed in any previous election. ", "&gt; His polished older daughter Ivanka, sat for a commercial intended to appeal to suburban women who have recoiled from her father’s incendiary language. But she discouraged the campaign from promoting the ad in news releases, fearing that her high-profile association with the campaign would damage the businesses that bear her name.\n\nOuuuch. \n\nVia the Daily Beast article above: http://www.nytimes.com/2016/11/07/us/politics/donald-trump-presidential-race.html ", "Exactly. And thought of a woman being next is causing their heads to implode ", "\"Listen guys. If he's *really* that bad we could always just kill him and start again, right?\"", "Ivanka you can stop worrying.  Your last name is definitely a liability for you now.", "I'm sure the mainstream media will cover these disturbing things Trump has said.  No way they won't focus on something sexier.  /s", "Yah I'm sorry, there's not enough to go on here. So, Mrs Clinton, about those emails...", "It's not only the mexicans. We know Trump is against all Hispanics. And the hispanics know. I think Trump is creating unity among Latinos.", "Peak social media happened.  ", "Lets make it a gay atheist born of middle eastern immigrants in 2024.", "The issue I have with it is best summed up by whoever said \"Big Bang Theory is a show about smart people written for dumb people\".\n\nSure it's nice to have a show that makes science seem important but it's almost hard to watch with how stereotypically \"sitcom\" it is.", "It isn't just Nevada. Sources are reporting that as of this morning [Latino turnout is at 45% in Florida](https://mobile.twitter.com/electionsmith/status/795341713283883008). Can you fathom that 45% and there is still time to vote today, and then the Election Day? National average for turnout for Latinos in prior elections was only in the high 30's. Florida Latinos have already surpassed that.", "The sad thing is I am pretty sure he was still be consumed by vengeance if he was winning.", "I feel compelled to post this every time this is brought up:\n\n&gt; \"the system is designed for speed and decisiveness. It's not designed to debate the decision.\"\n\n-- Michael Hayden (Former Director of the CIA **and** NSA)", "The American people in 2 days", "It hasn't been a problem thus far because everyone till now hasn't been a paranoid narcissistic sociopath.", "I'd phrase it a touch differently: the responsible respectable candidates (Clinton and Weld) behave in responsible ways, while the selfish, impulsive hacks desperately flail and pander in their respective bids for attention.", "\"Facts are biased against Trump!\"\n\n-- Trump supporters.", "In the finale episodes he seemed so angry and frustrated at the system and country that I don't think he'd have survived the Trump primary intact.", "I see a bit of BBT when I visit a friend (she always has it on) and a lot of the jokes seem to be just making fun of autistic people.", "It's just that old 1950s archetype of the nerd being socially awkward and liking science fiction and comic books.\n\nThen the jokes are all just references to popular mainstream franchises that would only seem nerdy to someone over the age of 50.\n\nSo it's like,\n\nSheldon: I like Boba Fett.  He's in Star Wars.  Bazinga!\n\nAudience:  OMG HE LIKES STAR WARS!?  WHAT A NERD!", "Well it's a known fact that most colleges/universitys brainwash students to be liberal. Damn those liberal professors who teach things like science and not creationism.", "and thats why I don't get people who insult it. Okay some of the jokes are corny and barely sciency but it is a great move to have such a science focused show be so popular.", "70 obese, fast food eater, high stress, possible drug user. Hoping we don't have long.", "This is the appropriate reaction to all things Trump. Just fucking laugh. \n\n\"I support Trump!\" HAHAHAHAHAHAHAHAHAHA\n\nIt's nothing but a sick joke now. ", "This is America calling out to all bad hombres. We need your help to take this orange piece of shit down. Please save us from ourselves. ", "Yeah the bots there show terrible machine learning.", "Tell that to Judge Curiel. \n\nHasta la vista Déplorables! Trump is gonna lose.", "T-60 hours until Trump is finally irrelevant.", "My dad just wrote me a 1000+ word email that details how *all* liberal politicians and *all* liberal media outlets are liars frauds, and conspirators. His source of information is limited to Fox News and some online writer who calls himself \"the Dilbert Guy.\" Everyone else is a liar and in on some global scheme to degrade our intelligence and moral values.\n\n(I voted for Sanders in the primary, so you can imagine how this Thanksgiving is going to go...)", "Hahaha SNL is funny cuz it's true! *sobs*", "They haven't announced that they're doing anything about it but they (unlike some other government agencies) take the 'no commenting on current investigations' thing seriously.  So it's very possible that Trump is being investigated currently, but we likely wouldn't know about it until the investigation was complete.", "That's why I love finding opportunities to link it. ", "Please call me Ivanka Kushner from now on. ", "I listened to InfoWars the other night to see what they've been doing. I didn't expect to strike gold. Alex's guest said that Hitler had it right and that it's a shame he didn't \"get the job done.\" Alex responded \"I can't 100% disagree with you.\" Guy couldn't shut up about how Hitler is misunderstood and was great in many ways, and all Alex had to say in response was \"I can't 100% disagree with you.\"\n\nThat may have been the last time in my life that I'll have been shocked by something someone said to a large audience.", "The Trump brand now stands for racism and misogyny. Ivanka will have to distance herself from it. ", "Yep very good example. He supports the rights of the man who came to his rally in opposition to him and treats him with respect. He inspires his supporters to be better.\n\nMeanwhile, Trump has peaceful protesters kicked out, insults them, and promises that he'll cover the legals bills of anyone who assaults them. He inspires his supporters to be worse.", "ITT: Totally-Not-Shills attacking the source [like the email isn't fucking real and easy to find](https://wikileaks.org/podesta-emails/emailid/52046) seemingly oblivious to the fact that ***this isn't going to just fucking go away once Trump loses***.\n\nJesus fucking Christ vote for Hillary against Trump, whatever makes you happy, but you all need to get your heads out of your collective asses and quit pretending reality isn't real. Hillary supporters who dismiss Wikileaks are just as deluded as Trump supporters who think he's actually going to \"help\" us. ", "You're damn right he's classy. He has the integrity to shout at a crowd of his own supporters to calm down in defense of someone protesting him. You would never see Trump do that.", "PBS and BBC have the best news; boring and factual.  ", "It seems like he's just really proud of the time that he [faked a heart attack while debating about pot legalization](https://www.youtube.com/watch?v=1pzoJVnPblI&amp;t=25s) and he wants to believe that he's a funny person and that he's on the sane side of every issue.", "But Lewandoski isn't the chair of the RNC? Brazile gave a question ahead of time when she was supposed to show impartiality? Does no one see the apples and oranges?\n\nI'm not voting for Trump but /r/politics is a cesspool. ", "Report: Aides send Trump to bed early he has a big day ahead of him tomorrow.", "In the UK around the referendum, a pro-Brexit politician dismissed claims that leaving the EU would be bad for the economy by saying: \"people are tired of experts\". ", "Dear SCOTUS this is what happens when you neuter the voting rights act. ", "Bienvenidos amigos.", "So not too different than the Reagan/Bush White houses.", "My costa rican family is basically a lot of \n\n\"how stupid do you have to be to believe a racist silver spoon fed egomaniac\" \n\n\"how can other countries look at you to lead when you can't lead yourself, a misogynistic, science denier, who can't read is poised to win\"\n\n\"All the work [CR] has done about to be undone by the orange man with bad hair\"\n\n\nAnd a lot, and i mean alot, of other insults to basically the entirety of the GOP for being closet racists.\n\n", "Hopefully the aides will walk out the door Tuesday morning and we can get the full unfiltered sewerage as he loses. Mind you I am looking forward to a few Trump free days.", "Someone even shouts out \"Kill him!\"", "I'd say the reason people dislike it is that the jokes arent related to nerd culture that they are nerds is the joke. The few episodes i'v seen one person would just mention something nerdy and the laughtrack would play \"ohh wow look at him, he likes this nerdy thing what a nerd haha\" its kinda insulting.\n\nThat being said it's a long time since i watched any and it was like 3 episodes. And i do agree it's great if it gets people interested in science that normally wouldn't.", "Did you read the actual email? The email his name was on is simply a list of people who bought a book from the U.S. Intelligence company named Stratfor  between 2004 and 2011. \n\nYou have literally claimed he's a Clinton plant based on the fact he bought a book at least 5 years ago from a company with no ties or connection to Clinton much less the Clinton campaign. \n\nPathetic.", "I've worked in finance for the last 6 years.\n\nWhen a financial services company (an investment bank or investment management firm, etc.) is short staffed -- like around Christmas -- or anticipating a major news event -- like Brexit -- they'll implement a *change freeze*, meaning they don't do things like upgrade, install, or move their servers and infrastructure.  It increases risk at a time the company is short staffed or the market is volatile and more people want to trade.\n\nDuring the 2012 election, nobody I knew had a change freeze.\n\nHowever, most companies I know are having a change freeze that started over the weekend and extends through the middle of the week.\n\nFrankly, they're anticipating a market crash if Trump wins.  When the e-mail news broke last Friday, the market almost instantly fell 0.5%, and then fell another 0.5% in a short period of time.\n\nBy the way, if Trump makes good on his promise to negotiate down the federal debt (I find this extremely unlikely), 2008 is going to look like a good year.  Two thirds of the debt is owned by **American citizens and entities**, and US government debt securities are widely assumed to be \"risk free.\"\n\nSo if the debt is magically deceased, that means a lot of people's retirement accounts are going to be magically deceased as well.", "It's already taken over reddit. The_Donald is the most active subreddit now. In 4 years more subreddits will fall", "Latinos are building a wall between Donald and the Presidency and they're going to make Donald pay for it.", "While I agree with the sentiment that song is awful.", "&gt;He prefers the soothing whispery voice of his son-in-law.\n\nTrump a confirmed asmr fan.", "No fire! No fire!  You're on fire... ... ... You're on fire", "Its that they are trying to make money regardless the cost to our country and people.", "[Money can't buy you class.](https://www.youtube.com/watch?v=kEDvlSAMhQU)", "Humanities are utterly vital. Meaning purpose and expression are just as important to me as practicalities.", "I'm still waiting for the \"end of America\" that was apparently supposed to happen after Obama was elected.\n", "Don't make any assumptions about how many members they have.  http://cbsnews1.cbsistatic.com/hub/i/r/2016/10/12/b9ed65c2-196a-407d-99dc-fad1ec6366ed/resize/620x/f36976a410471f6c0a91ec18ca2b7448/whiteladyblacksfortrump.jpg", "I honestly haven't seen any evidence whatsoever to prove she had people murdered. Get out of here with your silly conspiracy theories and learn critical thinking skills.", "This article is just an aggregation of this NYT article: http://www.nytimes.com/2016/11/07/us/politics/donald-trump-presidential-race.html\n\nI encourage people to read the original — it's full of lots of other little goodies about Trump's mental instability. For example he doesn't like to be alone with his thoughts, so he needs his aides to whisper to him how well the campaign is going for him to fall asleep.", "No he won't. He'll fall into self delusion to prop up his ego and probably go to his death bed thinking he was right the election was rigged and most people don't think he's a dangerous buffoon.", "Appearing in your family is hurting your brand.", "It's very like that the election is essentially over because the heavy early voting in Nevada (helped by a lot of Latino votes) is probably giving Clinton an insurmountable lead going into the final vote on Nov 8th. \n\nPretty much every scenario where Trump wins has him taking Nevada to reach 270. And no path is possible without him holding onto Arizona's 11 EVs and his loss there would entirely be because of the amped up Latino voters.\n\nOh the irony that Trump didn't just shoot himself in the foot, he blew it clean off with his asinine \"murders &amp; rapists......some, I assume, are good people\" statement on the very day he announced he was running. ", "You are right. The guy had an anti-Trump sign and no gun and he's being portrayed as Hinkley. ", "You shut my brain off at \"criminal\". No charges. No convictions. I thought in this country you're innocent until proven guilty.\n\nGuess Trump is a child rapist.", "Could make the difference in Nevada and Florida and those are very important states.", "&gt; run up the score and watch Trump shrivel.\n\nLike a wrinkly orange testicle exposed to the bitter truth. ", "If this was anything beyond a ridiculously overdone bit of hyperbole half of Congress would be in \"indefinite military detention.\"\n\nSince they're not, this is just a ridiculous thing to say.", "Sounds Nixonian doesn't it? Like when he was wondering around the White House during the Watergate scandal drunk and looking at pictures. ", "I believe my answer of \"no\" completely refutes your characterization of \"sillies like\" me. And I completely agree that Clinton does not have \"a snowball's chance in hell\" of winning Texas. However it is still a beautiful dream.", "&gt; We avoid politics generally because we love each other.\n\nDamn. My parents and I must hate each other. We are in the same situation yet we always argue about politics. We know we will never agree, yet we are all still dumb enough to keep bringing up politics. \n\n**TL;DR** My family is the idiot version of your family.", "Seriously. I don't think he's perfect but it blows my mind how strongly some people hate him. He really seems like someone that the opposition should at least respect, but they don't at all. Most of the people who hate him have such strange, conspiracy inspired reasons. \n\nAlso, the fact that people hate Michelle is all the proof i need that racism is alive and well in this country. There is no good reason to hate that woman. She's freaking fantastic. ", "It's so bizarre to hear people call Hillary anti Christian. She's possibly the most authentic in her religion for either nominee in either party for many elections.", "I'm not sure if your comment is a dig at Obama or not. I thought the video showed Obama being extremely level-headed and he said the exact right things. If this were a Trump rally the heckler would have been beat up and thrown out. Obama gave 4 reasons why the guy should be respected. *That* is a huge difference than what Trump does at his rallies, and really highlights the difference between a real President and someone who should never be president.", "Over on the_donald they've revved up their Google investigation machine and determined that he is a paid shill from Hillary's campaign, and was ejected from a rally months ago for trying to assassinate him a second time. He was, according to them, also in one of James O'Keefe's videos as a paid DNC protestor. Small world!", "What part about making a list of exclusively Jewish people and plastering \"globalist\" on their faces and labeling them as the enemy to be defeated could possibly be seen as antisemitic! \n\nI mean it's probably just a coincidence that Trump is endorsed by the nazi party and the KKK and has an outspoken antisemite Steve Bannon, as his campaign \"ceo\".", "This could have a surprising effect on a number of states.\n\nIt is reminiscent of the African American voter surge in 2008 that gave Obama a lot of states.\n", "&gt; \"They're retweeting misinformation that this was an assassination attempt. It was not an assassination attempt thankfully. Should they be spreading this misinformation?\" Tapper asked.\n\n&gt; Conway didn't directly address Tapper's question...\n\nColor me shocked!  \n\nI don't think I have *ever* seen Conway answer a question she was asked.  \"Spin\" doesn't come close to how she dodges questions.\n\nDon, jr and the campaign spreading this debunked \"assassination attemp\" story is very irresponsible and continues to fan flames that are worisome for Tuesday's vote.", "Huge news for HRC  \nEdit this is the letter http://i.imgur.com/k64fCLL.jpg", "She didn't take away a grown man's Twitter account she took away Trump's Twitter account.", "Wow so Comey broke policy to intervene with elections for absolutely nothing?", "And it won't get nearly as much coverage as the original fucking announcement.", "Until Trump deports her for being an illegal. ", "It knocked a few percentage points off her mandate and possible prevented a few congressional seats from flipping. The damage was done", "And now back to the FBI rigging the election! ", "Just heard the statement read on the air.  They said they **have** reviewed the new/additional emails and \"have not changed our conclusions that we expressed in July with respect to Sec Clinton\".\n\nEdit: [Comey's letter here](http://i.imgur.com/k64fCLL.jpg)", "Literally the entire Clinton career. \n\nLook at the difference between the people who know about the Whitewater investigation(or Benghazi take your pick), and the ~~amount~~ number of people who know the final conclusion of that investigation.\n\n**EDIT:** And /u/CaptainUltimate28 just reminded me of the AP Report too, we could literally create a list on this Clinton investigation bullshit.\n\nEmails\n\nState Dept. Mtgs\n\nBenghazi\n\nWhitewater\n\n\nALL bullshit\n", "So I guess Trump supporters are gonna have to go full force with this Hillary is a satanic necromancer idea since this email investigation was a bust. ", "From the head of the Oversight Committee:\n\"FBI Dir just informed us \"Based on our review we have not changed our conclusions that we expressed in July with respect to Sec Clinton\"\"\n", "Excited to see Trump steal his phone back from his aides lock himself in the bathroom, and respond to this", "Yep. Not really surprising but it's a rare bit of positive press for her right before the finish line.", "/r/the_meltdown is coming.", "This kills the Trump.", "He already tortures her with disgusting sex rituals I'm sure.", "Yes this is getting missed. This is not just an update. They have reviewed the emails. No charges!", "Welp guess we know who is writing a letter November 9th.", "My favorite was her joke for another one saying that \"sometimes people get carried away\" as security was hauling someone out ", "This is scary as fuck. Imagine of our president deals with non-violent protestors by calling them 'assasins'. Imagine if these 'assasins' were dealt with by shooting first in defense of the president.\n\nImagine an America where non-violent protest near the president was a death sentence. This is the freedom Trump offers. ", "So this was all a stunt to hurt her polls?", "lol. Yep. Trump's going to go bonkers.", "She's a grown-ass woman capable of making her own choices.  If she chooses to use her celebrity to support her deranged father then she does so knowing there will be consequences to her brand - she's not an \"innocent bystander\" here.", "Especially the latter. Quite a few Senate races tightened post-Comey announcement. You can imagine Kander or Ross losing ground as more GOP voters decide they'll swallow their pride and vote for Trump (and Republican down the ticket)", "Lets all head over to the_deplorables to witness the saltiest tears yet! ", "No joke Comey intentionally meddled in a US election for absolutely no justifiable reason, Obama needs to \"drain the swamp\" in the FBI. ", "This had better get just as much coverage as the original fucking announcement.", "This is an actual headline still at 5.6K upvotes over at r/the_deplorables I shit you not:\n\n&gt; HILLARY CLINTON IS CURRENTLY UNDER MULTIPLE INVESTIGATIONS BY THE FBI AND THEY BELIEVE THEY HAVE AN AVALANCHE OF EVIDENCE THAT WILL LEAD TO INDICTMENT. DO NOT FORGET THIS R/ALL.\n\nNeedless to say, the level of retardation that goes into posts like these is staggering.", "Absolutely. There's literally 0 shame in saying \"I love my father and respect him but I cannot condone the things he has said and will not be working on his campaign.\" \n\nBut she went all in on his bullshit and spent the past 18 months trying to gaslight the rest of us and she deserves to sink with him", "They've put themselves at an information disadvantage. Nationally GOP politicians have no sense of how they're doing (The eco chamber tells them they're winning in a landslide). At an individual level, right wingers shut off from the real world are frequently the victims of swindlers and scams. Many far right conservatives I went to high school with are attending dubious and costly online universities and investing in all sorts of nonsense advertised on Fox (buying gold instead of investing, for example).\n\nIt would be sad... but these people have so much hate, that I actually find it funny. ", "You absolutely can - a decades-long policy was violated. The damage has been done and this redirects the story - yet again - to these damn emails.\n\nI honestly can't decide if I'm glad about this statement or not.", "Victory for democracy and collective sigh of relief from most of America.", "Because many Americans are stupid and they want to see one of their own in charge. Most Americans can't identify the three branches of government or understand how a bill becomes a law yet they will spend hours dissecting their football team's strategy.", "Potentially costed Democrats the Senate and a justice confirmation.\n\nWhat a hack. ", "I think he's probably glad he's out. I've been a Stewart fan since he took over The Daily Show and as I've gotten older (and watched him get older) I realized that the reason I'm a fan is due in large part to how much pressure he puts on himself to deliver quality material in his niche and try his best to not misrepresent himself.\n\nI don't care about his biases when we all have them, but I do care that he made the effort. He made the fucking effort.\n\nI have never read a controversial story or watched a controversial clip involving Stewart and reasonably thought afterward, \"Okay, Jon was in the wrong here.\" I'm sure one or two could be floating around out there, but as a fan, a taxpayer and a voter he is the kind of American I would like to be like.\n\nThere is a lot of humor in the things that are happening, but it isn't funny anymore and I would rather him try his best to be a positive national treasure in whatever capacity he sees fit than to kill himself under the pressure of making all of this bullshit funny. \n\nI miss him, but he has earned his retirement and we should all say thank you.", "And on that bus is her dad bragging about serial sexual assault while on tape.", "As Conway said though 'its already out there'. \n\nThe actual facts say there's nothing here. But the cloud of scandal that republicans have been creating for 30 years will still exist around her and that being refreshed will still do damage. Hell, **has** likely done damage due to the effect on the early vote. ", "Welp this wins the internet for today.\n\n\nPack it in, boys, let's go home. ", "I don't care who you are voting for this man should be fired. Many have voted early before and after this fiasco began, and it as many predicted, amounted to nothing.", "Yea people keep pointing to race but I think *while that was a factor*, the bigger element here is the speed with which we take in information and move on to the next piece of information without taking the time to discriminate between truth and fiction. In this kind of environment, the winners are the people who can put out the highest volume of information, not the highest quality. If you keep hitting people with information about how Candidate Jack is bad, even if half of it is proven false, the [illusory truth effect](https://en.wikipedia.org/wiki/Illusory_truth_effect) takes over. This is how you still have people believing President Obama was born outside the country or that he is a Muslim. Trump has also - since 2008 - made extensive use of the illusory truth effect by driving home often fictitious points.", "they started a gofundme on The_D and despite over 5k upvotes 83 people contributed. embarrassed that this showed their upvotes are from bots and not users, they shut it down and forwarded it to a donation page for the church started by someone else. \n\nLet me find you where I read that...\n\nedit: https://www.reddit.com/r/EnoughTrumpSpam/comments/5avnme/the_donald_hosted_a_fundraiser_and_then_takes_it/", "&gt;October surprise: Comey: NEW CLINTON EMAILS\n\n&gt;November surprise: Comey: NEVER MIND EVERYTHING STILL THE SAME\n\nWhat a joke.\n\nhttps://twitter.com/mj_lee/status/795360532517756928", "But but the FBI is just moments away from arresting her! This is all disinformation they are actually heading over in their cars right now!", "Coming Wednesday AM!\n\nMaybe even Tuesday evening", "Well yeah its Anthony Weiners laptop. The guy whos probably going to jail for sexting a 15 year old. Lord knows what smut he has hidden in his \"Tax returns 94-99\" folder.", "Looks like they specifically reviewed the emails to/from Hillary first and didn't find anything new.\n", "This is breaking news on CNN. It's the opposite of being tossed to the wayside.", "His aides took away his twitter he might spontaneously combust ", "There is no liberal bias in the media there IS an establishment/power bias, it just so happens that the establishment is neo liberal in its politics.  Both sides republican and democratic.\n\nLook at the medias treatment of Bernie sanders, it was disgusting how they carried clintons water for her in the primaries.", "&gt;It's already taken over reddit. The_Donald is the most active subreddit now.\n\nBecause it is mostly ran with fake bots. \n", "36 hours until the polls open. With media running at the speed of the Internet it can only help.", "I still can't fully wrap my head around the fact that someone who might need to be kept \"in check\" in this way is as close as he is so much global power. ", "&gt; buying gold instead of investing for example\n\nNot a bad play if your right wing policies are going to crash the economy.", "GOP back to hating Comey", "\"Rush Limbaugh Urges Listeners Not To \"Fall For\" Fact-Checks\"\n\nhttps://mediamatters.org/video/2016/09/28/rush-limbaugh-urges-listeners-not-fall-fact-checks/213411\n\n\"RUSH LIMBAUGH: This fact-check technique is the latest. Let me tell you what it really is. There is no fact-checking. The fact that The New York Times and The Washington Post, and USA Today, and all these other papers and networks now have fact-checkers is for one reason. It allows them to fool you into thinking they have an objective, nonpartisan staff or person analyzing everything the candidates are saying, and telling you what they're saying is true, or what they're saying is false. When in fact the fact-checkers are no different than the biased left-leaning reporters and columnists at these papers and on networks. But the fact-check, the idea that it is a fact-check story is designed to say to you that it is objective and analytically fair, and all it is is a vehicle for them to do opinion journalism under the guise of fairness. Which, if you fall for it, gives it even more power, because if you think that the fact-checkers like PolitiFact or Snopes, or whoever else, if you quote them constantly as the Bible, well then you've fallen for it. \"", "It's extremely difficult to sit in an office and listen to your coworkers talk about how groping a woman isn't that big of a deal.  \n\nIt's extremely difficult to see post after post on Facebook of people saying women can be upset about Trumps behavior if we're not mad at Beyoncé or Miley. \n\nIt's extremely difficult to be surrounded by people downplaying the pain and suffering of sexual abuse assault, harassment and any behavior that renders another person to an object status. \n\nIt's 100x more difficult if you have already been a victim.", "Man universe, just give me one more Trump thing before Tuesday. Just one would be fine. Is anyone a fat pig out there? Are there any dirty riggers that need calling out? Has Paul Ryan done something you hate? Did Bill Clinton eat a baby?\n\nI feel like I got addicted to schadenfreude in October and now I'm having withdrawals.", "Yes and her winning a landslide is very important to me", "\"Facts have a well known liberal bias\"", "Dems: We can't let up. No matter what good news comes our way we have to live in panic mode until the polls are closed and victory is certain. Despite these stories, state polls are still incredibly close and every vote counts.", "This will have a huge boost. Election day will be in the midst of pro Clinton news cycles ", "http://news.harvard.edu/gazette/story/2016/06/the-making-of-the-campaign-2016/\n\nActually while Bernie got little coverage in the first half of 2015 once he did start getting coverage, his coverage was far more positive than Clinton. Bernie would get three positive stories to every one negative story, while Clinton got three negative stories to every one positive story. If anything, the media helped Bernie and hurt Clinton.", "Yeah but he saved the GOP House and Senate seats, so he did them a solid.", "There's no way you aren't right 538 had the Democrat's chances of taking the senate plummet from about 70% down to a 50/50 tossup after the announcement. ", "Sure looks like it.", "I've come to the realization that Donald trump exhibits the classic sings of in psychological terms, projection.  Anything he does frequently and people call him out on he then claims that his opponents do.  He knows and is aware he does these things but internally justifies it by telling himself, \"well, they do it too.\"  However, it's constant false equivalency.\n\nCalls Hillary a liar.  She is of course, but all politicians lie.  Indeed all people, but I digress.  However, when analyzed she lies about 30% of the time (about average for a politician) while Trump lies 70% of the time.  [For those that care to know politicians lie on average about twice as much as a non-politicians.]  He is, however, the first politician on record of being able to lie within the same sentence - which I have to give credit was quite a feat.\n\nTrump attacks women... so he has to say that Hillary attacked Bill's women.  Who cares if the circumstances are *completely* different.\n\nHe cheats on his taxes... crooked Hillary.\n\nHis charity, well... isn't.  So that means that the Clinton Foundation *must* be dirty.\n\nHe incites violence... so that means Hillary must be paying those protesters that come to his rallies and *they* are causing violence not his \"peaceful\" followers.  [Despite ample video evidence to the contrary.]\n\nHe is hiding his taxes... so she *must* be hiding her emails for \"obvious\" reasons.\n\nHe yells at protesters in his rallies... therefore, Obama must do the same.  Despite there is video footage of the incident and anyone [who wants to] can see it for themselves.  But he knows his followers will just take his word as gospel (pun intended) rather than think and view for themselves.\n\nIt just goes on... and on... and on.\n\nFacts and truth just simply don't matter to this man.  I fundamentally believe this is the *real* reason he has so many supporters.  Facts and truth just aren't that important to most people sadly; but particularly not important to his followers.  Particularly for a large body of people who already come to their beliefs through faulty and fallacious means (either faith, arguments from authority, or single sourced information).", "How much do you want to bet this gets a fraction of the coverage as the first letter.", "Yeah.  Even Shakespeare would have to tone Trump down if he wrote a play about him.", "AND THAT DOES IT! Still fuck you Comey. \n\nBut that should do it for the orange buffoon. ", "Damage has been done. This news will get tossed to the wayside.", "It's just a sign.", "The initial press conference showed that he was a hack. \n\nWho holds a press coherence to berate someone not being charged with anything ", "No it fucking isn't, and it's frankly offensive that that stupid term keeps being used. \"A stupid show about smart people\" is fine. Comparing it to racism against blacks is completely ridiculous. It pokes fun at smart people. It's not offensive to them in the way that blackface is offensive to blacks. ", "[deleted]  \n ^^^^^^^^^^^^^^^^0.0639 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/49624)", "I hope so. The dumber the bullshit they peddle in the next 24 hours the better. ", "&gt; Even if you're the most frothing vitriolic, alt-right, PC-hating, Limbaugh/Hannity listening Obama hater, you would know that Obama doesn't scream and has never screamed at anyone publicly.\n\nYou give those people too much credit. If Trump tells them the sky is green, they will look up and say it's not blue, never has been blue, and you're a fucking Muslim communist demon for saying it's blue.", "&gt; Yeah but Hilary. E-mails! I mean how much worse are e-mails then sexual assault tax fraud, racism, sexism, and being an overall piece of shit!\n\nRedditor: [I just realized while reading this that if Trump wins, my dad will die.](https://ng.reddit.com/r/politics/comments/5aqcw1/trumps_health_plan_pay_your_own_medical_bills/d9j2mc6/)\n\n ", "The fact that Donald Trump hasn't really messed up in the last week or so? No biggie in terms of controversial or stupid statements. ", "Obama needs to put this guys head on a plate.", "John Oliver and Samantha Bee have their own shows and both totally pick up the slack that The Daily Show is presently losing ", "Surely a certain subreddit will handle this news rationally. ", "Some of them were paranoid almost all were at least a little narcissistic (you'd almost have to be, to put yourself through this), maybe one or two were sociopaths. Never to such a degree as Trump. He is truly beyond the pale. In fact, he's orange. ", "Absolutely not. He made a serious error in judgment here. Everyone already knew this was going to be the end result. He still needs to answer for his previous decisions.\n\nI've NEVER thought he was a bad guy or even intent on swinging the election, but he definitely made a bad (and possibly illegal) call and he needs to be held accountable for that. ", "Mr. Comey\n\nThank you for the correction, but we still expect your resignation as soon as possible.\n\nSincerely,\n\nThe American People.", "Indeed. According to the latest poll from Telemundo on Hispanic attitudes (from 10/30 - 11/5) it shows that 76% of Hispanics will vote Clinton with 14% voting for Trump, a margin of 62%. The margin of error for that poll was 4.4%, so even pretending that the margin is larger than it is, it would still mean that [Trump would have the least support amongst Latinos for any Republican Presidential Candidate](http://www.pewhispanic.org/2012/11/07/latino-voters-in-the-2012-election/), possibly in the entire history of the U.S. (that survey started from 1980). For reference, the current largest disparity in terms of Hispanic votes was in 1996, when Bill Clinton won the Hispanic vote by 51%. ", "It's brainwashing.\n\nIt can happen to anyone not just those with mental retardation.", "Melania is taking her effort to reduce cyberbullying seriously", "This kill the hope of trumpsters", "Even if they know the conclusion the seed is already planted in their minds that she's untrustworthy.", "Watch out Trump aides, he bites.", "Surely he will cease this pattern of lying once he becomes president.\n\n&gt;\"Our economy is doing tremendously well.  Don't believe the phony studies that the *government* puts out.  I'm working on replacing those people.  Believe me.  Bunch of shills.\n\n&gt;The wall is already 70% complete.  Under budget and ahead of schedule.  Just look at this beautiful wall (holds up picture).  And here you can see a...probably a mexican trying to tear it down.  Look at all that Mexican graffiti.  \"Auf die dauer fallt die mauer\".  Am I pronouncing that right?  Idunno I don't speak mexican.\n\n&gt;A lot of people are talking about this...*made up* country.  Ukraine?  Ukraine?!  I crane my neck up looking at a map and I don't see it.  Sounds made up doesn't it?  At least come up with a good name.\n\n&gt;And folks, I gotta tell ya, this president business is a tough job.  A tough job.  Meeting after meeting after meeting.  These people won't shut up.  \n\n&gt;'Donald, you're meeting with So-and-so from bing-bing-bong.'\n\n&gt;'Donald, there was a tidal wave in..fffff-France.'\n\n&gt;'Donald, memorize this sequence: Alpha alpha bravo echo charlie tango sierra echo'\n\n&gt;It never stops!\n\n&gt;The state of the union is the best it has been.  Ever.  Period.\n\n&gt;...\n\n&gt;You hear those sirens?\n\n&gt;That probably means a mexican just tunneled under the wall.  How about some of you second amendment people head down to Texas and see what you can do abou--\"\n\n**fffffffFFFFFFSHHHHHHHHHHHHHHHHHHHHHHHhhhhhhhhhhhhhhhhhhhhhhhhhhh......**\n\n...\n\n...\n\n...\n\n*sounds of cockroaches skittering about*", "Remember:  you're not just voting to cause a Clinton victory (which seems more certain by the day) but you are also voting to help deliver a historic popular vote landslide humiliation for Trump.  He should not get to say he's not the worst major party presidential candidate ever. Time to pile on.  ", "Trump's campaign was born on an escalator in Manhattan and it died in a Cardenas grocery store in Clark County Nevada. Haremos Estados Unidos grande otra vez!", "Clinton should tweet this; make fun of him", "\"Obama recently said that 'he wouldn't vote for [himself] either' in a startling admission of his failed policies\"\n\n\n-Sean Hannity soon\n\n", "not enough time the damage is already done", "If anything this election has taught me is that we are post-fact. It doesn't matter that this has come to nothing.\n\nWhen we first got the internet we all believed that it gave the people power. It freed information. \n\nBut the powerful wanted to tame this wild west, and they've done it, intentionally or not, by creating social media that is so viral it loses all factual rigour. \n\nIt's a terrible price to have paid.\n\nEDIT: Thanks for the spelling corrections, I'm just terrible at words. And thanks for the gold - although there is a nagging irony I can't quite articulate about paying a company to add a weird value measure metric to comments, that kinda flies against my point. ", "Dear America\n\n'Never mind!'\n\nBest wishes,\nThe FBI", "From Dave Weigel:\n\"Comey letter was a Clinton scandal in miniature: Hubris disaster, leaks, rumors of indictment, then... never mind.\"", "&gt;\"In the last two days they had so little confidence in his self-control they said we are just going to take away your Twitter. Now, if somebody can't handle a Twitter account, they can't handle the nuclear codes,\" Obama said.", "\"HILLARY INDICTMENT COMING\"\n\nNo indictment.\n\n\"NEW EMAILS FOUND. SHES DONE. TO THE TOP\"\n\nNo indictment.\n\n\"UHH SHES A LIZARD HARRY!\"", "The FBI must really be a shit show. To make all this noise and then come back a week later with nothing is a joke. \n\nTo borrow a phrase while Comey's actions weren't criminal, he was extremely careless in the handling of very sensitive information. \n\nEdit: **Thank you.**", "[Pete Williams reporting that nearly all e-mails were duplicates.](https://twitter.com/Tom_Winter/status/795369503995678720)", "Obama is baiting Trump hard as fuck. Kellyanne better take that phone and run. ", "Doesn't matter. Clinton's numbers took a hit Comey did what Trump needed him to do. ", "So...the letter was pointless and could've waited a week", "Like how much clearer could it be? If your own people don't think you are responsible enough to have a twitter **you aren't fit to be president**.", "[CNN bring you this exclusive look into the FBI's investigation of these emails](https://www.youtube.com/watch?v=g3iFJpGJiug)           \n             \nEdit: Thanks for the gold anonymous Mel Brooks fan!", "Probably cost the dems majority in the senate in Comey words, \"Mission Accomplished\"", "his presidency would have to be chaperoned lol.", "I especially like that NBC interrupted its NASCAR coverage with this as breaking news. It means a lot of Donnie's base people who normally avoid the \"lamestream\" media, just got this news dropped in their faces without the usual spin. It will be interesting to see how they reconcile this with their beliefs.", "Wow it's not like literally everyone bar r/the_denial guessed that the second it was announced. Who'd have guessed.", "30 years of non stop investigations.\n\nMy god any politician over here would be utterly destroyed. Almost makes me wonder if she does have loads of lawyers/staffers assassinated.", "Not just Clinton. Before the announcement 538 estimated the Democrats had a 70%ish chance of taking back the Senate. Now it's a toss up. Hillary will likely still win but it will be with a GOP led Congress. ", "This entire thing has been detrimental to the appearance of the country. We just look like a bunch of savages now. As if putting hot dogs on hamburgers wasn't enough. We're fucked", "Damn even Breitbart posted a grudging one paragraph article on this.\n\nEdit: Article is now longer and shittier: \n\nhttp://www.breitbart.com/big-government/2016/11/06/fbi-director-james-comey-no-criminal-charges-hillary-clinton-based-additional-emails/#disqus_thread\n\nMirror from Bhill68: https://archive.is/ErQhC", "Apparently his aides have him off twitter. So however long it takes for him to wrestle a phone from one of them.", "What's the over under on how many minutes until Trump self destructs over Twitter? ", "This is the perfect trap. The only way for the Trump camp to deny this news is to have him send out tweets that are obviously from him - that is crazy tweets. ", "Wow....FOX was repeating over and over that \"sources\" said that there was a 99% chance (which Hannity said meant 100% chance) that Hillary was going to be indicted and that the emails on the computer were NOT duplicates.\n\nI guess I shouldn't expect any better but still I'm dissapointed.", "&gt;\"You don't shirk your responsibility when you're an elected official. You sanctify your responsibility and that's what I'll do. I'll consider who she nominates at the time she does and make a decision that's right for the people of Georgia,\" Isakson told the Atlanta newspaper.\n\n&gt;A spokeswoman for Perdue, a member of the Senate Judiciary Committee, told the AJC: \"He wants to ensure we have a Supreme Court justice who will uphold the Constitution, and he will examine each nominee independently based on their merits.\"\n\nBut what about the nominee who has already been put forward by a twice-elected president? ", "With hands that small? Could take him until November 28th.", "...and in Minnesota just now Trump is back on his \"system is rigged\" rhetoric.", "You're a bit behind in your batshit insane Clinton allegations. She's a witch now who practices some sort of blood voodoo. ", "The damage is done. Disgraceful from Comey to raise a false alarm 11 days out and then shut it down 2 days before. If he wasnt completely sure it was significant he shouldn't have revealed it 11 days out. Clinton still wins with over 278 electorial votes IMO.\n", "Kellyanne is in full denial mode on MSNBC right now lol", "Weiner is still alive.  He is walking proof that she doesn't have people killed and has been for years.  ", "I love how Obama has been shitting on Trump. Very satisfying. ", "Now its time for the investigations into the leaks from the rogue agents to Rudy to begin. ", "How about because there is no evidence whatsoever of Clinton even discussing killing someone, let alone her having them killled, she has never had anyone killed?\n\nThe Clinton Kills People meme is one of the stupider ones this cycle out of a lot of stupid.", "\"This is worse than Watergate\"\n\nLol.  Dumbass", "*I swear to god Florida if you fuck us again...*", "[So Mark Cuban was right](https://twitter.com/mcuban/status/792096395100422145)\n\nAlso why doesn't Pete Williams use his own twitter account", "They are already convinced all media is lying to them except for far right media. It's pretty disgusting.", "I believe this was the intended result. Comey is no fan of Trump but I think he saw a way to influence down ticket damage and took it.", "[CNN's frontpage right now lmao](http://imgur.com/a/dXO75)\n\n\nEDIT: The [updated pic](http://imgur.com/a/L4PJ5) might be even better hah", "So because they haven't found anything in all these investigations then that must mean she murders people?  Wow.  r/conspiracy is over there", "*hiss-like sniffles*", "They will have to destroy all twitter accesible devices anywhere near him.", "Can I please get off of this ride. 2000 seems so tranquil and normal compared to 2016. ", "Got to be tough for her when all her pivots started with \"but Hillary Clinton's emails....\"\n____\n\nEDIT: [Behold the new GOP Talking Point](https://twitter.com/SethAMandel/status/795399836858286081). \n____\n\nKurt Eichenwald's story about this worth reading:\n\n&gt; [From the information obtained that first day by Newsweek, it was already clear that, because of the accounts involved, almost all of the documents were going to be duplicates or personal emails. In other words, from the opening moments of this inquiry, there were people in government who already knew what the outcome of this new FBI effort would be, yet it took the bureau another nine days to confirm those details.](http://europe.newsweek.com/what-fbi-found-emails-anthony-weiner-laptop-517652)\n\nEDIT 2: [There weren't even 650K emails on that laptop.](https://twitter.com/kurteichenwald/status/795410682292408321) \n____\n[Reason no publication in USA reported 650k number in WSJ report \\(which had NO sourcing - not anonymous, NONE\\): Technologically impossible.](https://twitter.com/kurteichenwald/status/795411060517965824)\n_____\n\nEDIT 3:\n[@GenFlynn Seriously? U ran the DIA and u don't know of scan/match programs? Have u never used a computer? That is terrifying.](https://twitter.com/kurteichenwald/status/795413036249006080)\n____\n\nEDIT 4: \n\nOh shit Eichenwald is calling out General Flynn on his Russia connections:\n\n[@LansMyers @GenFlynn Maybe Flynn doesn't understand these complexity things like com-POOT-tors unless Putin whispers about it to him.](https://twitter.com/kurteichenwald/status/795413631672393728)\n\n[Another photo of General Flynn with Putin.](https://pbs.twimg.com/media/CqBbx-dWIAEcWZs.jpg:large) \n____\n\nEDIT 5:\n\n[I am really getting terrified by the number of senior defense/law enforcement trump people showing they know nothing about computers.](https://twitter.com/kurteichenwald/status/795414721302302720)\n____\n\n[For ppl saying \"I have 650k emails on my account.\" That is on the cloud, NOT downloaded to ur laptop. This was about emails ON laptop.](https://twitter.com/kurteichenwald/status/795415051771514880)\n_____\n\nEDIT 6:\n\nI'm getting a lot of people saying that 650K emails would indeed fit into a laptop. Absolutely it could be possible but that's not really Eichenwald's point. \n\nHe's saying that 650K emails wouldn't fit into that particular laptop that Weiner had. As we don't know the hdd size of it yet it's pretty unnecessary to speculate about this. \n\nHe's also saying that the number of \"650 000\" emails don't have a proper source when it first appeared in the WSJ article, that's why no other media reported on that particular number, not even an anonymous source so it's not even certain that it's an accurate amount of emails.\n______\n\nEDIT 7:\n\n[I love ppl saying \"if laptop had many gigs of memory &amp; emails compressed, could save 650k.\" It didnt and they weren't. Stop making up facts.](https://twitter.com/kurteichenwald/status/795459963888005120)\n____", "When you start a cult the first thing you have to do is convince potential followers that you are the *only* source of truth.\n\nEdit: Look, NASCAR fans and KGB agents. CNN does not represent the DNC in the same way that Fox News represents the GOP. Fox News is CONSTANTLY telling you and your army of angry grandmas that they/you \"can't listen to the lamestream media.\" It's a major part of almost every broadcast. I'm fully aware of the stupid thing that Chris Cuomo said that one time. You'd be hard pressed to find a democrat who didn't think he was making a total ass of himself. That's on CNN. Luckily, people only watch CNN while they're waiting to board their airplanes.", "Why yes let's vote for the person that can't fucking control himself on Twitter. ", "If you're thinking \"OK, she's winning now, I don't have to vote,\" remember:  you're not just voting to cause a Clinton victory, but you are also voting to help deliver a historic popular vote landslide humiliation for Trump.  He should not get to say he's not the worst major party presidential candidate ever. Time to pile on and help make a statement about what America stands for!", "But but but emails!", "Try to keep up she's a pedophile witch now.", "can you fucking imagine that?  These assholes are trying to install this guy as the President.  They can't trust him with twitter but they want him with the fucking US military and nuclear arsenal at his fingertips.  Disgusting.", "Such a nasty lizard. ", "Honestly how sad is it that a presidential candidate had to have his Twitter account taken away like a child? That speaks volumes.", "Remember two weeks ago when Arizona was looking blue and Texas wasn't out of the question?\n\nThanks, Jim. Enjoy your career on Fox News.", "Imagine how it would feel to be a head to the grindstone worker for the FBI. You do a ton of work on emails get a conclusion, pass it on, whew. Then a week before the election, your boss fucks up, and you now have to sift through thousands of emails in a week, or it's your head on the line. Feelsbadman.", "That doesn't make any sense. If that was the case he would continue to just say nothing until after the election.\n\nMaybe he's just an honest man that was stuck between a rock and a hard place, figured the best course of action was transparency?", "6th November: Don best you leave that twitter account to someone less volatile.\n\n9th November: Don, here's the nuclear launch code. We trust you.", "I hope he stays a public figure post presidency. Love the guy.", "Sadly the damage is probably done. But yeah the nation has one day to ponder over that. Happy voting.", "I know sarcasm has lost all meaning in this election thanks to Trump.", "I was pondering exactly the same the other day; more easily available information = better informed people is sadly a wrong assumption we made back in the early days of the internet. ", "It's very short. I just imagine Steve Bannon typing it up as fast as possible while Trump throws things around the office.", "As a Rockets fan I am increasingly uncomfortable with how much I like Mark Cuban. I mean, I came around on Dirk after a decade or so, but Cuban needs to knock it off. How am I supposed to look in the mirror in the morning. ", "Trump a week ago when Comey released his first letter: Comey is a brave man. This is bigger than Watergate.\n\nTrump most likely in the very near future: Comey is a coward. Crooked Hillary obviously paid him off.", "Florida's response is: \"You'll what?  Yeah nothing, that's what I thought.  We're gonna Florida the fuck out of this election and there's not a damned thing you can do to stop us!\"", "It's fucking impossible to tell what's real what's sarcasm, and what's satire. Ffs one of Trump's staff the Briebart guy literally had their pants catch on fire (was sitting too close to a heat source or something).\n\nCan't wait until this is all over so I can recalibrate my meter.", "I dunno it seems to have influenced the presidential more than the senatorial races. PredictWise, for example, showed the Senate odds recovering mid-week. ", "Better act fast before he [calls Sean Hannity](https://youtu.be/wDGLSRPQ5B4)", "So does the narrative from the Trump camp switch back to the FBI is rigged again?", "Lol r/the_denial. I like the term \"the Illiterati\" myself.", "Not a particularly original comment but: \n\nWhat the fuck was this all about then?\n\nComey didn't just shoot himself in the foot. He sawed off his leg with a rusty hacksaw, set it ablaze, and then beat himself half to death with it.", "https://i.imgur.com/YSeh2xR.gif\n\n*Thanks stranger!", "The Ruble just crashed", "His campaign staff literally changed the password and didn't tell him what it is.", "I'm just here to fuck elections and violate hatch acts...and I'm all out of elections.  -James Comey probably", "The_dump is having a heart attack", "And now we wait...", "20 million voted after Comey and before his newest comments. He legitimately changed the course of the election from a possible House Senate takeover to a barely there fight for the Senate. Imagine if Clinton was allowed a full week of being on offense. That's unacceptable. partisanship from our highest institutions of investigation. ", "\"Of course Mr Trump thinks that Mexicans can read and what he wants them to read the most is Hillary Clinton's 33'000 missing e-mails\". ", "Listen Huma was certainly not taking a break just because of this. The poor woman is in the middle of a very embarrassing, public failure of her marriage.\n\nI don't know about you...but I bet Hillary can relate to that. Yeah?", "No they hate her because she's a woman. She's survived because she's a goddamn professional.", "Clinton is a goddamn professional. That's exactly why the Republicans hate her so much.", "Nope. Just a [multi-million dollar industry](https://www.theatlantic.com/magazine/archive/2015/03/among-the-hillary-haters/384976/) specifically dedicated to making up scandals about her. ", "Yes people have died who have connections with Clinton.  But you got to remember Hillary and Bill combined have ran 4 big President campaigns Bill hired everyone in the White House and appointed many other people, Hillary ran the State Department, Hillary was one of the most traveled Secretary of State ever, and throughout their lives they hired many aides for their other positions (like Senator or Governor).  Because of this, over the courses of their lives they have had connections in some form with thousands of people.  With this many people there is extremely likely chance that a some of them died in ways that with proper wording can sound sketchy.", "538 still hasn't recovered. Dead heat.", "And the whole House and Senate thing.", "November 29th you mean", "It's almost like there is a vast right-wing conspiracy against her. ..............", "If rumors are to be believed they took his phone and changed his password. He'll probably rant about it at his rally, but he's been saying crazy shit all campaign at those. ", "So in other words that vaguely worded letter that Comey sent to Republicans about this was a politicized attempt to discredit Hillary 11 days before the election. \n\nHow about an investigation into the FBI itself now or is that just unnecessary? I'm guessing the Republicans will say so, especially since Giuliani has changed his tune when it comes to knowing about the letter before it actually happened. ", "Trump is our great white savior? Even if you hate HRC and washington to think Trump is going to fix any of that, you have to be insane. What is up with Trumpers?", "The scandal should be that the Republicans have targeted the Clintons for 30 years and have yet to make anything stick... other than that blowjob thing.", "Comey seems to be simultaneously helping Trump win while creating a situation where Trumpsters want him dead.\n\nThis does not seem to be an ideal strategy.", "Just you wait until November 9th", "The guy that would be trusted with the world's largest nuclear arsenal can't be trusted with his own Twitter account.", "NBC clearly did this as a smug \"fuck you\" to every trump supporter if there's one thing that riles up his supporters other than the Hillary emails, it's interrupting their redneck racing league. I love it. ", "The problem now is that there's so much information that you can always find enough to reaffirm your worldview. Everyone lives in echo chambers now that normalize their views and behaviors until it doesn't matter what the facts are.", "Blatant fucking voter suppression and it's disgusting.\n\nCut early voting hours/polling stations. They don't even try to hide it every election they pull garbage like this and nobody ever calls them on it really.\n\nAnyone here that supports this, give me a single fucking valid reason as to why early hours were slashed and polling stations lowered.\n\nThe democrats get out of the vote, the republicans suppress it. Their survival literally depends on them preventing people from exercising their rights.\n\nThe best part is when they try to pass \"voter ID laws\" and surgically target democrats and minorities while tagging on \"lower voter hours\" and \"less polling stations\" and then act like the DNC wants illegal immigrants to vote for them and that's why they're against the laws.\n\nI don't think I've ever seen a republican voter ID law that didn't come with lower voting hours and reduced polling stations on college campuses/poor areas.", "Dear Partisan FBI Agents\n\n'You're fired!'\n\nSincerely, the American People", "\"Isn't ok\" is an understatement. That's practically criminal. There should be a *surplus* of voting machines and voting precincts not a lack. We should be ready for a higher than expected turnout every time because it could always be higher than expected.", "This isn't them being not ready for high turn out it's them suppressing voters, they mean to do this.", "Please proceed Donald.", "I can imagine Trump waiting until his aides' backs are turned and then diving for his phone managing to fumblepost half a tweet until he is tackled:\n\n**OBAMA IS A DIRTY NI**\n\n*Tweet deleted*", "Baiting the fuck out of him. Trump has to be fuming on the inside today:\n\n1. More celebrities stumping for Hillary in key states. He gets Ted Nugent (LOLOL)\n\n2. Obama burns him again pretty badly\n\n3. The email scandal is revealed to be a nothingburger.\n\nTRIGGERED", "He's unfit to manage a fast food restaurant. He's just lucky he had a rich daddy or he'd be nothing. ", "This is why Republicans must be kicked out of government. The GOP has absolutely no shame. They will do anything in their power to get elected even if that means stopping people from voting. It's absolutely disgusting.", "He'd be such a liability in any diplomatic setting particularly if there's any press there so he feels he needs to grandstand ", "And look at the cretins who would be doing the chaperoning...", "Yep.  We can't afford more polling locations in Democratic precincts nor can we afford to keep the polls open very long, but we can *definitely* afford lots of polling centers and long hours in Republican districts.  They don't even try to disguise it.", "I for one, will be waiting to hear their very public apology.\n\nYeah, right.", "That was another great moment for Obama. I loved that Romney/Obama debate where everyone could see the trap except Mitt. He was so confident and then the moderator just shut his shit down hard like Obama knew he would.\n\nBarack is a great trap setter with simple and solid baiting techniques.\n\nedit: Link to what this is all referring to https://www.youtube.com/watch?v=cFwtuInlMew", "Could you imagine a President Trump *(shudder)* getting a tough question on the White House lawn from the White House Press Corp in front of the Chinese President? He'd go off trying to sound alpha.", "Should be as easy as getting a cup of coffee.  Doesn't matter who you are voting for", "Meanwhile Trump complains that polls were kept open in Nevada.  Apparently we're supposed to just tell voters to go home if the lines are long.", "Rigging the election is one of the few things that Trump has said that has any real truth to it. Course it's his party doing the rigging. He failed to mention that...", "It'll come on the same day Hannity makes good on his promise to be waterboarded for charity.", "I could definitely see Trump live tweeting insults about another leader during negotiations. Imagine him during the G8.\n\n'Merkel fooled by China on global warming. Killing businesses. Idiot'", "He's unfit to manage my Zoo in Zoo Tycoon for fuck's sake.", "It's pretty perfect revenge for all the times the GOP has shat on him.", "Sounds like Night Vale. ", "And this shit is coming from JULIAN ASSANGE who has destroyed his own reputation faster than Mel Gibson having a nervous breakdown in the back seat of a cop car.", "http://i.imgur.com/g2r2oHU.gif", "I'd be disappointed in Obama if he let this pass without mocking trump. It's eminently mockable", "I live in Canada you might know us as America's Hat. When I go to my voting location, which is mandated as the closest one to my home, it is often in the community league in the neighborhood. That means it's a 10 minute walk at max in the cities. I have voted in about a dozen elections between civic, provincial, and national. They are almost all conducted on one day, with early voting only available in special conditions such as a vacation booked on election day. The longest line I have ever had was about 5 people long, and it took less than 2-3 minutes for me to get my ballot.\n\nThe notion of lines like this in a modern democracy is frankly disgusting and alien to me. America often claims to be the bastion of Democracy. You deserve so much better than this. ", "Who'd be chaperoning who? It'd be like leaving a 6 year older in the care of a 7 year older. ", "Obama sounded like he was doing a Jeff Foxworthy impression.\n\n\"If you're up at 3am because SNL made fun of you...thennn you can't handle the nuclear codes.\"\n\n\"If your own campaign doesn't trust you with your Twitter account...thennn you can't handle the nuclear codes.\"", "The LeBron James endorsement in Ohio carries perhaps more weight than any other celebrity endorsement in any other state ever combined. ", "not to belittle the great nation of Mexico but their president is quite a short man and Trump bitched out on him, imagine how much he'd cave to Putin ", "Some Trump voters in Cincinnati notice the guy with the shirt. \n\nPatricia Zengerle ‏@ReutersZengerle  11m11 minutes ago\nOne of our photographers took this in Cincinnati. \n https://pbs.twimg.com/media/CwnLm1fXAAAczWE.jpg:large", "\"The powerful\" created internet hype? People do this all on their own and it's not new. It's why advertisement and propaganda work so well. Every political party in human history is guilty of manipulating that. ", "Ohioans are waiting in line for hours as well today to vote.\n\nhttp://www.vox.com/presidential-election/2016/11/6/13542680/there-are-4000-people-in-a-half-mile-voting-line-in-cincinnati-today-this-isn-t-ok", "Dude nobody calls Sean Hannity. ", "I would say people are more informed on average we're just also more informed about the crazy people.", "Make it harder for poor and minorities communities to vote since they often vote for democrats.", "*Opens link ad plays, see title*\n\nGood enough.", "Here's a recent [photo](http://imgur.com/gallery/47qZV).", "Oh Lord, that shirt is horrific.", "On one hand it's inspiring to see that so many people are so deeply committed to exercising their right to vote that they will let no obstacle get in their way. Nevada, North Carolina and Ohio have each now had a monstrous demonstration of voter resolve, with people willing to endure multi-hour waits to cast.\n\nBut on the other hand, of course, it's embarrassing that this resolve needs exercising.\n\nAll municipalities need to open enough polling places, both for early voting and election day, to accommodate all voters with a wait of no more than 15 minutes.", "as an older white American who voted R for years Trump is the scariest thing I have seen in politics and Comey needs to go. ", "Honestly I think she has shown how capable she is. She has been balancing between defending her candidate's statements and leading damage control from the day she started. A look at the popular vote right now is evidence of her efficacy in spite of what she has to work with.", "The idea of voting for Trump isn't to fix Washington it's to blow it up.", "For the sake of my sanity I refuse to believe that there are people who put hot dogs on hamburgers. 2016 has been absurd enough already", "In the richest large country in the world this is not just not OK. It is appalling and unacceptable. The numbers of booths and poll workers need to be set based on population, you should have the same number *per capita* whether you live in a city, suburb or a rural area.", "Don't let this rally distract you from the fact that THE GOLDEN STATE WARRIORS BLEW A 3-1 LEAD IN THE NBA FINALS", "\"Donald...Come out and plaaay. Donald...come out and plaaAAAaaay!\"", "As others have pointed out this is, at least in part, by design. You aren't seeing this in small towns in Ohio, just big cities with large poor/minority populations.", "Eh....disagree.  We have access to plenty of fact checking resources.  If it proves anything it shows that we humans like others who agree with our own opinions and our self-selection bias is a thing.", "&gt;&gt; As an outsider i find this so strange. What reasons were given to reduce the stations?\n\nThey claim it's funding most of the time but it's bullshit. \n\n&gt;&gt; I'd love it if any person that agreed with it could explain as well because i'm having a hard time understanding it which most likely means i'm missing something.\n\nYou won't actually get a straight answer, the GOP in NC got busted literally trying to suppress black voters by a federal court and they still tried to defend it.\n\nhttps://www.washingtonpost.com/news/wonk/wp/2016/07/29/the-smoking-gun-proving-north-carolina-republicans-tried-to-disenfranchise-black-voters/\n\n&gt;&gt; The federal court in Richmond found that the primary purpose of North Carolina's wasn't to stop voter fraud, but rather to disenfranchise minority voters. The judges found that the provisions \"target African Americans with almost surgical precision.\"\n\nThey went and did research on racial voting habits and everything.\n\n&gt;&gt; In particular, the court found that North Carolina lawmakers requested data on racial differences in voting behaviors in the state. \"This data showed that African Americans disproportionately lacked the most common kind of photo ID, those issued by the Department of Motor Vehicles (DMV),\" the judges wrote.\n\n&gt;&gt; So the legislators made it so that the only acceptable forms of voter identification were the ones disproportionately used by white people. \"With race data in hand, the legislature amended the bill to exclude many of the alternative photo IDs used by African Americans,\" the judges wrote. \"The bill retained only the kinds of IDs that white North Carolinians were more likely to possess.\"\n\nThey've been busted red handed doing this shit multiple times.\n\n&gt;&gt; Not looking for a argument i just assume there most be a reason that i haven't heard.\n\nYou will not find a valid reason for it, they'll claim it's funding every single time.\n", "I don't even understand the premise for attempting to spin voter enthusiasm as rigging. How is allowing voters to vote in any way a bad thing?", "The same people who keep asking how they got through 650000 emails in 8 days must be amazed that you can type \"Benghazi\" into the Google search bar and get 22700,000 results in less than a second.", "I'm sixty-eight grand in the hole and I'd sooner trust myself to run my Rollercoaster Tycoon 2 park than him.", "This election has been especially bad with NC and OH. \n\nThey just don't want people voting ... ", "Accusing powerful women of being witches worshipping Satan and harming children is straight-up 17th century shit.", "The waiting game sucks! Let's play Hungry Hungry Hippos! ", "There were officials who knew these emails were duplicates from the start:\n\n&gt; Newsweek reported on day 1 of Comey email \"scandal\" what happened from govnt sources. Yah - that means ppl in gov knew truth from 1st day.\n\nhttps://twitter.com/kurteichenwald/status/795386951457239041", "Where did Chachi go?\n\nChachi! Trump needs you now more than ever!", "But he says how it is!-Republicans.", "As an outsider i find this so strange. What reasons were given to reduce the stations?\n\nI'd love it if any person that agreed with it could explain as well because i'm having a hard time understanding it which most likely means i'm missing something.\n\nNot looking for a argument i just assume there most be a reason that i haven't heard.", "My personal bet? To weaken the odds of a Democratic Senate majority. Trump was polling so terribly that even this \"bombshell\" couldn't guarantee that he would pull ahead (and by most accounts it didn't) but it DID negatively impact crucial Senate races enough to make Democrats go from leading/tied to tied/losing (respectively). The actual GOP already knows they can do a shitload of damage if they maintain the House and Senate even if there's a Democratic president- they've spent the past eight years perfecting those obstructionist tactics. In some ways it's probably their ideal scenario- all of the gridlock power they had during Obama, but with none of the uncertainty and risk Trump would have brought to the table.", "She's been his best campaign manager by far it's a shame he didn't listen to her earlier in the campaign or he could have salvaged it before the humiliation during and after the debates. \n\nedit: grammar", "The FBI may not have even made an announcement until they had the chance to check the emails after the election but it's been reported that Comey was so afraid of a leak coming out of the New York office saying a motherlode of Hillary emails were found on Weiner's computer, that he felt he compelled to send the letter to the Congress. \n\nSo not only is the New York FBI office riddled with corrupt leakers trying to rig the election against Hillary, but Comey is an incompetent stooge who helped them with their [illegal](https://en.wikipedia.org/wiki/Hatch_Act_of_1939) scheme.   ", "you mean by reviewing the nominee who is currently been put forward and is waiting?", "I'm in Columbus Ohio and dealt with something less extreme but similarly annoying in 2012. I voted absentee this time because of it, but I know a few people who aren't voting at all, because they just don't want to deal with the enormous hassle and time commitment on a work day.", "Lynching is back on the menu boys.", "Exactly what I was thinking. I'm tempted to wait up until 3am and see if we get a tweetstorm \n\nEdit: I actually had to edit out the word edit", "She can join the club.", "I'm involved in local government. 3 people I've worked with have died in the past year and another one had a fire that killed a family member and destroyed his house. \n\nWelcome to the law of large numbers. ", "\"This is fine and acceptable. The system is working\" - RNC", "Obama did say he was gonna let go a little bit lol", "Supreme Court Justices tend to be reserved.", "He's unfit to *work* at a fast food restaurant let alone manage it.", "Honestly I just want him to get his own talk show. That he gets an Emmy for.", "https://www.hillaryclinton.com/calls/\n\nCalled 120 people in Ohio so far this afternoon. Let's get out the vote people.\n\n(Be sure that you click on \"all,\" not the default \"Featured\" to get states like Florida and NC).", "The Trump buddy on CNN right now is salty.", "He's all out of f**ks to give.", "Yeah i'll give her credit, she really knows how to spin Trump news in a way no other surrogate can", "Doesn't matter it's the same as every Clinton scandal, the innuendo and speculation are what have done the most damage\n\nNo one cares that it never amounts to anything", "100% would see the national debt explode.  Taxation is how we pay for Government.", "It's even against the Rockets congrats, you used the perfect gif", "\"They didn't vote Reagan either time maybe they'll vote Trump!\"\n\nI have seen literally zero Trump signs/bumper stickers in the eastern Twin Cities.  In the district that elected Michele Bachmann.", "Trump went from hating the feds to loving the feds to now? Hating them again?", "Yet again \"Hillary is crooked\" but under any scutiny the allegation collapses.\n\nMeanwhile\n\nDiddling Donnie has been through nearly 3500 lawsuits.\n\n174 Federal investigations.\n\nHas 75 pending cases\n\nAnd I think 2 or 3 court dates in the next 30 days. \n\nBut yeah accusation equals guilt for a Democrat even though nothing was ever enough to get her into court. \n\nAnd the annoying orange has been found guilty or fined of nearly everything he accused her of. \n\n", "\"Okay so this one is simple, Jake: Mr. Trump did the deaf voice at his rally this morning so that deaf people could hear him, too.\"", "Did....did you just say that a city with 850k people only has **ONE FUCKING PLACE TO VOTE**??\n\nPlease tell me that is a joke. ", "Netflix should buy the rights to everyone's account of what happened and make a series in the style of House of Cards. They could call it Trump Card. It would win that Emmy that The Apprentice never did. ", "I think this will mostly depend on who controls the Senate post election.\n\nIf the GOP loses the Senate then yes I can see what you're saying.\n\nIf the GOP maintains control I would expect nothing less than more bullshit and stalling like Ted Cruz alluded to.", "I was there the crowd went wild at that line", "If Trump had control over his Twitter account rn we'd finally hear him say the n-word.\n\nHow does such thin skin STILL look like leather?", "Also don't let *that* fact distract you from the fact that THE CLEVELAND INDIANS BLEW A 3-1 LEAD IN THE WORLD SERIES.", "Seems much more likely to me that you are an all-powerful nefarious, cannibal witch who will stop at nothing for the sake of world domination.  ", "&gt; Having Lebron James join Hillary is obviously cheating!\n\n* Donald Trump says while trying to find Christian Laettners phone number. ", "If the GOP loses the senate I'd like to democrats filibuster their own nominee, and then put Obama on the SC", "He's like Larry Bird is here in Indiana. He's practically a god.\n\nSadly Larry Bird is also a massive dickhead.", "You will probably see more of him and hear him speak more freely. Obama unchained. ", "As a Minnesotan let me illuminate any trump supporters or sympathizers to the anti-islam movement in the US, with a crosspost I made in the wake of the Pulse nightclub shooting:\n\nThere are no more than 50-300k people in ISIS across the globe, while there are 1.6-1.8 billion who practice Islam.\n\nPretty much all of these Muslim terrorists you hear about, wherever they make headlines, are native citizens of their countries. In France, Belgium, the US, Spain, etc.\n\nThe right wing points towards refugees and immigrants from the middle east. Not only are these people the most antagonized by the public, they're also the least likely to be ISIS sympathizers, because they have been victimized by ISIS to the point of fleeing their homelands. These are Muslims. They practice Islam. ISIS and it's sympathizers are going around during the holy month of Ramadan, raping and murdering 13-14 year old girls, and shooting up night clubs, when they should be fasting, repenting on their sins, and getting closer to God (Allah). \n\nWe have enough blowhards and bigots making this about Islam. We don't need our state heads and political figures legitimizing it.\n\nThe KKK consists of 5-8K members now, and peaked at 3-6 million members in the 1920s, about 1 in 19 Americans at the time. That was less than 100 years ago. That means there are likely way more Americans who grew up in klan/ ex klan households than there are ISIS sympathizers in all the countries around the globe. Some of them attack IRS buildings, black churches, or health clinics.\n\nMy state, Minnesota, has the largest Somalian population on the planet outside of Somalia itself. Somalian Muslims tend to be significantly less educated and Poorer than other Muslims in America, due to their relatively recent immigration, language barriers, and the war torn status of Somalia. Also, Minnesota is very segregated, resulting in a very insular community. Yet, they've thrived on entrepreneurship, and despite being an attractive target of recruitment for Al-Shabab and ISIS (and they have had some success, I admit - New York and Minnesota have the most arrests related to ISIS conspirators within the US), the communities remain vigilant in fighting against it. \n\n\nI refuse to condemn these people's religion when they are preyed upon by corrupt organizations and demagogues and, despite all circumstances, continue to resist such organizations and remain devoted to their communities and committed to living a peaceful lifestyle while adhering to the tenants of their religion. To do so would be to undermine all the honorable efforts our government and these communities continue to make for themselves, each other, and the rest of us.\n"], "links": ["5bgp1x", "5bfz5d", "5bfz5d", "5bfz5d", "5bgp1x", "5bgp1x", "5bfz5d", "5bfz5d", "5bgp1x", "5bgrjb", "5bfz5d", "5bfz5d", "5bgp1x", "5bgtpb", "5bfz5d", "5bfz5d", "5bfzt6", "5bfz5d", "5bfz5d", "5bgp1x", "5bgrjb", "5bfzt6", "5bf6ti", "5bfz5d", "5bgdfv", "5bgs8w", "5bfdnl", "5bgrjb", "5bgp1x", "5bfz5d", "5bghqb", "5bgslo", "5bfz5d", "5bgp1x", "5bf6ti", "5bgp1x", "5bgrjb", "5bfz5d", "5bfz5d", "5bfz5d", "5bfz5d", "5bfz5d", "5bfwjg", "5bgdfv", "5bgp1x", "5bfnqp", "5bgtpb", "5bgdfv", "5bfz5d", "5bgp1x", "5bg9f4", "5bf6ti", "5bfzt6", "5bfz5d", "5bfzt6", "5bgdfv", "5bfz5d", "5bg9h3", "5bfz5d", "5bfi92", "5bfz5d", "5bgdfv", "5bg9h3", "5bgtpb", "5bfp9f", "5bfz5d", "5bfzt6", "5bfwjg", "5bgslo", "5bgp1x", "5bfz5d", "5bgp1x", "5bf6ti", "5bfz5d", "5bgdfv", "5bgdfv", "5bfz5d", "5bfz5d", "5bfz5d", "5bfz5d", "5bgdfv", "5bfzt6", "5bgdfv", "5bfdnl", "5bfvor", "5bfdnl", "5bfz5d", "5bfwjg", "5bfz5d", "5bfn98", "5bfz5d", "5bfz5d", "5bfn98", "5bgs8w", "5bgp1x", "5bgrjb", "5bf6ti", "5bh1ln", "5bh1ln", "5bh1ln", "5bh8t8", "5bh1ln", "5bfz5d", "5bfz5d", "5bh1ln", "5bh1ln", "5bh1ln", "5bh1ln", "5bh1ln", "5bfz5d", "5bh09o", "5bh1ln", "5bh1ln", "5bh8t8", "5bh8t8", "5bh1ln", "5bh1ln", "5bgzs3", "5bh1ln", "5bgp1x", "5bh1ln", "5bfz5d", "5bfz5d", "5bgzs3", "5bh79i", "5bgtpb", "5bh1ln", "5bfz5d", "5bgzs3", "5bgzs3", "5bh4dc", "5bgtpb", "5bh1ln", "5bh1ln", "5bh79i", "5bfz5d", "5bfz5d", "5bg9f4", "5bgdfv", "5bfz5d", "5bh79i", "5bh1ln", "5bgzs3", "5bh1ln", "5bh09o", "5bfz5d", "5bfz5d", "5bh4dc", "5bfz5d", "5bgdfv", "5bgrjb", "5bgtpb", "5bh7xx", "5bfz5d", "5bh1ln", "5bfz5d", "5bfz5d", "5bgp1x", "5bh4rj", "5bh4dc", "5bfz5d", "5bfz5d", "5bfz5d", "5bgp1x", "5bfz5d", "5bgp1x", "5bh7do", "5bgdfv", "5bh1ln", "5bgzs3", "5bh1ln", "5bh8t8", "5bh1ln", "5bgp1x", "5bfz5d", "5bgp1x", "5bh1ln", "5bgrjb", "5bfwjg", "5bh1ln", "5bgtpb", "5bfwjg", "5bh1ln", "5bfz5d", "5bfz5d", "5bgtpb", "5bgzs3", "5bgzs3", "5bh7do", "5bh4rj", "5bfim4", "5bh7xx", "5bhlyl", "5bhlyl", "5bh8t8", "5bfz5d", "5bhlyl", "5bhl7m", "5bfz5d", "5bfz5d", "5bh8t8", "5bfz5d", "5bfz5d", "5bhl7m", "5bhhjg", "5bh8t8", "5bfz5d", "5bh1ln", "5bhl7m", "5bh8t8", "5bh8t8", "5bhhjg", "5bfz5d", "5bfz5d", "5bfz5d", "5bhhjg", "5bhlyl", "5bh1ln", "5bh8t8", "5bh1ln", "5bgzs3", "5bgp1x", "5bfz5d", "5bfz5d", "5bfz5d", "5bfz5d", "5bfz5d", "5bh8t8", "5bh8t8", "5bhhjg", "5bh79i", "5bhhjg", "5bhlyl", "5bfz5d", "5bh8t8", "5bfzt6", "5bgp1x", "5bhl7m", "5bfz5d", "5bhl7m", "5bgp1x", "5bh6mk", "5bgp1x", "5bfz5d", "5bgzs3", "5bgtpb", "5bh1ln", "5bfz5d", "5bhce5", "5bhhjg", "5bh1ln", "5bhhjg", "5bh1ln", "5bfwjg", "5bfz5d", "5bgdfv", "5bg9h3", "5bfz5d", "5bfrt9", "5bgp1x", "5bh8t8", "5bgp1x", "5bgtpb", "5bgp1x", "5bfz5d", "5bhl65", "5bgdfv", "5bfnqp", "5bh1ln", "5bh8t8", "5bhl7m", "5bhhjg", "5bh4dc", "5bh1ln", "5bhhjg", "5bfp9f", "5bfwjg", "5bh8t8", "5bhbsl", "5bfz5d", "5bfz5d", "5bgslo", "5bfz5d", "5bgdfv", "5bhfry", "5bhhjg", "5bh4rj", "5bhtp5", "5bhlyl", "5bhtp5", "5bhtp5", "5bh1ln", "5bhtp5", "5bhtp5", "5bhtp5", "5bhtp5", "5bhtp5", "5bhtp5", "5bhtp5", "5bhtp5", "5bhlyl", "5bhtp5", "5bh1ln", "5bhtp5", "5bhtp5", "5bh79i", "5bgdfv", "5bhvg7", "5bhtp5", "5bhl7m", "5bhtp5", "5bhtp5", "5bhtp5", "5bhtp5", "5bhtp5", "5bhl7m", "5bfz5d", "5bhtp5", "5bhtp5", "5bh1ln", "5bhtp5", "5bfz5d", "5bhl7m", "5bhtp5", "5bh1ln", "5bhvg7", "5bfz5d", "5bgrjb", "5bhtp5", "5bhtp5", "5bh1ln", "5bhtp5", "5bhtp5", "5bhtp5", "5bhtp5", "5bfz5d", "5bfz5d", "5bhtp5", "5bhlyl", "5bfz5d", "5bhwi8", "5bgp1x", "5bhrj9", "5bhlyl", "5bhtp5", "5bgp1x", "5bhxw6", "5bhtp5", "5bfz5d", "5bhtp5", "5bhtp5", "5bhvg7", "5bgp1x", "5bhtp5", "5bhlyl", "5bhtp5", "5bhtp5", "5bhtp5", "5bhtp5", "5bfz5d", "5bhvg7", "5bhtp5", "5bgp1x", "5bh1ln", "5bhlyl", "5bhtp5", "5bfz5d", "5bhulx", "5bh1ln", "5bhwi8", "5bhtp5", "5bhhjg", "5bhtp5", "5bhtp5", "5bhtp5", "5bhtp5", "5bhtp5", "5bgdfv", "5bhxw6", "5bhhjg", "5bhlyl", "5bfz5d", "5bhtp5", "5bi1pe", "5bi1pe", "5bi1pe", "5bi956", "5bi1pe", "5bi1pe", "5bi1pe", "5bi956", "5bi1pe", "5bi1pe", "5bi956", "5bi1pe", "5bi1pe", "5bi956", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi956", "5bi1pe", "5bi33i", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi956", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi956", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi956", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi956", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi2bh", "5bi1pe", "5bi1pe", "5bi1pe", "5bi956", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi956", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bigmd", "5bi1pe", "5bigmd", "5bigmd", "5bi956", "5bi956", "5bi956", "5bi956", "5bigmd", "5bi956", "5bi956", "5bigmd", "5bi1pe", "5bi956", "5bi956", "5bigmd", "5bigmd", "5bigmd", "5bi1pe", "5bi956", "5bi956", "5bi956", "5bi1pe", "5bi1pe", "5bi1pe", "5bi956", "5bigmd", "5bi956", "5bi956", "5bid1z", "5bi956", "5bigmd", "5bi1pe", "5bil4t", "5bi956", "5bi1pe", "5bigmd", "5bi1pe", "5bi956", "5bigmd", "5bigmd", "5bi1pe", "5bi956", "5bi956", "5bi1pe", "5bigmd", "5bid1z", "5bi956", "5bigmd", "5bi1pe", "5bigmd", "5bil4t", "5bi1pe", "5bi956", "5bigmd", "5bi1pe", "5bi956", "5bi1pe", "5bi956", "5bi956", "5bigmd", "5bi1pe", "5bi956", "5bi1pe", "5bi33i", "5bigmd", "5bigmd", "5bi956", "5bh1ln", "5bi1pe", "5bigmd", "5bi956", "5bi956", "5bi956", "5bi956", "5bid1z", "5bi1pe", "5bi956", "5bi956", "5bi1pe", "5biiy3", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bigmd", "5bhlyl", "5bi33i", "5bi956", "5bi956", "5bid1z", "5bi1pe", "5bid1z", "5bi33i", "5bid1z", "5biaa6", "5bilm6"]}