{"comments": ["We all need to give Melania Trump credit. She wanted to reduce internet bullying and found a way to remove her husband from Twitter.  Once again an immigrant does a job no American wants to do.", "No charges? Time for 8 years of congressional hearings to also result in no charges", "&gt;he was extremely careless in the handling of very sensitive information.\n\nOh the fucking irony is so deep I could swim through it.", "If there's one thing both sides can agree on is that whoever wins the entire FBI leadership should be fired what a shitshow.", "I feel bad for Comey. He knew Republican Congressmen and his own agents in NY who were buddies with Giuliani were going to leak the info about more emails so he tried to get in front of it, and sent a letter that said no one knows the significance of any of the emails. Despite that, the media ran with \"this is very significant!\" \n\nAnd he had the agents hustle to get this out before the actual election day.   ", "&gt; putting hot dogs on hamburgers\n\nYou had my curiosity but now you have my attention.", "Brilliant analysis. I always remember a quote \"In DC everyone is innocent until investigated\".\n\nSame thing here I guess. You gather information around a given topic and sully/affirm your own natural prejudices.\n\nSolvable problem sure, but at the moment you're spot on. ", "Maybe she's set up fake CNN footage and fake twitter feeds to fool him.", "It takes you ten minutes to answer a question ten seconds for me to ask one, and ten nanoseconds for me to lose interest in your reply.\n\nFor every stance, there's an easily googled questionnaire that requires expertise in a dozen different disciplines to fully satisfy. If it turns out you are, in fact, talking to someone who can pull that off... well, just ask another question.\n\nYou can't convince a person to hear you out, either, so after delivering a masterful lecture on the history of macroeconomics in the southern hemisphere as it applies to the rise and fall of political dictatorships you might come to find that the person on the other end hasn't heard a word of it.", "I assume they changed the password and he doesn't know it.  I once worked at a place where the boss was such a toddler the tech department diverted emails with certain key words to his secretary (this was agreed upon by the rest of the leadership team.)  He was a lot like Trump, now that I think about it.  It just made everyone else's life a lot easier in the long run.", "I hope he creates a new account and goes on a rampage\n\nEdit: looks like @alsorealdonaldtrump is available...Do it Donald!!", "I guess you could say she's in a \n\n(•_•)\n\n( •_•)&gt;⌐■-■ \n\n(⌐■_■)\n\nBad Romance. ", "Like leaving a horse in charge of dogs. Who's watching the dogs?!", "\"Here's the number where we'll be here's the cat food, and you're a horse\"", "This is the kind of injustice that happens to thousands of Americans when Republicans run the states and close down polling locations in predominantly poor and minority districts.  They cheat.", "We call it the Paul Ryan Strategy", "Like a reverse Wag the Dog? This should have been the strategy from the start.", "nincompoop?", "&gt; He still has his Facebook page I presume\n\nConway: \"Oh shiiiit...\"", "I am super looking forward to Obama being more relaxed and speaking freely like this post-inauguration.", "&gt; A look at the popular vote right now is evidence of her efficacy in spite of what she has to work with.\n\nThere are three reasons why the polls have ever been close in the general.  None of them have anything to do with Conway or anything she has done.\n\n1)  Comey's congressional hearing.  (Got the polls close until the Democratic Convention)\n\n2)  Hillary's pneumonia and collapse at the 9/11 memorial event.  (Got the polls close until the first debate.)\n\n3)  Comey's terrible and unprecedented decision to send the letter to Congress.  \n\n--------\nGive me a break with this Conway mythologizing.  All she does is go on TV and bullshit in the most transparent way possible.", "When I say what I'm about to say in no way does it imply this is all a done deal. Everyone's vote is absolutely crucial. But here we go, anyway.\n\nI cannot wait for Trump to lose. I cannot wait for the narcissistic, nepotist daddy's money permanent disappointment that is Donald Trump to be absolutely crushed and go apeshit. \n\nI can't wait for his supporters to look lost and blame everyone but who they *should* be blaming. Him.\n\nI can't wait. I don't just want him to lose, I want him crushed so badly that there is no doubt when people say \"We do not want this sort of politics. We do not want this hateful rhetoric. You have no place here.\"\n\nGet out there and stop him. ", "&gt;He says the same stupid shit that I sometimes say  \n", "Why is that?! If only they'd call him!", "No in NC they literally said it.  That's why a judge took them to task.", "\\**shakes head*\\* \"That's just not *true*.\" ", "Look Anderson if Sweden didn't want to be nuked it shouldn't have gotten in the way of those nukes.  Those nukes were targeted at the Baltic Sea as a warning shot.  It's not mr trump's fault that the world turned and as a result Sweden was in the place the Baltic Sea was when he gave the command to launch.  I mean how was he supposed to know that?\n\n-Kellyanne Conway probably ", "Honestly he would. \n\nTrump: \"Alright Washington...\" *closes his eyes and smiles* \"You're fired!\"\n\nPolitician: \"You actually don't have the power to do that in a democracy.\"\n\nTrump: \"You're fired. Arrest them!\"\n\nPolice: \"They've done nothing wrong, so I can't legally arrest anyone.\"\n\n*Trump skulks off and Tweets at 3 AM how the government is oppressive.*", "\"Check sex tape!\"", "November 9 2016 National Latino Appreciation Day!\n\n", "I really feel bad for Melania.\n\nShe's locked up 24/7 with this guy.", "&gt; They just don't want people voting ...\n\nThey just don't want *certain* people voting.", "Trolling The Pope at 3 AM.", "I was picturing a somewhat less endearing Truman Show.", "\"Yooouuu might be a redhat\"", "Going on 8 years now.", "Pence is the overly religious parent that spoils their only child. ", "This is what happens when there is only one place to vote early in the entire county. I've been trying to find time to go downtown and vote for the last two weeks but knowing how long the line is, I haven't found a single feasible block of time to do it yet. ", "Please elect my husband so he is so busy I never actually have to spend time with him. ", "Suddenly the last 8 years of Obama's presidency doesn't seem that bad. He's been the epitome of calm cool and collected.\n\nEdit: word change.", "how have you spent that much on rollercoaster tycoon.", "Newt has been probably the single most destructive entity in American politics.  His reign as speaker marked a huge ramp up of partisan politics and paved the way for all the shit you see now from the right.  I hope he suffers and dies slowly of some terrible wasting disease.  Like his wife did....when he was cheating on her while she was on her deathbed.  Fuck this piece of shit.", "Trump would fuck that up too.", "When I was a kid the complaint was that voter turnout was constantly and abysmally low.  Now that Republicans are shitting the bed demographically they've systematically closed polling stations in poor and minority districts in states where they retain control.  They cheat.  They don't care about the constitutional rights of what they deem to be the wrong kind of voters.", "We can the republican party fights tooth and nail to suppress voters.", "Eight years of gameplay baby!", "And IIRC Ohio had to be forced by federal order to even offer early voting in previous elections", "Credit where it's due the amount of stress from being his campaign manager is equivalent to eight years in the White House.\n\nhttp://i.imgur.com/cLEQ8PG.jpg\n\nShe said previously it's not for her to take away a grown man's Twitter account but it just shows how of a petulant child Trump can be. Don't know what  centipedes are up to but they should be in panic mode.\n\nhttp://www.politico.com/video/2016/10/conway-its-not-for-me-to-take-away-a-grown-mans-twitter-061058", "The Republican Party's whole angle is to say that government is fucked up go fuck up government, then point to their handiwork and say \"see, told you so.\"", "That's exactly why Obama won't be one.\n\nThere are plenty of highly intelligent ideologically reasonable federal judges who could to the job on SCOTUS as well as or better than Obama. None of them can sway public opinion like he can, though. \n\nPlacing him on SCOTUS would practically exile him in a job where he's not allowed to exercise his greatest talent.", "They aren't going to get their shit together until they are repudiated by the American public. So long as their shit works they will keep doing it. That's why they need to be voted out.", "What the fuck are you even complaining about. This exactly what we need our president saying. The presidency is in reach of a man-child. Its his job to give his opinion on this.", "For real. He'd grope his co-workers and refuse fries to the customers that looked at him the wrong way. ", "It must feel so vindicating for him after the years of Trump questioning his American birth.", "I keep trying to explain this to people.  Puerto Rico has had a massive exodus primarily to Florida but not exclusively.  Since the last election almost three quarters of a million people have moved from Puerto Rico to the mainland.\n\nNow.  Politics for Puerto Ricans is like soccer for the brits.  It's a national sport and once you choose a team, you don't switch.  Puerto Ricans vote like it's life or death.  Over 90% turnout is not shocking in the slightest.  Add to that Trump being a dick to Hispanics and you've got an unstoppable wave of Latinos coming at you.\n\nThis is not a secret and the republicans should have seen it coming.  Especially Rubio.", "She made her choice.  I do not comment on the lives of others unless they affect others. Personally she isn't affected anyone and has to live in her life.  After Tuesday I hope the shopping spree is massive and I suspect she will stay in this life until she gets her inheritance. \n\nI hope I live long enough to read her book.", "&gt;Ted 'PantsShitting' Nugent\n\nFTFY", "[\"Will he succumb to the maddening urge to erase history at the mere push of a single button?! The beautiful shiiiny button! The jolly candy-like button!](https://www.youtube.com/watch?v=FHy8kW632dE)", "This is the reason the Klan targeted churches. They're the pillar of the black southern community and a place that they feel safe from racism and hate. Say what you want about the Klan but they are one of the most successful terrorist organizations in history because they did shit like this. It's disgusting Trump doesn't care", "And thats when we saw the biggest twist of them all THERE WAS NO TWIST!!!!!!!", "When you admit you are voting to deliberately bring harm to the nation you forfeit the moral high ground and your credibility.", "66% upvoted.\n\nSo ~~44%~~ 34% down-voted this story because it goes against their narrative regardless of it simply being facts from the FBI themselves.\n\nI wonder who those people could be...", "Reducing early voting since 2008. In the last three elections. Early voting was great for the GOP because their voters were older. Since the last three elections the democrats have been able to communicate to their voters about early voting and now their cutting early voting days and polling booths to make sure dems can't vote.\n\nAlso i cant find it anymore but back in 2012 there was accounts in Virginia where voting booths in urban areas suddenly went down compared to 2008. which tilted elections in favor of rural areas because theres less people in them. While rural areas didnt have to wait Urban areas had longer lines than in 2008.", "It is also HOW he said it.\n\nIf Comey had said \"We have found new emails which require further investigation there is no reason at this point to believe that Hillary has done anything criminal.\" then it would have been taken much better than the way it was. His announcement left it wide open for people to invent narratives of Hillary being sent off to jail and that was completely careless at best or illegally influencing the election at worst.", "Trump's a sore loser; republicans are following the leader and sore losers blame their loss on other people \"cheating\" regardless if it was possible or makes sense. I actually think Trump and company might not even trying to seed unrest, I think he's just incapable of taking responsibility for failure and it's mostly a coincidence a lot of his base feeds off of baseless conspiracy theories.", "Ted \"Nobody under 50 knows my songs\" Nugent", "Oh alright, you can fire *one* nuke.", "He would just be a low level con man. Going from town to town defrauding people, and sexually abusing women. ", "Pretty much. I mean he's a musician that had [some success](https://en.wikipedia.org/wiki/Ted_Nugent#Career), selling 30 million albums and averaging 300 shows per year. He's mostly known for his political views and his, uh, \"creative\" [method](http://www.snopes.com/politics/military/nugent.asp) of skipping out on the Vietnam War when he was drafted. To be fair, the story isn't backed up by anything other than a story Nugent told 40 years ago.", "I'll be visiting every taco truck on every corner", "This? http://i.imgur.com/g6j5Aex.jpg ", "[May John Roberts burn in Hell for what he did to the VRA](https://twitter.com/ElectProject/status/795378059570544645?ref_src=twsrc%5Etfw)", "You seem to think the problem is that we dont understand.  That is inaccurate.   \n\nThese are conditions that are willingly created and expanded by the Republican party in order to keep them in power.", "the story is that they changed his password so he has to dictate anything he wants to tweet to someone who does it", "so all of that - for nothing.  Comey should resign after all the damage he just inflicted on the FBI.  ", "Defending the Constitution is part of the oath he took.", "By mentioning a story that highlights how unfit Trump is for office? ", "With somehow, **less** heart. ", "**Mail-in ballots ffs.** No fraud, no lines, no voting machine sketchiness, no intimidation/suppression, easy registration... wtf, America? This isn't rocket science. ", "It's a strategy that the GOP came up with because they are outnumbered. Gerrymandering has taken the House away from the Democrats until at least 2020. It's a very Machiavellian party run by the religious right (36% of all voters) and the gun lobby primarily. \n", "Id like to think of myself as compassionate and understanding but this election has shown a dark side of myself that I didnt know existed. I agree totally with you. Wednesday morning I want the Trump campaign's gnashing of teeth to be so grand that San Francisco gets a richter scale measurment. I want to see Trump weeping and frothing at the mouth. I want the self righteous windbangs supporting him to have strokes while being interviewed by Wolf Blitzer. I want every person who supports Trump to experience the deep existential malaise of realizing that every hope they have for the US is floating Brian Jones style around the toilet bowl of history.", "Probably the same way the rest of us have: by building a giant roller coaster that spans the length of the park that only one person ever rode.", "I don't know how Obama manages to maintain so much class in the face of such insanity. ", "Cleveland's economy is based on Lebron James.", "She laughs at you while she sit on gold. She's not a deep thinker. She is a product of classism and is pleased with her 'success' within its structure. ", "This campaign has been terrible but for me, voter suppression just really affects me. You hear people saying \"God what a horrible thing Trump said on live TV tonight\", and I say \"Go vote.\" \n\nBut then you see shit like this and it really hinders the Democratic process and essentially puts a cap on our freedom.\n\nThis is not okay, has never been okay, and will never be okay. ", "redcap", "It's never taken me more than 10 minutes to vote in Australia.\n\nThe last election was more like 3 minutes because I didn't number [literally 70+ boxes](http://8020.photos.jpgmag.com/2949554_197913_acf6620757_l.jpg) like last time.\n\nWhy can't America manage such a simple task?", "The real terrifying thing is the smart charismatic angry racist who might be coming up soon, with trump having set a precedent", "Shower thought. Maybe the neutral position is that Trump is quite literally the worst Presidential candidate to come out of one of the two major parties. ", "Thought wrong.\n\nFirst - there is nothing that states /r/politics is a neutral sub.\n\nSecond - this is pertinent to this election as Trump has made it a point to tweet constantly and has shown that people easily get under his skin.\n\nThird - this is a grown assed man who can not control himself to not tweet something damaging to his campaign which gives people insight to how Trump acts/reacts to the world around him so as funny as it may be, it is very troubling.", "No this is why republicans need to get their shit together and become a reasonable, moderate center right party. Hoping that they go away is silly, unless they are replaced by some other party. However hoping that they regain some sense of morality, principle and legitimacy is realistic and would be good for the country. However, I don't think they're going to do it without some outside force pushing them. I also think much of the existing republican establishment would need to be purged. ", "Some have asserted that he sent the letter to avoid anti Clinton FBI agents from leaking it and making it seem like a cover up that he didn't notify Congress. I want to give him the benefit of the doubt that this was his reasoning. He still could have written a much less vague letter initially and saved a lot of tumult. All that said glad this bs is behind us, but you can't put toothpaste back in to the tube. ", "How dare he criticize Trump who is running for President, about being unfit to be President. ", "what would he do to change our political process? A constitutional amendment is required for congressional term limits so that's not going to happen.\n\nTrump's deputy campaign manager is the president of Citizens United and the Trump Foundation donated to Citizens United.* THe conservative judges that he has brought up as potential Scalia replacements are the type in favor of the Citizens United decision. He's not interested in getting money out of politics. \n\n*I don't know why more isn't made of this", "Only 62%?", "'Proud' and '2016 election' don't belong in the same headline.", "Typical MSM hitjob- don't you know Trump has **THREE** endorsements or did you forget that the KKK's newspaper endorsed him?", "From the comments section of the article:\n \n&gt;It amazes me that the sanity and mental fitness issue is not a larger focus than it is. And it is no joke.\n\n&gt;The President’s power to order a nuclear strike is not subject to checks and balances or veto. Hence Americans must trust in the sound judgment of their President in what could be just minutes to decide.\n\n&gt;In 1962 the Joint Chiefs Strategic Capabilities Plan called for the destruction of Moscow alone with 170 nukes, and the destruction of every major Soviet, Chinese and Eastern European city and hundreds of millions. Sickened by a formal briefing on the plan, President Kennedy said “And we call ourselves the human race.”- JFK vs the Military, The Atlantic.\n\n&gt;When U-2 spy planes discerned Soviet offensive missiles in Cuba, most of the Joint Chiefs wanted to force their removal militarily. Soviet Premier Khrushchev would likely have responded by attacking Berlin, which would have triggered a nuclear first strike in a war that the generals thought we could “win.” As one said at the time “The whole idea is to kill the bastards. At the end of the war, if there are two Americans and one Russian, we win.”\n\n&gt;Instead, the President ordered a naval blockade of Cuba to force the Soviets to remove the missiles. Americans stayed glued to radios for days as the world teetered on the brink of destruction.\n\n&gt;Khrushchev sent two messages a day apart, the first conciliatory, the second bellicose. An unstable or ill-tempered President might have initiated the world’s destruction. JFK guessed correctly that Khrushchev sent the second message to appeal to bellicose elements within the Soviet hierarchy, just as some generals were pressuring Kennedy to act precipitously. By ignoring the second message and replying to the first, JFK attained America’s strategic goal of removing the missile threat while averting nuclear war.\n\n&gt;What might have Trump done in a similar situation?\n\nWe'd all be fucking dead.", "Bernie Sanders was the one good thing about this election but sadly it wasn't to be.", "That's because Bernie isn't trying to be a politician. He's trying to be real and in politics real gets you nowhere.\n\nBernie has always been on the right side of history. He's a true \"people's representative\". Sadly, the political system is against people like him.\n", "I am curious about the 7% who are more proud of America as a result of this election. ", "No matter how it goes down at least 55M Americans will have voted for a [legitimately fascist platform](http://interglacial.com/pub/text/Umberto_Eco_-_Eternal_Fascism.html). I don't know how we un-ring that bell.", "The fact that Trump supporters have twisted this fact to mean \"The Media is Rigging the Election\" is kind of depressing.\n\nThat is not what \"rigging\" means.", "I will be very proud depending on how much Trump gets his ass handed to him.", "- [Dollar jumps in Japan and Europe as FBI clears Clinton](http://www.businessinsider.com/r-dollar-jumps-against-yen-euro-as-fbi-clears-clinton-2016-11)\n\n- [US stock futures are ripping higher in Asia after the FBI cleared Clinton again](http://www.businessinsider.com/us-stock-futures-are-ripping-higher-in-asia-after-the-fbi-cleared-clinton-again-2016-11)\n\nGlobal productive society is worried about a Trump presidency.", "Jesus Christ I think you actually sent fire down the internet.", "\"The Republican presidential nominee knocked US officials as a 'group of losers' for not launching a 'surprise' attack...\" \n\nI've got a surprise for you Donnie. There is more to this war thing than surprise attacks. You might know that if you hadn't taken 5 deferments. You could have learned about war first hand in Vietnam. When your country called you were too busy being rich to answer. Fuck you, Donnie.", "Yeah they're the real losers, not the guy who dodged the draft five times. ", "I literally cannot wait for ｔａｃｏ ｔｒｕｃｋｓ ｏｎ ｅｖｅｒｙ ｃｏｒｎｅｒ.\n", "He's gonna go out and work towards un rigging gerrymandered districts. Much better use of his time ", "UPDATE: They won polling place open until 9pm.\n\nhttps://twitter.com/marceelias/status/795417136730689536\n\nhttps://twitter.com/marceelias/status/795418004007878657", "The koi in my backyard pond are worried about a Trump presidency.", "Let's be honest they probably don't know what a lot of words mean. They just repeat buzzwords they hear because it feels right. ", "The markets seem to like this as well.\n\n&gt;Dow futures jump 220 points peso stronger after FBI says 'no change from July' on Clinton probe\n\nhttp://www.cnbc.com/id/104083794", "The FBI needs to get their shit together and actually make a non ambiguous statement. ", "Between the US and the UK (hello Brexit!) faith in the world's two oldest and most established democracies has been seriously shaken.", "Oh they did eventually.  He was in year two of a three year contract when they did the email thing and everyone knew he would not last.  They were just trying to make life bearable in the meantime.  Also, the people that came up with this plan didn't have the authority to get rid of him. \n\nThe emails that got filtered were basically complaint emails from the public.  He could not deal with any criticism and whenever he got one he would have a meltdown and derail the entire team.   Once they started going to his secretary, she would take care of it or escalate to just one person instead of making 6 people stop what they were doing. \n\nIn year 3 he got put on \"special projects\" ", "It's super duper easy for most Americans to take two days in a row off of work and childcare right?", "How is that easier than simply replacing the boss with someone competent? Sounds like it was a large issue if that many people were on the same page.", "ProTip:\n\nIf one party is trying to *expand* voting rights and one party is trying to *restrict* voting rights and you happen to support party number two, you should question why your leaders think more people voting is such a terrifyingly bad idea. ", "He also said he was going to try to reduce the balkanization of the media. Feels like his career is just beginning...", "I think 2016 is gonna be remembered as the year we fucked up America tbh....", "The man doesn't have the temperament to have the most important job in the world. Full stop.", "I feel like I'm the only person that never liked Bernie much.  Nice guy I'm sure but not a very good politician.", "He swore off Apple products when they wouldn't help the FBI crack their phones to spy in everyone. Amazingly enough a time where Apple was right. ", "Preview of Wednesday folks!", "Pro tip. Any claim you see go to t_d, if it's trending there it is Pants on Fire. Done.", "Bad hombres will save America. ", "Its so absurd that a presidential candidate wants our military to fail.\n\nThe same military that he may be a commander in chief of. \n\nAnd people support this kind of rhetoric is even more absurd. ", "I can't get over the fact that he seems to think it's possible to transport thousands of soldiers and hundreds of vehicles across open ground and have nobody know about it. Divisions can't sneak up on cities.", "TIL I agree with Trump on something", "As a military man I can't respect this man with his anti-military rhetoric. His way of acting like he knows more about what's going on in our military than our military leaders is disrespectful. \n\nI've dealt with opinions on the military and I can let those opinions sit and not think about them, but this man is trying to lead these people he criticizes so negatively, it's disgusting. He has 0 clue about military strategy, he acts as if he's just going to appoint new generals who've never laced up a boot like him. \n\nHis defending of his statement that women in the military should expect to be raped when working with men, that was enough for me. That does nothing good for any of us, I really don't get how anyone can stand behind this man. ", "Have a little respect while they've been fighting, he's been declaring bankruptcies like a champ.", "I feel like you're just setting us up for that pun.\n\nDon't do it! It's a trap!", "&gt;**The boy J.J. Holmes, has a severe case of cerebral palsy and only speaks through a computer vocalization device. His mother, Alison Holmes, told Obama that the two were \"put out\" by security at a Trump rally in Tampa, Fla.**\n\n&gt;\"The crowd started chanting 'U-S-A' and pushing his wheelchair,\" his mother said.\n\n&gt;\"We were put out by security,\" she said. \"Mr. Trump kept saying, \"Get them out.'\"\n\nIs this who we want to be?", "Politics is about making connections with people. Currying support for your causes. Making alliances with like-minded people. That's just the reality of trying to govern a nation of millions of different people. Ideas alone don't make the world turn.\n\nBernie's loss is a direct result of being stubbornly independent. If he had joined the party sooner and worked to pull the party left from the inside he would have had a much better chance of gaining support when he decided to run for President.\n\nYou can have the best candidate in all history running, but without an organization behind them, how can they govern? That's the reason parties exist.", "He's been going on and on about that one thing the \"surprise attack\" like he invented it or something. lol", "Make no mistake about it boys and girls, the GOP has awakened the giant that is the Latino voting bloc.  \n\nShould Clinton win the election, she'll owe it almost entirely to the huge numbers of Latinos voting for her and against Trump.  You can expect to see Immigration and other minority issues being given full attention by the Democratic Party going forward, 'especially' if the Party can keep that Latino population engaged enough to have a demonstrable impact on the 2018 elections as well.\n\nMost people don't really grasp that we're living through a moment of real history here, where the Latino population finally engaged fully with the American political system and it's having an incredible impact on the national level.\n\nWe'll be reading about this election in the history books in 50 years.  ", "*Give me the twitter launch code*", "Haha no. Kellyanne doesn't answer questions about Trump. Even after election her default will remain\n\n\"I think what voters want to know about and should know about is hillary's emails\"", "One might even say he's a Master baiter!!!!!!!!!!", "He also adopted a 17 year old when he was 30 years old, so he could fuck her. \n\n2 years later he released a song called Jailbait, here are some lyrics. \n\n&gt;Well, I don’t care if you’re just 13\n\n&gt;You look too good to be true\n\n&gt;I just know that you’re probably clean...\n\n&gt;Jailbait you look fine, fine, fine...\n\n&gt;It’s quite alright, I asked your mama\n\n&gt;Wait a minute, officer\n\n&gt;Don’t put those handcuffs on me\n\n&gt;Put them on her, and I’ll share her with you\n\nThe very next song on that album? \"I am a predator\"\n\nThis isnt speculation or anything either. He has admitted to having sex with underage girls. ", "What are you afraid of GOP? The people?", "Too bad for him it doesn't go the other way.\n\nTrump's Charity Foundation is accused of being a complete slushfund scam and is shut down?  Clinton Foundation has an A- rating and is generally praised minus some smearing.\n\nTrump University is being sued for stealing students money?  Clinton has moved towards easier access to college and free public universities.\n\nTrump doesn't even bother actually donating to a children's hospital, accused of never donating?  Clinton has created laws that allow children to use their parent's healthcare well into their college years.\n\nTrump loses suit to wind farms and gains a collective hate for global warming?  Clinton advocates for green energy and will attempt to push for less environmental destruction.\n\nMaybe Trump should do more awful shit.", "I really think this sounds like Obama baiting trump to retort via Twitter. Like \"come on Donny... Let er rip.. you gonna let that one go!?\"", "Apparently they're aware their tracking poll is shit.", "Lady Gaga has been very involved with anti-bullying efforts including starting her own foundation.\n\nhttps://en.m.wikipedia.org/wiki/Born_This_Way_Foundation", "Admittedly he's gone off the twitter deep end for far, *far* less before. And we know he hates (and fears) Obama.\n\nI bet Trump's aides are in panic mode, trying to figure out how to shut down communications in a 10 mile radius of Trump as we speak.", "I want to see him humiliated. ", "I wonder why the reps were so against fact checking at the debates this year.", "Donald \"Strongbad\" Trump: [\"I'm on a rampage!\"](https://youtu.be/E4YEJeubV2w?t=1m22s)", "I think the most mindblowing thing is that his staffers actually have the power to take his twitter away from him. This is so demeaning lol.", "Thank all the gods above for the Latino population. America owes you a huge debt.", "he is android staff uses iPhone", "Giuliani has old ties to the FBI from his days as a public prosecutor. Current agents mention things to retired agents who mention it to Rudy\n\nhttps://en.m.wikipedia.org/wiki/Mafia_Commission_Trial", "Joni gave him the boot for coming home with an orange ring around his mouth.  ", "\"Why do we shush animals? They've never spoken!\"", "And far more representative of family values than the GOP candidate.", "'Member when Trump bought a single USFL team and managed to tank the entire fucking league through sheer idiocy? \n", "Millions of idiots are going to vote for this man. We need to fix the education system in this country. ", "That would be amazing to watch.\n\nAt this point he already gives precisely zero fucks Obama free of office is going to be glorious.", "They were kicking his fucking wheelchair... I want every person who cheered for that to magical die of karma.", "&gt;Clinton 57 Trump 2\n\nTrump has also been endorsed by [The Crusader,](https://www.washingtonpost.com/news/post-politics/wp/2016/11/01/the-kkks-official-newspaper-has-endorsed-donald-trump-for-president/) so that makes THREE newspaper endorsements\n\n", "It's going being know as the year that America kept it's shit together honestly. I'm an optimist.", "&gt; “You can't review 650000 emails in eight days,\" Trump said Sunday in an appearance at the Freedom Hill Amphitheater. \"You can't do it folks. Hillary Clinton is guilty.”\n\nThis guy --&gt; Trump", "But is FEELS true.", "AFAIK he started using Android because Apple refused to write software that would unlock the San Bernadino terrorists iPhone.", "You can tell what devices his Twitter posts comes from I don't remember which is his, but there's posts from iPhone and Android, and one of them is him and the other is his campaign staff. ", "ITT: Apparently there are quite a few people who believe the FBI is comprised of two people in a garage on Commodore 64s who have to print out and literally read every single email in order to go through things.", "On top of that even if they wanted to launch a surprise attack this dumb fuck announced that he wanted to surprise attack on national television during a presidential debate in front of millions of people.", "Because she has more important shit to do than troll a beauty pageant contestant at 3am", "This reminds me of when during the debates, his supporters said, \"Well you only mentioned two of the things Hillary did wrong, but you mentioned *five* of the things Donald did...\"\n\nYeah, because Donald says and does stupid shit at a pace that is unprecedented in modern electoral history; by volume, Hillary is actually being asked *more* questions about her indiscretions.", "Yeah...I know he is a \"musician\" and that's how he made his nut but I only think of him as the gun nut maniac who shit his pants to get out of service. Hey, another draft dodger! No wonder he likes trump ", "&gt; Why is there only one location for this city?\n\nBecause cities are full of libruls?", "I actually believe he does think that he invented it. ", "Do away with it altogether. Mail in voting works great for Oregon. And you have the advantage of researching anything you missed on the ballot from the comfort of your own home.\n\nPlus it's cheaper than managing all those polling locations.", "\"Being part of the music industry is walking the red carpet\" Kelly said on-air. \"You say hello to your fans and you give back to those reporters and those people who supported you. And when you go to an awards show and you don't walk the red carpet, I find that disrespectful.\"\n\nOsborne slammed her for not walking on the red carpet? This is her being a hypocrite? Am I missing something?", "I know I would just like to see my neighbor's head explode.", "http://www.dailykos.com/story/2016/11/6/1592255/-4-000-waiting-in-line-to-vote-in-Cincinnati\n\nRepublicans slashed early voting hours on other days friend, which means you get massive fucking lines like this.\n\nIt also seems like republicans only allowed 1 early voting station per county.\n\nhttp://www.urbancincy.com/2012/11/ohio-early-voting-rules-work-against-voters-from-heavily-populated-counties/\n\n&gt;&gt; According to the Hamilton County Board of Elections, 564,429 people have been registered to vote in Hamilton County – a number slightly higher than that in 2008. The difference between 564,429 voters in 2012, however, is that their early voting days have been greatly reduced.\n\n&gt;&gt; On top of the reduced number of days to vote early, voters across Ohio are only allowed to cast an early vote at one location per county. This means that voters in heavily populated counties with big cities are subjected to longer waits. So far, voters in Hamilton County have reported up to 4.5-hour-long waits downtown.\n\nThis has been a problem for years.", "How is this OK for him to talk about the military that way? If Hillary said those things, she would be raked over the coles by now... ", "Hilarious but Obama can do more good campaigning than as a judge, relative to what a liberal judge could do.\n\nSure, Obama might be a highly influential supreme court judge. But a liberal judge could do just about the same work. A liberal judge could not affect policy outside of the court the same way Obama can.", "i still can't believe he said that and it wasn't an SNL skit.", "Yup it's completely unsolvable, and everyone who thinks long term ought to be at least mildly worried about the potential implications.\n\nThe views people hold have traditionally been moderated and circumscribed by structures of institutionalized power and authority.\n\nHad an outlandish view? If the media refused to publish it, and authority figures refused to legitimize it, you were doomed to be a local fringe movement at best.\n\nIf you saw the movie Glory, one thing that I liked about it was that it showed the cunning of MLK and his colleagues. They knew what they were doing was creating scandal to entice the media into covering it so they'd get attention for their issues. To put it in the above terms, it was a way to get around attempts by established institutions to silence them.\n\nAnd of course that was a good thing, and a lot of the breakdown of that cordon sanitaire has helped minorities to get their rights for the first time in history.\n\nBut now with social media and the internet, this has gone over the brink into total anarchy. There is no moderation, any fringe view can get out there and be heard and pretty much all authority figures have been delegitimized into irrelevance except to their own small audience.\n\nI'm a bit more radical on human irrationality, so I'd say there was never such a thing as a truly factual era. People were always believing crazy irrational things. But it used to be that people could somewhat agree on a core set of crazy irrational things everybody held true (some of which actually was rational and factual beneath it all). Now that's gone, and it's just a wild wild west where everybody believes whatever the heck they want to believe and there's nothing keeping people even mildly on the same page.\n\nWe might pull out eventually, but I fear we're going to be living in this wild west for a while before that happens.", "ISIS IS LOSING. Every freedom loving person regardless of faith or ideology should be happy about that. Why is Trump rooting against the brave people who are literally giving their lives to stop them?", "[deleted]  \n ^^^^^^^^^^^^^^^^0.2101 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/52428)", "If Clinton said 10% of the shit Trump said there'd be a revolt.\n\nImagine Clinton saying she'd bring stop and frisk back to take guns from people.", "You're damn right they're afraid of the people in Miami-Dade...\n\nClark County already cost them Nevada and Florida would end this thing.", "&gt; “Aides to Mr. Trump have finally wrested away the Twitter account that he used to colorfully — and often counterproductively — savage his rivals” Maggie Haberman, Ashley Parker, Jeremy W. Peters, and Michael Barbaro write. “But offline, **Mr. Trump still privately muses about all of the ways he will punish his enemies after Election Day**.”\n\nThis should terrify *everyone*.\n\n1. He cannot be trusted by his staff to not sabotage his own campaign due to his uncontrollable desire for vengeance, and they're telling us he can trusted with the levers of power, including the nuclear codes.\n2. He essentially keeps a mental list of people to punish for opposing or wronging him. That list is long by now, and it could be in the hands of the most powerful single individual on planet Earth.\n\nHis supporters call us fear-mongers when we mention the nuclear codes. Well, call it whatever you want, but I'm terrified that a man as unstable as he is—someone without *any* self-control—might be able to start a nuclear war, because its game over for humanity if that happens.\n\nI know a lot of his supporters say, \"Just give him a chance. It couldn't be any worse than what we have now.\" Yes it could. It could be so much worse that it's almost unimaginable.", "Meanwhile my cozy, Safely Republican little island in the Gulf with a population of 16k has had two weeks of early voting, till 7pm and there are three polling stations open on election day.", "melania is literally just a trophy wife gold digging bimbo....", "Well the election hasn't actually taken place yet. The fallout could be tremendous. ", "All 7% of those people have rebel flags on their vehicles / houses. I am absolutely certain that. ", "I don't accept the results of the GOP primary.", "I'm not much of a Hillary fan but if she rode into the Senate in an armored chariot and began slaying Republican senators with a sword, I'd seriously consider donating to the Clinton Foundation. ", "Four endorsements! Don't forget the National Enquirer. I believe it was the Bigfoot issue.\n\nhttp://www.msnbc.com/msnbc/donald-trump-lands-endorsement-the-national-enquirer", "Obama has a history of trashing Trump  to his face. \n\nAt one of the White House Correspondents' dinners at the height of the birther nonsense, Obama gets up to make his remarks. \n\nTrump is there.\n\n\"I've been asked to release my birth certificate. Tonight, I'm going to do one better.\" \n\nCamera pans to Trump. He's scowling.\n\n\"Here's my official birth *video*.\"\n\nObama smiles. The opening of *The Lion King* starts up.\n\nIt was so brutal I almost felt sorry for Trump.", "Five endorsements! Don't forget [the endorsement of North Korea's state-run newspaper.](http://www.reuters.com/article/us-northkorea-usa-trump-idUSKCN0YN35S)\n\n", "I wonder if she actually has to sleep with him to keep their arrangement going or if she just able to always make an excuse. No amount of money is worth having to roll around with that gross dude.", "I just had a yelling match with my dad. We're on the same side - we're just ASHAMED of this election and we're yelling in fury at what we've all been subjected to. ", "Missouri here. Was strongly considering voting third party just to feel better about life. \n\nSeeing that map makes me think maybe my vote for Clinton could help swing my state the other way. \n\nThen going on facebook and seeing all my Uber Christian coworkers inviting everyone to their election prayer service and seeing them commenting about praying for President Trump kind of makes me wonder if I can scale the STL arch and just end it all... how... just how can he say and do all this stuff and people actually admit and pride themselves in voting for him?", "I haven't been proud to be an American since 2002 when we started talking about \"preemptive strikes\".", "They've already had 10 or 11 congressional hearings that never went anywhere. What's 8 more years.", "He's still Obama and they're still obstructing him. History will look on this experience of the obstructionist GOP unkindly, I predict. They've been unforgivable. ", "*Easier than getting a cup of coffee. I work at Starbucks let me tell you, that line gets pretty backed up. ", "So 650k emails cannot be reviewed in 8 days but 650 million people can arrive into the US in a week. ", "Son goes to father. Son say \"Father give me 5 ruble.\" Father say \"10 ruble? What you needings 30 ruble for?\"", "Oh. For me it's the SD card and swapable battery.", "Oh please don't leave out the House.\n\nThe United States House of Representatives is one step short of a lunatic asylum.\n\nWhy did you do this to us Founding Fathers?", "&gt; “You can't review 650000 emails in eight days,\" Trump said Sunday in an appearance at the Freedom Hill Amphitheater. \"You can't do it folks. Hillary Clinton is guilty.”\n\nWell, now we know how he's going to react on Nov 9.\n\n", "Well this election is a petty and insignificant thing to make you discouraged about the entire country.\n\nFellow citizens being bankrupted by medical bills students drowning in debt, massive wealth inequality, corporate takeover of the political system, and a country doing zilch about global warming are far bigger things to garner one's attention and affect one's \"pride\".\n\nA messy election barely rates. Of course the fact that these issues were ignored in the election probably qualifies.", "*Rigger.* The proper term now is *rigger*. ", "Ah the old send them to the roof team. Just waiting for his stock to vest with Big Head.", "I think what is meant is...faith that democracies generally make good decisions.", "So you're saying that the Jews WON'T steal the election for Hillary????", "650000 -&gt; 50,000 with HRC's email address -&gt; 0 non-dupes\n\nPretty easy to check them.", "You can't count 50 million votes in a few hours people.  You can't do it.  Hillary did not win.  \n\nI just hope he doesn't add another of his graatest hits like \"Second amendment people should do something about this maybe\".", "I bet this is going to drive Trump mad. I really do think the one person Trump hates more than Hillary is Obama. In fact I don't think Trump really hates her. He used to think she was great– before he decided to run for president. But Trump has always hated Obama, couldn't stand the idea that a black man could ever be American, and therefore there's no way he could be president of his white America. And then, of course, there was the correspondent's dinner where Obama humiliated Trump on a world stage. After that - and when you consider his racist resentment torwads him - his hatred became unhinged. I think he hated him so much that it became the sole motivation to become president: so that he could take away the power of the man that simply made fun of him. \n\nIt doesn't surprise me that Obama is so easily able to get under Trump's skin.", "Except an unapologeticly bigoted conman was nominated by one of the major political parties for the most powerful office in the world on a fascist platform.\n\nWe have nothing to be proud of with this election.", "Shit he doesn't have the temperament to manage a Chipotle (and I should know!). He's honestly appalling. ", "&gt;In the North Carolina case the 4th Circuit panel agreed with allegations that North Carolina’s omnibus bill selectively chose voter-ID requirements, reduced the number of early-voting days and changed registration procedures in ways meant to harm blacks, who overwhelmingly vote for the Democratic Party.\n\n&gt;“The new provisions target African Americans with almost surgical precision” and “impose cures for problems that did not exist,” Judge Diana Gribbon Motz wrote for the panel. “Thus the asserted justifications cannot and do not conceal the State’s true motivation.”\n\nSource: https://www.washingtonpost.com/local/public-safety/appeals-court-strikes-down-north-carolinas-voter-id-law/2016/07/29/810b5844-4f72-11e6-aa14-e0c1087f7583_story.html", "Just a week ago Kellyanne Conway said [\"It's not for me to take away a grown man's Twitter account.\"](http://www.politico.com/story/2016/10/trump-tweeting-kellyanne-conway-230283) I guess Trump is a child.\n", "The DNC is fully aware of the power Bernie has as an independent. They saw it first hand. Bernie will have a pretty big carrot/stick in the coming months and years and he didn't have to sacrifice himself for it.\n\nHe never stood a chance of becoming the nominee. He knew it at his core. The DNC was not going to let an outsider come in and steal their party out from under them like what happened to the GOP.\n\nBut, he did get a lot of his policies foisted into the conversation in a way that never would've happened had he been one more 'insider', and he will be a strong voice for progressives in the future.", "\"It was chaos we were like dogs without horses.\"", "\"The sherrif is near?\" ", "Makes me wanna vote for Clinton more tbh ", "Oh boy me too but I'll be shit posting ALL night long. I got me almost a dozen r/the_donald alts ready to go.", "First we are saved from Donald Trump then we are assured taco trucks on every corner. Truly the Lord has blessed us all. ", "Says an elite who has been in power for decades.", "That sounds a little fishy but I can't say why. ", "They can't trust him with the *Twitter* launch code but *nuclear* launch codes? No problem!", "And Tuesday night.....and Thursday Friday, Saturday, and Sunday 2020", "MIDTERMS Democrats! You have to get out and vote the MIDTERMS too! Time to flush ALL Republicans from office and start from scratch with FAIR voting for all.", "He's acting like people are reading 65000 emails by flipping pages in a book. That's not how technology works, we can filter things these days. ", "It's like a cold opening to It's Always Sunny.\n\nKellyanne Conway: It's not for me to take away a grown man's Twitter account.\n\n*Trump Loses His Twitter Privileges*", "So he doesn't accept FBI's judgment because he doesn't think they have seen enough evidence yet he's perfectly okay with judging that Hillary is guilty before looking at any evidence.", "Look I'm trying my best ", "Not to mention all the people that looked at the line and were like 'o fuck that i'm just one vote and I gotta get to work.", "Damn why didn't we think of this months ago?!?", "But even if Hillary wins handily...idk if political discourse in the US will ever be the same.", "Couldn't one easily write a computer program that could make that determination in minutes? I thought Trump was good with the cyber. ", "That pic is from a Trump rally in Minnesota.\n\nhttps://twitter.com/breanne_dep/status/795414881805672448\n\nhttps://twitter.com/reuterszengerle/status/795399310062010368", "\"No dag blasted dang nabbit! The president is a ni-\" ***GOOONNNNNNNGGGG***", "Republican leaders are shi**ing their pants. \nThey have been caught using the FBI to manipulate  the election.  \n\nHow about some focus on that?", "Being from a European country where I haven't seen a waiting line for voting ever, I find the American situation quite worrying and strange. I can just commend the good people that are willing to stand for hours to cast their votes. Most my compatriots would surely be defeated at a prospect of such an outrageous inconvenience. Although, given the high stakes this time, I feel nearly no personal sacrifice should be too expensive to stop the ugly orange menace.", "The bigger the margin she wins by the better chance he will go quietly back to Trump Tower. I think if Hillary gets under 300 electoral college votes, Trump spends all his energy filing legal motions and trying to flip electors. I will be so happy when he isn't dominating the news every day.", "If you don't mind me asking what started the yelling match? Just curious bc I've fought with my parents as well over this election.", "What's the difference between one ruble and one dollar?\n\nOne dollar.", "I wonder if Chaffetz and Giuliani will hold up as well as Hillary did.", "This happened everywhere in Ohio. \n\nIt's hard to get to the board of elections in a lot of counties-- Franklin County (Columbus 1.21 million people) has one single early voting place and it is in an inconvenient location by bus and shares a parking lot with businesses. \n\nCuyahoga County (Cleveland, 1.26 million) has also one location, the board of elections, with only 100 parking spaces reserved on weekdays (although it is at least downtown and they have a light rail system). \n\nMontgomery County (Dayton, 535,000) has one location, downtown, and today people [reported](http://www.daytondailynews.com/news/local-govt--politics/montgomery-county-doubles-voter-turnout-last-day-weekend-voting/V52MtI5khnuW8Yyv712iFO/) that the line went through the parking garage. \n\n\n", "Here you go!  [https://www.youtube.com/watch?v=cFwtuInlMew](https://www.youtube.com/watch?v=cFwtuInlMew)", "\"You can't just say 'You're fired' and expect anything to happen.\"\n\n\"I didn't say it I *declared* it.\"", "It may be crazy but I actually think Hillary would be doing even better against Cruz.  Trump for all of his flaws, actually knows how to get people to like him (certain kinds of people at least).  Cruz is just so unlikable, on an almost fundamental level,  that I think there would be more apathy among Republicans going into the election.  The establishment would be with him but a lot of Trump's supporters probably wouldn't be as excited.", "And that's sad I have military friends I've known for years who support him, military women as well. It confuses me, anyone I see that supports him that is in a group he often insults and disrespects confuses me. And what really scares me if the military women who support him don't see how he and his running mate see women in the military, I fear for their future. \n\nBut most of my military friends are black, so he's not an option to them for other reasons.  ", "Only at 63% upvotes...t_d is trying to bury this as hard as they can...", "The problem with the House is that some of those weasely little shits carry slings so it's kind of makes you a target if you're on a chariot. ", "Florida you will be our friend if you do this. We may even ask reddit to get rid of r/floridaman as a thank you.\n\nEdit: ask has a 'k' in it.", "Latinos are building a wall to prevent Trump from getting into the White House.", "Anti-globalist and extreme protectionist are not the same thing. His tariff policies will raise the price of consumer products by a shitload. He's the worst candidate for the average person.", "November 9th 3am Twitter:\n\n&gt; \"I do not accept Barack **HUSSEIN** Obama's long form birth certificate! And Hawaii is not even a real state. SAD. I told you! #MAGA!!!\"", "3/5th of a President? I don't think they give him that much credit. ", "Apparently 27 lateral G's is \"too intense\" for some people", "I don't see Hillary's camp trying to paint Trump as an occultist because his assistant might've gin to a sinner held by a performance artist. I don't see Hillary trying to sell her supporters beating up a protester as her supporters fouling an assassination attempt. ", "Trump dictionary:\n\nTremendous:  Results that agree with him\nRigged:  Results that don't agree with him\nFacts: &lt;no definition&gt;", "It must really frost Trump's nuts that Obama is better then him at trolling.", "Philly here.  We're pretty much all nasty women and bad hombres here. #withher", "Giuliani was sweating on CNN over this.  My guess is \"no\".", "Lock. Him. Up.", "Voted by mail in both Washington (previously) and now Colorado (last 2 Presidential elections). When I found out how few states do it this way I realized how lucky we are. Both WA and CO have it as an option for anyone, whereas OR is 100% mail in.", "Nah...keeping a pathological liar of a nationalist out of the most important job in the world is at least in the top three.", "\"Nobody respects women more than me\"\n\n*Trump grabs women by the Pussy*", "And you're source contradicting their assertion here is what exactly?", "Clinton had a little letter C in her emails? Trump's apartment lease applications had a little letter C for 'colored'. ", "On the flipside of that if she doesn't win Florida, she still has multiple paths to victory.  \n\nDonald, not so much.  ", "Also probably doesn't care that there are still 1.5 million civilians in Mosul and the UNHCR is working its ass off to find a way to provide protection and shelter for them. \n\nThe slow pace of the offensive is giving civilians more time to leave and authorities more time to avoid a humanitarian disaster.", "Maybe they'll eventually catch her in a lie about an inconsequential personal issue in civil litigation.", "Ask me Wednesday.", "Must not have seen today's news. It's ok. ", "&gt;TFW its gotten so bad you wish Cruz had won", "I realize you are asking a rhetorical question but I am worried the majority of America does not understand the hypocrisy in this rhetorical question.  ", "She's said she probably wouldn't but wouldn't ask him to withdraw himself during the lame duck either.  She's forcing the GOP to draw the noose around their own neck either way.  ", "I love no f's to give Obama especially after all the crap he's dealt with for the last eight years. I'll grant you, some will consider his baiting unpresidential, but it's still fun to watch.", "And... Clinton just won Florida.", "\"Bitch I told you...\"\n\n--Minnesota", "Do you know what our official language is?\n\nAnswer: We don't have one because this America, a country by immigrants, for immigrants.", "Good. Time for Republicans who have been turning a blind eye to the ideological ramifications of their ugly rhetoric to look at what they've caused in the face.", "This is gonna be great. The sane Republicans are going to blame the alt-right fringe for nominating such a shitty candidate. The alt-right fringe are going to blame the sane Republicans for not falling in line behind a batshit insane candidate.\n\nZero lessons will be learned by either faction.\n\n\\**grabs popcorn*\\*", "Even if Clinton wins in a landslide and Trump gets utterly destroyed this subreddit alone is nothing to be proud of.", "This is essentially all because they couldn't handle your president being black right? I'm in the UK so I'm only calling it as I see it and it appears that ever since Obama 'dared' to get elected, twice, in a post-911 world, the Tea Party sprang up, and birtherism, all stoked and encouraged by Fox as, basically, the media wing of the GOP. By the time Trump stepped in and took over, the whole thing was a Frankenstein's Monster out of control. Does that sound fair? (Other than the fact that Frankenstein's Monster was actually quite loving and misunderstood)", "not a developed country you have to be fucking kidding me", "I'm baffled as to why banning voter intimidation is something we have to fight over.", "I know I don't.\n\nI kinda feel like Hillary shouldn't've even been a candidate.\n\nAnd I *definitely* feel there should be some safeguards in place from letting a petulant manchild like Trump from running.", "I've also heard that some Europeans dont consider the US a developed country anymore.  \n1. 24th in education  \n2. 39th in healthcare  \n3. 5th in Infant Mortality   \n4. 1st in Gun homicides  \n5. 1st in Gun Suicides  \n6. 1st in Prison Population/Incarceration Rates    \n  \nKind of sad and embarrassing.  \n  \nEdit: I seem to be getting a lot of hate and would like to say that I was **not** the person who made that statement. It was an interesting thing I heard and wanted to make a comment that was related to the main post. I understand the advancements that the US has and has made, but for those who have said \"We're #1 because we can crush everyone else,\" or to those who have literally ignored the issues that we have, you have to understand that nationalism for the sake of nationalism is also a bad thing. The US has something amazing to offer to it's citizens, but we are **FAR** from where we need to be. We tend to crush innovation if it doesnt suit our standard format of maximizing profit. If you dont believe me, [check out this link](http://www.huffingtonpost.com/entry/eugene-gu-research-congress_us_581a3d79e4b01a82df6460de) . This is just one of many things our govt seems to do. Yes, the US is a fantastic country with so much to offer. But we are a long ways away from being #1. Until we see that, we wont be making large progress anytime soon.", "Bernie didn't get the nomination but he still won.  He started a conversation that hadn't gotten much credibility before, and convinced many Democrats that they didn't have to be as centrist.  HRC moved her policy considerably left because of him, and if she wins he will be in a strong position to effect some real change.  ", "Pretty much. First they couldn't handle a black president. And now they can't handle a woman as president.", "Apparently there are 'three' big factions in the GOP right now.\n\n1) The 'new party' Republicans.  That McMullin dude is one of them.  Says that the GOP is done and they need to start over with a new party that doesn't have the stain of Trump on it.  Plans on recruiting as many non-crazy old school Republicans to do it.  Trying to recruit the 'Restart' Republicans and hostile to the Trumpublicans.\n\n2) The 'Restart' Republicans.  Planning on doing a lot of navel-gazing to figure out how to get the GOP into the 21st century.  Includes guys like Romney and Kristol and George Will.  Dismissive toward the 'New Party' Republicans and hostile toward the Trumpublicans.\n\n3) Trumpublicans. Chris Christie, Newt Gingrich and all the GOPers that abandoned the establishment to join up with Trump to try and ride that crazy train to the White House.  The non-Trump Republicans hate these guys and if Trump loses, they're all dead, every last one of them and they all know it.  This explains why they're all so very gung-ho for Trump, even now.  If he loses, they're all done and they know it.  The Trumpublicans are in control of the GOP right now and they will burn that motherfucker to the ground before they give it up to the 'Restarts' or the 'New Party' Republicans.\n\nOnce Trump loses, all bets are off.", "&gt; “Now you may have heard that — this was just announced, I just read it, so I can’t confirm it’s true, but — this campaign has taken away his Twitter. In the last two days, they had so little confidence in his self-control, they said ‘We’re just gonna take away your Twitter.’ Now, if somebody can’t handle a Twitter account, they can’t handle the nuclear codes. If somebody starts tweeting at 3 in the morning because SNL made fun of you, you can’t handle the nuclear codes.”", "Where is Governor Kasich on this  Why hasen't he made some statements about it?  \n\nRemoving 1.2 million voters, and not enough polling places and now intimidation.  \n\nWhat a record!\n\nWe know these voters have not been restored never mind there is a court order to do so. \n\nhttp://wdtn.com/2016/10/20/judge-rules-1-million-ohio-voters-removed-from-voter-rolls-can-legally-vote/", "When you finish two full terms as President you don't have a career anymore just an assortment of world-impacting hobbies.", "It makes it 1000x better to know the context. Obama was saying something like let's get over this so we can focus on the important issues. \n\n&gt;Riffing off the president’s full name Barack Hussein Obama, the speechwriters had written a bit about how there were a lot of Republicans eyeing the White House who also had problematic middle names: “Did you know that his real name is Gov. Tim bin Laden Pawlenty?”\n\n&gt;**“'Here’s the thing,'” Favreau remembered Obama saying, “'I would just get rid of bin Laden and go with another bad guy.'” Favreau wondered why they would do that.**\n\n&gt;“He’s like, ‘I think bin Laden’s been done, it’s old, let’s go with Tim Hosni Pawlenty – that’s going to be much funnier,'” Favreau recounted Obama suggesting. \n\n&gt;The writing duo didn’t think so, but bowed to the president’s request.\n\n&gt;“One other thing that happened, **he called me right before the dinner and he was like, ‘Oh, could you also make sure – I’m probably going to remember this on my own, but just in case – at the very end of the speech I want to say, God bless America and may God bless our troops and keep them safe,'” Favreau recalled.**\n\n&gt;“I thought that was sort of an odd ending to add at a Correspondents’ Dinner,\" Favreau said.\n\n&gt;Obama took to the podium later that night and delivered the punchy address, including the line about Tim Hosni Pawlenty, to great reviews.\n\n&gt;**The following night the news broke: Osama bin Laden was dead.**\n\n\n", "Just a few days ago someone I work with in Europe ended a call by saying: \"By the way we are all watching. Don't screw this up.\"", "Thank you. People are getting confused. The figures in this article are from **\"the top 100 largest newspapers in America\"** not all  worldwide newspapers and magazines like in that Wikipedia article.", "Trump is too unstable to be allowed to twitter and he is too unstable to be President. ", "Just think about that for a moment.  Seriously. A man running for president of the United States and the enormous power it entails and his aides have to take his FUCKING TWITTER away from him because he is so thin skinned and volatile. Unbelievable.  Truly unbelievable. ", "&gt; some Europeans dont consider the US a developed country anymore.\n\n.....right\n\n\nThis is just cherry picking btw. We have top ranked universities hospitals.... 5th in infant mortality at I'm guessing &lt;.1%, is that even supposed to be something to be ashamed of?", "A life-long Republican who early voted for HRC: thank you for speaking exactly my thoughts, Senator.", "It's real easy for elderly white people that live on a diet of Fox news ", "you are unbelievably ignorant ", "I am convinced trump believes the as the president he will have absolute authority.  This man's ignorance is amazing.", "More importantly a well-liked senator and governor for New Hampshire which Trump has to win to have a shot.", "I've never lost so much respect for so many people that I considered friends than I have during this election. It's fine to be a Republican or a Democrat liberal or conservative, or anti-Hillary. However, the people that are supporting and defending this man's hateful speech, blatant lies, and total lack of respect for this country's governance is an incredibly disappointing sight. ", "Nobody is talking about this.  If Trump is elected on Tuesday the markets will crash on Wednesday and his supporters will blame the Jews on Thursday.", "As long as they contain it to the GOP I'm fine with that.", "As a sane Republican I don't think so. It's not so much that zero lessons will be learned. We all know what the lessons are: the 2012 autopsy report. The problem is Hannity (and others of his ilk) will blame NeverTrump Republicans/moderates for not falling in line. Just as they blamed us for nominating \"moderates\" in 2008 and 2012. \n\nI'm just hoping that Trump goes completely unhinged and tries to start his own party. Rather the fringe voluntarily leaves than continues to destroy the GOP. \n\nI also hope they don't decide to march on DC, because the metro sucks even without protesters. ", "Well about a third of the electorate don't vote and presumably don't care about politics. So that's just about all voting americans. ", "No. They should have refused to work for such a worthless piece of shit.", "Gary Johnson: 9", "This is the wages of cultivating End-Times psychos for the past 40 years.\n\nYou've earned it GOP.", "God I hope so. \n\nAnd I mean that in a good way. They are slipping into irrelevance that will start losing them House and Senate. It would be nice to have multiple parties that actually try to compromise to get things done. We don't have that now.", "#((( GLOBAL PRODUCTIVE SOCIETY )))\n\n/s", "He's a (((liberal)))", "He hasn't described a presidency he's described a dictatorship.  You're absolutely right, he seems to think government officials have absolute power.  Just look at the debates with all the, \"she's been in power for 30 years and she didn't fix anything!\"  Like a Senator is just going to wave a magic wand and change everything on her own.", "&gt; Vote for the person you think will be the best president.\n\nThis is one opinion but here's another:\n\nVote such that the worst candidate does not win. It sounds cynical but I'd call it realistic. I do think we need more third party candidates in our elections, but I'm saving a vote like that (a) for a third-party candidate I actually support, and (b) a candidate who actually has a chance of winning.", "At least some of them have the sense of country &gt; party. Well done.\n\nSlimeball cowards like \"I looked my daughter in the eye but it's OK she can get groped now\" Chaffetz and \"he can fuck me two ways but I'm still his dog\" Ryan and Cruz should take note", "I caucused for Bernie but I understand that he probably wouldn't have been a great president. He's not much good at coalition-building. He's not great at compromise. He has the right vision for America, but he's not the right guy to be at the helm. \n\nI'll be just fine with him heading the finance committee. ", "Republicans sure seem to have a problem with justice and fair play\n\nThey loved it when Comey tried to cheat the nation and rig the election in their favor though\n\nDon't vote Republican if you love America!", "Were you not around from 1993 through 2001? Clinton drove a lot of the GOP similarly crazy. ", "Trump was the owner of the New Jersey Generals a USFL team, which was a sort of plan D for people who loved watching football, especially out of season.  Many in the USFL thought they could peacefully exist with the NFL.  Trump wanted to force a confrontation that everyone knew would bankrupt the USFL so in the ensuing lawsuit against the NFL, the NFL could be forced to absorb perhaps 2 USFL teams.  One of which being his New Jersey Generals.  The USFL owners got what they wanted.  Their league was destroyed and their won their antitrust lawsuit against the NFL.  But because Trump was such a talented business man and flew the USFL plane straight into the ground on his own, the award was the loose change the NFL lawyers had on them at the time and that was it.  Trump, mighty titan of New York real estate, and tacky casinos desperately wanted to be part of the NFL club, which back then was department store owners, strip mall builders, in the case of Al Davis an actual gangster.  They wanted him to fuck off, and they would have paid just about anything to see that happen.  Judge took one look at Trump, overlooked every miscreant misdeed of the NFL owners and told him to take his awarded change and buy a bus ticket back to New Jersey.  ", "Trump and the USFL, were awarded $1 in damages, which was tripled under anti-trust laws to a whopping $3", "That's where Democrats vote.", "She started fucking Trump in his 60's she deserves every dollar she's earned and I hope she gets a fuck ton when he finally dies", "They just did.", "Dude the only reason the south isn't literally third world is because some of the wealth has to spill over.\n", "lol?  Which Democrats are melting down?  We're winning.  ", "Hopefully the civil war will stay within the GOP", "It will happen. We kept voting liberals in Europe and we now have kebap shops on every corner.", "that sounds amazing", "But Beyonce and Jay-Z are so vulgar.", "\"I'm only pay 7 ruble per day in meme factory.\"", "Jame's Inhoffe's snowball stunt may get mentioned in the history of why we allowed ourselves to get fucked by climate change.", "   I'll be brutally honest. Most of his military support is coming from enlisted ranks and support him because they errantly believe that GOP supports military and vets.  They don't think critically about the bullshit that Trump vomits, and fall for his tough guy talk, without even realizing that he's a draft dodger that was exempted 4 times from vietnam for heel spurs...which he can't even remember which heel it was.\n   He's a scam artist and a bully.  Fuck him and what he thinks about POW's, gold star families, women, and disabled.\n\n  Just $.02 from a disabled vet.", "Yeah if you add \"Elected a fascist\" to that list it looks like middle Africa. ", "Trump's healthcare plan isn't imaginary! \n\n1. He's going to strip 21 million people of health insurance.\n2. He will institute a race-to-the-bottom of insurance regulation by allowing companies to sell plans to patients across state lines.\n3. He will encourage people to put their money into health savings plans and pay directly for 100% of their care without addressing the underlying enormous cost of healthcare in this country.\n\nIs it a good plan? No but it's a plan!", "Two little snippets from the [FBI Historian: Comey Is 'Putting Our 240-Year Experiment With American Democracy At Risk'](http://www.huffingtonpost.com/entry/james-comey-threaten-democracy_us_581fb8a9e4b0e80b02cac463) article:\n\n\n&gt; The problem comes when Comey doesn’t recognize that the modern FBI is supposed to operate within constitutional limits such as on Friday, when revelations surfaced that the FBI director had defied Justice Department protocol as well as guidance from the attorney general in updating Congress on a potential new investigation.\n\n&gt;“If you don’t have an FBI that looks to the law and the constitution and the strictures of the Justice Department, then you are going back to the days of J. Edgar Hoover and you are putting our 240-year experiment with American democracy at risk,” he said. “The law is not what the FBI says it is. The law is what the courts and the constitution says it is.”\n\n.\n\n&gt; Having studied the more than 100-year history of the bureau, Weiner said that he was surprised not to see GOP nominee Donald Trump himself pursued.\n\n&gt; “Here’s the surprise to me, as somebody who has studied the conduct of the FBI for years,” he said. “You have a candidate in this election whose campaign manager came under investigation for some very unusual and profitable connections in a foreign country. You also have a candidate who appears, on the evidence produced by excellent reporters, to have bent the tax laws of the US to the breaking point. You have a candidate who is scheduled to stand trial in a civil racketeering case, involving a purported university, and you have a candidate who has bragged about a pattern of sexual assault. Where’s the long arm of the law there?”\n\n&gt; The Trump campaign’s efforts at voter suppression, he said, also may merit a closer look. “You have a campaign that appears set to act in defiance of what’s left of the Voting Rights Act of 1965 on Election Day. Where’s the long arm of the law to protect the American people there?”", "This (in Florida) is all because of the Puerto Ricans that just moved there.  Sorry Donald no \"bad hombres\" to deport.  They're all citizens.", "They might have been able to handle a woman but certainly not *that* woman. Republicans lose their fucking minds over the Clintons. ", "Can someone tell me exactly how Soros became this evil genius who can manipulate currency at will?", "She got 3.5 million more votes than Grampy Sanders.  Try to accept defeat with something resembling dignity.  ", "&gt; already melted down\n\nahahaha. How is this even real? I just WISH we could have actual honest political discussion with Republicans and right wingers, but you just can't do it any more, you're gone, lost, trapped in this weird radicalized, conspiracy driven cult. PLEASE come back to us.", "&gt;She's also very involved in spirit cooking. \n\nLow energy meming pupper. Back to your echo chamber where you belong.", "I mean I'll write something more thorough then. I am an attorney and I used to do financial crime internal investigations, programs such as Relativity or Concordance/IPRO (which are widely commercially used and I am sure far less sophisticated than whatever the FBI has) can quickly skim metadata to isolate emails by key fields, so if you had 650,000 emails, identifying all emails to/from/ccing Clinton would take, literally, seconds. They also have intuitive text features that skim the text on the emails just like a word-search in your browser and identify duplicates, parents, children. If you gave me two sets of 650k emails, I could tell you how many are exact duplicates in about half an hour depending on how fast my connection is. Near duplicates require human review, but at that point, instead of reading a whole long email, you only need to review the new content, so reviewing a \"thanks\" or \"please print\" email takes a second.\n\nAs for how fast you can review any new emails? We used to work in a team of about 12 and would regularly crush through 100-150k emails per week, and we are talking like, multi-tabbed financial spreadsheets and 15-20 page chat logs. Most emails are much simpler than that.\n\nThere is an entire ediscovery industry that is dedicated to doing this stuff, and people are *fast*. Lawsuits between big companies usually involve millions of tens of millions of documents to review, and the cheapest attorneys charge $120+/hr for doc review, so we've had to learn to be exceptionally fast.", "So a few days ago I had a discussion with someone regarding Soros and Brexit. I was told that the GBP is doing fine that the market didn't react, but Soros manipulated the Forex so that it would seem like Brexit caused it, but in reality it's just Soros.\n\nHe also pointed out that in 1992, Soros manipulated the GBP and that's how he built his fortune.\n\nNow, I'd like someone to tell me I'm wrong in assuming that Soros does not have the capacity to influence one of the world's greatest currency down the drain.\n\nHere are the facts (I think) I know:\n\n* Soros is worth 22.4 billion dollars\n* In 1992, the British government was keeping the GBP above it's real value.\n* Soros saw it, shorted it (with ~10 billion dollars) and made around 1 billion out of it, completely legally.\n* In June 2016, Brexit caused an overall value of ~2 trillion to be lost in the global markets.\n* The GBP lost 17 cents against the dollar (which went down even further after a few days).\n\nSo my assumption is that if someone had the capital to swing a currency for around 11% of its value in one shot (especially the GBP), the amount of invested capital would be unbelievable, and certainly well above 22.4 billion (which I'm sure he doesn't have on hand).", "You're right. Everyone should focus on the fact Clinton is literally a witch or that time when she coughed. ", "They're been trying to get for for the past 30 years no reason to stop now. If she so much as sneezes wrong, they're going to convene an investigation. ", "What makes it pants on fire is the fact that\n&gt;Company CEO Antonio Mugica and chairman Lord Mark Malloch-Brown said in a statement \"George Soros has zero ownership or involvement in our company. Smartmatic has no ties to political parties or groups in any country and it abides by a strict code of ethics that forbids the company from donating to any political campaigns of any kind.\"\n\n&gt;On top of all this, no state is using Smartmatic machines in this election.\n\n&gt;The Verified Voting Foundation, a group founded by a Stanford computer scientist to promote accuracy in voting, tracks all companies that provide voting equipment in the United States. Smartmatic has no such equipment in any state.\n\nReading the article can sometimes be a good thing.\n", "Can any conservative defend this in the context of a healthy democracy or do you admit that your party gives fuck all about democracy, and only cares about power?", "A shockingly large number of Americans do actually. The battle itself is covered much more than the espionage and tactics leading up to it. ", "What it came down to was Apple could help them crack *every* iPhone or not help them. They decided users' privacy and right to security trumped the FBI's desire to be able to break into any phone they felt like. It may well have been a financial decision rather than a moral one, but in this case, yes, I feel it was correct, given the last decade of government surveillance overreach. ", "If feel like I should add just how much of a small ball fuckup Trump was in this particular fiasco.  The had a chance to lure Don Shula away from the Marino Dolphins the hang up was Don Shula wanted an apartment in Trump Tower.  Mr. Big Time backed right the fuck down.  And had the USFL stayed the course and survived, which seems impossible in retrospect, but that view is colored by Trump's intentional destruction of the USFL, those teams would probably be worth hundreds of millions if not more.  But there were player strikes and lockouts in the NFL, circumstances where the USFL might have easily raised their profile.  They also had franchises in Jacksonville and Vegas which might have frustrated NFL expansion.  They even had success attracting NFL talent like Jim Kelly, Steve Young, Reggie White and Doug Flutie.  \n\n\nThe true magnitude of Trump's short sighted fuckup is really pretty amazing.  ", "Don't worry I'm sure they'll figure out a \"solution\". /s", "[Gordon John Humphrey (born October 9 1940) is a New Hampshire politician who served two terms in the U.S. Senate as a Republican from 1979 to 1990, and twice ran for Governor of New Hampshire, though both bids were unsuccessful.](https://en.m.wikipedia.org/wiki/Gordon_J._Humphrey)", "Picking Cyber bullying as the first issue of importance as First Lady is like picking clit enlargement surgery as your first body modification.", "the trick for me is holding back my reaction in a household with 3 Trump supporters\n\nnone of them even know I support her and I feel like I'm not gonna be able to not tear up", "That's totally fair.  It's hard to imagine the GOP's behavior over the past 8 years being directed at a white president.", "It's back in the dark ages of 2012 when debates were actually respectable. ", "Nothing says \"outdated and irrelevant\" like Ted Nugent.", "Just keep it nonviolent and within the GOP.", "You're trapped in a cult. They feed you fake news.", "Sounds like you're just swimming around the issue...", "So is that a \"no\" on giving a source?", "I think it's more that they know that it doesn't matter if they're noticed because they'll still be in charge on Wednesday. Whether Trump wins or loses is not especially relevant here because local/state incumbents tend to never be unseated without some major scandal or fuckup and these local/state incumbents are the ones doing the voter disenfranchisement.", "After this election I'd be okay moving to the new desert bluffs. ", "I'm just amazed that in the era of quick internet video uploading the people responsible for this think that what they're doing isn't being noticed.", "Trump is too unstable to run a Hot Dog on a Stick in a failing shopping mall. ", "Exactly as a Republican, I personally wouldn't mind the party splintering. Because I actually think the alt-right/pundits could win in any civil war. Our primary voters are white, angry, idiots. I'd rather they latch onto a new party than continue to drag down the GOP. \n\nIf we can either reform or splinter, I think a more conservative (though not as much socially) GOP could be attractive to voters. Otherwise we face becoming a regional party.  ", "Hell I'm not even American, and I feel that way.", "So are the shackles now on Trump again?", "I'm commenting here to remind everyone that [Politifact](http://www.politifact.com/personalities/donald-trump/) has fact-checked 328 of Trump's statements and has found that 70% of these statements are either \"Mostly False\" \"False\", or \"Pants on Fire\".", "He really was counting on the FBI screwing her over.  ", "We're laughing at you not with you op.", "Seriously this is the same Ted who got assblasted into another dimension by Donald for his New York values comment. Are Republicans going to stick a finger in their ears once again and pretend like Trump won by some fluke?", "I love how r/all is basically just the donald panicking in denial right now", "It's almost as if the business community much prefers a predictable and stable hand at the government's reins even if that hand is going to end up taxing them more than they'd like.\n\nWhile they'll pay more in taxes under a Democratic administration, they'd lose so much more money in the disaster that'd be a Trump Presidency.  ", "I'm hoping on a series of events that ends in the US annexing Canada Mexico, Honduras, Nicaragua, Guatemala, Belize, El Salvador, and Costa Rica. We can call it Remanifest Destiny", "Maybe not change an opinion but I honestly wouldn't be surprised if him being vocal about his support for Clinton gets some apathetic voters, especially young ones, to actually go pull the level when they might have blown it off. \"Well if the King says to...\"", "I'm one of the 62%. I despise Donald Trump but even when Hillary wins, I won't exactly feel proud of our country. ", "It's not even just the candidates. I am so sick of American media and the way it's run. They pretty much hijacked this entire election. ", "Now if for the love of god some just CALLED SEAN HANNITY all of this would be explained!!!!", "The coverage of this whole election was like a reality tv show. They knew what Trump was saw a gold mine and ran with it. It didn't matter if it was a right leaning or left leaning media. It was just 24/7 of Trump and clickbait articles.", "This resonates with me very strongly even though I have come to have a more positive opinion of Hillary than I did before this election cycle.", "Because one of the parties in the country doesn't agree with democracy.", "When you have a majority of the media colluding with an establishment candidate to ensure their election you can't really claim having a free press anymore.", "/r/politics has been a useless place for political discussion for years every now and then it gets even worse", "Its reddit its full of hyperbole masters.", "I'm in an affluent conservative area and you are spot on.  I bet I'll only wait 15 minutes maximum tomorrow ", "No I will not!", "Yeah it's amazing how many people believe the media has thrown in for Clinton when they've been giving him free press for over a year for every goddamn garbage thing he says.  Meanwhile if Podesta wrote an email to a reporter, it's high treason and they should all be smothered by jackboots.  Un fucking believable.", "Being from Phoenix I'm really torn. I can't decide what made me feel better, voting against chump or Arpaio. I gotta say, both felt pretty damn good and like I made a contribution to humanity.", "One party intimidates and suppresses voters. The other party fights to allow voters to vote. \n\nBasically the same.", "But that's exactly what got us here. When Clinton wins the Trump crowd is not going to just disperse - he showed everybody that if you get up there and preach targeted hate, they'll vote for you.\n\nI get that those people feel like they have nowhere to turn to, but the fact that they saw some kind of salvation in Trump should be an alarm to the rest of us who have been race-baiting and gaslighting and dismissing the concerns of a huge portion of our country. Yeah, I get that they've adopted some abhorrently backwards and medieval mindsets, but unless you hatch a plan to completely silence them then we're going to have to keep having the stupid fucking abortion debate and the LGBT rights debate.\n\nThese people need an off-ramp from the insanity, and their insanity is reinforced with every argument and every time somebody gets on stage in front of a crowd and starts talking about them like they're sub-human. I've known plenty of people who fit into that crowd; they're not all angry misogynist/racist/xenophobes, they're people who, for the last five decades, have been told that their country is being taken away from them, and during that time their quality of life has been drastically impacted.\n\nI'm not calling for pity for them, but dehumanization is going to make 2020 another shit show. These people are friends, neighbors, municipal workers, contractors, nurses, soldier - they are people who, just like us, keep the world going. Once political discussion begins, then the acid starts going and everyone fights with each other - even my wife and I, and I'm more liberal than her, but she feels better than I do about voting for the big D this year; we're voting for the same person and she still got mad at me because I wanted a candidate that didn't attract so much ire and she's a stop-Trump-at-all-costs and thinks I'm a monster for trying to maintain a principled stance.\n\nI don't know what it's going to take at this point, but everybody needs to calm the fuck down and start treating each other like fucking humans again, because I've been seeing Democrats banging the war drum for Russia and lately I've been seeing this \"kicking and screaming\" or starting a civil war, and that shit never ends well.\n\nEDIT: https://hbr.org/2016/10/how-to-build-an-exit-ramp-for-trump-supporters /u/tikael linked this, and it's where I got the \"off-ramp from the insanity\" idea from.", "&gt; 1st in Gun homicides\n\nNo we aren't. We are 18th in gun homicides.\n\nEverything else is correct though.", "My state is solid red. There is zero wait to vote. I literally walk in give my name, and they hand me a ballot.", "How the fuck are we supposed to deal with these people after the election?", "If you've seen the naked Trump statue imagine it covered in sweat and grunting on top of you. ", "Next up for president: Michelle Obama!", "My state is as blue as they come (Oregon) and I just had to drop my ballot off at a library. I can help but think we'd be a whole different country if every state managed their elections the way Oregon does theirs. ", "I would vote for her. ", "My favourite thing about this is all the whiny dudes complaining about them being against Trump.. \n \nOn their Facebook there are way too many comments say they 'are good at music but should stay out of politics' or are 'ruining the band with their politics'. Like have any of you dumb MFs ever listened to Green Day before? ", "Blame **Scalia** for helping to gut the voter rights act before he shit himself to death in his bed", "The university thing is a bit of a trick. Our public education (K-12) is awful. But when it comes to universities our universities have built prestige. So they attract the brightest people, who continue to do incredible work and add prestige to the university. The cycle continues. \n\nBut overall the average American is not that educated or intelligent. 2016 is good proof of that. ", "Not that I necessarily agree but...\n\n\"The best argument against democracy is a five-minute conversation with the average voter.\" \n\n Winston Churchill ", "It won't. Even if Trump loses he's built a template for someone else to follow. We'll probably see someone like him again in the future - someone who panders to the same crowd but is smarter about it.  :-\\", "Yeah this party has failed at their duty to represent their people. And they will be re-fucking-elected. This a comment from redditor OneYearSteakDay from another thread. .....\n\n#DON'T LET THESE FUCKERS OFF THE HOOK.  \n  \nCongressional Republicans didn't rescind their endorsements [when Donald was calling for killing innocent civilians,](https://youtu.be/I1eXRXL0nkk?t=1m13s) or when [he doubled down on killing civilians](https://www.youtube.com/watch?v=m_qEBwwET0s), when [he called African-Americans thugs,](https://twitter.com/realdonaldtrump/status/592910662424223744) when [he asked gun owners to do something about Hillary Clinton,](https://www.youtube.com/watch?v=ELL-aYFgkXI) when [he questioned my President's ancestry and religion,](https://www.youtube.com/watch?v=FlpaEXWe3Zs) when [he implied that vaccinations cause autism,](https://www.youtube.com/watch?v=G23Y8R-KcKA) when [he promised to ban a religion from immigrating to the United States,](https://www.youtube.com/watch?v=eh7XaJlvJIg) when [he invited Russia to hack a US citizen,](https://www.youtube.com/watch?v=gNa2B5zHfbQ) when [he advocated for torture,](https://www.youtube.com/watch?v=oxZv1Wq2c28) when [he demeaned women (pick one),](https://i.imgur.com/sYqvfDR.png) or when [he said that Mexico was sending us rapists and criminals.](https://www.youtube.com/watch?v=apjNfkysjbM)  \n  \nTheir endorsement stood through each and every indefensible thing he's said or done.    \n  \n#DONALD TRUMP WAS UNACCEPTABLE BEFORE THE FIRST ENDORSEMENT WAS EVER GIVEN.\n  \nAny sitting politician who endorsed this man before, during, or after this campaign deserves to lose their job.  Donald Trump has been an unacceptable choice since day 1, since before we heard *any* of this, but they endorsed him anyway.  House and Senate Republicans were willing to risk the wellbeing of the American people, and nominate a madman, in an effort to preserve the appearance of party unity.  They care more about obeying the Eleventh Commandment than they do protecting their constituents.  \n  \nWhat we heard today might very well be his last offensive comment, but it's certainly not his first.  \n  \n#ANYONE WHO SUPPORTS THIS MAN IS WORKING AGAINST THE AMERICAN PEOPLE.  PERIOD.  \n  \nDonald Trump didn't change tonight, he's still the same man he was when Paul Ryan, Mitch McConnell and Reince Priebus endorsed him.  \n  \nIt seems to me that congressional support for Trump is symptomatic of a much bigger problem within the GOP.  \n  \nIs a Republican Congressman endorsing Donald Trump in the name of partisanship and party unity ***that substantially different*** from a Republican Governor turning down a fully funded Medicaid expansion just to spite Obama and the ACA?  \n  \nThe Republican party has been pulling shit like this for the past six years, they've been electing people like Trump since the Tea Party burst out of their chest.  [Donald Trump actually looks normal compared to some of the Republicans on the state level.](https://www.youtube.com/watch?v=UB1bSJB3n10)  \n  \nAt some point you have to put country over party, wouldn't it have been nice if they had figured that out *before:*  \n  \n * [Enacting restrictive voter ID laws.](http://www.latimes.com/opinion/op-ed/la-oe-hajnal-voter-id-research-20160908-snap-story.html)  \n * [Closing schools to pay for tax cuts.](http://www.msnbc.com/rachel-maddow-show/more-kansas-schools-forced-close)  \n * [Detoothing Dodd Frank financial reform.](http://fortune.com/2016/09/13/republicans-dodd-frank-act/)   \n * [\"Papers please\" laws in places like Arizona.](https://www.dailykos.com/story/2012/6/25/1102974/-Supreme-Court-invalidates-most-of-Arizona-s-papers-please-law-leaves-papers-please-intact)  \n * [Cutting public benefits to pay for tax cuts.](http://www.govexec.com/pay-benefits/2016/03/house-republicans-double-down-nearly-300-billion-savings-feds-expense/126952/)  \n * [Firing public employees to pay for tax cuts.](http://www.motherjones.com/rights-stuff/2011/06/who-getting-screwed-ohio-budget-cuts)  \n * [Rolling back abortion rights across the nation.](https://www.washingtonpost.com/news/the-fix/wp/2016/06/01/14-states-have-passed-laws-making-it-harder-to-get-an-abortion-already-this-year/)   \n * [Turning down Medicaid expansions to the states.](https://www.advisory.com/daily-briefing/resources/primers/medicaidmap)  \n * [Refusing to enforce the recent gay marriage ruling.](http://www.politico.com/story/2016/07/trump-vp-pick-mike-pence-evangelicals-225623)  \n * [Cutting infrastructure spending to pay for tax cuts.](https://www.washingtonpost.com/news/dr-gridlock/wp/2016/07/20/the-irony-of-the-gops-new-promise-to-cut-mass-transit-funding-donald-trump-loves-trains/)  \n * [Preventing Elizabeth Warren from heading the CFPB.](http://www.politicususa.com/2013/01/29/gop-blocked-elizabeth-warren-director-cfpb-senior-senator-massachusetts.html)  \n * [Refusing to set up public exchanges on the state level.](https://www.dailykos.com/story/2013/9/29/1241710/-Better-Dead-and-Red-How-the-GOP-blocked-health-care-for-red-state-Americans)  \n * [Remember the trans-vaginal ultrasound laws?  Still a thing.](http://www.forbes.com/sites/davidkroll/2013/07/07/state-mandated-transvaginal-ultrasounds-where-are-the-medical-societies/#be692e26c74f)  \n * [Voting more than fifty times to repeal the Affordable Care Act.](https://thinkprogress.org/gop-lawmakers-vote-to-repeal-obamacare-again-on-groundhog-day-6f0c931a8549#.wrdaey3v3)  \n * [Wasting taxpayer money on repeated investigations into Benghazi.](http://www.nytimes.com/2016/06/29/us/politics/hillary-clinton-benghazi.html)\n * [Appointing Emergency Financial Managers to replace elected officials.](http://www.theatlantic.com/politics/archive/2013/05/does-michigans-emergency-manager-law-disenfranchise-black-citizens/275639/)  \n * [Preventing the most popular of gun reforms...](https://fivethirtyeight.com/features/most-americans-agree-with-obama-that-more-gun-buyers-should-get-background-checks/)  \n * [...or even allowing gun violence to be studied by the CDC.](http://abcnews.go.com/Health/cdc-launched-comprehensive-gun-study-15-years/story?id=39873289)  \n * [Preventing the appointment of a Supreme Court Justice...](https://newrepublic.com/article/131700/republicans-block-obamas-supreme-court-pick-violating-constitution)    \n * [...or any of the hundreds of other Judicial vacancies in our country.](http://www.thedailybeast.com/articles/2016/05/16/it-s-not-just-merrick-garland-republicans-are-blocking-so-many-nominees-it-s-caused-a-judicial-emergency.html)  \n * [Almost shutting down the federal government...](https://en.wikipedia.org/wiki/United_States_debt-ceiling_crisis_of_2011)  \n * [...before ultimately succeeding...](https://en.wikipedia.org/wiki/United_States_debt-ceiling_crisis_of_2013)  \n * [...and causing the first ever downgrade of the United States credit rating.](https://www.washingtonpost.com/business/economy/sandp-considering-first-downgrade-of-us-credit-rating/2011/08/05/gIQAqKeIxI_story.html)   \n * And generally standing in the way of any bill, law, or amendment proposed by someone with a [D] next to their name.  \n\nCongressional Republicans have blocked more bills, and passed fewer, than ***any other Congress in American history.***  \n\nHow many jobs could have been created if Congressional Republicans had allowed proper public investment?\n  \nHow many more Americans would have health insurance if Congressional Republicans hasn't killed the public option?  \n  \nHow much more secured would our infrastructure be if Congressional Republicans hadn't blocked spending on road and bridge repair?  \n  \nAnd this is just off the top of my head.  If someone wanted to take the time and do the research they could easily double or triple the number of things that State and Congressional Republicans have royally fucked up over the past eight years.  It sure would have been nice if they had been working for the benefit of our nation instead of just working to stop Obama.  \n   \n[And](https://leanleft.com/2016/03/21/to-our-conservative-friends-if-gop-policies-are-so-great-please-explain-kansas-and-louisiana/) [Kansas.](http://nymag.com/daily/intelligencer/2016/03/gop-must-answer-for-what-it-did-to-kansas.html)  [Poor,](http://www.chicagotribune.com/news/opinion/zorn/ct-kansas-conservative-brownback-economic-disaster-zorn-perspec-0518-jm-20160517-column.html) [poor](http://washingtonmonthly.com/2016/07/03/kansas-experiment-in-right-wing-economics-is-still-failing-miserably/) [Kansas.](http://www.motherjones.com/politics/2016/05/sam-brownback-kansas-tax-cuts-trickle-down)  \n  \nEdit: Please watch and share the first video in this post.  I could ask the same of all the videos above, as I do think they're all worth watching and sharing, but that first video just sends chills up my spine, and I think it's important that other people see it and understand exactly what he's saying.  It's 40 seconds long.  \n  \nEdit 2: If you have RES, Reddit enhancement suite, you'll see a button at the bottom of this post that says \"Source.\"  Clicking that button will bring up a raw, unformatted copy of my comment that can be copied and pasted for future use, or use in other Reddit threads.  You have my permission to copy or link anything and everything here.  \n  \nEdit 3:  Thank you for the gold!  I love gooooold!  Stop giving me gold.  Seriously, I appreciate the gold, but give the money to hurricane relief or donate to a Presidential candidate that can defeat Donald Trump.  What I want more than gold, far more than gold, is to see these ~~assholes~~ Republican politicians get what they deserve this November: [Unemployment benefits.](http://www.cnn.com/2014/02/06/politics/unemployment-insurance/)  ", "He is a Republican why would he say something about it?", "You're fucking kidding me. ", "2016 is a dream. It never happened. We're all in some feverish hive mind dream that never actually happened. The history books will cover 2015 and 2017. It was a leap year so 2016 didn't happen.", "You might think that but you're wrong.\n\n\nThere are US states that have Human development indexes' straight up worse than multiple developing countries.", "It makes it 1000000 times better that the announcement of Bin Laden's death interrupted The Apprentice!  https://youtu.be/qV76jeUQTXI", "Problem is many Republican voters know exactly why the GOP wants to suppress voter turnout, and they totally agree with it.\n\nOne of the biggest fears of conservative voters is that whites will lose the ability to control the nation.", "LOL\n\nSo you don't think anybody in the country is proud that there is a woman as a major party nominee? \n\nNo it's definitely just those old republican racists proud of Trump...\n\n/s", "Now I really want Night Vale style narration of this election.\n\n&gt;In other news the members of a vague yet menacing government agency have retracted their previous statement, saying \"This has been a test of the emergency scandal broadcast system. This was only a test.\". Witnesses report that hooded agents of the World Government were standing behind them, watching malevolently.", "Same reason why one party seems to love voter suppression. They become a lot less powerful if everyone gets a say", "Yeah a number of people believe that night is when Trump decided to run for president:\n\nhttps://www.youtube.com/watch?v=Htt91G2qDwM", "What a weird argument.  Of course comparing the poorest parts of one country against the average of others is going to make them look less favorable.  ", "Just imagine how great it would be if AZ turned blue on election night.", "The sight of Hillary and Bill back in the White House is going to drive Republicans absolutely batshit crazy.", "I don't blame non-voters for staying out of politics.  It's nasty.  I'm a very politically informed and knowledgable person and I can't even count the number of times I've pretended to not know about politics just to stay out of a crazy conspiratorial rabbit-hole of a discussion.", "I'm getting really fucking sick of hearing complaints about the two candidate from people that couldn't be bothered to vote in the primaries. ", "Yet another example of \"oh they couldn't have possibly said tha- no, no, they actually said that.\"\n\nOr put it on a shirt, as it were.", "I think it goes to Goldwater v Johnson in '64. The emergence of the religious right in the shadow of the post-Civil Rights Democratic party. The hard split in partisanship really took off during the beginning and tail end of the Bush Sr era. The '88 the Republicans fought dirty claiming Dukakis had a mental disorder, the prison furlough program (Willie Horton), he's going to take their guns, and so on. Dukakis tried the \"we go high thing\" rather than pointing out Reagan was obviously suffering from dementia (fairly well-known in the DC crowd), or pointing out Reagan, as governor of California had been the first to employ the prison furloughs, signed gun control measures in CA and had proposed Gun Free School zones (passed in 1990). We know how '88 turned out.\n\nWell, budget season didn't go well for George Sr, especially with military spending continuing to grow after the fall of the USSR. To mollify the Democrats in Congress, Bush allowed some specific revenue increases that were sorta \"new taxes\" to get a solid budget through. \n\nIn 1992, the gloves came off. Despite Atwater's death, they employed a similar model of attacking Clinton's role as governor... problem was, Clinton had been fairly moderate thanks to the political climate in Arkansas. Bush found himself walking a fine line in attacking Clinton''s record, without bruising his own. Coupled with a flank attack from a feisty Perot, Bush found himself taking heat from Perot for the \"new taxes\", countering his famous \"read my lips\" speech... then Clinton ran ads doing the same thing. Then Grover Norquist (up and coming asshole, still little known) called Bush out in an op-ed for it, too! Bush made the mistake of reaching across the aisle, and he was getting heat from all sides. Deserved, if you consider his '88 campaign, but it was a very bad thing for our country.\n\nWith 1994, we saw Gingrich and his Contract on America, later the Ken Starr investigation, then impeachment, then the Hastert rule, the growth of punditry in the 24 hour news cycle, Rush and Fox... \n\nTo Republicans, George HW Bush was a cautionary tale, warning them against the perils of bipartisanship, and they took that lesson to heart. Democrats had no idea what they inadvertently started until they had to call on their senate majority to keep an obviously bull shit attempt to oust the president at bay. And they could only watch in horror as the weaponry of the lunatic religious right was deployed in the 2000 Republican primary against McCain, who had been a very well known figure due to his ability to work with them. \n\nI don't know if this is the culmination and/or the end result, but God I hope so.", "&gt; As a sane Republican\n\nYou'll be labeled as a RINO. There are no sane Republicans left the party that you were a part of no longer exists. You and the other sane Republicans are going to have to find a way to take your party back.", "Yeah that's delusional.", "We don't have the best K-12 but it's not like it's awful everywhere. Remember, USA is big as fuck. Compare it to ALL OF EUROPE and tell me where it stands. If you're going to cherry pick, say, the Nordic countries, then I think it would be fair to do the same in the US and cherry pick top private schools. And at that level I'm guessing the difference is negligible (although I will admit I don't know where to find #'s that group Europe together, I'm only finding by country lists)", "Establishment musicians like Green Day, are the worst! \n", "As a non-American there's so much I don't understand about this election. Starting with \"what the fuck is a *primary*\". \n\nBut chief among them is that I'll never understand how people can be looking on one hand at a thin-skinned, ignorant, racist, misogynistic, narcissistic bully and sexual predator who has advocated everything from war crimes to genocide, and then look to the other option and shy away because there **might** be more emails that **might** say something bad. Am I missing something? Do I just not have enough freedom?", "&gt; Hillary won 1 and 2. That's why she won. Quite simple.\n\nNo she won because of a labyrinthine primary system that is kept that way to purposely make it difficult for other contenders. Polling locations were strategically closed or blocked, voters were purged, and voting machines had tallies altered. Not to mention she got debate questions early, had a direct line to the media who basically worked for her, and had the entire party sabotaging Bernie.", "Who cares about this guy?", "&gt;\"Articles that I have read I haven't verified them,\" Duffy told host Wolf Blitzer on Oct. 27, 2016. \"But we heard that one of George Soros' companies has provided some of the machines for some of these states. And, obviously, Mr. Soros leans left. I haven't personally verified that yet.\"\n\nYeah, why verify something when you can just bullshit and no one will really hold you accountable anyway?", "&gt; He never stood a chance of becoming the nominee. He knew it at his core. The DNC was not going to let an outsider come in and steal their party out from under them like what happened to the GOP.\n\nIt's not the DNC that did that. It's the voterbase. \n\nTo win the Democratic primary you need to win 2 of the 3 deciding groups. \n\n1. Women\n2. Minorities\n3. Young People\n\nHillary won 1 and 2. That's why she won. Quite simple. \n\nIn 2008 Obama won 2 and 3 so he won then. \n\nIt's not nearly as complicated or rigged or whatever as some people make it out to be. It's actually boneheadedly simple. If Bernie wanted to actually make a run for the nomination he wouldn't have written off Southern Democrats (overwhelmingly black) as not important or unworthy of focusing on after he got BTFO in South Carolina. He should have been recognizing his weakness (minority support) and aggressively correcting it. \n\n\n", "Correct me if I'm wrong but is Joe Arpaio the guy I think of when I think of a red-faced, blustering, racist sheriff of a dead-end desert town?\n\n", "Good news is after Starbucks you won't be backed up!", "This is the best explanation yet for non-technical people. I doubt it will make a significant difference to people who are going to (not) see what they (don't) want to see but for other's who are willing to look at things a little more objectively it describes it well.", "Your point about all of Trumps backers losing their careers its another reason why TrumpTV makes too much sense not to happen.  He'll hire Newt and Hannity and Christie to come peddle conspiracy theories on his reality tv brand of \"news\". ", "Republicans. He's the only musician that allows his music to be played at their rallies.", "I'm sure that shirt was a big hit at Waffle House this morning.", "\"I'm mad my preferred left-wing candidate lost so I'm gonna support an insane right-wing demagogue who opposes 99% of the things my original candidate stands for.\"", "Honestly this right here is why Repubs think Dems are weak. They'll only think these pleas are serious when they're made by guys with guns. \n\nBut, of course, the feds putting the national guard into Ohio to guard the election will just make the right-wing hysteria even worse. Fuck it all.", "The point doesn't really change though does it?", "Not necessarily for early voting. If you read the article there is exactly one early voting location in Cincinnati. One location for a county population of 800k.", "Hillary has Beyoncé Lebron and Jay-Z. Trump has...this. Also, KKK, Ailes, Breitbart and promises to make America great (white) again. ", "College town = liberal = must be discouraged from voting!", "They cherry pick the constitution like they cherry pick the Bible. ", "There was a very good segment on 60 Minutes tonight talking about the disconnect that exists in American society at this current juncture. Part of the problem with this election has been that both sides have a passionate hatred for the other where such hatred emanates from a simple problem with listening and understanding. Rather than attempt to find common ground or understand where people are coming from, our immediate response has been to call anyone who has a view opposite to ours an \"idiot,\" \"bigot,\" \"racist,\" or \"ignorant.\" No one takes the time to listen, and everyone is eager to force people to agree with them. If they don't happen to agree, then they are someone not worth talking to, or in the worst cases, someone not worth existing. \n\nI know Trump supporters want to blame Hillary and her supporters for the downfall of America, and Hillary supporters likewise want to point to Trump and his supporters for the vitriol that we've experienced this election cycle. The reality is that both groups are equally responsible. Both sides have been stubborn and have refused to see the people on the other side as people, and instead have opted to label them \"the worst of the worst.\" Once both sides make those determinations, then all hope of useful discourse is out of reach. We must realize that, at the end of the day, we're all American, and we all have similar issues with our government---we simply have different ways of thinking about how we should address those issues. \n\nDon't let the partisan rhetoric of your respective candidate, whomever it is you're supporting, drive you to a path of hatred for people who disagree with you. Instead, remember that the foundations of a vibrant democracy rest on understanding through discourse and a sense of community. Don't let political parties coerce us into hating each other just because *they* hate each other. Regardless of who you vote for on Tuesday, strive to humanize those on the opposite end of your political spectrum and try to understand their very human concerns for the way our government works or doesn't work for all of us.", "The GOP will cry about rap lyrics but be BFF's with this guy who LITERALLY threatened to assassinate Obama.\n\nEdit: And aparently wrote a song about fucking a 13 year old girl. You cant make this shit up folks.", "Exactly and yet he was being called a \"nice,\" Republican as if there is such a thing alive in the U.S.A. today. ", "Because the Clintons have spines something the GOP isn't used to having to deal with.", "The most striking thing to me here is that 75 papers which didn't take a position in the last election came out and endorsed Clinton. That's how lopsided the candidates are...", "Clearly the answer is just more war cart spam. And to annex the Scythian Empire before they overrun everything with horses.", "I think Americans built it actually.", "That's not a drive. That's a short putt.", "Sure many people (myself included) are extremely proud of a female president.\n\nHowever the emergence of Trump has his supporters blatant fascism is absolutely horrifying. It shows that we are no where near where we thought we were in 2008. I am deeply ashamed of those people that are ruining our country. ", "They have it as [half true](http://www.politifact.com/georgia/statements/2016/sep/16/jim-barksdale/barksdale-claim-wage-gap-lacks-context/) depending on context. Isn't that what everybody has concluded?\n\nEdit: more ratings\n\n [1](http://www.politifact.com/truth-o-meter/article/2015/jul/15/politifact-sheet-gender-pay-gap/)\n\n[2](http://www.politifact.com/truth-o-meter/statements/2012/jun/21/barack-obama/barack-obama-ad-says-women-are-paid-77-cents-dolla/)\n\n[3](http://www.politifact.com/truth-o-meter/statements/2014/jan/29/barack-obama/barack-obama-state-union-says-women-make-77-cents-/)", "I suppose Trump is that change? ", "I want some of what this guy's on.  Seems like it's good stuff...", "You left out the best part where he preempted The Apprentice to announce OBL's assassination a day later. \n\nMic drop. ", "Well he's the Sheriff of Maricopa County, which contains Phoenix, but it sure *sounds* like you're describing Joe Arpaio.", "No it doesn't. My comment was just meant to counteract all the \"But what about this newspaper?\" comments.", "What I like best about this clip is Obama finally in-his-glory and giving no fucks: 'Can I get a *witness*?!' Folks have talked about a Supreme Court nomination which would be wonderful for him but at the same time would silence this wonderful orator-which would be very nearly criminal. American political discourse needs this voice loud and clear.", "Didn't Nugent make a promise to either be dead or in prison if Obama got reelected?\n\nWhat a pussy.", "I was wondering would a tech site take this one lol", "Look you can think that it was stacked against him, but once you start saying \"voting machines had tallies altered\" you get into crazy pants territory.  He lost those primaries, sorry, it's that simple.", "Just because something happens and you disagree with it doesn't mean democracy has been shaken.", "If Donald Trump is *quasi-Hitler* then Joe Arpaio is half a goose-step away from being an SS Officer.", "Plus when it comes to infant mortality, it is important to consider that in America *all* deaths after birth is counted. In many countries only deaths after 24 hours are counted. ", "I just recently moved to NC (as a 'pub) but it's about time the NC GOP got called out on their shit. \n\nIt took about 2 weeks here for me to cut any ties I had to the party. I'm embarrassed it took me that long. \n\nFor those who haven't seen District 12... It's the most extreme case of gerrymandering I've ever seen. \n http://imgur.com/eNMxubX", "Vox and politico tilt left but at least report facts, even when they are detrimental to Clinton and are reputable publications. At the_donald they literally ban anyone reporting facts - for instance they're banning anyone who mentions that there was no 'gun' in yesterday's kerfuffle and that there was no 'assassination attempt', but just someone holding a sign getting beat by Trump supporters. I can't think of anything anywhere near equivalent in /r/politics - so it's a bit of a false equivalence.", "I know right?  I'm **already** less proud of America and I don't even vote for another 33 hours.\n\nOf course I was less proud 3 months ago too.", "Just remember...Nugent smeared shit on himself to try and dodge the draft \n\nhttp://gawker.com/5983634/patriotic-american-ted-nugent-shit-his-pants-to-avoid-the-draft", "Yeah it would be inappropriate for a moderator to correct someone's stance on global warming with the facts. It would not be inappropriate to fact check Trump as having posted on Twitter that global warming is a Chinese hoax after he denies having done so. That's equivalent to what Crowley did to Romney.", "A lot of it was black people actually. Enslaved black people.", "&gt; As long as there isn't an armed rebellion or civil war\n\nI guess you haven't been on /r/the_donald today. Lots of posts calling for serious armed rebellion and \"civil war\" after comey's latest statement.", "A 650000 row database?!\n\n\nIt would take months just to create all the punch cards to feed that into the super computer!!", "First you remove the duplicates. This could result in a tenfold reduction in mail.  Then you remove any emails that you previously searched. Given these are likely  copies of what is on the server that is likely every single email that was left. \n\nPretty fucking simple. ", "Even if I absolutely loved Hillary and thought she never did anything wrong ever (which I don't) and she won I would still feel incredibly disappointed in this country just because of where this election is right now and all the fucked up views that are being put out in the open\n\nI've seen enough things on facebook alone to make me question everything I've ever thought good about the masses of people in this country", "Why it was even announced before a basic search was completed is fucking ridiculous. ", "It is simply astonishing that this was ever for even a moment, considered a viable rebuttal.\n\nI can hear the slow rumble of the collective world of data scientists banging their heads on desks in unison.", "lol honestly. I couldn't understand how people couldn't understand this was fairly simple and 8 days probably gave them enough time to be extra thorough.", "Yeah college professors had the ability to figure out if you plagiarized half of a sentence in a 20 page term paper from pretty much any website or book in existence in seconds at least a decade ago no shit the FBI can scan through 650,000 text emails in a week.", "Also remove all the Weiner dick pics reduce it by 99%", "man the disconnect from trumpers is scary.\n\nWikileak dumps millions of emails and they accept articles with BOMBSHELL in title is up within the hour. But, the FBI being able to crosscheck 650,000 email in against their previous database in EIGHT days? Bullshit... Impossible. RIGGED. SAD", "Also remove all the spam that never got deleted from the spam folder and reduce it by 90%.", "Seriously hope #1 wins but I'm not hopeful yet.  This country needs a *functioning* right-wing party that actually wants to govern so there can be real policy debate.  I'm pretty liberal but the Dems are not always right, and the best policy comes from real compromise, not this \"take my ball and go home\" bullshit we've had from the Repubs since Obama.", "Or even a fucking warrant to do the search", "I've seen speculation that Comey announced it to head off leaks. There's a big pro-Trump contingent at the FBI and Comey isn't in control of all his agents.", "Does anyone else feel like either candidate would lose in a LANDSLIDE if they were going against anyone else? I can't imagine a Bernie v Trump or Clinton v Cruz election being anywhere close.", "Oregon Colorado, and Washington.  Everybody gets mail-in ballots.  This is so much better than any other system, and I find it actually greatly increased my participation in the down-ballot candidates and issues, as I could actually take my time and research.", "My vagina just sealed itself", "They must be good at cyber. ", "Am data scientist. Do bang head.", "The only person Hillary could win against is Trump.\nThe only person Trump could win against is Hillary.", "Meanwhile my feelings for both couldn't sink any lower.", "It still remains to be seen how much of that policy platform actually translates to results.", "I definitely do not think this. I think Cruz would have struggled against Clinton for totally different reasons (he is almost absurdly conservative -- almost like a liberal caricature of conservatism in every category). I think Cruz-Clinton would have been a much more policy and ideology driven race and Clinton does well when the debate is about policy and detail. And too, I think people overestimate how well Sanders would do in a general relative to how well he did in the primary. Once Bernie was *the enemy* to conservatives -- and not just the guy making Clinton's primary harder for her -- the popularity he enjoys would have almost certainly gone down dramatically (whether it would reach Clinton levels is unlikely, of course). ", "Someone please explain this to me. How fucking HOW do conservative christians support Trump??? He is the embodiment of the exact opposite of the teachings of Christ.", "Without Twitter all I can imagine is Trump in his tower screaming \"KHAAAAAN!!!\" like Kirk.", "Twitter bait.\n\n*plz bite plz bite*", "He almost certainly would but Kellyanne Conway took his phone and changed his twitter password.", "I got a mail-in ballot in California.  Came with a like 100 page booklet with non-partisan information on all the candidates and propositions.  Fill it out put stamps on the envelope, drop it in a mailbox, get an email a few days later confirming they received it.  \n\nSuper easy.  Previously, I had to vote in person on the day.  I can't believe it doesn't always work like this!", "I do stuff like this for a living. Searching through an archive of data takes almost no time at all. Removing duplicates (deduping) and filtering out all emails that do not contain Hillary's email address(es) would leave them with maybe a few hundred pieces of new information at most.", "He sciences data can you not read??", "Hmm that crazy Republican was right!", "Reddit has come to believe that because he is not as insane as Donald Trump that he is basically a liberal now. ", "I had an argument with someone yesterday about this. I asked if they thought Trump following his \"Moved on her like a bitch, but she was married\" adulterous comment, cared about the other Ten Commandments at all. Their reply was \"Clinton is not Christian because she believes in abortion\". It's like they are in a delusion.", "This can't be! I don't get how such a nominee get support from the KKK North Korea, and praises Putin have so much support. At some point his supporters have to actually look and see that maybe this guy is an a**hole! \n\nEdit: The English language! ", "That makes her smart.", "I think you underestimate the absolute hate-ability of Cruz. I mean during the primaries I learned the word backpfeifengesicht because of him (German for 'punchable face'). ", "Obligatory everyone still needs to vote.\n\nBUT this is a very good place to be going into game day.", "https://en.wikipedia.org/wiki/List_of_wars_involving_the_United_States\n\nYou really can't justify more than a few of our wars as anything but imperialist expansion and massacures for either political or economic benefit for our country. I've always had a conflicted view of being an American. Are we great because of our national values and systems or rather because we have been the most efficient in exploting with no concience.", "I was proud to be an American where at least I'd known I was free, until I fucked up in 03, and joined the Army.\n\nEdit: A reminder that even though Friday is Veteran's day, a large percentage of veterans do not like being thanked for their service. There are interesting articles by folks such as Vonnegut on the subject.  But this sums up how I feel on the matter https://youtu.be/lpzqQst-Sg8", "Not even just data people. \n\nThe tier 1 help desk guy in India was probably shaking his head in disbelief as well.", "Oh it's a 'comin: https://www.reddit.com/r/the_meltdown/", "Are you Barron Trump? You seem to be very good at the Cyber. ", "I would still be disappointed that Hillary is our President", "\"the cyber\"", "2016 is just the tipping point it has been brewing for a long time.", "Man if there is an afterlife there's one son there who is surely damn proud of his parents. ", "Goddamn robots are taking our jobs.", "after reading reading general Flynns tweet I now know why Trump thinks he knows more than the generals... at least the ones he knows like Flynn.", "He would have blown trump out of the water. ", "I'm not less proud of America in theory as it is set out in the constitution, but to be honest I have come away with a lower opinion of the electorate in general. First and foremost it's been truly disheartening to see the incredible amount of hatred, prejudice, and ignorance coming from Trump supporters. The primaries were also incredibly disappointing with regards to the Democratic party (and the DNC in particular). I voted Clinton in the generals, but her fans' constantly making excuses for her and condescending dismissal of valid complaints and concerns from other liberals left a bad taste in my mouth. You all seriously need to be careful how you move forward in reaching out to Democrats who are on the fence with Clinton - she's not going to be so lucky as to face someone as stupid as Trump later on, and you'll need all the help you can get. \n\nParticipation in midterm elections will be essential to make sure leftist policies can progress, but there are certain areas within the president's sphere (particularly with regards to foreign policy) that may very well lead people to cast off even the meagre support they gave Clinton this time. If she loses in 2020 because of something like that, it's her own fault - at some point the elected officials need to be held accountable for their performances instead of lazily relying on fear of the opposition party doing the work for them. Both the DNC and Clinton need to change for the better if they want her to get a second term. ", "How can someone \"narrowly avoid\" indictment? There isn't a spectrum between guilty and not guilty. ", "Hillary could win against Ben Carson unless the alt-right could perform the necessary mental gymnastics to support him.", "That's what scares me. Sociopaths are watching and thinking \"we'll if I just don't grab them by the pussy I can be president\"", "Giant Douche vs Turd Sandwich\n\nOrange Hitler vs Grandma Nixon\n\n\nI'm less proud of the 38% who seem to be oblivious ...", "Yeah Comey is getting shit on both ways. Being upfront is better in this case because if it was in secret Hilary would catch flack anyway and Comey would be crucified by republicans. This was better for him and his department in the long run.", "&gt; If Snowden is correct the real question isn’t why the examination of the emails was over so quickly, it’s why it took so long to clear up the mess Comey made with his Oct. 28 letter to Congress. \n\nSen. Franken's investigation into this fiasco cannot start soon enough.", "\"And now for our prison correspondent Chris Christie\"", "Sing it Mr. Khan.", "No puppet.", "Unless of course you consider their policies and basic world views.", "Unfortunately we *already* screwed this up just by being in the position we're in with two terrible candidates. Maybe some serious election reform will come of this...but probably not.", "I think we may be talking past each other here. Sanders currently enjoys extremely positive favorability -- well in to the 60s. \n\nI am very confident that would have fallen to 50% or so in the heat of an actual general. There is a good chunk of conservatives who can stomach him when he basically operates as a thorn in Hillary's side -- as he did in the primary -- but would suddenly and miraculously discover they hate him if he became the actual nominee. As a separate point a lot of Bernie's weaknesses couldn't be exploited by Clinton in the primary, in the same way that a lot of Trump's weaknesses couldn't be exploited by Republican primary opponents.  Calling Bernie a socialist was clearly fine with Democratic primary voters, for example, but could easily have been weaponized against him in a general election with a broader electoral base. [Socialism is still deeply unpopular in the US.] (http://www.gallup.com/poll/191354/americans-views-socialism-capitalism-little-changed.aspx)", "538: B+ with 1.7 D lean moe 3.7", "Probably the same way Congress can read 1000+ pages of legislation hours before voting on it.", "I am disappointed that democrats picked the queen of corruption as their candidate.", "I don't think so. The racist and sexist streak is there but I don't think it's the main factor here. The GOP would be equally monstrous regardless of what the Democratic candidate for president was, it's just that a black man allows the racists to shine, and a woman brings the misogynists to the forefront.\n\nIn my opinion, it's a few factors at play. Firstly, Fox News, conservative talk radio, and websites like Breitbart provide an echo chamber so conservatives can go the entire news day only hearing one side of any issue. And second, with gerrymandering making a lot of voting districts safe red districts, Republicans in those districts have no reason to moderate to appease democrat and centrist voters, and on the contrary have every reason to pander as far to the right as they can to ensure that they aren't pushed out by a more extreme primary challenger.\n\nAt that point, the entire party turns into a competition to see who can hate liberals the most, cooperate the least, and propose the most \"conservative\" policies, regardless of what the American populace as a whole wants. Because they're not trying to appease the American populace as a whole, they're just trying to appease the districts they've carved out and cultivated to be a lock for their party. ", "Please Hillary invite Mr Khan to your victory party on Tuesday.", "My hope/thought is they climb back under whatever rock these bigoted racist, xenophobic, white trash gutter scum crawled out from under. Like all cowards, they aren't tough unless in a crowd of other pieces of shit like themselves. ", "The only thing I really hope for this election is that Mr. Khan sees Trump get crushed in the vote Tuesday night and can fall asleep thinking \"at least I helped with that...\"", "When do they plan to release RNC emails? \n\nOh wait they are completely one sided in their weaponization of information... because WikiLeaks never wants to be thought of as anything other than Russian propaganda, ever again.", "Trump's border wall will have a 1989 mile gap in it.", "I can see your point with Cruz but you have to consider the weight of the \"Never Hillary\" campaign, and the huge amount of border line conservative christians who feel disgust for Trump that wouldn't for Cruz. Cruz's absurd conservatism would have actually been a huge rallying point for the same people that are nuts for Trump. But again, you make a very valid point.\n\nOn the Bernie side I disagree completely. Hillary was/is a hard sell for Sanders supporters, but I feel most Clinton folk would have been pretty enthusiastic about a Sanders campaign, and he wouldn't have as much of a polarizing effect for middle isle and independent voters who are fed up with establishment.", "Her friends? Like the sorta-but-not-really non-partisans in the FBI? If you think Comey and the FBI are her friends you need to find some new friends.", "It's going to be interesting reading in the history books about how the two most disliked candidates ever became the nominees. ", "America has suffered enough from Donald Trump.", "\"The best argument against democracy is five-minutes spent on /r/t_d\"\n\nWinston Churchill probably \n\n", "Some people need to spend some time in jail for pulling shit like this. ", "Breitbart. ", "\\&gt;breitbart\n\nlol", "No! Let's have a gay Muslim! Imagine the GOP react to that.", "And maybe if the group of people who has traditionally held power (eg white dudes) is scared of becoming a minority maybe they should reevaluate how they treat minorities. ", "I'm not an American but I'm really surprised how many big guns have been pulled out by HRC today. \n\nHer organization is just mind blowing.", "It's almost like the whole world just heard \"Clinton still likely to win\" and breathed a collective sigh of relief.", "I have no problem believing they could do it. I get a little irritated that they didn't do it before they sent a letter to Congress that was interpreted as opening an investigation", "That is perfect. Run that as an ad - Seeing and hearing Trump would attract his supporters' attention then WHAM! Remind em who actually gets meaningful shit done.", "The problem is we have to explain to every  trumpet one at a time and then they still go back to 650000 emails can't be read that fast.", "I don't think Sanders would have appealed at all to the general electorate. ", "The deliberate self inflicted cognizant dissonance is mind blowing. ", "*He's 10 years old. He has computers. He is so good with these computers it's unbelievable. The security aspect of cyber is very, very tough. And maybe it's hardly doable.* - Donald Trump", "Turnout turnout, turnout.", "How come everyone can smell shit but anyone who dares suggest we check our shoes is in \"Crazy pants territory\"?\n\nAt this point the corruption is so pervasive does anyone really put it past the powers that be to not rig elections? There's so much opportunity for it now with these new machines. The discrepancies between the polling and the outcomes were stark and it also seemed to correlate with states that employ suspect voting machines. But hey I'm crazy because I think the Clintons, a family mad for power might just be a bit shady. How naive of me ...", "Yup. Most of the monsters do vote trump. ", "This isn't meant as a personal attack but the crazies are going keep driving the party until the sane Republicans grow a pair and kick them the fuck out.  Even today the party leadership is squirming around trying to look like they aren't endorsing Trump, while appeasing his faction.  \n\nOf course, doing this basically splits the party &amp; forgoes any national elections for a long time, so I'm not optimistic any of the current party leadership will have the balls to do it.", "I mean. She's been looked over with a magnifying glass this entire election and nothing dirty was found. ", "Jesus Christ.  First Mexicans are rapists.  Then all Arabs are terrorists.  Now apparently all the Somalis who have been living in MN for years, are also subhuman.  I just cannot process how utterly vile of a human being Donald Trump is.", "Oh was he arrested? No? Then I think calling him a loser for wearing that around people who have been singled out by the leader of an angry mob is entirely appropriate.", "You're keeping us in suspense?"], "links": ["5bi956", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi1pe", "5bi956", "5bi1pe", "5bi956", "5bi956", "5bipo9", "5bi956", "5bi956", "5bil4t", "5bi1pe", "5bi956", "5bi956", "5bi956", "5bi956", "5bi956", "5bil4t", "5bi956", "5bi956", "5bigmd", "5bi956", "5bi956", "5bi956", "5bi956", "5bil4t", "5bipo9", "5bigmd", "5bi956", "5bi956", "5bi956", "5bi1pe", "5bi956", "5bigmd", "5bipo9", "5bi956", "5bi956", "5bgp1x", "5bi956", "5bil4t", "5bigmd", "5bi956", "5bil4t", "5bi956", "5bigmd", "5bi956", "5bigmd", "5bi956", "5bi956", "5bi956", "5bhhjg", "5bipo9", "5bi956", "5bi956", "5bgrjb", "5biwem", "5bi956", "5bi1pe", "5bigmd", "5bi1pe", "5bil4t", "5bi956", "5bi956", "5bi956", "5bi956", "5bil4t", "5bi956", "5bfn98", "5bigmd", "5bi956", "5biwem", "5bi956", "5bi956", "5bi956", "5bigmd", "5bigmd", "5bil4t", "5bi956", "5bi956", "5bid1z", "5bipo9", "5bigmd", "5bi956", "5bigmd", "5bi956", "5bi956", "5bi956", "5bigmd", "5bi1pe", "5bi956", "5bi956", "5bj5mv", "5bj5mv", "5bj4yq", "5bi956", "5bj5mv", "5bj5mv", "5bj5mv", "5bj5mv", "5bj4yq", "5bj5mv", "5bi2bh", "5bi956", "5biz3j", "5biz3j", "5bi2bh", "5bi956", "5bizz9", "5bi2bh", "5bj4yq", "5bi1pe", "5bi1pe", "5bj5mv", "5bi956", "5bigmd", "5bi956", "5bizz9", "5bi956", "5bj5mv", "5bi956", "5bj5mv", "5bi956", "5bja6o", "5bj8zz", "5bj46n", "5biz3j", "5biz3j", "5bi956", "5biz3j", "5biz3j", "5bi956", "5bj4b5", "5bj5mv", "5biz3j", "5bj46n", "5bi956", "5bi956", "5bi956", "5bi956", "5bizz9", "5bigmd", "5bi956", "5bj3xo", "5bipo9", "5bi956", "5bj3xo", "5bi956", "5bi956", "5bi956", "5bj46n", "5bi956", "5bi1pe", "5bi956", "5bi956", "5bi956", "5biz3j", "5bi956", "5bi956", "5bj4b5", "5bj4yq", "5bj5mv", "5bja6o", "5bj8zz", "5bi956", "5bi956", "5bi1pe", "5biz3j", "5bi956", "5bj4yq", "5bi956", "5bigmd", "5biz3j", "5bigmd", "5bipo9", "5bi33i", "5bigmd", "5biz3j", "5bi33i", "5bj46n", "5bi1pe", "5biz3j", "5biz3j", "5biz3j", "5bizz9", "5bhlyl", "5bigmd", "5bipo9", "5bj5mv", "5bj5mv", "5bja6o", "5bi33i", "5bj4yq", "5bi956", "5bj4yq", "5bi956", "5bj5mv", "5bj3xo", "5bj5mv", "5bi1pe", "5bi33i", "5bigmd", "5bja6o", "5bi2bh", "5bi956", "5bi33i", "5bja6o", "5bj5mv", "5bi956", "5bi956", "5bj5mv", "5bj8zz", "5bja6o", "5bja6o", "5bi956", "5bj5mv", "5bi956", "5bigmd", "5bi956", "5bj5mv", "5bi956", "5bi956", "5bi2bh", "5bjaje", "5bj46n", "5bjiq4", "5bi2bh", "5bi956", "5bja6o", "5bizz9", "5bja6o", "5bhlyl", "5bja6o", "5bj8zz", "5bigmd", "5bja6o", "5bj5mv", "5bja6o", "5bigmd", "5bi956", "5bjk3a", "5bigmd", "5bj3xo", "5bj5mv", "5bi2bh", "5bjgmr", "5bigmd", "5bi956", "5bi956", "5bja6o", "5biz3j", "5bi1pe", "5bi33i", "5bjaje", "5bj46n", "5bi2bh", "5bja6o", "5bi33i", "5bi956", "5bj8zz", "5bja6o", "5bi956", "5bjaje", "5bjgmr", "5bjj89", "5bigmd", "5bi956", "5bhlyl", "5bj8zz", "5bigmd", "5bjaje", "5biz3j", "5bi1pe", "5bj5mv", "5bjaje", "5bja6o", "5bja6o", "5bi33i", "5bi956", "5bizz9", "5bj4o8", "5bil4t", "5bjpvl", "5bjpvl", "5bj5mv", "5bjpvl", "5bj5mv", "5bjrsd", "5bj5mv", "5bj5mv", "5bj5mv", "5bjpvl", "5bjpvl", "5bjlxt", "5bjrsd", "5bi956", "5bi956", "5bj5mv", "5bj4yq", "5bjlxt", "5bjlxt", "5bj5mv", "5bjomg", "5bigmd", "5bj5mv", "5bjkgm", "5bjomg", "5bil4t", "5bi2bh", "5bjpvl", "5bjpvl", "5bj5mv", "5bjlxt", "5bj4yq", "5bjpvl", "5bjpvl", "5bi2bh", "5bj8zz", "5bjkgm", "5bj3xo", "5bjomg", "5bj5mv", "5bjqqu", "5bjpvl", "5biz3j", "5biz3j", "5bizz9", "5bipo9", "5bi1pe", "5bj5mv", "5bjpvl", "5bjpvl", "5bi2bh", "5bi2bh", "5bjooc", "5bi2bh", "5bi33i", "5biz3j", "5bj5mv", "5bjkgm", "5bi1pe", "5bj46n", "5bjpvl", "5bj8zz", "5bjpvl", "5bjpvl", "5bipo9", "5bja6o", "5bj8zz", "5bi956", "5bjpvl", "5bj8zz", "5bjpeh", "5biz3j", "5bi956", "5biz3j", "5bi2bh", "5bjomg", "5bipo9", "5bjaje", "5bjpvl", "5bi956", "5bjooc", "5bjpvl", "5bjpvl", "5bi2bh", "5bj8zz", "5bigmd", "5bi1pe", "5bigmd", "5bjlxt", "5bjpvl", "5bj5mv", "5bjlxt", "5bjdor", "5bjrzs", "5bjksq", "5bja6o", "5bi1pe", "5bjrdv", "5bj5mv", "5bid1z", "5bj5mv", "5bj5mv", "5bk3p7", "5bj5mv", "5bj5mv", "5bjrsd", "5bj5mv", "5bj5mv", "5bj5mv", "5bigmd", "5bi956", "5bj5mv", "5bjxd3", "5bjrsd", "5bj5mv", "5bj5mv", "5bigmd", "5bk2of", "5bi956", "5bjpvl", "5bigmd", "5bjpvl", "5bk0qj", "5bjrsd", "5bj5mv", "5bj5mv", "5bj5mv", "5bi33i", "5bjrsd", "5bj4yq", "5bj5mv", "5bj5mv", "5bi956", "5bizz9", "5bj5mv", "5bi1pe", "5bjrsd", "5bi956", "5bj5mv", "5bjxd3", "5bjpvl", "5bj5mv", "5bj5mv", "5bk2of", "5bjpvl", "5bjpvl", "5bjxd3", "5bj5mv", "5bk0qj", "5bi1pe", "5bj5mv", "5bjvs4", "5bj8zz", "5bj5mv", "5bjxd3", "5bigmd", "5bk3p7", "5bjpvl", "5bjvs4", "5bk2of", "5bjxd3", "5bjrsd", "5bj4yq", "5bigmd", "5bjv71", "5bigmd", "5bk2of", "5bj5mv", "5bjvs4", "5bjrsd", "5bjpvl", "5bj4yq", "5bi33i", "5bizz9", "5bjpvl", "5bj5mv", "5bj8zz", "5bjxd3", "5bjxd3", "5bi956", "5bjxd3", "5bj4yq", "5bjlxt", "5bjvs4", "5bk3p7", "5bj5mv", "5bj5mv", "5bjxd3", "5bj5mv", "5bigmd", "5bjlxt", "5bj5mv", "5bjv71", "5bi956", "5bizz9", "5bj5mv", "5bk3p7", "5bk3p7", "5bj5mv", "5bk3p7", "5bk3p7", "5bk3p7", "5bk3p7", "5bk3p7", "5bk3p7", "5bk3p7", "5bjpvl", "5bk3p7", "5bk3p7", "5bj5mv", "5bigmd", "5bi956", "5bk3p7", "5bk3p7", "5bj5mv", "5bj5mv", "5bj5mv", "5bj5mv", "5bj3xo", "5bk81i", "5bk81i", "5bk81i", "5bigmd", "5bk3p7", "5bk3p7", "5bi956", "5bjrsd", "5bj3xo", "5bj4yq", "5bk81i", "5bj5mv", "5bkbuk", "5bj5mv", "5bj5mv", "5bk3p7", "5bjxd3", "5bk3p7", "5bj5mv", "5bk3p7", "5bj5mv", "5bk81i", "5bk3p7", "5bk3p7", "5bj5mv", "5bj5mv", "5bj5mv", "5bj5mv", "5bj5mv", "5bj5mv", "5bk3p7", "5bk7e2", "5bjpvl", "5bk81i", "5bk81i", "5bjxd3", "5bj5mv", "5bj5mv", "5bkbuk", "5bk3p7", "5bj5mv", "5bjpvl", "5bk81i", "5bk2of", "5bk81i", "5bk6xm", "5bkd5q", "5bj5mv", "5bj5mv", "5bj5mv", "5bk6hf", "5bj5mv", "5bk6ru", "5bk8jn", "5bk8jn", "5bjpvl", "5bizz9", "5bjomg", "5bi1pe", "5bk3p7", "5bi956", "5bk3p7", "5bj5mv", "5bj3xo", "5bk3p7", "5bkbuk", "5bj5mv", "5bkdif", "5bjpvl", "5bj5mv", "5bk6hf", "5bk2of", "5bj5mv"]}