{"comments": ["Hillary represents everything I hate about American Politics.\n\nTrump represents everything I hate about the American Media and the Billionaire class.\n\nI don't know how pride could even be a possible outcome from this election. ", "I think America has been calling itself the \"greatest country on Earth,\" for so long that it is nice to see some people realizing they have alot of work to do to live up to that title. I really hope this this election cycle will inspire some sort of positive change in the country", "This election has made me embarrassed for America. We look like idiots for letting this farce happen.", "I heard that they are very good with the cyber.", "Me: \"There's no way that this actually happened.\"  \n\n*reads article*\n\nMe: \"Son of a bitch.\"\n\n&gt; Asked by the moderator why he insisted on singling out and attacking Jewish journalists who reported stories critical of Trump Duke did not disappoint. “There is a problem in America with a very strong, powerful tribal group that dominates our media and dominates our international banking,” he declared. (Duke had previously claimed that a Jewish conspiracy secretly inserted the plagiarized portions of Melania Trump’s Republican National Convention speech that cribbed from Michelle Obama.)", "I am proud that there is a woman as a major party nominee just not proud of the nominee in question.", "&gt; (Duke had previously claimed that a Jewish conspiracy secretly inserted the plagiarized portions of Melania Trump’s Republican National Convention speech that cribbed from Michelle Obama.)\n\nI like how they just slip that in there at the end like nbd. That's fucking hilarious. ", "Dear Athens\n\nWe accidentally fucked up democracy. How fix?\n\nSincerely, \n\nUnited States of America. ", "I've been having some anger issues towards the boomers in general. My parents luckily aren't on the crazy side of the isle. But I'm still just feeling angry at a generation that had it immensely good and has had remarkably little hardship and enormous opportunity in their lives.\n\nAnd instead of being in any way grateful / appreciative / wise / aware of their good fortune, they've fallen into this totally selfish and self absorbed meltdown. Oh and it's is topped off with an astounding level of xenophobia. And let's not forget many of these people are **the children of immigrants**. \n\nIt's just enraging, these people are **adults** and they are acting like children having a tantrum.", "A database? Are you kidding? Do you realise how many floppy disks you'd need to store than much data?\n\nI think you'll find that they just print all 650000 emails and then post them to Bangalore where a team of laborers read through them all and highlight anything that looks classified before mailing them back again. It's called \"outsourcing\" and it's all the rage these days.", "Poor Sean Hannity has been sitting by the phone for a month hoping someone would just call and say hello.  He's so lonely.  Please call Sean Hannity.", "yeah! Good Smart people like us, Reddit! ", "The fact that most people would rather have Michelle over Hillary highlights how much the presidency has become about likability and fondness over actual policy and preparedness. ", "Obama gets his revenge. He took Trump's \"People are saying this I don't know if it's true\" rhetoric and threw it right back in Trump's face. ", "Lol my favorite part of this is if you scroll down and read his tweet about Lester holt\n\n\"Biased moderator Lester Holt has been married to his Jewish Wife since 1982.\" And it has a lovely picture of them above the caption.\n\nHow the hell is that a bad thing? A beautiful interracial couple surviving being taboo and catching side eyes for 34 years. And finally really making it to a point where what they are is not only tolerated in our country but accepted and more commonplace. What kind of reality do these people live in? That lasting love that transcends race and religion is somehow a bad thing? Fucking yeesh. Like I'm normally able to just dismiss this shit as ignorant assholes, but that really fucking got to me. ", "Trump should have his son take a crack at it - I hear he is pretty good with the cyber", "The average population is not very smart and can be taken advantage of. It's up to good smart people to prevent evil, smart people from taking advantage. It's as true today as it was in the past. People can be manipulated. ", "Neither one of them should have been.", "What about from Michael T. Flynn the retired Director of the Defense Intelligence Agency\n\n&gt; IMPOSSIBLE: \nThere R 691,200 seconds in 8 days. DIR Comey has thoroughly reviewed 650,000 emails in 8 days? An email / second? IMPOSSIBLE RT\n\nLOL", "pretty much.  This time around it was obvious because Trump had actual support (big) within reddit and that exposed a lot of dirty things.", "&gt; Khan whose speech was so well received by the audience it seemingly took him aback\n\nThis is what is so endearing about Khan. He didn't feel entitled to a good reception. He is no orator, but he is a really good speaker with a great amount of self awareness and restraint. He has been one of the few bright spots of an awful election year.", "No you can't make that kind of conclusion. He's *probably* an idiot.", "FWD: re: re: FWD: FWD: Omg he did it again", "And still more qualified than Trump! P.S. She was a Lawyer. Grad of both Princeton and Harvard so there's that!", "Plus filter out all of the email's not sent to/from Hillary's email server which was most of them because it was Weiner's laptop, not Huma's.", "Man being a Jew sounds absolutely freaking *exhausting*. When do they find the time to orchestrate all these things, especially the ones who don't work on Shabbos? I'm so grateful for being born into a long line of lazy-ass WASPs. ", "Go fuck yourself trump.  You lack any semblance of leadership. ", "Well you are talking about a former grand wizard, no? The hate runs very deep.", "It's funny to me that Trump acts like the FBI is a two bit operation.  That only one person is only looking at the emails.\n\nEven if you don't know about deduping one would imagine that the FBI would have many many people working on her case.", "My mother once said to me \"The thing about marrying money is in the end, *you always end up earning it.*\" \n", "Yet another justification for my suggestion for the official motto of the GOP for 2016\n\n\"Even worse in context Republicans 2016\"", "I don't feel sorry for him at all.  It's his job.  If he's letting his investigation get influenced by external factors then he shouldn't be in the position that he's in.\n\n", "&gt;could perform the necessary mental gymnastics\n\nWell they seem to have the training.", "Milo Yiannopoulos needs to spread himself over a fire.", "Another interesting angle to this is if Abedin unknowingly backed up emails and the FBI has now gone through those and cross referenced them with the materials Clinton submitted, it is a good indication that there are not swathes of deleted emails as has been reported. ", "North Korea and Putin would love to see the US fuck up so it makes sense that they'd support the fuck up candidate, who is of course supported by the fuck ups that are the KKK\n\nIf Trump gets elected, we're fucked", "Pretty much this.\n\nWhy couldn't the first woman major party nominee be someone like Elizabeth Warren? She's the one I wanted even more than Bernie but dropped out really early on.\n\nDamn shame too, she would have spent much of her administration prosecuting the heads of big banks for their crimes in creating the recession. Hillary is too /r/HailCorporate to do such a thing.", "Well it wasn't directly relevant to the quote, but it speaks volumes to his mindset", "Don't you know nobody on reddit is all that dumb. We love joining pun threads and giving our intelligent opinions, usually starting with \"(Demographic of discussion) here\"", "AZ born and raised. My hometown is typically blue and the town I'm living in now is very very liberal. I *know* that this state is republican but I've never seen it. I can't even imagine how frustrated I'd be if I were in the city or wherever it's Trumpstergrad. I've literally never seen a Trump sign or a person wearing \"Make America Great Again\" clothes and I'm very okay with that. I've been lucky enough to live in the blue spots on the Arizona map. ", "Even if you ignore everything you know about computers the FBI has lots of people. The best people, some might say. Very smart people. \n\nThe FBI has some 30,000+ people working for it. Now, obviously some of those people have more important things to do than read Huma's email. But you could literally just divide the 650,000 emails between 100 people and get it done pretty easily in a week. \n\nSo even if you're ignorant to cyber, you should at least understand what that many of the smartest, best people can do. \n", "&gt; and how we can change it.\n\nyeah that's not happening", "You mean the group of people who want to murder innocent journalists?", "Didn't Duke just claim that he wasn't *that* anti-semitic.", "We're gonna build a big horse.  It's gonna be the most amazing horse you wouldn't even believe.  Then we put our military in it so they can stop being a bunch of losers.  They can stop being a disaster.  Then we ring the doorbell on Mosul and the troops start the greatest surprise attack in the world", "Ranked choice voting.\n\nAdopt this and eliminate party primaries. Everyone runs in a single election. Everyone gets to vote for who they really want and some others that are also acceptable. ", "In any sufficiently large group of people most are idiots.", "Yes it was genuinely shocking how openly disrespectful both the nation and Congress acted towards Obama the second he stepped foot into office. \n\nA Republican House member (Joe Wilson) actually interrupted him in the middle of an address to Congress to call Obama a liar. \n\nMitch McConnell admitted the Republicans' new policy platform was to oppose everything Obama suggested and make him a one-term president. \n\nThe Republican Congress actually went out of their way to jeopardize diplomatic negotiations with Iran, and even went so far as to go behind the President's back and invite a foreign leader to speak to Congress and proselytize on how Americans should conduct their foreign policy to favor Israel's interests and positions over America's own. Did you watch the end of Netanhayu's propaganda-ridden speech? The apes in Congress gave him a standing ovation, when they couldn't even be bothered to clap for Obama and his proposals for cancer cure research during the State of the Union address.", "That's an iffy statement. He's liberal enough that even moderate republicans would have voted for anyone but him. Clinton is moderate enough to pull some votes from Trump. ", "That's the thing. A lot of voters are less proud regardless of what happens. I know this sub is staunchly against Trump but they seem to be missing the point here. ", "No this goes back further. \n\nThis kind of obstructionism and witch-hunting really took hold during Clinton's Presidency. Newt Gingrich turned Congress into a circus, and Rush Limbaugh gained a lot of notoriety. \n\nThen 9/11 happened, and shit really went crazy. Anybody who dared say, \"Hey, uh, maybe we should calm down a bit and think about this rationally,\" was screamed at for being a traitor and not supporting our troops. Yes, people who didn't want to send our children to war were told they weren't supporting them. It was insane.\n\nDissent was practically outlawed, and Bush and Halliburton pretty much fucked everything up, just as those \"traitorous\" protesters warned back in 2001.\n\nAnd then with Obama the GOP went completely off the rails, but had really learned how to cherry pick issues to make sure people stayed fired up and afraid.\n\ntl;dr: this has been going on for decades, and this is the logical conclusion. No matter how many times Progressives are proven correct, nobody ever listens to them the next time around. It's maddening. ", "He's had the biggest wake up call of his life.\n\nA fascist declares you guilty then searches for a crime.", "You're the puppet", "The long-term cost of getting Clinton into the White House this year will likely not be worth it.. I can't see her beating an actual politician in 2020.", "The alternative is the human equivalent of a dumpster fire made of feces so it's not exactly a hard choice.", "One guy is reading through the emails the other is organising lunch with Rudy Guiliani.", "I'm more used to the little parenthetical quotes being things like \"(&lt;x&gt; previously condemned this behavior in a prior visit to the university in 2015)\" or nonsense like that not \"(Duke thinks Melania's plagiarism is a Jewish conspiracy)\"\n\nIt just kinda tickles me tbh. ", "The thing about racists is there's not much to get. ", "Well we need to show up in two years and back senators who will stand with Bernie.  If we get him a coalition then Hillary will have to negotiate with him(If she wins)", "There is no such a thing as a safe margin in Florida. Nevada is different because its partisan composition of counties is similar to Illinois. Eventually Clark county is going to become a Cook county within the near future and it will likely place Nevada in the solid blue column.", "Impeachment hearings will start January 20 2017.\n\nTo quote Matthew Yglesias:\n&gt; Clinton’s critics know she’s guilty, they're just trying to decide what she's guilty of", "He has a son.  He's 10 years old. He's so good with computers Trump nominated him as Chief of IT.", "Well [ya say that....](https://m.youtube.com/watch?v=wDGLSRPQ5B4) ", "First robot president is a huge achievement for Robo Americans tho", "This is really unfair. We had an entertaining bigot candidate. And they take the entertainment away from us and that just leaves us the bigot!", "Wouldn't surprise me. After all he hasn't gassed any Jews for the past... month or two. He could be more antisemitic. ", "So statistically speaking you're an idiot?", "People blame Trump for creating an atmosphere of fear and hatred to opponents that has escalated to this point.", "Typical Trump Supporter.", "Voting in the dnc primaries was literally pointless because it was rigged ", "She really should make this a bigger part of her platform. It's hard to understand how the economy works but it's easy to understand the benefit of having a taco truck on every corner.", "\"His 60s\" not \"the 60s\". The comment is referring to Trump's age, not the 1960s. ", "There's a strong selection bias at work there.  If someone supports Trump they are not likely good at assimilating new information.", "I wouldn't. She has no experience whatsoever. ", "I mean I'm proud of that, but the fact someone like Trump could get anywhere fucking near the presidency outweighs it by several orders of magnitude.  ", "... after just having written Trump's latest campaign commercial (((masterpiece))).", "When he first conceded I was among them, but then I thought about it for a while and realized pretty much all of Trump's positions are contrary to Bernie's while Hillary's are mostly similar to, if not the same as his. Not to mention Trump is completely incompetent. Needless to say, I came to my senses real quick. I'd rather have a democrat who will have Bernie and his followers as a thorn in her side than a wildcard that won't listen to anyone, much less Bernie. Also he called Bernie \"Crazy Bernie\" (really clever btw, /s), why would he back the guy who thinks his policies are crazy?", "Damn. I don't enough to form a solid opinion on the Obama presidency but as a person, he's a savage. That was impressive and very entertaining.", "Someone who wants to be President.", "Free\n\nEducation\n\nMight\n\nActually\n\nCorrect\n\nA lot of\n\nMurcia's\n\nProblems.\n\nSeriously.\n", "Eh after 8 years as First Lady, you have a decent amount of experience. In any case, I doubt she'd be interested after already spending 8 years in the White House and seeing the toll it took on her husband.", "Honestly I'm concerned for Hillary's sanity. What kind of person spends 8 years watching all the stress and shit the president goes through from the closest vantage point possible, and then says \"yes, I would like that too\". ", "I find it hilarious that both sides vilified him for the same stuff. He investigated Hillary trumpers think he is a god. He clears her, Trumpers think he is paid off and the devil. He says they are investigating again. Somehow NOW he is on their side and the dems are pissed that he would try to sway the election. Trumpets think their guy, who wasn't their guy but is today, will finally indite on fake chargers. He clears her, Trumpers want him executed, dems are still pissed he brought it up.", "All the Republicans would have to do is call him a socialist and half the country would lose their minds.  Many others wouldn't vote for him because his plans would take too long to work.", "There is no sane version of the libertarians. Garry Johnson is the sanest of the bunch. He got booed at the libertarian convention for saying that he would've voted for the civil rights act. Also for saying that driver's licenses are a good idea to maintain public safety. ", "I was banned for saying it was rude to insult the parents of dead soldiers.  \nThey really need their safe space. ", "I totally disagree. First no one ever attacked Bernie. Hillary handled him with kid gloves. So there's no way of knowing if there's a scandal hiding in his closet somewhere. Second, he's a self-proclaimed socialist. That right there puts ~45% of the electorate against him. Finally, to the incredulity of people online, his policies are just not that popular. The general electorate hates taxes and can't understand that you need to raise taxes in order to fund Bernie's proposals. Check out the polling on ColoradoCare. It is going to fail probably by more than 40 points. If single payer can't pass in Colorado, what makes you think these ideas would be popular to a general electorate?\n\nTrump would coast to a victory against Bernie. All he would have to do is rant about socialism and communism and taxes. See!??!?!? My opponent admits he will raise taxes on the middle class! He will kill this country with his communism! America won the Cold War!!!!!", "Jews control the banks and the media they are ruining thus country, and some I assume, are good people.", "10/10 would bang head again", "I think my favorite part about this election is that the 25 years that the GOP spent building conspiracy theories about Hillary led to Trump being nominated who was one of the very few people who could lose badly to her. ", "Yes. I am voting for HRC but we shouldn't pretend that her email server was a 'nothingburger'. It was an enormous mistake.\n\nOur political discourse is too damn polarized. All of the disgusting vitriol against Cinton from the right makes me reflexively defensive of her... which is not so good. Democracy works best if politicans can be held accountable with reasonable criticism.", "I feel slightly sorry for him. He's a dog with too many masters and no matter what he says or does somebody in a position of power is going to be pissed at him and ready to make his life miserable.", "God man. I just like wanna sit and talk with him. I just wanna find out where this world view comes from and how we can change it. ", "To be fair if you are worried about that you can go to an early polling station or on the 8th and drop off your completed mail in ballot without waiting in line in the same bin all the in person ballots go in.", "Meanwhile in reality the actual voting machine CEO has in the past promised to deliver Ohio to the Republicans:\n\n&gt;IN mid-August, Walden W. O'Dell, the chief executive of Diebold Inc., sat down at his computer to compose a letter inviting 100 wealthy and politically inclined friends to a Republican Party fund-raiser, to be held at his home in a suburb of Columbus, Ohio. **''I am committed to helping Ohio deliver its electoral votes to the president next year,''** wrote Mr. O'Dell, whose company is based in Canton, Ohio.\n\n&gt;That is hardly unusual for Mr. O'Dell. A longtime Republican, he is a member of President Bush's ''Rangers and Pioneers,'' an elite group of loyalists who have raised at least $100,000 each for the 2004 race.\n\n&gt;But it is not the only way that Mr. O'Dell is involved in the election process. **Through Diebold Election Systems, a subsidiary in McKinney, Tex., his company is among the country's biggest suppliers of paperless, touch-screen voting machines.**\n\nBold text added by me, [Source](http://www.nytimes.com/2003/11/09/business/machine-politics-in-the-digital-age.html)", "You'd think all these evil organizations would be smart enough to pretend to support Clinton so they can make her look bad. I guess reverse psychology escapes these people.", "I can't believe she had the nerve to convince millions more democrats to vote for her. Et tu Hildawg? ", "They were kicking his wheelchair when he was being escorted out.  Are you fucking kidding me?  ", "Just all that pent-up economic anxiety am I right?", "You gotta grep the pussy.", "Honestly this outsized pride Americans have makes it really hard to feel sorry for them when they get in trouble.", "&gt;I hate Donald Trump\n\nDon't we all ", "The question of this latest round of investigating was \"have we seen these e-mails before?\" A computer is really good at figuring that out. \n\nThe previous investigation was \"are these e-mails important?\" A computer can only do a so-so job at that; certainly not enough to replace human brains.", "[Here is a video of one Trump supporter kicking the kid's mom as they are leaving.](https://twitter.com/TomLlamasABC/status/794936883700764672)", "That GenFlynn tweet is fucking hysterical to me. It's like this guy thinks he's being smart by doing that whole calculation as if it's supposed to be this triumphant gotcha moment, only to display his ignorance of the existence of basic database/search tools.", "And the racists/hateful prejudice (along with hate for minorities including females) out there. They seem to be more proud of the fact they can be more public because Trump has made it seem more ok. The discourse is horrid this election cycle even after the years of Obama, the first black president. ", "Marco Rubio said something profound when he lost Florida. \"What the media is doing and I'm not talking about you [the reporter], they played a role in this (rise of trump). The way they give out news is deeply damaging to our democracy\"\n\nHe's right. \n\nhttps://m.youtube.com/watch?v=ztdzg5kssXk", "40%+ of voting Americans actually support Trump.\n\nEdit: wtf with the downvotes. I'm just saying that not everyone hates Trump. ", "From the outside looking in (Europe) this place is incredibly biased towards Clinton. To be honest this subreddit could use a name change into /r/Clinton or /r/Hillary. I am not saying that everyone here is a Clinton supported I am saying that the majority of threads I find here are pro-Hillary.", "Yeah because CNN asking for a dialogue and permission from the DNC shouldn't bother anybody right?", "Exactly. The number 1 problem in America is that Americans don't see each other as Americans but a series of impostor groups imposing a fake America on them.... Which works real well for the 1%. Divide and conquer.", "It's our first woman president! **:D**\n\nOur first woman president is Hillary Clinton. **D:**", "They took our jobs. ", "&gt; these people are the children of immigrants\n\nYup. The most right wing person/rabid trump supporter I know is my 70something year old neighbor. Son of **refugees** from Hungary after WWII. Doesn't want any Syrian refugees here even though I'm sure Americans were just thrilled to have refugees from former axis countries come here after the war... \n\nPeople are dumb or incapable of critical thinking. \n", "To all of you Trump supporters that can't understand why Bernie Sanders' supporters would support Hillary Clinton here's why. We aren't simple minded and vote based on a candidate that promotes fear mongering, anger, prejudices, and hate. We vote because we are rational and understand and care about policy. \n\nWe are smart enough to know that of the two nominees that actually have a chance at winning, one of them may likely take us a step forward towards the policies and ideals we care about, while the other candidate is the complete opposite of what Bernie stood for and will regress our policies completely backwards. One of them we can probably put up with for the next four years despite her flaws, while the other's lack of policy and political experience, combined with his ability to bring out the worst of our country, makes us fear for the very stability of our country and at minimum fear for whatever terrible policies he will try to get passed.\n\nEdit: a word", "I heard Wikileaks released emails showing people from CNN emailing the DNC asking for questions to ask Trump Ted Cruz, and other Republican politicians to make them look bad in interviews.\n\nIf this is true, that would be pretty damning huh? \n\nScumbag media. \n\n", "He seems to know how to defend against intelligence pretty well.", "You are entirely right.\n\nWhich is hilarious because about two months ago this place was filled to the brim with bernie or bust people.", "Honestly my pride in America went down the shitter when we found out for sure that Iraq was a bogus war. I was outspoken against invasion pretty much from the start, but I didn't think the Bush administration was knowingly and willingly lying about it. Since then, paying taxes is just paying rent to me.", "Tribalism and logical divisions. It's far beyond race. It's segregation based on ego development lines and product choices.", "I told someone that I would vote for Richard Nixon over Donald and we started seeing how low the bar had been set.\n\nThe last person I picked over Trump was Caligua because he was kind to animals.", "&gt;And I definitely feel there should be some safeguards in place from letting a petulant manchild like Trump from running.\n\nThe voters in the primary should have been.  ", "You know every time I start getting the feeling that we're (redditors), just as dumb as all the other interneters out there, I go and read the comments on youtube videos and yahoo articles. ", "And Trump could have been smart and gracious.\n\nNo wait he couldn't.\n\nOne reason I felt so much anxiety as Trump headed to the GOP nomination was because I knew that at some point he'd do the pivot and start acting like a President.\n\nHe didn't, he kept being the Donald.  \n\n ", "Scalia was a terrible justice.  People who lamented the loss of \"a great legal mind\" were all spreading bullshit.\n\nScalia was not a great legal mind.  Exact opposite in fact.", "I don't get this argument. The media has covered the email scandals more than any other topic. They frequently ignored other stories so they could cover Trump. Hell CNN which is supposedly the worst one ignored the press rally hosted by trumps accusers so they could stream his rally.", "Eli5 please why did it take 8 months to analyze the first thirty thousand emails? Is that even true? ", "I can't believe people actually think Bernie would support Trump. Like what planet do they live on? Bernie's an Independent not a crazy person. While he might not fully agree with Clinton on stuff at least she can be reasoned with and has actually changed some parts of her campaign to align with things Bernie wants to see done. Trump on the other hand...good god where would Bernie even start with that man.", "Sometimes I think about how happy Obama must be to see the GOP get their own shit served to them.\n\nHe's *incredibly* classy through it all I think if I was in that position I would call out each every piece of bullshit that I saw. Then again, that's probably why I'm not POTUS :(", "A state *is* comparable to a small county. ", "Trump :: Goofus\n\nObama :: Gallant", "If you want to know how we should teach future generations - Trump is an excellent yardstick . Just do the opposite of what he does and what he stands for. But hey he's made being an asshole socially acceptable ! Cool huh? ", "I unsubscribe and resubscribe through the years and I was shocked to see how much this subreddit was shitting on Wikileaks.  They used to be prime circlejerk material here.", "emails mentioned\n\nhttps://wikileaks.org/dnc-emails/emailid/23554\n\nhttps://wikileaks.org/dnc-emails/emailid/25284\n\n", "Depends on whether you're looking at the list of 'developed' countries or all countries, I guess.", "Or truck nuts on their trucks. Or rebel flags on their truck nuts. ", "Why wouldn't people believe the media has thrown in for Hillary? The cable companies that own the media have directly contributed to her campaign creating false polls, and she's been caught getting debate questions beforehand. Cmon dude\n\n", "Good news for you Hillary supporters out there- it turns out the vague yet menacing letter released by the Sheriffs Secret Police was simply a test of Night Vale's ability to turn any new information whatsoever into a raging scandal. In a press conference earlier today a representative from the sheriff's secret police, clad in the customary short cape, blow dart chest-belt and tight leather balaclava, explained: \n\"We were just trying to gauge how fast the town would react should a real scandal emerge. Say, a scandal involving certain public figures who may or may not be using law enforcement funds for rave parties in the school auditorium.\" \nHe went on to explain that the fact that this fictional scandal had been targeted against one of the leading candidates in a neck and neck presidential race was pure coincidence. The representative refused to answer any follow up questions and disappeared in a cloud of mustard gas, blinding reporters and civilians alike. Unfortunately, I had sent Samirah the intern to get some boots on the ground coverage of the event. Which reminds me- to the family of Samirah the intern, she was an excellent intern and will be missed. \n\nWell, Night Vale? I think our town passed this 'scandal test' with flying colors. Not only did we leap to conclusions faster than many thought humanly possible, but a few intrepid souls took to the streets, demanding the head of a presidential candidate without doing any research into the issue whatsoever. All in all, a good day for democracy. \nUp next, an interview with the caterpillar who just crawled onto my desk. But first, a word from our sponsor.", "Step 1: Put it into Excel\n\nStep 2: Go to Data &gt; Remove duplicates\n\n~~Step 3:~~\n\nOh we're done.", "After 30+ years of shit being thrown at her I doubt anything affects her anymore. Say what you want about her but she's tough as hell.", "America has an infant mortality rate of 100% what a horrible country. ", "but the DNC election was all good? not rigged or anything right? /s", "Imagine if Clinton was Jewish? The conspiracy theories would get even wilder if possible.", "Holy shit i had to glance outside to see if I could spot pigs flying. A pro Hillary opinion piece from Fox. That in itself is news!", "&gt; in America all deaths after birth is counted.\n\n......Wouldn't that just be all deaths in general. ", "First of all he didn't \"survive\" shit... he's 72 so he was 1 when WWII ended. Also, I'm not that young. The lesson of WWII is to not elect a demagogue who blames complex socioeconomic issues on minorities, says he alone can fix things, declares elections \"rigged,\" and says he may not accept the outcome. Apparently something he didn't learn.", "Hang on I need to change my typewriter's ribbon...", "You think Bush gave you a bad reputation around Europe? Donald will be on another level.", "Uhhh did you read what you linked?", "For anyone that thinks what you say is far fetched check into Pence.  He did try just that for Indiana.", "No he's a 400 lbs fat nerd", "Oh thank god. Now we can have Bowie back.", "No 400 lbs fat nerd. \n\nNo 400 lbs fat nerd. \n\nNo you're the 400 lbs fat nerd.", "Or you know..../r/the_donald", "Satire: the use of humor irony, exaggeration, or ridicule to expose and criticize people's stupidity or vices, particularly in the context of contemporary politics and other topical issues.", "&gt;RT\n\nFucking LOL", "God the Democrats need to REALLY make sure they pay back the Latino electorate for this and don't just allow the Republicans to sweep immigration under the rug. If they try filibustering and voting down immigration reform, they need to make a MASSIVE deal over it and make sure the Latino voting bloc continues to turnout like this in future elections and continues to gravitate further into their corner. If Democrats can make sure that minority issues are taken very seriously in their party and also maintain a presence with white voters, they're golden going into future elections as minorities will continue to increase their share of the country's electorate and turnout at large amounts, and white liberals/moderates can fill the remaining gap on Election Day. It also wouldn't hurt them to become more in favor of protectionist policies to appease white middle class voters in the Mid-West. That's why Trump is likely to win Ohio.", "If you support Bernie's principles you can't in good faith vote Trump. Trump will get at least two Supreme Court nominations who will obstruct any legislation that someone like Bernie would support. ", "I follow wikileaks on Facebook and everyday there's some anti Hillary stuff coming out. \n\nThey even share a video which is an interview of a Slovenian philosopher about he would rather vote Trump. \n\nIt's almost shocking to me that wikileaks has turned into something like this. ", "Regardless of how ridiculous and clownish American politics is they are still a developed country. To say otherwise is ridiculous. ", "You are a sad sad person.", "Seriously.  Feeling bad for these women while making fun of Trump's sons is a form of sexism. THESE are grown ass women capable of making their own decisions and if they were really good people they wouldn't be compromising their morals for inheritance money. However, because they're attractive women,  they garner sympathy for some reason.  ", "I'm ok with Hillary. She's a politician but IMO not really any worse than many other presidential candidates. \n\nBut yeah, the republican party will have to look into what's been happening with its primary process, which was a debacle from day 1, with too many non-serious candidates. ", "HE KNOWS MORE ABOUT ANALYZING EMAILS THAN THE DIGITAL FORENSICS EXPERTS AT THE FBI!!!11", "Or the same time on /r/politics. Its all the same crap.", "I can't believe Trump's gang assaulted assaulted a disabled kid!!! These people are nothing less then domestic terrorists. We need to lock this man up before he harms another child. #LockTrumpUp", "This article isn't about David Duke but you might be interested in how [his Godson](https://www.washingtonpost.com/national/the-white-flight-of-derek-black/2016/10/15/ed5f906a-8f3b-11e6-a6a3-d50061aa9fae_story.html), son of Don Black's infamous Stormfront website, got out of it. Trump supporters should take a read, as well. ", "I cant go outside without seeing someone wearing a trump shirt or hat I live in the most conservative city in Arizona though so it makes sense.", "There's nothing comforting about the thought of a narcissistic sociopathic ignoramus being leader of the free world.", "Next thing you know the Cubs will win the pennant!", "I mean..  whenever I use Google it takes me 3 months to get my search result back.  They need that much time for Larry Page himself to search through all the web pages to find what I'm looking for.\n\n/s", "Ah yes the MLK strategy. Wait on your ass until someone else makes change happen. That's why he gave all his historic speeches from his home couch while watching the Price is Right.", "In the manner that Charles Manson was the nice guy when compared to Hitler because he was responsible for only a fraction of the deaths of the other guy.", "Flagstaff and Tucson for sure.\n\nAlso Nogales Page, Winslow, probably others but that's all I know off the top of my head. We've got pockets here and there, but it's rarely enough to swing it blue statewide. ", "I just want to say how much I enjoyed this comment. ", "Opinion page but... FOX????", "When the higher ups want stats for the million emails sent within the last year I can get it to them in a work day. And that's starting from scratch. If they ask me to do it again, it can be done in an hour. Most of the time just massaging the presentation of the data. Running the actual queries takes a couple minutes.", "My fellow Utahns please get out and vote! I know it can be hard and it can feel like your vote doesn't matter in a state like this, but the Republicans are tearing themselves apart. If we can keep these numbers up on election day, there's the possibility that we can carry the state if McMullin and Trump split the vote. Don't give up!", "Yes. I feel very secure branding anyone who would advocate the lynching of journalists as a dangerous fucked up person. \n\nI'm not American, but I have always admired Americans' commitment to freedom. Freedom of speech, freedom to bear arms against authoritarians, freedom of the press, etc. Very disappointing to see that half of Americans value hate and fear more than freedom.", "NO DONG. No dong. YOU'RE THE DONG.", "Trump could be caught red handed on camera in a rest stop bathroom paying for and getting a BJ from a trucker and the Trumpers would rationalize it by saying \"he was going to the bathroom, and he tripped while pulling up his pants, and fell right dick first into the open mouth of the trucker. It was just bad luck that the photographer walked in when he did, he didn't get the full story!!!!! Rigged!!!!!\"\n\n\nIn their minds, he is culpable for nothing that can be seen as remotely negative. The double standards and delusions they subscribe to are astounding. ", "You're right racists and bigots are *cool*..?", "Trump admits he can get away with grabbing women's pussies because he's \"a star\".\n\n~~Clinton emails.~~\n\nTrump charity fraud.\n\n~~Clinton emails.~~\n\nTrump calls for nuclear proliferation.\n\n~~Clinton emails.~~\n\nTrump calls for national stop and frisk.\n\n~~Clinton emails.~~\n\nTrump violates trade embargo with Cuba.\n\n~~Clinton emails.~~\n\nTrump sued over Trump University fraud.\n\n~~Clinton emails.~~\n\nTrump bribes District Attorney.\n\n~~Clinton emails.~~\n\nTrump doesn't pay taxes for 20 years.\n\n~~Clinton emails.~~\n\nTrump disparages a gold star family.\n\n~~Clinton emails.~~\n\nTrump threatens to jail his enemies in fascistic style.\n\n~~Clinton emails.~~\n\nTrump threatens to restrict freedom of the press in fascistic style.\n\n~~Clinton emails.~~\n\nTrump calls for ban of an entire religion from entering US.\n\n~~Clinton emails.~~\n\nTrump demands deportation of undocumented immigrants and their American-born children.\n\n~~Clinton emails.~~\n\nTrump lied about support for Iraq War over and over in debate.\n\n~~Clinton emails.~~\n\nTrump in court for rape of a minor.\n\n~~Clinton emails.~~\n\nTrump unaware of Russia's Crimea occupation.\n\n~~Clinton emails.~~\n\nTrump unaware of situation in Syria.\n\n~~Clinton emails.~~\n\nTrump penalized for racist housing discrimination.\n\n~~Clinton emails.~~\n\nTrump files for bankruptcy 6 times.\n\n~~Clinton emails.~~\n\nTrump goes 0-3 in debates by showing scant knowledge of world politics.\n\n~~Clinton emails.~~\n\nTrump calls the most famous American POW a loser for getting caught.\n\n~~Clinton emails.~~\n\nTrump said he wouldn't necessarily defend allies in NATO\n\n~~Clinton emails.~~\n\nTrump threatens to nullify trade treaties destroying faith in U.S. credibility\n\n~~Clinton emails.~~\n\nTrump calls Mexicans rapists.\n\n~~Clinton emails.~~\n\nTrump questions judge's integrity because of parent's heritage.\n\n~~Clinton emails.~~\n\nTrump deletes emails involved in casino scandal.\n\n~~Clinton emails.~~\n\nTrump commits insurance fraud after Florida hurricane.\n\n~~Clinton emails.~~\n\nTrump has 75 open investigations into his business practices.\n\n~~Clinton emails.~~\n\nTrump has dozens of assault victims and witnesses come forward with allegations of abuse.\n\n~~Clinton emails.~~\n\nTrump attacks former Ms America for being overweight.\n\n~~Clinton emails.~~\n\nTrump tweets about sex tapes at 3am.\n\n~~Clinton emails.~~\n\nTrump calls for US citizens to be sent to Gitmo.\n\n~~Clinton emails.~~\n\nTrump calls for more extreme forms of torture to be used.\n\n~~Clinton emails.~~\n\nTrump asks why cant we use our nukes if we have them.\n\n~~Clinton emails.~~\n\nTrump calls for offensive bombing attack on sovereign nations because someone gave the middle finger.\n\n~~Clinton emails.~~\n\nTrump calls to kill women and children of suspected terrorists.\n\n~~Clinton emails.~~\n\nTrump says women should be punished for having abortions.\n\n~~Clinton emails.~~\n\nTrump mocks a disabled reporter for being disabled.\n\n~~Clinton emails.~~\n\nTrump calls for end of freedom of the press.\n\n~~Clinton emails.~~\n\nTrump calls global warming a Chinese hoax.\n\n~~Clinton emails.~~\n\nTrump praises Putin and Kim Jong Un's strong leadership.\n\n~~Clinton emails.~~\n\nTrump openly admits to not paying his employees during debate.\n\n~~Clinton emails.~~\n\nTrump calls Obama an illegitimate non-citizen hundreds of times over for 7 years.\n\n~~Clinton emails.~~\n\nTrump uses campaign donations to enrich his own businesses.\n\n~~Clinton emails.~~\n\nTrump first candidate to refuse to release tax returns.\n\n~~Clinton emails.~~\n\nTrump says Ted Cruz involved in JFK assassination unironically citing National Enquirer.\n\n~~Clinton emails.~~\n\nTrump's campaign manager involved in illegal corruption with Russia, forcing him to step down and triggering FBI investigation.\n\n~~Clinton emails.~~\n\nTrump says election is rigged ... unless he wins.\n\n~~Clinton emails.~~\n\nTrump encourages followers to commit blatant voter fraud.\n\n~~Clinton emails.~~\n\nTrump encourages voter intimidation through \"poll watchers\" in minority precincts.\n\n~~Clinton emails.~~\n\nDonald Trump’s companies destroyed emails in defiance of court orders \n\n~~Clinton emails.~~\n\nYears later, Trump thinks Central Park Five still guilty, despite DNA evidence to contrary.\n\n~~Clinton emails.~~\n\nTrump says laziness is an inherent trait in black people.\n\n~~Clinton emails.~~\n\nTrump lies about fake assassination attempt.\n\n~~Clinton emails.~~\n\n**A fascist declares you guilty then searches for the crime.**\n\ncredit to /u/ilikelegoandcrackers", "This should be higher up. Trump was never part of the GOP plan. Jeb had a real shot at the Whitehouse and the Trumpers fucked it up.", "I find what he sed awk-ward", "I've seen interesting things written about how candidates/presidents have become a lot more attractive/likeable since TV became a household thing in the 50' (JFK probably being the first really good example of this). ", "You must not be very good at cyber", "No one is asking you to vote for Clinton. That guy was just saying that voting for Trump is going against Bernie's principles.", "You've got to be kidding me.", "So many despicable traitors in this sordid episode of history I've said for twenty years that republicans have become unfit for governance.\n\nSeriously, what is that plastic, soulless Conway hack thinking?  \n*\"My immediate job is to put him in the most powerful position on the planet, but he's so childish and petulant and unstable it's infuriating!  Yet I'll keep on trying my utmost.\"*  Then let's say that in an alternate universe he wins the White House, what then, with that petulant instability?  \nThere may not even be a self-aware *\"Oh shit, what have I done?\"*, quite possibly.  If it turns into a national catastrophe, does she rationalize it as *\"Hey, it was just a job\"*, or *\"At least it's not another Clinton\"* (who she's irrationally despised for over twenty years).\n\nAt most charitable, these imbecilic people don't think things through.  At worst she's a traitor, whose blind hatred would help destroy the country and maybe take a few other ones along for the infernal ride.", "He's ruthless and clever but not very knowledgeable. There's different kinds of 'smart'. He hires knowledgeable people to advise him.\n\nThis isn't a pro-Trump post, just an observation.", "Both sides are saying that! From what I've heard a lot of the people voting Trump don't really like him,  they just really hate Hillary and/or democrats.", "Hillary represents everything I hate about politics. \n\nTrump represents everything I hate about Americans. ", "&gt;Trump supporters responded by **“chanting ‘U-S-A’ and pushing his wheelchair”** \n\nThat's a new level of pathetic.", "    $ grep pussy\n\n    grep: cannot grep pussy: Permission denied\n\n    $ echo \"never stopped me I'm famous\"", "Comey dumped useless but politically charged info a week before the election.  Two days before the election he walks it back because it turns out it was bullshit.  But what Comey did had a profound impact on national politics.  The presidential race is now within the margin of error and he may have damn well flipped the Senate majority singlehandedly.\n\nIt is not appropriate for federal law enforcement to be arbitrarily picking and choosing what unsubstantiated scandals will be headlines today.  This is brazen electoral interference and people deserve to go to jail for using their sworn office in this fashion.", "Foreigner here. The Democrats seem right wing enough why not replace the Republicans with a left wing party?", "&gt;The question of this latest round of investigating was \"have we seen these e-mails before?\" A computer is really good at figuring that out. \n\nThis is answer right here.\n\nThe first time you have to read and analyze and reason and check with other departments. \n\nThis time, the question was \"have we read this already?\". Emails have unique IDs, and like the article states, you can create unique IDs from emails. It's basic programming to create something that looks at two lists and finds the items that exists in both.", "Dear USA\n\nUnfortunately if your democracy is corrupted the best way to ensure stability is to reinstall from recovery media. Please note that you will lose any unsaved constituents, so please make sure to back them up before this procedure.\n\nSincerely, \n\nAthens.", "or more than one single person performing the task.", "I know right? The Democrats are more right wing than most countries right wing. \n\nHere in Canada the Conservatives had 10 years to ban Gay Marriage, abortions and cancel free health care. They didn't, and they won't.", "&gt; The reality is that both groups are equally responsible. \n\nI am a fucking scientist and I am totally sick of this shit. \n\nWhen one party says global warming is a hoax and the other is does not, both parties are not equally wrong. \n\nWhen one candidate calls for tariffs and mercantilism to the objection of nearly 100% of economists, whose job it is to *study this shit*, and the other candidate does not, both candidates are not equally wrong. \n\nWhen one party cuts taxes as a matter of literal dogma and cuts education, job training, and welfare for the poor to pay for it, and the other party advocates investment in The People, both parties are not equally contributing to desperation of America's poor and disintegration of our physical and social infrastructure. \n\nWhen one party fights unceasingly for the complete and utter destruction of unions and the other does not, both parties are not equally responsible for stagnating or falling wages of blue collar workers.\n\nWhen one party restricts birth control and abortions resulting in large numbers of the poor having children they are unready or unable to fully support and the other does not, both parties are not equally at fault for child poverty and the social consequences of hundreds of thousands of children raised in squalor with absent parents.\n\nWhen one party is hell-bent on demonizing all drug users as irredeemable and morally depraved criminals deserving of harsh and unforgiving punishment and the other fights against private prisons and pushes for light sentences and rehabilitation, both parties are not equally responsible for the sustaining of a criminal underworld, drug violence, and drug abuse. \n\nWhen one party advocates a national effort to get cheap and ubiquitous broadband to everyone and everywhere while the other party literally passes legislation essentially prohibiting competitors from threatening regional telco monopolies, both parties are not equally at fault for 20+ years of double digit Internet price inflation. \n\nWhen one party pushes for health care for all, even the poor, and the other party obstructs to the point that a flawed bill has to be passed, and that party continues for 8 years pushing to rescind health care from 30 million people while **not even once** ever proposing alternative policy that expert analyses determine would control prices or decrease the uninsured population, both parties are not equally to blame for the continuing health insurance and health care cost and availability crises. \n\nWhen one party unilaterally and unwaveringly opposes any and all legislation by the opposing party **for 8 years,** regardless of merit, for the very political purpose of preventing the opposing party from having any good news and capitalizing on the resulting anti-government sentiment, additionally: causing government shutdowns and sequesters; neglecting or substantially delaying bills that address real problems and would actually help ordinary people; creating backlogs in the judicial system to the point of dysfunction; undermining the respect for, and trust of, the vital institutions and organs of government; all the while the opposing party compromises again and again and again and caves to hardball partisan demands when the country's welfare and international reputation are on the line, both parties are not equally responsible for the dysfunction in Washington. \n\nThe Democratic party is not a beacon of wisdom and knowledge. Its obsession with mass shooters and good-feel gun legislation that is fundamentally incapable of stopping them, its demonization of gun enthusiasts who own guns that look scary but are functionally no different than an old hunting rifle, and its preoccupation with fixing loopholes that are virtually never used by violent criminals, rather than focus on the actual source of guns used in crimes (that is, the black market of stolen guns) is unhelpful and needlessly antagonizes about half of the country. Further, its condescending attitude towards rural, religious, and conservative people and its appeasement and often tacit approval of what I would call militant and often racist SJW demagogues has contributed *greatly* to the racist anti-social justice reactionary backlash on the right. \n\n**But no objective analysis of reality could possibly conclude that both sides share equal blame for the current situation in America.**", "Are you really that surprised by a Trump supporter's behavior?", "\"Man with eight Confederate flags on his truck tells man with only three Confederate flags on his truck to go back to Afghanistan.\"", "The media created Trump. I don't get how people can say the media is totally hostile to him. He wouldn't exist without the insane levels of coverage they gave him.", "I guess but it makes no sense to make an argument that America isn't a first world country, and then take statistics to prove that point *from a list of first world countries*", "At least Sanders wasn't Trump's opponent. The antisemitism from his camp is already bad enough imagine if he was actually facing a Jewish opponent.", "It's situations like these where you have to just suck it up and pick the lesser of two evils.  Voter suppression or fair representative democracy -- it's a hell of a tough choice.", "&gt; but dropped out really early on\n\nShe was never running. Warren hasn't run for president ever. ", "The fact that we share a country with these people is depressing. I guess they take cues from their nominee in treating disabled people and other vulnerable groups like shit. Absolutely no decency whatsoever. ", "Remember when Republicans raised hell when the DOJ noted the need to keep an eye on radical right wing groups?\n\nPepperidge farms remembers ", "\"Don't boo vote\"... is what an adult might have said.\n\n\n", "I work on designing &amp; implementing large scale machine learning pipelines and much of the data pipelining/infrastructure around that. Do a fair amount of model building and statistical analysis. Background is in pure math/CS.", "What did she actually do. Don't answer in a meaningless platitude. \n\n If you're trying to correct people about 'a great legal mind' give the facts of the case.", "\"An email a second!\"\n\n650k emails over a hundred people is 6500 emails per person. Twelve hour days that's 60 hours over a week, or ~100/hr.\n\nCan I scan 100 emails per hour? Yes... Can you? Yes... Can a trained FBI agent? Yes...\n\nWho the fuck thinks this is rocket science?\n\nMost emails are going to be risotto recipes, so you can scan that in just a few seconds. Big emails might take a couple minutes. Sounds mind-numbing, but totally reasonable.\n\nOf course, you could just run a quick filter on to, from, cc/bcc, and content, and cut out the bulk of the emails anyways, because they're irrelevant. You could most likely do the job in a week with two forensic tech guys and a dozen agents who got unlucky and have to actually read stuff. After the first half hour when 90% of the content is marked irrelevant, the tech guys can run all manner of searches on the remaining material to prioritize emails that look interesting.", "I'm not sure if I'm sadder that it happened or that I'm not surprised it happened.", "I think your being a bit naive if you think America (or any of the big super powers) involves themselves outside if it isn't in their self interest. Yes there is aid donation but I'm presuming you are thinking of the 'world police aspect', you don't think it's a bit suspect how much effort america (and the west) put in to middle east (lots of oil there), or asia (where having a military base is a foothold against china), but don't really care in the slightest about the genocides in Africa?\n\nMaybe I'm jaded, but I don't believe for a second any western government cares about other countries, they care about strengthening the country you live in, at the expense of others if needed. They will not send money abroad unless forced to (ie enough pressure politically that they are starting to look bad not doing so) ", "also any non-tech-savvy person who knows the term \"man-hour\".", "Can't be true. T_D says she's totally behind in NH. And NV FL, PA, NC, MI, and 57 other states.", "They shit on anything that is even relatively against Hillary's favor\n\nLook how they hate 538 now for just saying Donald *has a chance* not even that he will win", "I understand some of these words.", "Day 1: How do I perl?\n\nDay 2: How do I regex?\n\nDay 3: Why is my regex broken?\n\nDay 4: 90% of emails correctly marked irrelevant due to not being from to, copied to, or about her.\n\nDay 5: fix bugs, drink a beer or two.", "Quite the shift from earlier in the year when this place was super anti-hillary. ", "&gt;FWD: re: re: FWD: FWD: Omg he did it again\n\nconnects to Britney Spear's *Oops I Did It Again*\n\n&gt;I played with your heart, got lost in the game\n&gt;\n&gt;Oh baby, baby\n&gt;\n&gt;Oops, you think I'm in love\n&gt;\n&gt;That I'm sent from above\n&gt;\n&gt;**I'm not that innocent**\n\nGROUNDS FOR INDICTMENT!", "You missed out the outrageous gun violence sub-par education and highest incarceration rate of any western country", "Election rules are set up by state governments. Most of the places experiencing problems are controlled by Republican state legislatures. These are the folks passing voter I.D. laws and closing polling places (which typically tend to be in largely democratic areas). \n\nOhio Nevada, North Carolina, Georgia, Pennsylvania. Pretty systematic.", "cringe", "Man I had hoped that when I looked this man would have retired from the DIA in the 80s.\n\nNo such luck.\n\n&gt;On April 17 2012, President Barack Obama nominated Flynn to be the 18th director of the Defense Intelligence Agency. Flynn took command of the DIA in July 2012. In October 2012, Flynn announced plans to release his paper \"VISION2020: Accelerating Change Through Integration\", a broad look at how the Defense Intelligence Agency must transform to meet the **national security challenges for the 21st Century**\n\nThe solution? \"Computational science briefing: What are computers and how do they work so fast?\"", "The other option is Trump as president. The notion of a third option is not real in the US.", "I'll keep you in suspense", "\"If we have X emails and each email takes Y time to review, how many man-hours is that? How many man-hours in a week? Let's get that many people on it.\"\n\nIt's really not that many people.", "Yeah. And even another child with cerebral palsy would still have known better than to kick at a disabled kid's wheelchair.", "Divide and Conquer... Isn't that what American politics is all about when you only have two sides, the partition will be huge. Other countries solve this by having three or more alternatives to vote for. Maybe that's something to be less ashamed of.", "This really feels like the overlooked part of all this shit.  I don't care what kind of system we have in place if the primaries are these hellishly partisan convoluted messes that take all day, then of course they'll only attract extremists with nothing better to do, which then feeds into itself (who wants to argue with them all day to be reasonable), and gets morons up there in the first place.", "650m immigrants.\n\n650k emails.\n\nCOINCIDENCE?????????//", "Nothing like a ludicrously manipulative conniver who leans entirely on emotional canards as a campaign strategy to really break down those shitty stereotypes about women.", ".....Are you really going to try to argue that the Iraq war wasn't the Republicans fault? ", "&gt; \"He tells it like is.\" \n\nYou would think Trump supporters would have more respect for Obama because of things like this. Instead the only time is when it fits their agenda (i.e in 2008 when he was competing against Hillary).", "Shit you're right. That would have been pretty insane as well.", "Remember when Hillary Clinton was President 2001-2009? Me neither. There was this Republican named George W. Bush. \n\nListen the President has massive power in foreign policy, especially after a 9/11 type event. Congress has never really been able to regulate foreign policy or the military in a war-time situation. The President calls the shots and Congress goes along 99/100.", "Let's go over recent history...\n\n**Republicans started:**\n\nIraq War - 3836 US troops killed\n\nAfghan war - 1,954 US troops killed\n\n**Democrats started**\n\nISIS bombing/special forces campaign - 4 US troops killed\n\nKosovo War - 4 US troops killed\n\nIntervention in Haiti - 1 US troop killed\n\nPeacekeeping in Somalia - 29 US troops killed\n\n**Hillary Clinton wars started**\n\nNone.\n", "Rigged for which side? Former Romney advisor: https://twitter.com/stuartpstevens/status/795312485062606848", "As if Cruz is going to do shit. He's probably the only issue both parties agree on: everyone hates the guy. He lost any credibility he had the moment he endorsed Trump after Trump insulted his wife and plus he made a big show at the RNC of not endorsing him. ", "Trumpets know that the only way they can possibly win is misinformation and lies. \n\n(Also gotta love the idea that Hillary will somehow be more of a warhawk than a guy who wants to attack Iran for rude gestures.) ", "I'm pretty sure that's normal. They get suggestions from the RNC for questions addressed to Democrats. ", "Yeah well, we'll just have to wait until all those states vote on the 28th.", "I'm not concerned. Up until recently I lived in the midwest and worked in and out of industry (warehouse/factory work mainly). I heard the same rabble four years ago and four years before that, and four years before that. Mainly just macho backwater white trash gun nut rabble from Podunk, USA. ", "So should Cory being employed by CNN as their talking head whilst colluding with the Trump campaign.", "Lol Hillary could have murdered him with her bare hands and she would still make a better President than Trump. \n\nHow low the Republicans have fallen. ", "[Vince Foster was my brother. Donald Trump should be ashamed.](https://www.washingtonpost.com/opinions/vince-foster-was-my-brother-donald-trump-should-be-ashamed/2016/05/26/95c684f2-233f-11e6-8690-f14ca9de2972_story.html)", "They don't think they're evil. In their mind the Kkk think they are helping Trump.", "No.  She doesn't like her tax money going to poor people.  ", "No thank you that sounds terrible. I honestly do not care if a person is Jewish or not.", "What's the problem?  If you want good questions ask the DNC and the RNC for input.  ", "http://i.imgur.com/pyxT7QV.jpg", "&gt;if you take away the defining characteristics of person they are different", "&gt;hrc supported it at the time.\n\nNo one mentioned support... We are talking about who started the Iraq war. Try to keep up. ", "Whew you bunch are really out of options, aren't you?", "Your last part is actually becoming less true every day.\n\nTAR (Technology-Assisted Review) is a thing and it is a system of training a machine to look for relevant material in investigations. I work for a company that does a combination of that and intense keyword review to reduce the review footprint of a broad collection of documents. While it is still prudent to have human eyes on it sophisticated programs that attempt to relieve the high amount of effort that goes into review is happening, and it likely will remove that part of the legal profession in around 20 years.", "If by linked you mean knew a guy who committed suicide, then sure ", "Nothing they released was particularly news-worthy a lot of what they released were grievous violations of privacy, and their ultimate intent was to influence an election because of a personal grievance by the organisation's megalomaniac leader.\n\nCompare this to 5 years ago when wikileaks was working together with major reputable news organisations to vet their information, release only what was relevant and news-worthy and do so to expose war crimes. \n\nThere's no doubt that the credibility has been shot to the ground, and it's a shame, as I think it would be good to have an organisation like wikileaks was 5 years ago, a safe place for whistleblowers to send important information for public disclosure. ", "I wasn't even the slightest bit interested in politics less than a year or two ago now I'm watching the election like a hawk\n\nAnger, dismay, disgust, confusion; I wished I stayed out of it.", "Every choice is between the lesser of two evils. Life isn't simple but humans like to pretend it is.", "Another factor is that Soros is the Fox-News response to all the dirty laundry that's been dug up on the Koch Brothers over the last decade or so. The conservative media was desperate to find some example of a lefty they could accuse of being just like the Koch's. In reality what Soros does is *nothing* like the Koch's operation, but it hardly matters, it's all just a new tool for the deflection and projection machine.", "I am a Nigerian Prince.  Give me bank account my gullible friend.", "&gt;  If someone supports Trump they are not likely good at assimilating ~~new~~ information.\n\n", "Because he thinks the 1000 Trump scandals and the one email scandal are not equal - he thinks the email scandal is much worse. So of course it should be covered. But covering any of the Trump scandals is wrong because Trump said so.\n\nIt's like Trump Baldwin said \"I said it and now half the country believes it.\"  ", "Step 3: cocktail hour!", "Remember when Texas seceded after Obama won?", "I specifically remember from grade school about how the JFK-Nixon debate was the first one to be televised.  The general opinion of people who saw the debate on TV was that JFK won while the people who listened to it on the radio thought Nixon won.", "Well yeah but \"developed\" really doesn't refer to public perception. If people are using \"developed\" as a shorthand for \"respectable\" then well...that's just wrong. ", "Yes. That clearly had a big impact on George W Bushes chances this election.", "Based on false information provided by guess who....that's right. The Republicans!", "How is it a fucking excuse when your beloved Bush and his cronies misled Congress and Senate which at the time, included Senator Clinton? A lot of politicians voted for the Iraq war. I don't see nearly as much hatred spewed in their direction.\n\nClinton might have had a hand, but let me ask you.... **who started the rhetoric**? You won't answer this question, of course. Trumpsters never defend themselves to scrutiny. ", "So? ", "&gt;If someone supports Trump they are not ~~likely~~ good ~~at assimilating new information.~~", "The shackles are off now!", "Yeah until the Dems take back the House...not really. ", "He's 84. He also gets the edge simply because he's done the disgusting shit that he wanted when he ran for office hopefully Trump will never get to that stage.", "Where's that happening?", "Donald Trump is strongly linked to NAMBLA the KKK, and stupid people.", "lol.  Let me translate the headline into layman for you: \"Political comms team does fucking ordinary media outreach.\"  \n\nFront page worthy?  What a fucking joke.  \n\nThe real problem with wikileaks is that the average American doesn't know fucking anything about how politics works.  Or journalism.  Or the justice system.  Or fucking any of the complex systems that have been built to support the American system.  So every headline is greeted as an incredible revelation to these people because they are so totally fucking naive and incurious about all the forces that shape the world they live in. \n\nEvery time one of these headlines drops I feel like I'm talking to a bunch of people who have just looked up and saw the moon for the first time, and they want to know what conspiracy has hidden it from them up until now.  I don't even know where to start.  Like.. \"YEP.  Actually, it's always been up there!\"", "But their breitbart poll predicts trump +2 in NH! how could it be wrong! it's not like it has questions like this in it:\n&gt;Why do you think FBI Director James Comey chose to reopen the investigation into Hillary Clinton’s use of a private email server while Secretary of State after the agency recently uncovered thousands of emails on the laptop used by Clinton’s closest advisor?\n\nOh wait that exact question was in the gravis NH poll contracted by breitbart. And many more like it. ", "[Here's a former Romney strategist saying he's also been asked to provide questions for Democratic debates.](https://twitter.com/stuartpstevens/status/795312485062606848)", "Trump is pretty much a walking American stereotype and the epitome of the \"ugly American\". ", "yeah if any American politician stands for \"business as usual\" the same old same old politics, Hillary is the person.\n\nand if anyone is looking for the worst qualities a human being can have, in America or anywhere else, you have got the Donald! \n\nGod bless America!", "Even if the kid is a Trump protester come on Trump supporters the kid is in a fucking wheelchair. You are just giving the Dems easy ammo at this point. Have a small bit of self-awareness.", "Demand a multi party system! It's being done in MANY other countries. Politics isn't red or blue - you can love gays and guns at the same time!", "I kinda viewed the FBI different after we found out about all the shitty things it did to MLK and other civil rights leaders and all of Hoover's weirdness. \n\nAnd again when they weren't able to put the pieces together before 9-11. ", "I'm American and I know we're not the best at a lot of things.", "RE: Democracy \n\nDear Athens\n\nThank you for your prompt reply. \n\nWe have most of our constituent's data backed up (thanks to a few paranoid techs) but nobody seems to know which recovery point we should revert to. Is there any way to tell which restore points might be corrupted and which are safe?\n\nThanks again,\n\nUnited States of America. ", "RE: RE: Democracy\n\nDear USA\n\nGenerally if the restore point predates the installation of American Megatrumps&amp;trade; MAGA drivers version 11/2015 that were included in the faulty GOP Obstructor&amp;trade; update package, then it should be safe to revert to that restore point, provided an alternate update from Berner, Inc. (downloaded from [here](http://i3.kym-cdn.com/entries/icons/facebook/000/001/030/dickbutt.jpg)) is installed immediately afterward.\n\nAfter reversion it is advised to do a thorough virus check.\n\nGood luck!\n\nSincerely, \n\nAthens.", "Jerbs*\n\n\nFTFY", "This is the small part of me that is happy Bernie didn't win. \n\nI wish Bernie won but part of me feels like Americans would have just went \"Okay, Bernie's in office. Corrupt Politics are now fixed!\" and we wouldn't have realized how bad the problem is.\n\nBut since he lost, more HRC/DNC scandals have come out and we're becoming appropriately humbled.\n\nHopefully this is a wake-up call.\n", "The thing is that Nixon actually did many good things as president.  He was actually qualified and cared about the job.", "I think I'm going to try this - I'm just going to spend a year telling people I'm the best and I do the best things, and about 40% of people will believe me with zero evidence... ", "9-11 is a very complicated subject and we can't blame a failure to stop it on just one agency.  A lot of things went wrong that led to the hijackers boarding those planes.", "Who wants to make a bet that no one gives a shit in two months?", "Computers. What do they know? Do they know things? Let's find out", "&gt; But since he lost more HRC/DNC scandals have come out and we're becoming appropriately humbled.\n&gt; Hopefully this is a wake-up call.\n\nWake-up call for whom?\n\nCertainly not the corrupt politicians who'll get elected anyway and see they have a tight enough grip on anyone involved so they can get away with anything.\n\nAnd the voters will have already given up their only leverage, i.e. their vote. There's nothing for them to wake up to.\n", "i never saw my choice of obama as the less of two evils. even hillary i wouldnt even call it evil. its more like choosing between someone i disagree with on certain issues and dont trust 100 pct and someone who is literally hitler.", "It'll have died down but people still won't think of the FBI the same way ", "Yeah. That doesn't seem like collusion to make him look bad at all. That looks like serious actual questions for a presidential candidate.", "Even setting aside his technological ignorance... does he think that the FBI is just one guy? ", "Because Europe shipped all of the craziest religious people here a few hundred years ago.\n\n(just kidding mostly)\n", "You better have some gold plated shit that's the secret Ingredient. ", "https://twitter.com/stuartpstevens/status/795312485062606848\n\nHere is a former Romney advisor. ", "&gt;But no objective analysis of reality could possibly conclude that both sides share equal blame for the current situation in America.\n\nI hate to be *that guy* after you wrote such a good post that I mostly agree with but the parent didn't argue that. They said that both sides are equally to blame *for the vitriol*, not for the situation from which the vitriol stems. We don't have to respect or agree with the other side's ideas, but we have to try to understand why they think that way and supress our tribalist instinct to immediately other them. Just screaming \"You're wrong\" at each other will get us nowhere even if one side is telling the truth.", "must have missed that. Hard to get news in the Fema camp they put me into after Obama personally came to my house and took my guns. Which one of the United nation members is ruling us now anyway? ", "Yeah insult a dead war hero, and then complain when his father responds. \n\nThis isn't 'the left' or even 'the right' it's the Americans who don't like your candidate pissing on the graves of military heroes \n\nThe division comes from one man, and one man only, feeding his own narcissistic childish ego and greed.  ", "McMullin is still a hard line right winger. He just wants to put a shiny face on the policies. Ultimately the Republican Party, and right wing social policies as a whole will vanish from the political landscape within a decade or two. Look at what millennials think about every social issue and realize that the republicans and the right wing as a whole are on the wrong side of history. The party that emerges from this election will not have the firepower or the coalition to win a national election in 2020. By then it's too late for them, they will lose Texas and until the major shift occurs in which a Republican Party drops the social issues, they will lose again and again. They will change; millennial republicans key in on the fiscal message but are turned off by exclusion and derisive social policy. ", "no it is the fact that you have a fucking Orangutan running against a run of the mill politician. Of course we support the run of the mill politician over here.", "Maddow is actually the pundit whose opinion I respect the most. She has literally the one show that can spend 17 straight minutes covering backstory and providing nity-gritty details before she actually gets to her point. The research performed on that show is exemplary. I don't think she is perfect and sometimes I disagree with her, but it is probably the most informative and smart show on television today. ", "After one guy called \"gun\" at his rally Trump and the whole room where in desperate need of a change of pants and adult diapers . The only thing this guys can wage war on is a bag of Cheetos.   ", "Obviously vote however you want but voting for a candidate just to piss people off is pretty stupid reasoning.", "I share this article as much as possible. It's an incredibly moving reminder that love and acceptance can in fact, conquer all. Derek Black was Don Black's(founder of Stormfront) don and David Duke's godson and was heralded as the next leader of white nationalism in this country. His views changed largely because a Jewish friend invited him to Shabbat dinner and being kind to him when he was ostracized. Kindness has always been the cure for bigotry. ", "Everyone needs to stop \"feeling\" what's going on though. Hundreds of thousands have died, millions are on the run... you've got children afraid of the fucking sky because they never know when an invisible drone is going to cause some collateral damage. The destruction and reconstruction of an entire region's infrastructure has been wildly profitable for some Industries but a financial catastrophe for the public. And, as it turns out, this isn't how you spread spare awesomeness. This is how you get ISIS.", "&gt; puppet\n\nNo-one say it. We're allll thinking it.", "&gt; There is absolutely no way normal Reddit would even consider voting for her or Trump.\n\n/r/politics has always been a left-wing subreddit and the election of Donald Trump would basically halt or reverse any of the changes that left-wing people want to see.  So it's a pretty easy decision about which candidate to support.", "That's how she lures immigrants to America - each one gets a personalised dick pic from Weiner.", "Sounds like she's the type of person who became a doctor for the money rather than to help people in need.", "&gt; I think the problem in this is collusion\n\nDo you guys legitimately not understand what collusion is? I really do not even get what you guys are advocating for... Do you not want the press to talk to any political organization? This is literally what we want the press to be doing. It doesn't change anything for me if the press get a lead or a story from a political campaign... No one should be surprised about that. It's functioning as intended. ", "So they're the guys who got me my new Debit card overnight and also renewed Atlanta?\n\nThanks guys.", "I... I hate to be this guy but voter intimidation is already illegal, and in this case the part of the civil rights act that got shot down would not have done a damned thing, anyways. Go read the ruling.\n\nFor the record, I'm a democrat voting for Clinton. But, this isn't really Scalia's fault, not that I like defending him. This is the republicans fault for encouraging Trump's behavior, and Trump's fault for encouraging his supporters to engage in intimidation. ", "Hopefully a wake-up call for voters. To care more about electing people like Bernie in state and local elections.", "But she's even bad at that.\n\nShe's up against Trump lol. She should be wiping the floor with him instead of her servers.", "This isn't some conspiracy. It's common sense that if you cut university and African American stations less of them will vote.\n\n[Here's a prominent Republican talking about doing it](https://youtu.be/8GBAsFwPglw)\n\nEdit: Spacing", "I love how the dude instantly turned into a crybaby once he got banned of Twitter.", "Yeah dividing the racists from decent Americans and conquering hatred. Save your fake outrage for Tuesday.", "It's a series of tubes! ", "I found them!!!!!!\n\n1993 Park Police investigation assisted by the FBI\n\n* https://vault.fbi.gov/vincent-foster\n\n&gt;“The condition of the scene the medical examiner’s findings and the information gathered clearly indicate that Mr. Foster committed suicide. Without an eyewitness, the conclusion of suicide is deducted after a review of the injury, the presence of the weapon, the existence of some indicators of a reason, and the elimination of murder. Our investigation has found no evidence of foul play. The information gathered from associates, relatives and friends provide us with enough evidence to conclude that…. Mr. Foster was anxious about his work and he was distressed to the degree that he took his own life.”\n\n1994 Fiske/DoJ investigation\n\n&gt;“On the afternoon of July 20, 1993, in Fort Marcy Park, Fairfax County, Virginia, Vincent W. Foster, Jr. committed suicide by firing a bullet from a .38 caliber revolver into his mouth. …The evidence overwhelmingly supports this conclusion, and there is no evidence to the contrary.”\n\n1994 Clinger/Republican House Committee on Government Operations report\n\n&gt;“all available facts lead to the undeniable conclusion that Vincent W. Foster, Jr. took his own life in Fort Marcy Park, Virginia on July 20, 1993.”\n\n1995 Senate Banking Committee/Democrat report\n\n&gt;“the evidence overwhelmingly supports the conclusion of the Park Police that on July 20, 1993, Mr. Foster died in Fort Marcy Park from a self-inflicted gun shot wound to the upper palate of his mouth.”\n\n* From Republicans on the Committee:\n\n&gt;“We agree with the majority’s conclusion that on July 20, 1993 Vincent Foster took his own life in Fort Marcy Park.”\n\n1997 Ken Starr/Office of Independent Counsel investigation\n\n* http://www.washingtonpost.com/wp-srv/politics/special/whitewater/docs/foster.htm\n\n* Medical Examiner:\n\n&gt;“to a 100 percent degree of medical certainty, the death of Vincent Foster was a suicide.”\n\n* Pathologists:\n\n&gt;Foster “fired the gun with the muzzle in his mouth, his right thumb pulling the trigger and supporting the gun with both hands and with both index fingers relatively close to the cylinder gap (the space between the cylinder and the barrel).”\n\n* From Foster's family\n\n&gt;“Mr. Foster told his sister four days before his death that he was depressed; he cried at dinner with his wife four days before his death; he told his mother a day or two before his death that he was unhappy because work was ‘a grind'; he was consulting attorneys for legal advice the week before his death; he told several people he was considering resignation; he wrote a note that he ‘was not meant for the job or the spotlight of public life in Washington. Here ruining people is considered sport.’ The day before his death, he contacted a physician and indicated that he was under stress.”\n\n* Conclusion\n\n&gt;“In sum, based on all of the available evidence, which is considerable, the OIC [Office of Independent Counsel] agrees with the conclusion reached by every official entity that has examined the issue: Mr. Foster committed suicide by gunshot in Fort Marcy Park on July 20, 1993.”", "I don't blame them for it. Number one everyone could have been doing things better and it still might have slipped through. Number 2, the folks higher up the chain did a poor job of marshalling and focusing resources and getting all agencies on the same page. ", "I don't know I've been waiting for the death panel sentence since ACA", "Not in any practical sense. It's Trump or Clinton. ", "&gt;The GOP is the party of entrenched racism since the Southern Strategy in the 1960's? \"What about Robert Byrd?\"\n\nI have seen this one in particular so often this cycle. How democrats are the real racist party and they cite a bunch of democratic policies from the 50s, and point out how Lincoln was a republican, and nothing could have possibly changed in the past 60 years.\n\nWhen I pointed out the Southern Strategy I was told it was a \"liberal lie.\"\n", "No we aren't. \n\nIt's an objective fact that the media has covered stupid scandals more than policy and the latter is a huge strength in Hillary's favor. \n\n[The opening section of this article illustrates the problems with your media perfectly.](http://highline.huffingtonpost.com/articles/en/hillary-clinton-policy-agenda/)\n\nFewer people overseas watch your shitty cable news shows and we're less susceptible to being trapped in social media echo chambers. That explains foreigners coming to the very reasonable conclusion that Hillary is a great candidate. \n\nFrankly, from my standpoint, it's the repugnant attitude that Americans have towards Hillary Clinton that is giving US citizens a bad reputation. It's so painfully obvious that she's being held to a vastly different standard than any other politician has, and it's also painfully obvious why that is. You're not conscious of it and you're going to deny that's a factor at all, but it is. \n\nThe world is waiting for HRC's leadership with bated breath. ", "Nothing says bringing people together like \"build a wall\"", "They literally don't need to read most of the emails. They already have all of the emails from before read and indexed. So they can run a search algorithm and check for duplicates of the ones they already have read.\n\nThey can also look at the metadata of the emails and knock out any that are not related to the investigation, meaning any emails which were not sent to/from Clinton's server. Remember, this computer was used by Abedin occasionally, and mainly by her husband. That probably knocked out the majority of the emails. \n \nSo, while it may have only taken a few hundred people, it could have taken less than 10. All we know is that they did it, and didn't find anything useful. I'm willing to bet that they knocked out 90% of the emails at least, purely based on who was sending them/to where. And then a further 80+% of those after searching for duplicates. Which leaves a very manageable number, especially if they dedicated a lot of bodies to it.", "Clinton was state secretary for 4 years (2009-2013). \n\nYou assume all 650.000 emails were from or to her. That would mean that this one recipient received 445 emails a day from Clinton. Or 7 emails an hour every day. \n\nThough the FBI could have also searched for all emails from Clinton since the account was opened to date. Still seems ridiculous. \n\nMost probably the 650.000 were the emails on Weiner's email and they narrowed it down to either the period Hillary Clinton was Secretary of State (or not). Then they narrowed it down to known Clinton email addresses (or known Clinton friends, assistants, etc) and then threw the results into software to check for duplicates and compare to those emails they already reviewed.\n\nWhatever is picked suspicious is manually reviewed. Whatever is left a search algorithm goes through them to identify known keywords and if nothing is picked up then that's that. \n\nThe FBI already went through Clinton's emails and probably cached it for keywords. The only red flag I can imagine is if they pick an email on Weiner's computer that was not handed over by Clinton, which proves that Clinton didn't provide all the emails. Otherwise they have a real simple job which can be automated and shouldn't take longer than allowing their software to create a mirror of the data and go through it. I doubt they needed more than a standard 8 hour work day for all of this. ", "Not particularly. He also sits in the House of Lords so I might as well suggest that the voting machines are owned by the British Parliament, or by the Queen. If Smartmatic machines were actually being used, which they're not.", "*Milo says actual horrible things. \"That Sarkeesian chick\" is politically opposite Milo therefore she must have said equally horrible things.* - You", "What's so dangerous about these fascists is that they've totally made us all forget about our country's real problems.", "&gt;just gotta remember most people in other countries aren't nearly as immersed in our political system as many of us are. My knowledge of the intricacies of foreign governments is basically non-existent\n\nThis is ridiculously untrue. The US election has been the top story here in Australia for the last few months easily dwarfing our own domestic politics. There are multiple programs on TV, radio, and online dedicated to covering US politics - not just during presidential years, but as a part of regular programming every year.\n\nHell, the most prestigious university in Australia has an entire faculty dedicated to the study of US politics and culture.\n\nUS politics has a massive effect on the rest of the world, we watch closely for a reason.", "Its almost as if Republicans would have a better shot if they abandoned policies that instantly alienate half the country.", "Why ask Democrats?????", "You guys should build a jail under the George Washington Bridge and put him there once he's convicted. (seriously why hasn't he been indicted yet) He can take his rightful place as the troll under the bridge.", "A simple query search can be easily done on any computer to instantly eliminate duplicates (in content headers, etc).  Just because YOU aren't smart enough to know how to search and compare emails doesn't mean people in the FBI can't.", "For me it did the opposite. I don't have a horse in the race since I don't live in America but thanks to /r/politics I'm hoping Trump wins. ", "Good thing too. After all, we have some bad hombres here.", "Good point I'll gold plate some shit. ", "That hit way too close to home.", "/r/cringeanarchy", "Steve Bannon is a liberal extreamist? Did you even look at the article? ", "So all it took was a typical politician.", "In what universe do you live in that you don't think this happens with both parties? Or happens with any interview with a CEO?\n\nAll news stations exist to sell you ads. That's the entire goal. They do that by having \"premium content\" like access to candidates. That comes a negotiated bargaining chip. NONE OF THIS is new or unique to this election. ", "Good. People love pushing the horse shit narrative that both parties are the same - so let's actually treat them as such and pursue the slightest hint of wrongdoing by republicans to the end of the fucking earth via congressional hearings.", "C'mon man he's her campaign chairman. Of course he showed her. \n\nThis is also like Loretta Lynch meeting Bill Clinton without media allowed, on the tarmac, days before the decision on the last FBI investigation....\"oh we didn't talk about that though, even though we're both highly connected to that case, we just talked about our grandchildren....\" ", "Anyone who posts garbage conspiracy theories deserves all the shaming they receive. ", "Except America does have colonies and overseas territories. Puerto Rico Guam, US Virgin Islands. And 100 years ago, the Philippines and Cuba were full blown colonies of the US.\n\nAlso were you even taught about the Manifest Destiny? ", "Thing is it was leaked by a republican senator.", "It's called technology ", "Not very; it hadn't been the capital for about 130 years and had a serious of bad emperors and barbarian invasions of Italy. ", "If that's what qualifies as \"Collusion. Biased. Rigged.\" then what words can we possibly use to describe Breitbart whose executive chairman is Trump's campaign CEO? Not exactly \"Professional. Impartial. Honest.\" now is it.", "If anything Britain did more on the espionage front. Not that the US didn't play its part, but between Britain's top notch signals intelligence (partially inherited from Poland's quite good signals intelligence - guess who broke the earlier versions of Enigma? The Poles!), successful turning of every German spy in Britain, and highly effective diversions (like washing up a body on a shore with plans for an invasion of France), they really deceived them.", "If Democrats win Phoenix and surrounding Maricopa County they win Arizona.", "I member.", "&gt; she never actually seemed jazzed about the political arena..\n\nBarack was only barely allowed to run for president. She *hates* being a political figure even if she's out there on the campaign trail.", "Computers are very good at finding duplicates. Most of the emails were either not addressed to Clinton and the ones that were were mostly duplicates that are easily (were talking a matter of minutes to hours) found. Don't be so dim as to assume that people had to manually read every email.", "Lmao. If the republicans put up a candidate who acts like a child then it's okay to mock him.", "Agreed I have great respect for her, the best segments are when she goes into some esoteric detail from the past only to wrap it around to become relevant to current day. She is also well respected by many republicans, she gets guests that the others on MSNBC cannot.", "Well they said they're not a whiz!", "Yawn.  Laziest concern troll ever.", "I'm sure with a username like \"eatdix\" you are a professional criminal prosecutor and are able to determine what is a criminal offense and what isn't... /s", "&gt; Nice deflection\n\nSpeak for yourself.", "&gt; The thousands of new emails were mostly personal and duplicates of what had already been seen law enforcement officials said in explaining how the conclusion was reached so quickly. The laptop which was found was about a decade old with lots of personal content on it not relevant to the investigation, according to one source.\n\nhttp://www.cnn.com/2016/11/06/politics/comey-tells-congress-fbi-has-not-changed-conclusions/", "As if the United States doesn't hold it's own interest first and foremost when spending these resources. If it didn't benefit either the rich oligarchy or the United States as a whole we wouldn't do it.", "She is seriously like Margret Thatcher lady of steel. I don't think things affect her much anymore.\n\nEdit: missing a word, plus further explanation. I think Hillary is like Thatcher in how they both handle scandals; they don't let them phase them and how they present themselves as political leaders.", "I can't wait for Trump to be out of the daily news myself but if he wins Florida he still does have multiple paths to victory. They are few, but he does have multiple", "&gt;I think America has been calling itself the \"greatest country on Earth,\" for so long that it is nice to see some people realizing they have alot of work to do to live up to that title.\n\nSo, are you suggesting that we should make it great again?", "Yep this is going on in every swing state.\n\nIt's not a matter of volunteers. They just will not authorize locations or authorize enough voting stations in general.\n\nIn OP's article about Cincinnati (population 800k), it's pretty obvious that if you only have 1 polling location with say, 10 voting stations, it's just impossible for everyone to vote. Source: math", "And Hillary is the epitome of what everyone hates about politicians and their bribery. Whoever wins we lose.", "perfectly okay with gays guns, micro brews, a womans body is her own until there's actual brain 'true' activity, barring medical need. so i'm perfectly okay with whatever because it's not _my_ life/sanity on the line. each case is different.\n\nnot a huge fan of weed, but if someone can do it responsibly (no, toking at the bus stop in violation of state regs is not responsible) in the places its legal to do so, then whatever.\n\nyou wanna worship god/allah/xenu? fine, shut up and go do that quietly over with the rest of the people who are in your flavor of whatever, but stop trying to meddle with other peoples lives.\n\nmy stance remains unchanged of late. 'freedom of choice until that freedom infringes upon the freedom of choice of others.'\n\nsadly, this election pretty much goes against that philosophy. heck, almost every election has.", "And it allows China to sell the idea to their people that democracy is an undesirable mess:\n\n&gt; [Ugly US election race a poor ad for democracy in China](http://www.bbc.com/news/world-asia-china-37724839)", "He lost by 3 million. He lost the minority vote hard. I wanted him but he lost by three million votes. It was never close.", "    $ su star -c \"grep pussy\"", "I heard little Trump was gonna head up the wall project. His Minecraft model was impenetrable. ", "Because Americans aren't that left wing.", "-3 Million minority votes worth?", "Please do some introspection and ask if the work that was done would have had any chance of turning three million mostly minority voters. She won in an extremely decisive manner that really was not close not even close to enough to be moved in how you are insinuating. I'm looking at the same evidence you are and all I see does not nearly add up to a different candidate. She won in a landslide, take a second to reflect on that. The other man lost, hard.", "&gt; It's basic programming to create something that looks at two lists and finds the items that exists in both.\n\nBelow basic. Excel VLOOKUP or INDEXMATCH is basically this. And I'm sure smarter guys were in charge finding this out.", "I demand it!\n\nHow am I doing? Is it working?", "Voting for Trump in the first place shows you either a) don't know much about politics or follow it and your emotions of fear get to you or b) you are comfortable ignoring the ridiculous aspects of the campaign and project your own insecurities onto the opposition. ", "Better watch out man. A trump supporter might call you names and lay some memes out. That means they win the debate as is Trump internet law.\n\nI mean Trump not being allowed to tweet by his own staff pretty much tells the whole story. ", "Exactly like how President Obama told the crowd to calm down and pointed out reasons to respect the protestor at his Clinton rally yesterday. Trump just let it happen...", "\"Tells it like it is\" or \"says what everyone is thinking\" is dog whistle for \"puts blacks and women in their place\".", "For sure he's getting a front-row seat to the inauguration.  ", "I'm appalled he wouldn't talk to Jon Lovett at the very least. That man is a straight shooter respected on all sides.", "You're saying that as if to imply that he was not a crybaby *before* getting banned.", "You guys are willing to ignore technology when it fits your narrative? It's fucking sad.", "He loses the election then all of a sudden Kellyanne's paycheck doesn't come through. \"Well, Kellyanne, I hired you to make me the President. I didn't lose, I don't lose, if I lost, it's because you lost the campaign for me, and I don't pay losers.\"", "This will be stickied on the_deplorable soon with some elaborate conspiracy theories tying this directly to Hillary in the library with a candlestick. ", "&gt;In the end Scalia and his wife are a case study for corporate corruption of the Supreme Court.\n\nYou're thinking of Clarence Thomas, who is still alive and bullshitting. ", "Jews weaponizing the words of a powerful black, woman.\n\nI'm surprised he can even handle that blow to his worldview. How does a Neo-Nazi come back from that one?", "Basically Sanders is quite more progressive than Clinton, but Clinton is still a progressive. ", "This is good for America. ", "Chelsea Clinton is Jewish as is her husband (and as are Jared and Ivanka on the Trump side).", "Remember when we thought W was the worst it would get?  There will be one man happier than Donald if he wins.", "FUCK YES. Huge news!! All the trumpettes will be so sad they can't suppress the vote in PA as easily now.", "Strawman much? His point was clearly that the focus on urban location for educational facilities left the rural areas with less education and thus more susceptible to inflammatory polítics", "&gt; Not sure why you object to Hillary. If the companies that pay her millions in \"speaking fees\" wants legal weed she'll go along with it.\n\n", "\\&gt;650000 EMAILS FOUND\n\n\"Alright let's crosscheck these with the ones we have and remove the duplicates...\"\n\n\\&gt;0 EMAILS FOUND\n\n\"Huh. Well then. Guess I'll play World of WarCraft for the next eight days...\"", "Why hasn't Trump done a single thing in his 70 years to make this country better? ", "This is good for Democrats. ", "Evil fucks. ", "Have to agree the Dems are plenty right for modern society to set up a proper labour party to the left.", "If only she'd call sean...", "She was slinging plenty of mud during the primaries.", "It's not. Playing the victim is a major part of conservatism.", "\"Hillary is losing the election because her latest rallies were empty\" is the perfect sentence to sum up the mindset of your average Trump voter.  Everybody else knows that would be anecdotal at best were it true but it's just as likely to be a false statement in its entirety.\n\nI'm sure she'd prefer voters to be at the polls early rather than be at her rallies anyway, and the numbers from Florida and Nevada are looking very positive in that regard.", "I don't see  \n\n- ??????\n- Profit \n\nFucking *casual*. ", "Bangladeshis have historically barely been good for Bangladeshis.", "The problem is that they needed a year to check the 30.000 earlier emails so this comes as a LITTLE surprise that they managed to \"improve\" so quickly. ", "\"Ask for more money from the Germans.\"\n\nSincerely Greece", "The Republicans have been proven guilty with federal judgement of voter suppression and have been under a tight decree in attempts to wrangle in their poor behavior.  Yet every election they pull antics that's quite blatant.\n\nhttps://www.washingtonpost.com/news/wonk/wp/2016/07/29/the-smoking-gun-proving-north-carolina-republicans-tried-to-disenfranchise-black-voters/\n\nhttp://www.joemygod.com/2016/10/25/rachel-maddow-on-trumps-poll-monitors-video/\n\nand much more... ", "The last time this happened Trump supporters swore assange was dead and that large parts of England were blacked out by government goons.", "&gt;Until a presidential candidate adopts that mind state I will continue to abstain from voting. \n\nWell that is one way to ensure you will never vote. \n\n&gt;Also I’m a lazy pothead that forgot to get registered so I don’t really have a choice in the matter.\n\nOh... okay............\n", "Well I live in Ireland so I'm gonna go get my popcorn and wait for this all to blow over.", "The FBI has never been afraid to make enemies of sitting presidents.", "It's been this way for a long time.\n\nIf you want to know what underhanded shit the Republicans are up to look at what they're accusing Democrats of doing. They're almost guaranteed to be actively doing that very thing.", "I feel a mandate holds her to her promises more than a close election. If it's close then half the country disagrees with her policies. A mandate gives her the political currency to push her policies through.", "&gt;Source?\n\nAll the polls?\n\nJoking aside this really hurt the chances of a lot of democratic incumbents. When the republicans came home, the democratic candidates both had to face a surge in opposition as well as Hillary dropping support because she was forced on the defensive.", "Isn't this a common practice networks use in order to generate difficult questions for primary candidates?", "It's not fair to say they did not have hardships. Sure economic hardships were less severe, but don't forget the Vietnam war where millions of young people were drafted and 68000 Americans died for no fucking reason. And the Cold War and constant threat of nuclear annihilation. I am not trying to defend their views, but there is no reason to look at the boomer's life with rose coloured glasses.", "Oh it will fall out of the media cycle pretty quickly and most people will forget but Hillary and the Democrats won't. There will probably be a leak or maybe the White House will hold a press conference announcing a through review/investigation of the FBI. Then people will forget and then months or maybe even over a year later the review is wrapped up and heads officially roll. Comey's actions definitely hurt Democrats but maybe this was for the best in the long run. If the Director of the FBI is making decisions based on personal politics and field agents are going rogue, then the FBI definitely needs to be cleaned up but without this whole situation people may not have known how bad things were in the FBI.", "Calling it now: if Hillary is woman president it will be at least 100 years before we get another.", "People I would hate playing poker against: Hillary Clinton.\n\nSeriously that's it. I would have no problem playing against Hellmuth, Laak, and any other major pro players. But fuck playing against Hillary.", "Yeah we know. Someone tell CNN to actually report it.", "You don't.  You don't manufacture an assumption of guilt and conspiracy involving unknown aliases and then proceed to work backwards with the data to fit this manufactured narrative. I know this method doesn't apeal to those on  a witch hunt who have come to a situation with a presumption of guilt but oh well.", "Can Trump supporters stop spamming this please? We know and we don't care. For the last time (lol I know its not the last time), it is common knowledge that political organizations and media organizations work closely together. They literally follow these candidates around 24-7... ", "But why is nobody talking about how Bill raped an email in Benghazi and  gave it Parkinson's disease. The email couldn't keep the affair (c)ondential, so Hillary sacrificed it in a blood ritual to Satan. And then declared war on the canned foods section at a grocery store to take out the pickle jar who was going to leak the story.", "Not that i disagree with you but i dont think being a woman gives you a right to punch anyone in the throat.", "Julian Assange has a personal vendetta against Hillary Clinton.", "And I'm sure people like them in 1930s Germany were sputtering \"but but but I voted for the Fuhrer\" as they were being led away to disappear forever or were laying on the ground getting their heads kicked in by Nazi thugs. Good for you I guess? Now enjoy the fruits of your labor.", "They're both anti-establishment in the same way that keyhole surgery and a lobotomy are both medical procedures.", "The meetings usually take place via discord or slack. Easier for us to orchestrate globally. ", "Thank you Transportation Workers! You guys are patriots. ", "Man you people are like a broken record. ", "Saying D-day was not a suprise is taking it a bit fur IMO.\n\nGermany knew that an attack on the French coast was coming they just didn't know where or when. \n\nThey expected it at the Pas de Calais which is the shortest distance from the south coast of England across the Channel and their intelligence reports told them of a large build up of forces in that area of Britain - this however was due to \"operation Fortitude South\" whereby fake tanks, planes and ships were set up by the British including misleading radio traffic and the creation of an entirely fictitious First US Army Group (FUSAG) headed by General Patton, who made himself extremely conspicuous in that area - all of which convinced the Germans the attack was not to arrive at Normandy. \n\nCombine all of that with the worst weather in the Channel for many years it even led the Nazi Commander in Chief of forces in France, Field Marshall Erwin Rommel, to leave his post and return to Berlin for his wife's birthday. \n\nSo were they expecting an attack, yes no suprise there.\nWere they expecting it in Normandy, not even close they were utterly misled. Suprise here.\nWere they expecting it to happene when it happened. NOT AT ALL. Suprise. \n\nSo not calling it a surprise attack is rewriting history to make a political opponent look dumber than he is. Its a bit dishonest and slimey if you ask me. ", "Good. I hope the USG is orchestrating the attack and will sustain it until further notice. This interference in our elections is unacceptable. ", "I really hope you're not relying on Trump to do that for you.", "They've been pummeling all the Bernie holdout subreddits (WayoftheBern etc) and it's blatantly obvious, yet a lot of former Bernie supporters still seem to fall for it. I'm just happy to see you being rational (to be fair, I use \"agreeing with me\" as a barometer for rational here), friend.", "&gt;prejudices\n\nYeah I hate how prejudiced she is towards equality helping the middle class, and reality. How dare she not objectively cater to the right-wing's ideas about gay people not having rights, trickle down economics, or the delusional alt-right world... Totally biased! /s", "I encourage you to reread your last line and really consider what it is you're saying and the comparison you're making.\n\nIn the latter example the candidate, admitting fault, guilt, and responsibility, *didn't use the appropriate email server.* Seriously, that's what you're excoriating her for.\n\nIn the former example, the candidate has not been allowed to speak off teleprompter, give a press conference, or be trusted *to not say a single sentence* that would potentially reveal how terribly unqualified he is to be President. His team is literally afraid that he does not have enough self control or wisdom to not say or do something in a few words that will cost him the election because it will be offensive, wrong, or both...because he has a history of doing so.\n\nDo you see how insane that is? ", "Seeing Joe Arpaio in jail would be pretty funny", "Sharing a video from prison planet? Might as well be linking us to videos of ufo sightings and lizard people. ", "&gt; it's going to look an awful lot like she's taking revenge \n\nYep. \n\n&gt;and that's not going to be good for her image or the image of the country as a whole. \n\nUh, disagreed. I think revenge is EXACTLY what is warranted here. This behavior cannot be allowed to stand unabated. She should absolutely take revenge and the American people should support her levying the appropriate punishment for any policy or law violations that took place. ", "Yes. For one of those investigations they were starting from scratch and actually needed to review and research everything.\n\nThis time they used a program to filter out what applied to Hillary and which emails they already had.  How do you not get this?", "No-one's saying to then kick their wheelchairs.", "Sounds like an episode of Check it Out with Dr. Steve Brule.  \"Compruters. Where do they fit so much knowledge in their tiny heads? Magic? Prossibly. I'm talking with computer wizard Arthur Bringus today to find out why computers are magical.\" ", "Seriously. Every other Senator of both parties hates his ass and it's because they know him personally. ", "Not even a question in my mind yes. FFS, they have a PAID Trump staffer on staff. Of course the RNC is working with CNN. ", "Are you going to just keep ignoring the fact that since the beginning every report, as well as just common sense, says that the majority of those emails would have had nothing to do with Clinton? You can keep arguing this point but it's idiotic. ", "History will not agree with you.", "Are you going to leave reddit when she wins or delete your post history and pretend you never backed Trump?", "So I can understand, sorta, if you're independent or an old school republican and make this comment. I think you probably made up your mind about Clinton two decades ago and nothing will change that. It's a separate type of debate to have. \n\nIf you're a Trump supporter... this comment makes so little sense. Donald tells flat out lies and doubles down when they're proven wrong. He makes shit up on the fly and doesn't seem to have a moral compass. Hillary and Donald aren't even comparable here; he's a pathological liar and a narcissistic, mysoginist pig. The deeper you go, the worse he is. He's overtly an elitist fraud who ruins everyone he can for his own personal benefit, forget even his wife or kids. \n\n She's an old school politician who's behind-closed-doors comments are weirdly reasonable and pragmatic. The deeper you go with Hillary, the less of any meaning you can pull out. It seems suspicious and then you go deeper and can't find anything. \n\nBut if I were like you and had already decided she was crooked, then of course I'd insist that she *must* be lying about everything, truth be damned. ", "This is a big deal...I used to live in Philly and SEPTA is essential for many residents. Now go out VOTE and make me proud!", "The Daily Show with Barack Obama\n\nThey could have a daily Trump segment as well if he should get elected\n\n", "Because they didn't secede they are now living under double-secret Sharia Law, and they don't even know it!  \nUnder the cover of shadows in the White House, Obama signed a classified executive order declaring all of Texas to be a FEMA concentration camp!", "\"Of course it will help. The fewer city dwellers who get to vote the better\" - you posting in a Trump subreddit\n\nUsername checks out. Enjoy Tuesday, scum. :)", "&gt;Get money out of ~~politics~~ economy     \n     \n*Athens 2016*", "fyi all the people kicking his chair were all clinton plants\n\nas was the mother and wheelchair kid\n\nand the staff of trump's campaign\n\nand trump", "This story is important and will I hope, become part of the historical autopsy of Trumpism.  A disabled, wheelchair bound child was bullied and ejected by Trump and his mobbed following.  This movement is pervaded by a lack of decency, empathy and basic concern for life itself - fragile, vulnerable life.  Trump ranks among history's great haters, an agitator who calls forth destructive aggression In those who follow him. Their weakness is temporarily suspended while immersed in chants of imaginary power. Obama's decency and genuine care toward that young man stand in stark contrast.  I hope that someday soon, when the fever of Trumpism has cooled, those who shouted down the voice of this child will feel guilt or at least shame for their acts.", "We're pure shit on things that counts. We haven't invested in the people or our infrastructure in decades. You're seeing the result of that combined with a whole generation dedicated to anti intellectualism.", "* Donald Trump promising to usher in a new age of cybersecurity  \n* Doesn't believe one of the most powerful intelligence agencies knows how to filter data  \n\n'kay", "If the climate change denier wins the planet lose.", "you're super best at baseball though you always win the World Series. ", "The Khan family has made every decent person in America and the world, proud.\n\nThank God for them.", "As a Jew who has spent the last half a year or so hearing all these Jewish conspiracies. Why can't they be true? I wanna be wealthy and influential. I'm just a broke college student but the way the alt right portrays me I'm actually part of a scheming globalist cabal that controls the banks and the media", "white people with guns advocating for their rights == patriots\n\n\n\nBlack people with guns advocating for their rights == black panther thugs\n\n\n\nRepublican logic. If you aren't white you have to be twice as patient and twice as good. ", "Smoking a cigarette at the bus stop is also kinda douchy unless you're being considerate and go like 30 feet away from the stop to smoke where nobody has to smell it. \n\nCoffee isn't smoky and stinky. ", "It's on video", "Kids with palsy took our jobs?", "Yes.  Except for the mass murder in South East Asia and keeping our boys in Veitnam when he knew the war would be endless...\n\nTrump would be the worst but there will not be a great jump to second place.", "RE: RE: RE: Democracy\n\nDear Athens \n\nFollowing your advice, we have restored to the only point that we had available before the GOP Obstructor update (dated 1/10/1963). This seems to have cleared up some of the corrupted democracy, however there are a number of conflicts now occurring. \n\nWe went ahead and installed the alternate Berner, Inc update in the hope that any issues would be resolved, but it seems to have only increased the conflicts ([crash logs attached here.](http://www.berniesandersvideo.com/uploads/8/9/4/8/8948721/4467801_orig.png)) \n\nPlease advise.\n\nRegards,\n\nUnited States of America.  ", "Or like me in 2012 stood in line for 2½ hours, then had to leave and go to work.", "Yeah it's FBI, not FB II", "No she will eke out a win because of people who could not get over the fact that their favorite candidate lost and tried to actively sabotage her by spreading rumors and lies\n\nShe will eke out a win because lies after lies after lies were spread about her and despite everytime it being proven to be a lie the same people shamelessly continued spreading it\n\nShe will eke out a win because Trump and Clinton were being treated at different levels, she playing on hard mode, where one single accusation against her tanked her ratings while a 100 accusations against Trump were ok and if he kept quiet his rating rose. The entire FBI was against her. \n\nShe will eke out a win because America is still deeply racist and sexist and there are many white men who will selfishly think of their own temper tantrums even if America becomes hell for the former under Trump\n\nAnd despite all that, she has still done much better than Sanders every could who would have lost to Trump", "A cigarette is the same. Caffine from coffee is not inflicted on other commuters.", "I don't think Chelsea converted. They had an interfaith wedding.", "If that isn't already an Onion headline it will be tomorrow.", "Not to mention that you can kill 90% or me for being duplicates then use what you said to further reduce, then have 50 guys go through the rest.\n\nThis whole thing is ridiculous. The FBI needs to get cleaned up about interfering in elections, Comey needs to resign, and some people need to go to jail over the Hatch Act.", "Let me guess... He \"had it coming\"? ", "Found the anti-semite. ", "Ah that's a step too far. Trump at least you know he's tremendously incompetent and can't organise properly anything, all you have to see is he's clusterfuck of a campaign. If he got elected it would be a disaster, yes, but mainly because of everything being a clusterfuck of a mess. Hitler's worse because he was cunning and organised enough to see all his fucked up plans to fruition.", "No one say it. \n\nNo one say it.\n\nYou're the one saying it. ", "NH isn't a very populated state and also very rural a few big cities but generally the population is spread. I'm a MA resident, but in my opinion NH has a very \"leave me alone\" idea behind their politics. To be honest I'm surprised they don't vote more conservative than they do, but a real NH resident may have more info than I do. ", "They've dipped back into Hoover levels of corruption and disrepute. ", "This assumes that they needed that long soley for the task of checking the emails that none of their work then provides a base to work from this time around and that a significant number of the new emails were not duplicates of one's already checked", "Um. Pretty sure PC-authoritarians don't overlap with progressive ideological purists very much. They're far to concerned with minor social issues to be care about important progressive ones.", "Do you have to demean and put down others to make yourself feel better. You are targeting the father of a dead son. No one who does anything worthwhile in life or accomplished anything will do that. People who accomplish things in life dont need to put down others to feel better about themselves. Successful people are content. Losers are unhappy with their own lives and blame it on minorities gays, blacks, women, etc", "\"Come on man!\" ", "This sounds like a school essay written by a 16 year old alt-righter.", "So its an insult to be against Trump? That's a one.", "Yeah the correct statement would be \"America is at the bottom of the list of first world countries on many metrics\".", "Lmao you have the critical thinking skills of a traffic cone. ", "This sub was so ridiculously pro-Bernie for months on end during the primaries that it makes me not really give a shit about the current pro-Hillary bias.  I swear to god people just flat out don't remember the front page being filled with Daily Caller and Breitbart conspiracy theories.", "I don't expect it to have any effect.\n\nSource: Live in the country in which Margaret Thatcher was the first woman prime minister. We already have another.", "We get it you vape.", "&gt;no reputation for throwing fits and screaming at people\n\nHave you seen his twitter feed?", "It's Trump and his fascist loving followers vs. America. ", "Agreed. The morbid fascination with Trump during the primaries did not help Bernie get his message I absolutely agree that he got squeezed out. If he was not in his 70s I would wish he would run again. I hope that Warren makes a run at some point. From what I have see of her so far she would have my vote in an instant. ", "Actually not.\n\nhttps://www.washingtonpost.com/news/wonk/wp/2016/08/12/a-massive-new-study-debunks-a-widespread-theory-for-donald-trumps-success/\n\n&gt;The results suggest that his supporters on average, do not have lower incomes than other Americans, nor are they more likely to be unemployed.", "If you are voting for Trump then yes.  And chances are you were a fucking fascist long before this election as well.", "&gt; DIR Comey has thoroughly reviewed 650000 emails in 8 days?\n\nHaha, what's better is his manic assumption that he'd do it all personally.\n\nNothing better to do, at all. Including sleeping, eating or even looking away from the monitor\n\n*If only he had some organisation, some bureau, perhaps, to assist him in such matters*.\n\n&gt; *I must analyse all these emails personally. No-one else can do it. Me. It is my responsibility. Like Frodo on The Mountain Of Terror. Senor Comey to the rescue!*", "Oh The Donald reached out to women...", "I think a lot of people find it a hard accomplishment to get pumped up about when that first woman president has a lot of controversy attached to her.\n\nDon't get me wrong I'm voting for her 100% but that doesn't necessarily mean \"I'm with her.\" I'm proud of the fact that we are at the point where that is an option. I just wish the option were a better one.", "I went to high school with this guy and can tell you he was a douchbag even at 16.", "What exactly did they do to harm him again? ", "Tells it like it is until he has to walk back nearly every statement because people \"mis-interpreted\" what he said. ", "60 minutes per email?  I stopped reading.  You should start reading more. 90% of emails are smaller then.........this post. Should not take you 60 seconds to read this.  ", "Also imagine if this election goes well enough Bernie might just wind up with a key position in the Senate", "I think you mean \"Republicans\".", "CNN is saying the laptop was 10 years old. WTF?? They should have checked the emails before comey sent his letter last week.\nRudy Giuliani needs to be investigated in his role in trying to get the rogue FBI agents to leak info which led comey to release his letter.\nI think Giuliani plays a bigger role in FBIgate than is known now. ", "Who is the mysterious \"they\" the author of this drivel keeps referring to?\n\nBack to Stormfront! Back I say!", "I would say Hillary is the lesser of two evils. At least she is a politician and can play the game. Trump could be an utter disaster.", "Yeah and they took her out by infecting her with Parkinson's in 1995.", "Read the setion: Whose IP is it anyway?\n\nhttp://www.truth-out.org/archive/item/90265-on-heels-of-dieboldpremier-purchase-canadian-firm-also-acquires-sequoia-lies-about-chavezties-in-announcement\n\nTrue George Soros does not own any voting machines, I know of at least. A board member on George Soros' Open Society Foundation, Mark Malloch Brown, is the/a chairman in Smartmatic, a company which is connected to voting machinery, it does not own any physical voting machines in USA, but the IP which Sequoia machines used, was never given from Smartmatic. Later sale of Sequoia machines handed all intellectual property of Sequoia machines to Dominion, doesn't include the IP since it was never a property of Sequoia\n\n\nhttp://www.smartmatic.com/about/our-team/detail/lord-mark-malloch-brown/", "I question whether there will be another election if Trump wins. ", "Inb4 a Trump surrogate intimates that she was killed by Clinton.", "Highest incarceration rate of any country period.", "Would you give nuclear codes to someone who can't even be trusted to use his twitter account responsible?", "Well aren't you so goddamned edgy kid.", "Found the anti-semite. ", "Actually most of the time is spent getting higher ups to be specific enough about what they actually want to see what problem they are trying to solve, and what questions they will have. Giving them what they say they want on first request is a surefire recipe for disappointment on all sides.", "Yes of all the things that have ever occurred between Russia and the USA you think a no-fly zone in Syria can lead to nuclear war. \n\nDo you have any concept of history or precedent? I mean any, at all?", "Bush: \"At least I'm not Trump.\" ", "Julian Assange has let his personal vendetta put   the USA and the whole world at risk - by raising the possibility of a Trump presidency.  All he cares about is getting his revenge against Hillary Clinton.  He could care less about putting the entire world and everyone else at risk.  He has proven himself to be an extreme risk to the world.   Someone likes him with that much influence, needs to be dealt with and put away before his ego destroys the world.   I used to support Wikileaks, but now I hope Madam President Clinton will go after him with the full force of the US before his next tantrum destroys us all.\n\nAssange could have released  the emails during the primary, which would have helped Bernie and eliminated Hillary from the race.  He could have gotten his revenge and helped the American people at the same time.  Instead, he withheld the emails - because  he has clearly wanted to screw over Americans at the last moment.  He has clearly shown himself to be an enemy of the American people.   \n\nSo, you know what, *fuck him*.", "It's a little different with Mosul though. More akin to trying to surprise Hitler with an attack on Berlin after they had been pushed back from everywhere they had previously conquered. ", "Bernie told us to make our own informed decision.", "&gt;\"You'd rather be in her [Clinton's] shoes than Donald Trump but it’s **not an incredibly safe position**\" Silver said. \n\nSo, just \"safe position\" then, Nate?\n", "&gt; Take out all the pro-LGBT pro-choice, not being racist to blacks, and political correctness from Hillary. \n\nTake out what Republicans don't like, and then she suddenly becomes likeable to republcians! woah!", "Can anyone tell me why NH is such a swing state? It's in the NE which is heavily blue. ", "I can understand that. It just seems like  suddenly Reddit really wants to see Hillary in office which is a different vibe than simply not wanting Trump. I could be reading it wrong, but the difference from the Sanders era is just bizarre and seemingly unnatural.", "It only drove me even further from Clinton.", "...and into the circle jerk that is mainstream media which is bought and paid for?  I can't even get anything decent out of NPR anymore.  \n\nPlease for the love of god go to Yemen and ask about her drone policy.", "I actually couldn't see at first either so thank you for pointing it out. She kicks out her right leg. ", "Buddy he's getting at least 40%. I have no idea why but I really think Sanders free college plan should happen after this. ", "Head of the budgetary committee if all goals well for him I think. Basically gives him a bit of push when it comes to progressive goals since he'll be leading the budget battle", "She's bad\n\nSource: feelings", "You realize this investigation was into Weiners laptop right? The majority of the 650K were Weiners a small fraction related to Huma and an even smaller fraction of *that* were to/from Hillary ", "Are you a time traveler?", "After reading this mess of cognitive dissonance I'm not even certain you are old enough to vote.", "LMAO the title.", "r/politics is a Hillary feedback loop and has been since the convention.", "Just remember it's Rorschach test truth; you listen to what The Donald says, but hear only what your mind wants to believe. The rest? He was joking.\n", "Go. Fucking. Vote.", "Hispanics have historically been hard to nail down in polls. They may primarily speak Spanish they work a lot and mixed shifts, they are not necessarily trusting of cold calls.\n\n\nSo they are probably significantly under-reported.", "If she only sucked his cock once she earned every penny of his millions. ", "You did a good job of that yourself with a 3rd party vote.", "Umm yes? The US is by far the leader in medicine development we need to change how our people get it but that's not a question of inventing things.", "This entire election is fucking sad.", "PLSS GOD PLSS GOD let something trigger him later tonight at 3am before election day. 🙏🏻🙏🏻🙏🏻", "Why three separate replies???\n\nAnyway those articles are still based on Wikileaks' own claim. I've personally seen no outages on Wikileaks. Is there an independent confirmation of the attack aside from their claim?", "Muslim? Better keep your head down.", "That would be the cherry on top if it's true that [he decided to run because of how humiliated/badly roasted he was by Obama/Meyers at the 2011 Correspondence dinner](http://youtu.be/Htt91G2qDwM)", "Just following the rules. The typo is in the actual headline.", "Louisa Adams wife of John Quincy Adams, born in London and daughter of an American Consul. ", "Dude's jewish and anti-semitism is on the rise."], "links": ["5bj5mv", "5bj5mv", "5bj5mv", "5bk3p7", "5bke17", "5bj5mv", "5bke17", "5bj5mv", "5bj5mv", "5bk3p7", "5bk3p7", "5bj5mv", "5bjpvl", "5bjlxt", "5bke17", "5bk3p7", "5bj5mv", "5bj5mv", "5bk3p7", "5bj5mv", "5bk81i", "5bj5mv", "5bk3p7", "5bjpvl", "5bk3p7", "5bke17", "5bkkxm", "5bke17", "5bk3p7", "5bipo9", "5bke17", "5bk3p7", "5bj5mv", "5bjpvl", "5bk3p7", "5bj4yq", "5bj5mv", "5bke17", "5bj5mv", "5bjxd3", "5bk3p7", "5bke17", "5bk2of", "5bke17", "5biz3j", "5bj5mv", "5bj5mv", "5bjpvl", "5bj5mv", "5bj5mv", "5bjpvl", "5bkg8h", "5bk81i", "5bj5mv", "5bjomg", "5bk3p7", "5bke17", "5bke17", "5bj5mv", "5bizz9", "5bjpvl", "5bk3p7", "5bk3p7", "5bj5mv", "5bk81i", "5bke17", "5bj5mv", "5bkg8h", "5bke17", "5bj5mv", "5bi2bh", "5bipo9", "5bk3p7", "5bjpvl", "5bj5mv", "5bke17", "5bjxd3", "5bi956", "5bjpvl", "5bk2of", "5bjpvl", "5bjpvl", "5bk3p7", "5bj5mv", "5bjpvl", "5bjaje", "5bj5mv", "5bke17", "5bk3p7", "5bjpvl", "5bj4yq", "5bk3p7", "5bke17", "5bigmd", "5bj8zz", "5bj4yq", "5bjxd3", "5bkkxm", "5bkkxm", "5bk3p7", "5bj5mv", "5bkkxm", "5bk3p7", "5bkkxm", "5bk3p7", "5bj5mv", "5bj5mv", "5bkkxm", "5bj5mv", "5bj5mv", "5bj5mv", "5bj5mv", "5bkkxm", "5bj5mv", "5bjxd3", "5bj5mv", "5bk3p7", "5bj5mv", "5bj5mv", "5bj5mv", "5bkkxm", "5bj5mv", "5bj5mv", "5bkkxm", "5bjrsd", "5bj5mv", "5bk3p7", "5bjxd3", "5bjlxt", "5bj5mv", "5bkkxm", "5bkkxm", "5bj5mv", "5bj5mv", "5bj5mv", "5bj5mv", "5bj5mv", "5bi1pe", "5bk3p7", "5bjpvl", "5bj5mv", "5bj5mv", "5bke17", "5bkrsy", "5bj5mv", "5bj5mv", "5bk3p7", "5bj5mv", "5bj5mv", "5bjpvl", "5bk3p7", "5bj5mv", "5bk3p7", "5bj5mv", "5bke17", "5bk3p7", "5bj46n", "5bknfa", "5bknfa", "5bj5mv", "5bk81i", "5bipo9", "5bj5mv", "5bk3p7", "5bj5mv", "5bkkxm", "5bke17", "5bjxd3", "5bkbuk", "5bkrsy", "5bk3p7", "5bkptt", "5bjrsd", "5bjxd3", "5bk3p7", "5bkrsy", "5bk3p7", "5bkpip", "5bk2of", "5bk81i", "5bi1pe", "5bk2of", "5bi956", "5bjpvl", "5bk3p7", "5bjpvl", "5bk3p7", "5bknfa", "5bkbuk", "5bjlxt", "5bj5mv", "5bj5mv", "5bj5mv", "5bkkxm", "5bk3p7", "5bk3p7", "5bjpvl", "5bk3p7", "5bj5mv", "5bk3p7", "5bjpvl", "5bj5mv", "5bkkxm", "5bjpvl", "5bj5mv", "5bj5mv", "5bke17", "5bjrsd", "5bj5mv", "5bkkxm", "5bky9o", "5bkkxm", "5bk3p7", "5bjrsd", "5bk3p7", "5bkkxm", "5bj5mv", "5bk3p7", "5bkvz0", "5bj5mv", "5bk3p7", "5bk3p7", "5bj5mv", "5bk3p7", "5bj5mv", "5bigmd", "5bk81i", "5bk3p7", "5bjxd3", "5bk81i", "5bk3p7", "5bkkxm", "5bj5mv", "5bj5mv", "5bk3p7", "5bj5mv", "5bktq9", "5bjlxt", "5bke17", "5bktq9", "5bktq9", "5bkxzp", "5bjpvl", "5bktq9", "5bkxzp", "5bkvz0", "5bky9o", "5bj5mv", "5bkum7", "5bkum7", "5bj4yq", "5bjomg", "5bke17", "5bkxzp", "5bk81i", "5bj5mv", "5bktq9", "5bkum7", "5bk3p7", "5bkum7", "5bk3p7", "5bj5mv", "5bjrsd", "5bj8zz", "5bke17", "5bk3p7", "5bj5mv", "5bk3p7", "5bky9o", "5bjpvl", "5bj5mv", "5bj4yq", "5bktq9", "5bktq9", "5bkxzp", "5bk3p7", "5bk81i", "5bjpvl", "5bjxd3", "5bj5mv", "5bkum7", "5bkxzp", "5bkvz0", "5bkxzp", "5bj5mv", "5bj5mv", "5bkkxm", "5bj5mv", "5bl2un", "5bj5mv", "5bj5mv", "5bj5mv", "5bkkxm", "5bj5mv", "5bkkxm", "5bkwua", "5bl2un", "5bl2un", "5bk3p7", "5bj5mv", "5bjrsd", "5bl2un", "5bj5mv", "5bk3p7", "5bjpvl", "5bkwua", "5bkxzp", "5bj5mv", "5bky9o", "5bk81i", "5bjpvl", "5bj5mv", "5bl2un", "5bky9o", "5bj5mv", "5bke17", "5bj5mv", "5bjlxt", "5bj5mv", "5bk3p7", "5bjomg", "5bkxzp", "5bke17", "5bjrsd", "5bj5mv", "5bj5mv", "5bigmd", "5bjpvl", "5bk81i", "5bk3p7", "5bkum7", "5bl2un", "5bky9o", "5bjxd3", "5bj8zz", "5bj5mv", "5bk81i", "5bk3p7", "5bi1pe", "5bj8zz", "5bjpvl", "5bj5mv", "5bj5mv", "5bjaje", "5bj5mv", "5bjpvl", "5bi1pe", "5bj5mv", "5bk81i", "5bkwua", "5bj5mv", "5bk81i", "5bl2un", "5bj5mv", "5bj5mv", "5bjgmr", "5bj5mv", "5bkum7", "5bj5mv", "5bk3p7", "5bi1pe", "5bj5mv", "5bkxzp", "5biz3j", "5bjxd3", "5bky9o", "5bjpvl", "5bi1pe", "5bi956", "5bl2un", "5bk3p7", "5bkum7", "5bi1pe", "5bk3p7", "5bi1pe", "5bj5mv", "5bjpvl", "5bjaje", "5bj5mv", "5bigmd", "5bj5mv", "5bj5mv", "5bj5mv", "5bjrsd", "5bk3p7", "5bk3p7", "5bjpvl", "5bjrsd", "5bjrsd", "5bk3p7", "5bj5mv", "5bjxd3", "5bjxd3", "5bkkxm", "5bjlxt", "5bk81i", "5bk3p7", "5bjpvl", "5bk3p7", "5bjlxt", "5bl9a7", "5bjrsd", "5bke17", "5bjxd3", "5bl7ho", "5bke17", "5bjlxt", "5bl7ho", "5bj5mv", "5bj5mv", "5bk3p7", "5bj5mv", "5bl7ho", "5bkkxm", "5bjpvl", "5bk3p7", "5bj5mv", "5bj5mv", "5bl87o", "5bk3p7", "5bkkxm", "5bk3p7", "5bj5mv", "5bigmd", "5blbfa", "5blac6", "5bj5mv", "5bl2un", "5bil4t", "5bjaje", "5bl2un", "5bl9mm", "5bj5mv", "5bl2un", "5bj5mv", "5bjpvl", "5bkwua", "5bk3p7", "5bl9mm", "5bl9mm", "5bipo9", "5bk3p7", "5bkkxm", "5bjxd3", "5bke17", "5bl7ho", "5bk81i", "5biz3j", "5blbfa", "5bj5mv", "5bjxd3", "5bl2un", "5bi956", "5bjxd3", "5bl87o", "5bl2un", "5bk3p7", "5bj4b5", "5bk3p7", "5bj5mv", "5bl9mm", "5bk3p7", "5bi956", "5bl87o", "5bj8zz", "5bl7ho", "5bi956", "5bky9o", "5bj4yq", "5bj5mv", "5bkkxm", "5bkkxm", "5bj5mv", "5bk3p7", "5bj5mv", "5bj5mv", "5bk81i", "5bke17", "5bjrsd", "5bj5mv", "5bkkxm", "5bkkxm", "5bkkxm", "5bj5mv", "5bigmd", "5bk3p7", "5bk81i", "5bj5mv", "5bke17", "5bjpvl", "5bk3p7", "5bkkxm", "5bke17", "5bkkxm", "5bjlxt", "5bkbuk", "5bl2un", "5bk3p7", "5bj8zz", "5bk81i", "5bjlxt", "5blirc", "5bjrsd", "5bj5mv", "5bkbuk", "5bj5mv", "5bj5mv", "5bj5mv", "5bi956", "5ble9t", "5bjrsd", "5bj5mv", "5ble9t", "5bk3p7", "5bj46n", "5bj5mv", "5bke17", "5bjrsd", "5bjlxt", "5bk3p7", "5bjxd3", "5bi1pe", "5bi1pe", "5blirc", "5bj5mv", "5blawa", "5bj8zz", "5ble9t", "5blgll", "5bj5mv", "5bl98v", "5blawa", "5bke17", "5bk3p7", "5bj5mv", "5bjlxt", "5bk3p7", "5biz3j", "5bj5mv", "5bleub", "5bjomg", "5bkbuk", "5bj5mv", "5bj5mv", "5bj5mv", "5bj4b5", "5bj5mv", "5bjxd3", "5bkqgu", "5bk3p7", "5bky9o", "5bjxd3", "5ble0p", "5bj5mv", "5bjlxt", "5bleub", "5bj46n", "5bipo9", "5bjxd3", "5bj5mv", "5bk3p7", "5bl98v", "5blbfa", "5bj46n", "5bj3xo", "5bldcq", "5bipo9", "5bj8zz"]}