{"comments": ["Is he living in Russia and tweeting things contradicting Trump?", "Drop non-responsive To:/CC:/BCC: hash both sets, then subtract those that match. Old laptops could do it in minutes-to-hours.(Snowden Tweet ) ... But making it sound impossible to do in a short period of time ...stirs up the Trump Zombies !", "Ehhh\n\nStill not convinced...\n\nI think I need to be belittled, bullied, and insulted a few more times.", "If you want Bernie to chair a committee and actually influence some legislation that is...", "I haven't been reminded of my Privilege lately.", "Not a plant. Not a plant. You're the plant. ", "The real story here is that she didn't get beat up. ", "&gt; Whoever wins we lose.\n\nat least we can all agree on that.", "Trumpers are not angry about jobs or the economy as they may claim. They are just bigots and bullies who hate anyone they perceive as inferior or weak. They only want free license to persecute and subjugate others.", "Nope.  I'm still voting my conscience so you can't blame me when we go to war.", "Sanders is rallying behind her for a reason and he has good reasons but if you don't want to join him then at least consider doing two things over the next 48 hours to help him advance his goals: Don't let your issues with Hillary suppress Democrat turnout. Vote down ballot for Congress. She is likely going to win with her current numbers, but Sanders would be better off with a Democratic majority in the Senate.", "We need to have a basement dance party in her honor. ", "I will never vote for the candidate who colluded with the DNC to cheat in the debates and steal the primary from Sanders. He was our candidate. Bernie supporters who plan on voting for Hillary should be ashamed of themselves. I would rather give the Presidency to Trump than reward Clinton and the DNC for what they have done.\n", "Do you have any username regret? ", "I mean democracy has had a bad year: Brexit, Duterte, Trump", "Kicking the wheelchair of a disable kid. \n\nWhat kind of monsters are these supporters?  ", "I charge a reasonable fee by the hour PM if interested.", "De-fucking-plorable ", "The funny thing is he is working twice as hard but not reaching as many voters. Democrats have surrogates that are barnstorming different states every day not to mention Hillary's ground game.", "It's almost like a profit driven model isn't the one sized fits all solution to all our problems. But Rubio would never think to ask why the media does what it does. ", "Yes this woman just wanted to be sexually assaulted. That's secretly what every woman wants.\n\n/s in case that wasn't clear.", "For a long time I was afraid that Donald would pivot and be Presidential.\n\nBut the Donald would rather be the Donald than be President.", "I'm really gonna miss Obama. I might not agree with him on everything but he has more class then our next president can possibly havs.\n", "good news. and if that still doesn't make it easier for you to vote in Philly free uber and lyft rides tomorrow:\nhttps://myridetovote.org/\n\n", "Man there's so many plants at Trump's rally it's actually reversing global warming.", "It was kind of gross that Trumpers were hoping for a strike to get a close race.\n\nGlad to hear the strike's finished.", "president Clinton", "    $ sudo mount woman\n    $ touch woman/pussy\n    touch: cannot touch ‘woman/pussy’: Permission denied", "Nixon started the EPA which is good.  But yeah then there's watergate, vietnam, etc.  \n\nStill would pick him over Trump.  ", "Also what are the odds that the FBI already has tools to automatically consume an Outlook .pst file and distill it into something more useful in a push of a button?  I seriously doubt it requires any actual computer skills beyond what your average office worker has.", "That's not targeted voter suppression that's some office clerk fucking up the records. It's unfortunate for you, and I'm sorry it was such a bitch for you to vote in your primary, but things like that are inevitable in such a large bureaucracy. \n\nIf you were issued a mail in ballot, that's wasn't the DNC, that was your state.", "&gt; Bernie supporters who plan on voting for Hillary should be ashamed of themselves\n\nYou mean like Bernie? ", "No. He is saying that the only way Berne will have any real influence is if Clinton is elected.\n\nIf Trump wins there is no way the Dems flip the Senate.", "Not all 650000 emails were relevant just the ones to/from Hillary's server. ", "How would the DNC have gotten involved? If it was mail in it was in the control of the State.", "I really wish Rage Against The Machine would ditch their neutrality and tell us their real unfiltered thoughts on the state of the American political machine.", "Damn it I came here to ask for [one last dance party...](http://www.nbc.com/saturday-night-live/video/janet-renos-dance-party/n11053).", "Good news out of Philadelphia.  Looks like all mass transit service will be available for Election Day Tuesday.", "Generally speaking the people who support Trump have no idea such software exists.", "and before anyone starts with the nonsense about the emails where CNN asks the DNC for questions...\n\nBoth the RNC and DNC get asked for debate question suggestions. It's been standard practice for debates for quite a while. \n\nhttps://twitter.com/stuartpstevens/status/795312485062606848", "Not a fake Bernie supporter at all. ", "One more day lads. One more day and we won't have to hear about tracking polls for another four years.", "sudo^^nald", "In other words:\n\n&gt; Fuck due process we need a witch hunt.\n\nSeems a fitting end to this shit campaign.", "Hmm. You're defending David Duke and you're clearly sympathetic to his worldview that jews run the world. As evidence, you point to an obviously satirical opinion article, so you're either trying to be disingenuous with a blatant mischaracterization, or simply lack reading comprehension, and aren't able to tell that article is making fun of people like you. \n\nUnrelated question, who are you supporting for President this year?\n\nJust kidding, everyone already knows it's Trump. Wonder why? ", "If it were impossible or unreasonable to finish the analysis before the election I'd buy this. But they sat on the data for 2 weeks. Waited until after announcing they were going to look another day or two before getting a warrant...and still finished two days before the election.\n\nIf you had nothing and wanted to make it look like you had something, this is exactly how you'd go about it. Had they just gotten a warrant and done the analysis the minute they found the emails, they could have told us *before early voting even started* that this was nothing.", "Everyone is a Clinton plant but you. ", "No question about that all political bullshit aside, his son paid the ultimate price so she can stand there and get inaugurated ", "The should be the official tagline for the 2016 election. ", "No they were not the closest to correct at all. Do not spread lies and misinformation when someone can post the truth.\n\nIBD/TIPP called Obama +1 but Obama won by +3.9 both Pew and ABC/WaPo were closet with +3 Obama.\n\nhttp://www.realclearpolitics.com/epolls/2012/president/us/general_election_romney_vs_obama-1171.html\n\n\nlol", "I love Bernie. Total supporter. All the way. But what I like more than Bernie is Bernie's policies - those things are really really good. And last time I checked in with my brain Trump hadn't shown much interest in getting any of those through. In fact he's stated he would go in the complete opposite direction. \n\nI think Bernie knows this which is why he isn't supporting Trump.", "That poll showed Obama +1.\n\nAbc had Obama +3\n\nObama won by 3.9.", "You can't just say that and not elaborate. Come on share. \n\nWas it you not registering as D in time for a primary? Were you purged from the registry before a primary, which, when it occurred, hurt Clinton more than Sanders? Or is it something completely different?", "She was ruthless", "&gt; doesnt that mean they still have to look at 620000?\n\nNot if the other 620000 don't go to the state department email or more specifically HRC's email.", "In their defense they look at the things Trump says and think \"Hey, these are the things *we* say!\" Then they look at his rallies and polling numbers, and think \"hey, there are *literally millions* of people in this country supporting this candidate who says exactly what *we* say!\"\n\nWhat conclusion are they supposed to reach, other than that there are millions of people who are okay with things the KKK says?", "Jesus christ that headline lol", "yes a kid in a wheel chair.  A perfect and easy time for trumpers to take the high road.  But, they're dumb assholes.", "And part of the problem is that some Americans would call you \"unpatriotic\" for not claiming that America is the greatest country on Earth. Ironically many of those people are Trump supporters (at least in my personal experience) who want to make America great again. The inconsistency is infuriating.", "Imagine what you would be put through with 4 years of president Trump. Makes voting for Clinton easier.", "\"May your skin be bright orange and your hair resemble sea anemones copulating\" ", "He also said a few months ago to not listen to him if he ever told us who to vote for. I was with him to break up the power structure of this country to get money out of politics.", "I mean besides privately saying mean things about him ", "THANK YOU SEPTA!\n\n...Man, that feels strange to say.", "He'll have no decent platform or position without a Dem majority Senate and you know it. ", "if they have 33000 unique ids from before and 650000 now with 33000 matching doesnt that mean they still have to look at 620000?", "Hillary founded ISIS shortly after her Bat Mitzvah", "&gt; *Never attribute to malice that which is adequately explained by stupidity.*", "Mk. II", "After Waco even Rush said that she was the best person for the job.", "What will you people do for work after the election?\n\n[Hillary PAC Spends $1 Million to ‘Correct’ Commenters on Reddit and Facebook](http://www.thedailybeast.com/articles/2016/04/21/hillary-pac-spends-1-million-to-correct-commenters-on-reddit-and-facebook.html)\n", "Whoa whoa whoa you are telling me we need to consider things in *context*???", "Primaries aren't democratic.", "You can't hate people like he does without embracing bullshit.", "no dissenting opinions around these parts!!!\n\nclassic republican rally.", "Maybe. Her leadership with the Libya transition (not Benghazi) has resulted in chaos there and with Russia saber rattling in Yemen and Syria we are damn near at the brink of WW3. Iranian and Russian backed rebels have been launching missiles at US Navy ships. \n\nI can understand why we have lousy candidates. What sane person wants to spend years of their lives being disrupted so they can get to make decisions between terrible choice and awful choice?  \n\nI remember the \"oh shit\" moment when driving my daughter home from the hospital.  I can't imagine being passed the nuclear football. \n\nIt doesn't matter who wins. It is going to be a rough four years. Hopefully it will be healing and someone will step up and help us so that but I'm not sure who that would be. ", "FBI not FB We", "How many manhours wasted on trash like this on t_d instead of on things that could have helped Trump like phone banking or GOTV?", "Shhhhhhh! Don't tell them how real campaigns work.", "ding ding ding", "Well he does know more than the generals fighting ISIS. ", "Clinton is Bernie's antithesis. Do you think Clinton will wage war against the corporate leaders of Wall Street for us? She will be grabbing so many briefcases under the table it would make Nixon blush.\n", "Wait didnt they just beat their current 2020 target?  Im fairly certain they are ahead of us in the cutting emissions race.", "Sure but those are irrelevant to Hillary and the investigation you'd have to open a new investigation into Podesta for those. That is even if they exist and you stop drinking the Alex Jones coolaid.", "She had plenty of time to talk about her policies against Bernie but she didn't because she learned her lessons against Obama that she neither has the charisma nor the trust of the people to win on that alone. Hillary should be thanking the gods that she's running against Trump because at this point she probably wouldn't win against most other candidates the republicans have put out before.", "Most accurate poll in the galaxy. What a joke.\n\n", "You have now been banned from /r/Pyongang and /r/the_donald. \n\n ", "http://i.imgur.com/prLhhqm.gif", "It's so strange that they know he's so irrationally stupid that they have to do this but still want to make him president. What do they do for an encore gargle with razor blades?", "No Nate Silver is not 'taking a more conservative position then is warranted'.    He's not taking a position at all.  He has a statistical model that he created long before the election started, and he just feeds poll data to it.  And the model is telling him the election is close, especially in swing states; Hillary has a slight lead in the polls, but it's within the margin of error in most places.   \n\nDon't be in denial here.   There is a lot of uncertainty, and this election could be close.   Don't take anything for granted.  \n\nAnd no, Nate certanly doesn't think the GOP is a competent party with values or policy positions, lol.    I'm guessing you haven't read many of his articles or listened to many of his podcasts?   They try to focus on the statistical stuff over there, that's their wheelhouse, but  they do occasionally admit just how horrified they are by the stuff Trump says and does.   ", "Well if the Daily Beast says so then by golly on the very last day I'm going to change my mind and support Hillary just because I supported Bernie. Thank goodness the author isn't pushing an agenda.", "What the fuck is with all the deleted posts?", "Can you Imagine christie going to jail for this, rudy going to jail for FBI thing and then Trump ends up with criminal charges on university fraud and does time?\n\nThey will cry we are jailing our political opponents LOLOL  \n\n\nEdit: just read an article that Trump is planning for all these morons and more to have top positions in his administration. VOTE VOTE VOTE", "No thanks.", "These comments are hilariously condescending", "I think he's going to get charged. Remeber when he was shouting \"LOCK HER UP\" from the top of his greasy lungs at the RNC pulpit? Well now that cry is going to be heard about his lardass. From his own citizens. It's ironic how quickly the tables turn. \n\nChristie is an embarrassing shitstain on the fine reputation of the fine people of New Jersey. ", "No. Bernie was the answer. The DNC/Hillary STOLE the election from him[.](https://docs.google.com/spreadsheets/d/1sGxtIofohrj3POpwq-85Id2_fYKgvgoWbPZacZw0XlY/edit#gid=1323002420) She is not entitled to his spot. Bernie could have beaten Trump.", "It concerns me that they will escape prosecution exactly for that reason.", "I have an unhealthy desire for Tuesday night when the babysitters leave Trump Tower and the orange twit is armed again.", "There's a non negligible part of the Bernie camp that doesn't give a fuck about Bernie or his platform they're just anti establishment or anti Clinton", "You really shouldn't be called a \"global warming skeptic\" for not accepting the science consensus here. That would be like if I argued that triangles had 4 sides on a math test and instead of being called wrong I was just labeled as a \"geometry skeptic\". ", "This is r/Politics Not r/ClintonCircleJerk", "Yep Trump is definitely going to get those Washington insiders out of politics.", "My favorite part was when the mom turned to look at her and all the sudden the kicker was like 'oh no I didn't do anything, just uhhh...adjusting my sign! Yeah!'. \n\nWhat awful behavior.", "Is this gif from the same rally? Trump supporter kicked the mother on her way of being escorted out.\n\nhttps://gfycat.com/SeparateSandyCrab", "&gt; But how can people be so stubborn?\n\nWell because they're not actually who they say they are. Some Bernie-or-bust people on reddit seem to have an agenda. \n\nEdit: I know there are plenty of genuine Bernie-or-bust people who will now vote Trump or third party. It is my personal opinion that you have an overly romantic view of yourselves, but whatevever, you do you. ", "\"The best people\" translates to literally the worst people...\n\n\"Anti-establishment\" translates to the same old Republicans.\n\n\"Drain the Swamp\" translates to appointing the same exact assholes that have been poisoning our political system for a generation.", "She didn't just wrong them  she wronged everyone. Blatant corruption, lying, pay for play, rigging the primary process.... It goes on. All of it present and shown in the podesta leaks. She's the epitome of everything wrong with American politics. I get it, trump is bad, but that shouldnt make any sane person OK with putting Clinton in the white house. ", "In Texas they believe Jesus will come back to destroy the earth much sooner than global warming will. Probably on Nov 9th if Hillary wins.  \n\n--Source A long suffering Texan.", "and of course the supporter is a coward.", "Trump supporter (Disclaimer).  I think it would be very difficult for any of you to deny that Bernie was robbed of any chance at the presidential nomination.  To further that - ANY OF YOU that voted for Bernie and supported him were victims of election fraud.  You supported and voted for a person that was NEVER going to be given a chance to win.\n\nNow with emails that came out in the last few days - it is appearing that Sanders was very likely blackmailed by the Clinton campaign to not go too hard on her during the election (like dismissing the emails).  It also appears that whatever the DNC has on Bernie may very well be securing his reluctant support of her now.  \n\nI know I won't change any of your minds to vote FOR Trump.  But seriously - voting for Clinton tells the Democrats that what they did was OK.  It tells them that THEY get to decide who is put in positions of power.  I don't care if you vote for Trump (I wish I was not a supporter of his so my comments would have more meaning to you), but we (Repbulicans) were basically in the same boat.  We had the RNC telling us basically who we should choose.  They refused to support Trump (like the DNC did with Bernie).  They worked with his opponents to try to keep him from the nomination.\n\nI know most of you hate Trump - and I will be the first to admit he is not the perfect candidate.  But speaking from the heart - he is the guy WE chose.  You all (Bernie supporters) chose to side with a man that NEVER had a shot.  Now, he is out there reluctantly supporting her.  I do not agree with his politics, and I would never vote for him - but I do feel sorry for the position he has been put in.  In a couple years, he will be nothing but a footnote on the election.  Just like in my teens when Ross Perot pumped some enthusiasm into the election - Sanders will just be known as the \"loser\" of the primary.  \n\nIf you really supported him.  If you really believe in what he stands for, and the policies he proposes - then you MUST NOT vote for Clinton.  You must show the power structure of the DNC that they are there because YOU PUT THEM THERE.  \n\nWin or lose for Trump - the Republican party is going to have a revolution.  The power players that have for years ruled the party and pulled the strings now realize that Republicans are tired of being forced to choose the candidates they put in front of us.  If you \"progressives\" really believe in your cause - it is time to send a message to the DNC that YOU will pick the candidate you want.\n\nDon't vote for her just because you feel you \"have to\".  If you really believe in change - and sending a message - vote for Trump or Johnson or Stein (hell - write in Bernie).  Just don't let them think they can pull all this sh*t and still win.", "OK...  Feelings aside now what should I do with my principles? If people are choosing not to vote for Clinton its not because their feelings are hurt, it's because they can't in good conscience support such a blatantly corrupt as fuck liar.", "Yeah seriously. The moment the woman looks at them after the kick suddenly they're looking at the ground fiddling with their Trump sign. \n\nThey even look back up and see she's still looking, then quickly go back to pretending there's something important going on with their sign in their hand near the ground.\n\nAbsolutely pathetic.", "Something important to remember - after beating Sanders Clinton could have moved to the center to try and compete for more independents or disaffected Republicans. All of the Sanders supporters assumed she would do this and were terrified of a \"center-left\" Democratic Party that wasn't progressive enough.\n\nInstead, she went hard left, along with the party, at the convention, and is running on tax increases for the wealthy, aggressive environmental policy, free public college education for those making less than six figures.\n\nIf we reward her by giving her our support, she will have a progressive mandate and the Democratic Party will have proof that it can move left and compete nationally.\n\nIf we stay home or jump ship to third parties? They'll never give us this opportunity again, at least not for years. They will see a progressive platform is a loser in the general election, and we will have succeeded in creating a center-left party after all, that is, if we survive four years of Trump.", "It has been a very tough few years for New Jersey Gov. Chris Christie. He has gone from the hottest thing in Republican politics (circa 2012) to well, not.  From his never-really-got-started presidential campaign in 2016 to his decidedly odd surrogate work for Donald Trump, Christie has watched his relevance as a major figure within the GOP ebb away. ", "It is pretty funny. Though also terrifying the number of people supporting this man child.", "&gt; She's the epitome of everything wrong with American politics\n\nYet somehow she's *still* considerably better than Trump!", "&gt; Here is a video of one Trump supporter kicking the kid's mom as they are leaving.\n\nthat fucking bitch and her side ponytail should rot in hell.", "You missed \"blatantly corrupt as fuck\".  And no every politician is not that. ", "Noam Chomsky who suppored Bernie in the primaries, concurs - he recommends at least in swing states, [\"hold your nose and vote for Clinton\"](http://www.democracynow.org/2016/5/16/chomsky_on_supporting_sanders_why_he).\n\nbonus quote: Trump [\"almost a death knell for the human species\"](https://www.theguardian.com/film/2016/may/20/noam-chomsky-on-donald-trump-almost-a-death-knell-for-the-human-species).", "Or maybe they don't live in a swing state so they understand the electoral college system and would rather vote for a third party to try to get them federal funding for the next election so we don't continue with a two party system that can result in two of the worst candidates in the history of polling data again?  Not everyone is just throwing a tantrum.  If you live in a state where your vote doesn't matter you should vote for whoever you want and if that means voting third party that's what you should do.", "This is my favorite part. He assumes that the FBI had one dude there opening each email and reading them. ", "\"If you can convince the lowest white man he's better than the best colored man he won't notice you're picking his pocket. Hell, give him somebody to look down on, and he'll empty his pockets for you.\" -President Lyndon B. Johnson", "If you cannot in good conscience vote for a liar then you should never vote. All politicians lie. All the time. It's a crucial aspect of their jobs. Every person you have ever voted for and every person you will ever vote for has been a massive liar.\n\nThe worst - the absolute worst - thing you can do is succumb to romantic delusions that your preferred candidate de jour is more honest than everyone else. That's how cults of personality happens. That's how people like Trump happen.", "The obvious question is who is really controlling Trump? Which leads to the question, who will be snatching the nuclear football if Trump starts losing it. ", "No I don't think that's entirely correct. Sure they are bigots and bullies but they are also angry( partly because they are bigots). Even where they look the minorities are succeeding. From small business to large, from doctors to lawyers, everywhere. The minorities are moving into areas that are priced for \"upper middle class\". Traditionally all the niche occupied by white men are being filled by minorities and women. \n\nAnd that is scaring the hell out of them. It was ok if other white men were in those positions and making them feel poor, but it can never be a non white man/woman.  \n\nSo they are angry about the jobs that were exclusive domain of white men, they are angry about an economy that is leaving them behind.  ", "Just so everyone knows the House science committee has been so fucked up for a long time. They don't do **shit.**", "People really don't give her enough credit for going hard left after winning. That never happens in US politics", "&gt; tone-death\n\n😐\n\nEither that article was written by a high school English student or Google's closed-captioner. P-U.", "Because **absolutely nothing** happened in the world since then.", "The people waiting in line for 5 hours to vote told him about the poor turnout ", "He should be tried for his crime against his people.", "A young-ish looking white woman get beat up at a republican rally??? Not a chance. She would have had to make the kind of move that would get a man OR a non-white woman shot by the secret service for people to lay hands on her.  \n  \nSad but true.", "Oh god bless those FBI Agents. How many dick pics did they have to endure in one weekend? ", "I'm pretty sure that editorial note has been on all their Trump articles for months now", "I'm a proud beautiful fikus.", "The anti-establishment candidate everyone. ", "Principles are a guide. They are an arrow pointing where you want to go.\n\nThey are not prescriptive and limiting. Sometimes you will deviate left or right slow down, or even move backwards - but principles exist to show you the way you're trying to head overall.", "He's probably imagining one guy printing them all out and sorting them into piles.", "&gt; this kid &amp; his mum showed up at a trump rally chanting for 'Hillary Clinton'. What were they expecting to happen?\n\nIf I went to a Hillary Clinton rally and chanted for Trump I'd expect to get booed and yelled at and ejected. I wouldn't expect to be assaulted. ", "Where are you getting that information?", "I remember in the beginning of the year how everyone on reddit was against Clinton. Both sides disliked her because democrats wanted Bernie, and we had sooo much links and posts about how she lies and flip flops all over the place.\n\nThen you expect everyone to just forget all of that and *join* her because she is the democrat? Nope, duck that, it's time to choose the *other* anti establishment politician, even if it's on the other side of the spectrum.", "Nah I have two cats, I think they have it covered.", "I don't know how trust worthy this is as Priebus doesn't meet the minimum # of marriages required.", "The KKK the KGB and the FBI are all working for the same candidate. That's all I would need to know figuring out how to cast my vote. ", "He was incapable. Just as much as I can pivot to doing theoretical physics.  ", "Yeah but emails. \n\nNever mind all the constant lies, the lack of any comprehensive policy, the fascist tendencies of the Trump campaign and the complete opposite viewpoints when it comes to equality, minority rights, healthcare, education, the environment etc.", "To be honest I kinda feel sorry for Bridget Anne Kelly. If what she said is true, then she is merely a patsy for Christie. The case took a very heavy toll on her - she aged terribly over the past couple of years.\n\n[2014](http://www.northjersey.com/polopoly_fs/1.649179!/fileImage/httpImage/01082014bridgetkelly-dngnk.jpg)\n\n[2016](http://www.gannett-cdn.com/-mm-/09d958d0b4ff41440311d29a01a46278b9b6801e/c=231-0-4019-2848&amp;r=x408&amp;c=540x405/local/-/media/2016/11/05/USATODAY/USATODAY/636139417102117348--DIP-01A.JPG)", "Or even I'd expect Obama to be like \"He has a right to protest. Don't boo or kick that kid in a wheelchair vote!\"", "He has to work twice as hard who does he have that's **really** out there stumping for him? Christie and Giuliani are damaged goods and Pence is running for himself.  \n  \nThe star power over on Sec. Clinton's side is staggering, need to hit the college campuses? Call up four or five multi platinum recording artists. Need to energize blacks? How does the staggeringly popular (ESPECIALLY among blacks) first black president sound? Blue collar America? Ol' uncle Joe will handle it. I mean it isn't even fair anymore.", "Did you make it all the way to the end of the article?  Huffpo has really taken off the gloves:\n\n&gt;Editor’s note: Donald Trump regularly incites political violence and is a serial liar rampant xenophobe, racist, misogynist and birther who has repeatedly pledged to ban all Muslims — 1.6 billion members of an entire religion — from entering the U.S", "Bill Clintons 1996 State of the Union address almost had the line \"An era in which things certain seem to melt in the air.\" to describe the 90s.\n\nIt was proofread 10 times before an intern realized that line was from *The Communist Manifesto*. Could you imagine where we'd be today if Republicans caught Bill or Hillary quoting *The Communist Manifeseto*?", "But lets be honest (hoping to have a civil debate) it should be pretty clear that what you are talking about with Hillary is not completely accurate.  At least with Trump - you know where HE stands on an issue (even if he is not eloquent about how he says it).  With Clinton, it is very clear that her stance on various issues is told to her.  Look at some of the emails that show how every speech and every statement she gets is reviewed by 20 people to make sure it is \"crafted\" to appease the most people.  Look at times where her staff has said things like \"not sure where we should be on that issue - lets hold off\" (paraphrasing, not an exact quote).  At least with Trump if you walk up and ask him a question - he will tell you what he thinks.  \n\nAgain, I know I won't convince any of you to vote for him.  But hopefully when you are standing in the voter booth you will ask yourself if you can really support the candidate of a political party that will have appointment and position dictated to them by their corporate sponsors.  Look at the email about the Obama cabinet.  Citibank literally told the Obama administration who to put in charge.  To say that Hillary has surrounded herself with great people is not accurate.  CORPORATIONS AND DONORS have told her who she will put in different positions.  \n\nJust look at her Vice Presidential pick.  Kaine was decided well over a year ago.  I wonder if Hillary and the DNC told people like Sanders or any of the other people that thought they were \"in the running\" for the VP position that it was decided already.  Is that the type of people you want in power?", "Yes its true you see unlike the GOP, dems work on establishing relationships and employ a foreign policy that works toward the safety of the American people. \n\nIf Russia is just doing its thing, we can be friends, but when they invade 2 countries and hack us, we arent friends anymore. \n\n\nBut since you guys love consiparcies that are undebunkable, I have an intelligence source telling me that Putin himself instructed snowden to shut them up because they are acting like inbreds chasing a dead end, they need to chase a more plausable and undebunkble theory because they are running out of time. ", "He lost by approx 3.7 million votes and 359 pledged delegates.  All you have are DNC emails from when he was already mathematically eliminated. They were frustrated that he was attacking their org and vented a bit. What's more is nothing came of those conversations, but to you, it means, \"RIGGED!!1!!!\"", "I reckon Michelle Obama's speeches have been the other. ", "Thank you for your service Janet Reno. I'll miss your dance parties. ", "You have internet access and a device of some type to access it when 3/4 of the people on the planet live off of less per day than a Grande Mocha at Starbucks.\n\nHow's that.", "Newt as SoS? I'm gonna hurl. \n\nThis election will either be Newt's worse nightmare - Clintons back in power - or a dream come through \n\nEDIT: grammar ", "I don't see him as a sellout I just don't agree with his support of Hillary. Him supporting her doesn't make me think much less of him. I'll only vote for a candidate I like and respect, my internal math goes in a different way then him. I can't begrudge someone that much for wanting to keep Trump out of office so bad they'll ignore other things. I just can't bring myself to that point. ", "True but it also had many successes that are too boring to make headlines. Most citizens in liberal democracies continue to enjoy prosperity human rights and freedom of speech. We just take them for granted. ", "Except a Trump only plays Minecraft on Creative", "Also there were far more than 33k emails reviewed in the first round, there were millions.  The thirty three thousand figure was the oft cited 'deleted emails' number", "A president does not gather intelligence. And while I don't approve of how we handled things following the attack I don't believe that laying blame on Bush due to taking vacation is fair at all. ", "Not much chance of them getting back inside at this rate\n...", "So I'm beginning to wonder if the election will essentially be over by the time the first polling precincts close (7 or 8 EST). Say for example Trump loses NH **and** FL that would make his path essentially impossible.  \n  \nOf course I'm not saying *something* couldn't happen and of course everyone should stay in line and bury that piece of garbage but man the news networks may be stuck talking in circles pretty early in the night as experts call the race for Clinton by 9pm EST.", "Honestly they left out a few things...", "Mental gymnasts UNITEDDEEEERRRRRFPPPPP! ", "Also asked RNC.\nContext matters", "I find the \"they had it coming\" line disturbing given that the first amendment applies to the disabled.", "If the GOP gave me a choice between HRC and Romney or McCain, Id have voted GOP. Trump is no politician. Not only that, his rhetoric is anti-fact and grossly unreasonable. It's not about policy for him, especially compared to HRC. Most Trump supporters admit what he would need a strong team of advisors to help him craft policy, as civics is not his strongsuit. I encourage you to look up his wiki page, and view who he has appointed to work for him right now. Not impressed, at. all. Compare it to Obama's cabinet. Night and day--not politically; intellectually. rationally. \nI need a rational, trustworthy candidate that can reason well and has policy before I can vote GOP, and I need the GOP candidate to be a sane person not intent on revolution before I can stay home. \n", "Actually a historic achievement for a third party to get more endorsements than a major party", "Some like my friends are simply butthurt.\n\nTheyd rather lose everything than vote for someone who they feel wronged them.\n\nChildren...\n\nEdit:  apparently I'm a neckbeard to spelling lose loose.  Clearly your wisdom is sagely oh trumpet.", "Only solace I take. These people are only imaginary badasses at a rally or in the Breitbart comment section.", "[deleted]  \n ^^^^^^^^^^^^^^^^0.4861 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/33629)", "I think you're gonna be sad tomorrow.", "I declare BANKRUPTCY", "Why do the underlings always take the fall?  Is the looking at jail or some alternative sentencing. ", "[shivers]", "You do know that the electoral college is a thing right?", "Not sure what you mean by \"right wing\" (militarily perhaps) but something that gets lost in the kerfuffle is that the US has made great strides socially in the past 50 years and it's almost exclusively due to Democrats.  Legal abortion women's rights, minority rights, LBGT rights, legal and regulated immigration, establishment and preservation of financial \"safety nets\" for citizens, etc.  Republicans fought against all of these things tooth and nail but lost.\n\nAmerica is still, by and large, far less liberal than Canada and western Europe, but is slowly moving in that direction.  Religion and ignorance still play a much larger role in politics than they do in other countries.", "Dear USA\n\nRegretfully you will have to wait for oswald.exe which will kill the main service process. This program will then be deleted. Eventually your system will recover but it might take some time to become stable. Hope this helps.\n\nBest of luck,\n\nAthens.", "Damn that's a sexy clickbait title there", "4 in the top 100.\n\nIt's really quite misleading to leave Johnson out when he has more endorsements than Trump.", "We have a third party candidate.  Vote Gary Johnson!  He's a good middle ground for both sides.  Maybe not perfect but he's a saint next to one that should be in prison, and the other in an asylum.", "I'll vote for whoever the fuck I want\n\n**EDIT** I did not expect this to blow up\n\n**EDIT #2** holy shit gold thanks guys\n\n**EDIT #3** I was banned for Incivility. So there ya go", "The Daily Beast is owned by IAC which is run by Chelsea Clinton...", "This is one of the most censored and controlled subreddits right now. Anything that even looks like an anti-Clinton post is removed.", "I understand that reasoning but my issue holding me back from voting Clinton is different. During the process of the primarys the DNC favored clinton from the beginning which undermine the voice of the people. The democratic party went against democracy. My issue is that no one seems to talk about this anymore, and I can't brimg myself to vote democratic in this election for that reason.", "This sub doesn't even try to hide its bias anymore.", "It's paid not to.", "*\"I am doing the opposite repeatedly writing friendly and positive pieces about Bernie as an HRC supporter, and when the time is right I will have money in the bank with him and his people as a liberal to urge them to come out in force to vote for HRC.”*\n\n- from wikileaks, revealing journalists who pretended to support Bernie with the aim of \"building credibility\" with his supporters to eventually push them towards Clinton.\n\nEDIT: Vote for whoever you want guys, just take headlines like this with a grain of salt.", "This is one reason why I support teaching CS in high school: not to train a throng of future software engineers but to make more people aware that there are rather easy techniques to quickly handle datasets so big that a human could never do it in a lifetime.  To anyone who has done a little programming, General Flynn's assertion is laughable.", "http://iac.com/about/leadership/board-directors/chelsea-clinton\n\nhttp://iac.com/brand/daily-beast\n\n*cough*", "Yup everyone telling everyone else why they're stupid for exercising their constitutional right in the way they see fit.\n\nIf you're a citizen, you can vote for whomever you want, or not.  Period. ", "I refuse to vote for an oligarchy.", "BREAKING : t_donald members learn that computers can be used for more things than playing video games and shit posting on reddit.", "So he's right?", "&gt;now we all **MUST** vote Hillary\n\nnaw I'm gud", "He's Putin's middle finger to the US. A big old Fuck You.", "why not zoidberg", "I can't agree with this article at all. Hillary's a Wall Street bankrolled warmonger with serious honesty issues. \n\nTrump's an awful choice, but we can't absolve one Nightmare for the benefit of the other.", "I work in eDiscovery and a million emails isn't anything special in terms of volume.  We'd process that deduplicate it and have keyword searches run across it in a day or two.  You almost never review every email in a set - you review the docs that hit on key terms only.", "Hmmm do I want the woman who cheated my candidate or not.", "You can also disagree with people and argue with them about their decision.", "No thank you.", "Christie flew too close to the sun on wings of lard.", "Shhhhhhhh. Wrong sub. Opinions like that cost serious karma 'round these parts. ", "\"We must vote for X\"\n\nSounds pretty fascist to me", "&gt;run by Clinton\n\nShe's one of ten directors on the board.\n\nEdit: ITT redditors have little to no understanding of how a corporation operates yet they're so convicted in their ignorance can't say I'm surprised by this pisshole of a sub.", "&gt;Unless of course, Trump wins on Tuesday — a possible but far from likely prospect.\n\nTrump isn't loyal. He'll throw Christie under the bus as soon as he has no use for him anymore. I don't have nearly as much as expectation as some people that CC would have ended up in Don's administration.", "Man /politics isn't even trying now.", "No. Nobody is forcing your hand except you. There's no way I \"must\" vote for Clinton. I don't think there's any level of evidence to convince me to do so.", "This is such bullshit People voted for Bernie because they wanted dramatic change, Hillary will continue the policies that have ruined this country.", "This site never discloses that Chelsea Clinton is in the board of their parent company and this is the only political reporting property of that company. Undisclosed conflict of interest, therefore propaganda.", "Yep. This sub is fucking cancer. ", "In most states [they don't even count the write in votes](https://www.washingtonpost.com/graphics/politics/2016-election/write-in-votes/) unless they're for a certified write-in candidate, which Bernie isn't.\n\nIt's the electoral equivalent of holding a protest by yourself in your own closet.  ", "Yes go vote for the person that rigged the votes to make Bernie lose in the first place.", "\"Crooked Christie\" has a much better ring to it doesn't it?", "The major swing in r/politics since bernie has been out has been really unnerving. \n\nLike yeah I figured most of you would vote for clinton, but to have LITERALLY EVERY post be anti-trump/pro-hillary? Seems a bit fishy, and I'm not even voting trump.", "Clinton literally stands against everything I found attractive in Bernie\n\nhttps://richardcharnin.wordpress.com/2016/06/24/smoking-gun-approximately-15-of-bernies-votes-were-flipped-to-clinton-in-california/", "Why isn't this heavily downvoted?  I was surprised at the top comments this morning being anti Hillary.\n\n*edit - Surprised to see my comment upvoted so far. For the record I'm a conservative who voted for Bernie. I even donated to his campaign. I will be voting third party tomorrow but if that were not an option I would be voting for Trump.  I don't like the idea of two families having total control over the country for potentially 28 of the last 34 years (assuming if Hillary did 2 terms).", "I got you with that upvote before the downvotes come pouring in. What you've said is perfect. ", "and Trump literally stands against everything you find attractive in anybody.", "The Clinton's do have a habit of at least making enemies who sooner or later self-immolate. \n\nKenneth Star - resigned in disgrace recently for protecting rapists at Baylor\n\nHastert - pedophile in jail\n\nGingrich - resigned in disgrace as speaker, cheated on his wives, fucked an intern/aide\n\nLivingston - resigned in disgrace, prostitutes\n\nRoger Ailes - resigned in disgrace\n\nThe Clinton's don't really have to do anything. Their enemies just tend to be shitty people who can't help but fuck themselves up eventually. \n", "Kristie Kreme does too.", "If you want to get rid of Corporate Democrats you know the wing of the party that Bill Clinton started, then do NOT vote for Hillary.  A loss to the Democrats now would prove to them that running an extremely filthy Democratic Primary (4 DNC forced to resign including the chairwoman Debbie Wasserman who stepped down from the DNC to get a paycheck from Hillary,  Donna Brazile the replacement for Debbie had to step down after she gave questions to Hillary for the Democratic primary), there is no way you should reward the Democrats if you want change.  You know the \"change\" Obama promised that he spearheaded by protecting Wall Street and by shoving the TPP down Americas throat.\n\nDo not vote for Hillary unless you want globalism and a race to the bottom for your wage.  Hillary will enrich corporate interests by supporting Free Trade Agreements that will force you to compete against $2/hr workers for manufacturing let alone the current white collar outsourcing taking place now.", "haha a nice little propaganda piece calling for the berniebros to fall in line and vote for their queen like good mindless drones. Shillary was the worst thing ever but now we gotta all come together and worship her and defend her on everything we had a problem with a few short months ago! They aren't even trying to hide their intellectual bankruptcy anymore haha. Perfect display of what lying hypocrite frauds they really are. ", "Daily Beast has been vehemently pro Clinton the entire election. It isn't just Chelsea.", "Writing in Bernie will do literally 2 things.\n\nAbsolutely nothing.\n\nConfirm to the Democratic party that certain blocks are unreliable voters and thus ensure their voice will be heard less.\n\nYou want your voice listened to?\n\nVote like Old people do. There is a reason why people listen to them and not youth.\n\nEDIT: When I say vote like old people - i thought it was clear. Vote and vote every time, presidential or mid-term. Youth are a joke vote wise for consistency. You're unreliable to the extreme. It doesn't matter who you vote for because no one expects to count on you, even third parties know they can't count on the youth vote consistently. That's what I'm talking about.", "Not no but hell no. Hillary Clinton is the antithesis of why I was for Bernie.", "So you are saying it was her turn to win.  This \"paid her dues\" argument doesn't work.  Well it does if the DNC rigs it for you.\n\nMy vote is my choice, not the DNC's.", "Hillary failed to win my vote I don't HAVE to vote for her.\n\nThe idea that you are obligated to vote in a system where your vote doesn't matter except in a small percentage of cases is a joke. Everyone's vote isn't equal until we allow the popular vote to determine our president and throw out the EC.", "*Without being condescending or a prick", "This is huge. \n\n1) By election day more than half of the electorate will have already voted. That's fucking GOTV. \n\n2) In 2012 FL was decided by 5 votes per precinct. **Any** edge no matter how small, could be it all. \n\nLooking good. ", "People who vote in this sub are biased. This is a website based entirely on upvotes and downvotes.\n\nBesides how can this sub not be biased? Cover Trump favorably? Trump has next to nothing good coming out of his mount. Cover Jill Stein? She's not in the news for the sub to cover. How about Jonson? Again, nothing.\n\nAnother important thing to consider is that many of the anti-Clinton people don't even come to this sub anymore, so it's easy to see why they don't have enough downvoting power.\n\n", "I love how the defining reason to vote for both sides in this election is \"yeah, well *they're* worse!\" \n\nDid I say love? I meant I'm dejected and have lost faith in our system. ", "I'll be voting for Jill Stein thanks.", "Whoop whoop whoop whoop", "No I don't. She stole my vote and now expects me to fall in line. She will lose this election. ", "Wait a second...you'd use *computers* to review the emails? Those things don't work. What even is a computer? I don't know any computers. ", "The more I hear from Snowden the more I like him.", "Problem is when you share goals with voters but come to different conclusions about who to vote for. I think it's right to argue over that. \n\nThe whole \"woah man people can vote how they want\" attitude (and by implication people shouldn't get heated about it) is something I very much disagree with. If voting is important and politics is important then robust argument is to be expected and indeed encouraged. Not necessarily insults but, when has something important ever been agreed on politely?", "I hope a prosecutor finds an excuse to play that video at his trial", "Yeah I'm writing in Bernie not because I expect it to do much but at least so my voice is heard.  The Clinton camp can't just steamroll over how they got this far - they successfully quelled a popular rising in their own party and they need to be held accountable after the election.\n\nEDIT: Thanks, I'm aware about the write-in laws of my state.  Also, thanks to everyone calling me an idiot or a child or selfish, it's really making me change my mind!", "&gt; Now We All Must Vote Hillary\n\n#No you do not! \n\n\nClinton is a member of the political class - the establishment -  that has fucked you all for a very long time. Think about it. ", "I'm sure the immediate right-wing response was \"you're a traitor to this country so you must be working for Hillary.\"", "Since when?", "Or I could vote down ticket and not vote for Clinton. I'd still be contributing to a Senate majority. Only people ignorant of our political system are going to buy into that tired argument that a vote for Hillary is a vote for Bernie as a major committee chair.\n\nMandatory Edit: I live in NJ. My presidential vote doesn't matter. If you live in a swing state (MA NH, VA, NC, FL, NV, AZ, NM, CO, or anywhere in the midwest) yours does. \n\nI do implore you to vote for her.", "Yes Russia isn't going to kick him out because he is being used to insult America.", "&gt; White male Americans are in the process of losing those historical societal advantages. As minority populations grow, they’re losing their grip on the American majority. The first racial minority president was elected and re-elected. Women are approaching even footing with men in the labor force. Even social norms are changing, for example with gay marriage becoming legal...Donald Trump’s goal is to make America Mad Men again by reversing the progress we’ve made over the past half century and returning the country to a 1950s era-style society dominated by white men.\n\nI am sure it is difficult for white men to go through this cultural shift, but things have been difficult for the rest of us for a long time, and we endured it, and you will survive too.", "A lot of Republicans will also see their careers end tomorrow so Chris won't be alone.", "The Hillary supporters who were reluctant to come out for Obama when she was defeated during the 2008 cycle must surely now acknowledge debt paid.  \n\nI am sorry for Republicans who have lost the chain of empathy with voters.  Democrats can reach right back to Jimmy Carter with their public endorsements and yet in 2016 both Bush's, McCain, Romney are if not quiet, are openly hostile to the GOP.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "they probably mentioned correc t the record", "The fact that she's only ahead by 3 points and her opponent is a dumpster fire is mind-boggling. ", "There has never been an election where the system has shown itself to be so broken.", "But one of them WILL be your next president.", "no computer no computer, you're computer", "David Brock is ninja down voting you now.  People pretend that Hillary \"goes high\" but her stooge Brock was making fun of Bernie's health back in January.    When Trump supporters did it to Hillary then they pull out the sexism card.", "I simply do not trust Clinton to follow through on any of her agenda. That is the issue. ", "&gt; they simply put more backing behind Clinton than Sanders because she was one of them and he was an outsider \n\nThis is what is so fucked up. Don't you people understand that the DNC was supposed to be impartial during the Primary and not involve themselves *in any way*? Yet you acknowledge it with a shrug. Anyone can run on any platform. Doesn't fucking matter if you're part of their little clique. Look at Trump, a former Democrat running on the Republican ticket..and from this it appears that the establishment Republicans, as filthy as they typically are, showed more integrity (used loosely) by the end of their primary than the Democrats did.\n\nThe problem with (establishment) Democrats is that they're the biggest fucking hypocrites when it comes to corruption behind closed doors (and hell, even openly, after they've been discovered).", "That 10% was the bulk of what I cared about when I voted Bernie. Stopping with Middle Eastern Wars being against bad trade deals, and ending the collusion and corruption in Washington were why I was excited enough to help campaign for Bernie. The rest of it was way down the list and Clinton is really only in support of the superficial issues that won't actually improve much. ", "You think that's crazy look at Nevada! 70% early vote. ", "I feel ok about Florida. Not comfortable but cautiously optimistic. As long as hillary can keep Florida deadlocked in the polling aggregate, she should be able to take it with a good turnout operation. It could be one of the clearest examples of ground game effectiveness we've seen. ", "Can I just point out how manipulative this logic is? If I write in Bernie or if I vote third party, I'm not helping Hilary get elected, I'm not helping Trump get elected, my ballot does not include either of their names. In no healthy democracy should my vote be influenced by what others write on their ballots. That's why they're secret ballots.\n\nPlease stop validating that train of thought, it scares people into doing things they don't want and it's why we're all so upset with where we're at in the first place.", "Vote in every election for every race right on down to dog catcher", "I'm a hundred percent with you. People all say well do you want to Trump? No but I cannot vote for someone that made a mockery of the Democratic process either. \n\nEdit: To anyone still saying, \"Well Trump is worse and going to win\"  Here is my answer, if you all weren't spineless and voted for your hopes and not your fears we would have a much better time tomorrow.  ", "Sadly it's only Johnson and Stein who want Snowden pardoned. Trump wants him hung by the neck and Obama and Clinton want him tried and jailed. \n\nThe man is a patriot and hero who exposed to the American people that the government was violating the law lying to the people's representatives in Congress and violating the constitution. He sparked a national debate on privacy and government accountability when it comes to infringing on civil liberties. \n\nHe should be pardoned and given the medal of freedom. The American people owe Snowden for his heroic actions and selfless service to the law and the constitution. He exposed the illegal actions and blatant lies of domestic government surveillance on American citizens.", "The reality of most democratic elections is that many people feel they don't have someone they can really support. That's not something that can be fixed because democracies have big populations with very diverse, idiosyncratic views and, two party or multi-party, democratic systems require making only a few choices across only a few candidates.\n\nI'm assuming you were motivated to vote for President Obama. If so, consider yourself lucky you had two elections where you believed a candidate really represented you. Most people in the world never have. I certainly never have. But I understand that the job of a voter is to find someone capable of doing their job and making the government run, whether I agree with them or not. It's a pipe dream to believe you can always have someone that inspires you, because there's very, very, very few people in this world and in history that are capable of doing that on a large scale.", "Is Snowden not a coward for hiding in Russia then?", "I love how the mods in the sub aren't even trying to hide their bias anymore.", "The anti-PC crowd sure is worried about people using the wrong words. Bunch of hypocrites.", "Title sounds like it should be long to the North Korea sub Reddit. ", "Same thing.", "The assumption is that Bernie supporters aren't just a cult. That they actually follow Bernies ideals. Not just see him as the glorified leader.\n\nAnd then one would expect such a rational and thinking person to come to the extremely obvious conclusion. Sulking in the corner doesn't help anyone. Doesn't improve anything.\n\nAnd then that person might even dare to look at the actual issues. And how much overlap there is between Clinton and Sanders. And how Trump is the exact opposite on most issues.\n\nSo for anyone who actually cares about these issues. The things Bernie supports. There really is no choice except to vote for Clinton. It's the best bet to push progress. Probably not as far as Bernie would have pushed it. But definitely better then the giant leap backwards Trump represents.", "There's a difference in just saying that and saying that with a gun pointed at you.  One's the first amendment and one is fascism.", "&gt;Hillary is 69\n\nShe'll be 45 in January.", "For people from /r/all wondering what happened to this sub it got taken over by a Super PAC \n\n\nhttps://www.reddit.com/r/television/comments/5agmik/cnn_drops_commentator_after_finding_she_provided/d9gj9eb/\n\n\nThis shows the most downvoted posts on Reddit:\n\nhttp://www.notreddit.top/\n\n/r/politics dominates, and downvotes everything that goes against the pro-Hillary/anti-Trump narrative. Everything. It is the most downvoted new section by a country mile. [It's absolutely shock full of new accounts doing this and there is no way that this is organic](https://www.reddit.com/r/subredditcancer/comments/4z7vjx/rpolitics_is_under_a_constant_bombardment_of/). Anyone saying anything positive about 3rd party candidates is quickly shut down, as this sub is now campaigning for Hillary. \n\nThe endless examples of censorship on /r/politics can be seen all over [both /r/undelete](https://www.reddit.com/r/undelete/search?q=r%2Fpolitics&amp;restrict_sr=on) and [/r/subredditcancer over the last few months](https://www.reddit.com/r/subredditcancer/search?q=r%2Fpolitics&amp;restrict_sr=on) as it dominate there as well. The list just goes on and on and on and on.\n\n", "After tomorrow I never want to hear Trump's gross irritating voice again.", "Yes.", "Because the daily beast were anti-Bernie from the start. They were one of the main \"liberal\" news sources that were biased for Clinton from the start.\n\nTo write this garbage article claiming they were \"with Bernie\" is just ridiculous. Total propaganda. What a joke. And this is now on the front page with the mods heavily censoring this thread. Typical propaganda BS. This is the state of our democracy. ", "Wow all these comments, I had to double check that I wasn't sorting by controversial.\n\nIs Reddit finally pushing back?\n\nRegardless of the outcome tomorrow, I look forward to the sudden 180 this sub will make tomorrow when funding drops and it returns to pre DNC primary form.\n\nEdit: I meant convention, not primary.", "How does this shit make it on r/politics? I get the Trump hate but my god. It's either pro Hilary or anti Trump bullshit I am always seeing at the top of r/politics. There is zero middle ground here. ", "It takes skill to be condescending to his wife women, and all voters in one statement.\n\n", "&gt; fine reputation of the fine people of New Jersey.\n\n\n\nAs someone from New Jersey this is the first time I've ever seen this sentence constructed.", "Edit to thank everyone who has voted and urge anyone who yet hasn't to go out and do it! Also for any blue Texans out there, [Here is an awesome primer on Texas as a battleground state](http://www.dailykos.com/story/2016/11/7/1592148/-Texas-Election-Primer).\n\nWell yeah, of course he does, it's **hilarious**. This is a grown man, asking to be made leader of the most powerful nation in the world, who had to be put in \"Twitter time out\" by his campaign staff, because that was their decision for the best way to get him elected, or at least to be less humiliated November 9th.", "\"There are 24 hours left - surely I can piss off women one last time\"", "I was with Bernie and I'm sure as hell not going to vote for her.", "Love /r/politics sources! In /r/politics we also source hillaryclinton.com !", "Weird didn't Trump insist Hispanics love him as much as he loves taco bowls?", "/r/politics did a flip on August 31 [it has been documented](https://www.reddit.com/r/television/comments/5agmik/cnn_drops_commentator_after_finding_she_provided/d9gj9eb/) by /u/rationalcomment ", "Melania was not kidding about going after cyber bullying.  I stand corrected.", "So you think all the liberals on Reddit will just disappear over night? That literally every single person who disagrees with you is paid to do so? \n\nYou are going to be in for a rude awakening tomorrow. ", "Exactly Putin is not as pig ignorant as his orange dick sock.", "I'd assume it was primarily the anti-establishment angle. I mean Trump and Bernie share almost no actual policy positions, so I can only assume that's what would cause someone to swing all the way from Bernie to Trump.", "You must not have been here during the Democratic primaries.", "Yep ", "Damn r/politics forgot to censor this thread. ", "And Bill Curry the article's author, was a former Clinton aide.\n\nSo yeah, we've got a biased article published on a biased site, trying to convince us all that everything is peachy and totally not bought and paid for, so we should shut up because IT'S HER TURN™!", "Furthermore almost all of [the most downvoted posts on reddit](http://www.notreddit.top/) are negative articles (some valid, some not) of Hillary on /r/politics \n\nEdit: to those of you going on about \"but they're garbage sources\", what in the hell is *the Daily Beast*? Also, there is more than 600,000 subreddits. How do you explain ONE SUBREDDIT accounting for 23 of the 25 most downvoted posts on the entirety of reddit? This has consistently been the case for the past 2 months.\n\nEdit 2: Yeah, I'm aware /r/The_Donald is a thing. Nobody is saying that sub isn't overrun by an alt-right upboat brigade, because it is.\n\nBut really, what does that have to do with /r/politics and the fact that it dominates the bottom of reddit? ", "So he calls them rapists and drug dealers and expects them to vote for him?", "Hey come on.  Republicans don't hate women.  They think every guy should own one.", "I'm with you. After the DNC covention and them pushing out Sanders supporters like me it's clear they don't want my vote.\n\nI will attempt to send a message by voting third party. That just because in every election up to now I've voted Democrat, doesn't mean they can count on me when they literally cheat a candidate out of the race. How Sanders was treated has soured me on the Democratic platform possibly forever. I'm more convinced now than I ever have been that we need a multi party system here and not a bi-party system.\n\nGet out and vote, but go with a third candidate. Don't give the RNC or DNC your vote, neither of them deserve it anymore. Let's give rise to the 3rd party during this, the shittiest election of all time.", "/r/politics is one of the most genuine communities on reddit! It's my favorite! There is definitely nothing shady going on. ^^^^^Vote ^^^^^For ^^^^^Hillary ^^^^^PLEASE", "Bush and his merry band of war criminals and torturers escaped all punishment for exactly that reason.", "Ok seriously what the fuck. Fuck these mods and fuck this subreddit. ", "No Landslide!  No Landslide! You're the Landslide.", "We never had proof he was a great businessman. We did have proof however that he suckled on his daddy's teet to make his money though. ", "The Author is Bill Curry is a former Clinton White House official and two-time Democratic candidate for governor of Connecticut. I doubt his was a Bernie supporter. ", "I can't tell if General Flynn is that dumb to think that the FBI had one guy literally reading each email one by one or if he just knows that Trump supporters are that dumb and wanted to get them foaming at the mouth about it.", "Probably calling out the fact that Daily Beast is owned by IAC (interactive corp) and that Chelsea Clinton is on IAC's board. So basically, /r/politics supports media corruption by not banning links from there &amp; they're mad people know.\n\nEdit: Honestly, media in general is in such a sad state. We need media *without* bias, no matter which side you're on. It only serves to mislead people into supporting the special interests of those that have the money to buy support.", "A grown adult that has to have his toys taken away from him for his own good.\n\nLet that sink in. Take as long as you need.", "Thank holy hell someone is finally saying this.  I voted Bernie in the primaries. And I voted Johnson in the election. I know they're policies aren't completely aligned They do share some common ground contrary to what Reddit would have you believe  but that's not important.  I don't trust Hillary.  And that, right there,  is the only. Fucking. Reason. She won't get my vote. ", "No you also have the right to be condescending and a prick.", "Hillary is\n\nExactly what\n\nLaboring americans\n\nPrecisely need!\n\n\n\nMurica is \n\nExcited for her election!", "Don't tell me who to vote for", "It's on the way to that. My seven year old is exposed to and taught more extensive technology in second grade than I was exposed to in middle school. (I'm 24) They also teach a lot about privacy and online safety how to verify sources, they even have their own kid Facebook that is a closed social network for only students and staff which helps them see good social media behaviors on top of being a curriculum tool. Teachers are constantly receiving training in new technology, new applications of technology, hardware to use. I'm a middle school teacher and even these kids who are twice my son's age aren't as exposed, but they're way more immersed than I was. ", "Fucking fire nation. ", "I'm sorry I can't vote for Hillary. I was 100% behind Bernie Sanders but the DNC wanted Hillary from the start. \n\nWhy the hell would you award someone for rigging their own parties nomination?", "Long live Bernie Sanders!", "Politics has gone the way of the mainstream media just worse.", "He actually hates taco bowls. See he is a genius in how he manipulates people using his cunning linguistic skill./s ", "I love how people talk about what a hawk Clinton is.  Trump would have started a war over Iranian sailors saying mean stuff.  ", "Take Back r/politics from Hillary", "Good. A lot of Republicans need to lose their jobs tomorrow. Reposting this from another threads...\n\nEdit:  For clarification [ALL 435 members of the house of Representatives will be on the ballot this Tuesday](http://www.270towin.com/2016-house-election/), [34 out of 100 Senators will be on the ballot this Tuesday](http://www.270towin.com/2016-senate-election/), and [12 Governors will be on the ballot this Tuesday.](http://www.270towin.com/2016-house-election/)  That's why the information above, and below, is so consequential: We can give Secretary Clinton the blue Congress that she so desperately needs.\n  \n--------  \n\nI'll call your attention to one section in particular: [Retracted Endorsements.](https://en.wikipedia.org/wiki/List_of_Donald_Trump_presidential_campaign_endorsements,_2016#Retracted_endorsements)  \n  \nA lot of people will tell you \"Well they pulled their support for him, they deserve a pass/reward.\"  \n  \nNo, they don't deserve a pass, they don't deserve a reward, they *created* this mess.  You've heard me say this before, but with less than 48 hours to go until election day I think it bears repeating:  \n  \n#DON'T LET THESE NINNIES OFF THE HOOK!!!  \n  \nCongressional Republicans didn't rescind their endorsements [when he was calling for killing innocent civilians,](https://youtu.be/I1eXRXL0nkk?t=1m13s) when [he called African-Americans thugs,](https://twitter.com/realdonaldtrump/status/592910662424223744) when [he asked gun owners to do something about Hillary Clinton,](https://www.youtube.com/watch?v=ELL-aYFgkXI) when [he questioned my President's ancestry and religion,](https://www.youtube.com/watch?v=FlpaEXWe3Zs) when [he implied that vaccinations cause autism,](https://www.youtube.com/watch?v=G23Y8R-KcKA) when [he promised to ban a religion from immigrating to the United States,](https://www.youtube.com/watch?v=eh7XaJlvJIg) when [he invited Russia to hack a US citizen,](https://www.youtube.com/watch?v=gNa2B5zHfbQ) when [he advocated for torture,](https://www.youtube.com/watch?v=oxZv1Wq2c28) when [he demeaned women (pick one),](https://i.imgur.com/sYqvfDR.png) or when [he said that Mexico was sending us rapists and criminals.](https://www.youtube.com/watch?v=apjNfkysjbM)  \n  \nTheir endorsement stood through each and every indefensible thing he's said or done.    \n  \n#DONALD TRUMP WAS UNACCEPTABLE BEFORE THE FIRST ENDORSEMENT WAS EVER GIVEN.\n  \nAny sitting politician who endorsed this man before, during, or after this campaign deserves to lose their job.  Donald Trump has been an unacceptable choice since day 1, since before we heard *any* of this, but they endorsed him anyway.  House and Senate Republicans were willing to risk the wellbeing of the American people, and nominate a madman, in an effort to preserve the appearance of party unity.  They care more about obeying the Eleventh Commandment than they do protecting their constituents.  \n  \nWhat we heard today might very well be his last offensive comment, but it's certainly not his first.  \n  \n#ANYONE WHO SUPPORTS THIS MAN IS WORKING AGAINST THE AMERICAN PEOPLE.  PERIOD.  \n  \nDonald Trump didn't change tonight, he's still the same man he was when Paul Ryan, Mitch McConnell and Reince Priebus endorsed him.  \n  \nIt seems to me that congressional support for Trump is symptomatic of a much bigger problem within the GOP.  \n  \nIs a Republican Congressman endorsing Donald Trump in the name of partisanship and party unity ***that substantially different*** from a Republican Governor turning down a fully funded Medicaid expansion just to spite Obama and the ACA?  \n  \nThe Republican party has been pulling shit like this for the past six years, they've been electing people like Trump since the Tea Party burst out of their chest.  [Donald Trump actually looks normal compared to some of the Republicans on the state level.](https://www.youtube.com/watch?v=UB1bSJB3n10)  \n  \nAt some point you have to put country over party, wouldn't it have been nice if they had figured that out *before:*  \n  \n * [Enacting restrictive voter ID laws.](http://www.latimes.com/opinion/op-ed/la-oe-hajnal-voter-id-research-20160908-snap-story.html)  \n * [Closing schools to pay for tax cuts.](http://www.msnbc.com/rachel-maddow-show/more-kansas-schools-forced-close)  \n * [Detoothing Dodd Frank financial reform.](http://fortune.com/2016/09/13/republicans-dodd-frank-act/)   \n * [\"Papers please\" laws in places like Arizona.](https://www.dailykos.com/story/2012/6/25/1102974/-Supreme-Court-invalidates-most-of-Arizona-s-papers-please-law-leaves-papers-please-intact)  \n * [Cutting public benefits to pay for tax cuts.](http://www.govexec.com/pay-benefits/2016/03/house-republicans-double-down-nearly-300-billion-savings-feds-expense/126952/)  \n * [Firing public employees to pay for tax cuts.](http://www.motherjones.com/rights-stuff/2011/06/who-getting-screwed-ohio-budget-cuts)  \n * [Rolling back abortion rights across the nation.](https://www.washingtonpost.com/news/the-fix/wp/2016/06/01/14-states-have-passed-laws-making-it-harder-to-get-an-abortion-already-this-year/)   \n * [Turning down Medicaid expansions to the states.](https://www.advisory.com/daily-briefing/resources/primers/medicaidmap)  \n * [Refusing to enforce the recent gay marriage ruling.](http://www.politico.com/story/2016/07/trump-vp-pick-mike-pence-evangelicals-225623)  \n * [Cutting infrastructure spending to pay for tax cuts.](https://www.washingtonpost.com/news/dr-gridlock/wp/2016/07/20/the-irony-of-the-gops-new-promise-to-cut-mass-transit-funding-donald-trump-loves-trains/)  \n * [Preventing Elizabeth Warren from heading the CFPB.](http://www.politicususa.com/2013/01/29/gop-blocked-elizabeth-warren-director-cfpb-senior-senator-massachusetts.html)  \n * [Refusing to set up public exchanges on the state level.](https://www.dailykos.com/story/2013/9/29/1241710/-Better-Dead-and-Red-How-the-GOP-blocked-health-care-for-red-state-Americans)  \n * [Remember the trans-vaginal ultrasound laws?  Still a thing.](http://www.forbes.com/sites/davidkroll/2013/07/07/state-mandated-transvaginal-ultrasounds-where-are-the-medical-societies/#be692e26c74f)  \n * [Voting more than fifty times to repeal the Affordable Care Act.](https://thinkprogress.org/gop-lawmakers-vote-to-repeal-obamacare-again-on-groundhog-day-6f0c931a8549#.wrdaey3v3)  \n * [Wasting taxpayer money on repeated investigations into Benghazi.](http://www.nytimes.com/2016/06/29/us/politics/hillary-clinton-benghazi.html)\n * [Appointing Emergency Financial Managers to replace elected officials.](http://www.theatlantic.com/politics/archive/2013/05/does-michigans-emergency-manager-law-disenfranchise-black-citizens/275639/)  \n * [Preventing the most popular of gun reforms...](https://fivethirtyeight.com/features/most-americans-agree-with-obama-that-more-gun-buyers-should-get-background-checks/)  \n * [...or even allowing gun violence to be studied by the CDC.](http://abcnews.go.com/Health/cdc-launched-comprehensive-gun-study-15-years/story?id=39873289)  \n * [Preventing the appointment of a Supreme Court Justice...](https://newrepublic.com/article/131700/republicans-block-obamas-supreme-court-pick-violating-constitution)    \n * [...or any of the hundreds of other Judicial vacancies in our country.](http://www.thedailybeast.com/articles/2016/05/16/it-s-not-just-merrick-garland-republicans-are-blocking-so-many-nominees-it-s-caused-a-judicial-emergency.html)  \n * [Almost shutting down the federal government...](https://en.wikipedia.org/wiki/United_States_debt-ceiling_crisis_of_2011)  \n * [...before ultimately succeeding...](https://en.wikipedia.org/wiki/United_States_debt-ceiling_crisis_of_2013)  \n * [...and causing the first ever downgrade of the United States credit rating.](https://www.washingtonpost.com/business/economy/sandp-considering-first-downgrade-of-us-credit-rating/2011/08/05/gIQAqKeIxI_story.html)   \n * And generally standing in the way of any bill, law, or amendment proposed by someone with a [D] next to their name.  \n\nCongressional Republicans have blocked more bills, and passed fewer, than ***any other Congress in American history.***  \n\nHow many jobs could have been created if Congressional Republicans had allowed proper public investment?\n  \nHow many more Americans would have health insurance if Congressional Republicans hasn't killed the public option?  \n  \nHow much more secured would our infrastructure be if Congressional Republicans hadn't blocked spending on road and bridge repair?  \n  \nAnd this is just off the top of my head.  If someone wanted to take the time and do the research they could easily double or triple the number of things that State and Congressional Republicans have royally fucked up over the past eight years.  It sure would have been nice if they had been working for the benefit of our nation instead of just working to stop Obama.  \n   \n[And](https://leanleft.com/2016/03/21/to-our-conservative-friends-if-gop-policies-are-so-great-please-explain-kansas-and-louisiana/) [Kansas.](http://nymag.com/daily/intelligencer/2016/03/gop-must-answer-for-what-it-did-to-kansas.html)  [Poor,](http://www.chicagotribune.com/news/opinion/zorn/ct-kansas-conservative-brownback-economic-disaster-zorn-perspec-0518-jm-20160517-column.html) [poor](http://washingtonmonthly.com/2016/07/03/kansas-experiment-in-right-wing-economics-is-still-failing-miserably/) [Kansas.](http://www.motherjones.com/politics/2016/05/sam-brownback-kansas-tax-cuts-trickle-down)  \n  \nRepublican politicians have spend the past six years trying to *break* this great nation, now is our chance to start putting it back together.  ", "You leave Krispy Kreme the fuck out of this. ", "The most infuriating aspect of all of this is that at least 50% of the people who saw the post are so fucking ignorant that they will be sure with 100% certainty, that the story is absolutely true, forever. ", "Which kinda makes me wonder why it took eleven months to review the initial batch of 30000 emails.\n\nSurely a task that could have been done in a week being dragged out for nearly a year has nothing to do with the fact that it left a potential indictment hanging over Hillary's head for the entirety of the Democratic primary.", "Fuck this censored and biased subreddit", "You have the right to stand up at Thanksgiving and call your grandmother a whore. It still makes you an asshole.", "Christie said people who smoke Marijuana have no self control. So fuck that fatass. ", "Yeah as a big law attorney, I just shake my head at what people think email document review is like.  We uploaded 100 gig of emails last Friday, and a team of about 6 of us will have relevant documents reviewed and produced by next Friday.", "They both are anti TPP though. ", "Discovery of the emails identifying which are supposed to be classified, those things cant be automated. Possibly less duplicates than this set (which are duplicates of emails already analyzed).\n\nWould chains count as seperate emails? Because it could easily just boil down to this being a bunch of duplicates/not relevant to Hilary.", "Aren't all of his speeches essentially tantrums?", "Honestly I feel bad for all the Bernie supporters. Hillary and the DNC literally blackmail Bernie and cheated their way to the nomination. ", "But...but... First woman president! And...and...uh.... SHE'S NOT TRUMP!?!?", "Remember the reports of the initial intel briefings when The Donald had to be told repeatedly why we couldn't just use nukes?  Good times.", "If Trump loses is this sub gonna still be an anti Trump sub even though technically he's irrelevant in that case? Or are we gonnna be praising Hillary as the best president ever?", "tl;dr: \n\n\"Bernie won't win so we can afford to be nice.\"\n\nCall me cynical, but that doesn't warm my soul.", "I hope he's been keeping a journal of what he wanted to tweet and is going to just tweet out non-stop once he regains Twitter privileges.\n\n", "The US economy has spoken and it said \"Dear God, not The Donald.\"", "TIL: Hillary is a Democrat.\n\nIt's really weird that people are so surprised that Clinton has pushed standard Democratic philosophy and policies over her political career. No shit she's a Democrat. Her senate voting record was almost identical to Obama's record. It's like people were willfully ignorant during the primaries. ", "Dames am I right?", "Fun fact: The Daily Beast is owned by a company that has Chelsea Clinton on their board of directors.\n\n", "&gt; to be putin his radar.\n\nFTFY", "California is just waking up.", "At least you admit that you're voting based on feelings alone. That you don't particularly care about the issues and policies. That you didn't really care about Bernie's views or stances or what he has to say. \n\nAs for OP complaining about getting banned for \"incivility.\" It has happened to all of us on more than one occasion. There's a certain group of people on here who love brigading the report button. It's a classic concern trolling technique. ", "Can't say I find this offensive:\n\n&gt; John one thought worth considering would be for HRC to offer leadership for a better kind of politics by suggesting Democratic candidates agree to not run negative ads against each other during the primaries. A modern version of Reagan's 11 commandment of Republicans not attacking each other. She would get credit with voters for trying, Bernie would almost certainly agree and O'Malley doesn't matter at this point and probably won't.... \n\n&gt;HRC could then spend money running positive ads about herself, juxtaposed against Republicans, which helps her favorable and trust numbers, draws a nice contrast between her and Republicans, and when she has to go negative when Republicans do, she has a strong foundation of having campaigned for a higher standard of politics which voters want.... \n\n&gt;Frankly I thought it was dumb for McCaskill and Gutierrez to be attacking Bernie. We are going to need his voters to turn out in November for HRC, he won't be nominated. I am doing the opposite, repeatedly writing friendly and positive pieces about Bernie as an HRC supporter, and when the time is right I will have money in the bank with him and his people as a liberal to urge them to come out in force to vote for HRC.....which is not a given, and we won't have much margin for error in a close election.....Brent ", "Lol Gingrich was named as Trump's pick for Secretary of State. /gag", "Yeah the fact that not a single post on the front page of r/politics has been pro-trump/anti-hillary since the beginning of the primaries despite trump's support makes it way too obvious how censored and biased they are.", "Hey what even happened to\n\n#***BERNIE***\n#***OR*** \n#***FUCKING***\n#***BUST?***\n\n\"I was with Bernie till the end\" my arse.\n\n_____________\n\nEDIT: Oooooooh, this seems to have hit a nerve with the Wreckordkeepers.\n\nAnother: \n\nYou guys see the sneering and condescending attitude of HRC supporters throughout this thread? This is **exactly** what the rest of you Bernie supporters can expect for the rest of the 4 years, as she will **GUARAN-FUCKIN-TEED** go back on *every last \"concession\"* she made towards Bernie, to try and honeypot his voterbase. \n\nAnd every time she does it, you'll hear the exact same sneers. \"Get with the program\". \"Her position on this was known for years, when you voted for her\". \"The rest of the adults got over it\". \"What's your other option? Vote Trump?\". \"Stop taking an idiotic position demanding &lt;thing that was promised to you&gt;, it's not gonna happen\".\n\nYou will never have your voice heard with people like this. If you know *ANYONE* who supported Sanders in the past, show them this thread. Remind them that their voice is worthless. They view Bernie as an old fool who can be duped and scared into signing over his entire voter base over to the HRC Machine - thanks to the Trump bogeyman. His supporters are chumps who can be misdirected with some \"concessions\" that will be snatched away within a month. \n\n**Well fuck that.** Don't reward this shit. They mock you and call you Idealists?\n\nOnly idealists change the world. Cynics have never changed shit. \n\nI don't care who you vote for, just let it be anyone but her.", "Thanks. We need an opposition party that thinks like this:\n\n&gt;“Trump’s attacks on women the disabled, war heroes and minorities are disgusting. A normal person doesn’t do that. But Trump is not normal. He’s cruel. He’s shameless. He’s a bully. And it gets worse. Trump is simply unfit to be president. Do we want a commander in chief who’s temperamental, belligerent, unhinged?” he asked.\n\n&gt;He continued: “Trump could get us into a nuclear war. That danger has not gone away, and it would mushroom with Trump’s finger on the nuclear trigger. For the sake of our families’ safety, let’s stand together against Donald Trump by voting for Hillary Clinton. It’s the responsible thing to do.”", "Chelsea Clinton is on the Board of Directors of the company that owns The Daily Beast.", "Before the election started I remember reading about a number of issues here still pretty left-leaning, though. Flint's water crisis, Keystone pipeline, Kentucky's Conservative Experiment, and Supreme Court Case du jour are all things I remember reading about. \n\nEDIT: Kansas's conservative experiment, not Kentucky. ", "must be making /r/The_Donald's heads explode", "Bush was a Bush when you have several supremes in your pocket you get away with things.\n\nThe Trump crowd has no such connections. ", "Should've been Bernie ", "&gt; *\"He says he's a big negotiator but he doesn't negotiate with the workers,\" Elsabeth Moges, who has worked as a Trump International housekeeper in Las Vegas for four years, told Business Insider.*\n\n&gt;*After the move to unionize narrowly passed in December, the hotel argued that the vote had not been fair. In March, a regional National Labor Relations Board certified the union, a decision that was upheld in July by the NLRB's national headquarters.*\n\n...\n\n&gt;*\"He'd tried to do everything he could to intimidate the workers and scare them and get them to vote no,\" Bethany Khan, a Culinary Workers Union spokesperson, told Business Insider. \"That's a little concerning for someone heading into Election Day.\"*\n\n&gt;*\"He's breaking the law,\" Khan said. \"The hotel is operating illegally, as they're supposed to negotiate any of those changes at the hotel concerning employment and workers with the union.\"*\n\n...\n\n&gt;*\"He says he wants to make America great,\" Marisela Olvera, a housekeeper, told ThinkProgress in April. \"Well, he should start here in his own house, his own business. He always brags about how he has millions and millions and millions of dollars, but he pays his workers less than most in Las Vegas.\"*\n\n&gt;*By September, Trump Hotel had still refused to acknowledge the legitimacy of the union after months of protests outside of the Las Vegas property. So the Culinary Workers Union launched a boycott of all Trump properties, encouraging supporters to stop spending money at Trump's hotels, golf courses, and other businesses.*\n\n...\n\n&gt;*In October, in the week of the third presidential debate, the union organized taco trucks to form a \"wall\" outside of the Trump International. The Culinary Workers Union has been aggressively canvassing in the state and has registered 34,000 of its 57,000 members to vote.*\n\n&gt;*\"I want somebody at the top who will listen\" Moges says, both at Trump International and as president. \"If you don't listen, how can you improve? He has to listen to the workers.\" So far, she says, Trump has failed to do that at his own hotel.*", "It's called an editorial its purpose is literally to push an agenda.\n\nEditorial content is not, and will never be journalism. You know how papers \"endorse\" candidates? Those are the editorial boards, the people who are paid to write their opinions. The actual journalists are often forbidden from even speaking to them out of fear that they will be influenced.", "&gt; Bush was a Bush when you have several supremes in your pocket you get away with things.\n\nHuh, I was not aware that Bush had such a good relationship with members of that famous Mo-Town group, but how exactly have they kept Bush out of prison?", "/r/politics sucks. ", "Idk if you're being serious but I'll take it as if you are (even though I think you're quoting t_d). You don't have to search for keywords  just compare the emails to the ones they've already investigated and eliminate duplicates. Then do an investigation.", "That's the best way to convince people to think the way that you do.", "*waddling", "its actually been proven that r/politics was taken over by a pro clinton pac that shall not be named (because every comment that names them gets deleted instantly) if you look at the mods you can also see that a few of them are also mods of r/enoughtrumpspam. its just disgusting at this point and something needs to be done.", "\"Computers can't algorithmically perform investigations. If they could then detectives wouldn't exist. What they're saying here is that they searched the emails for keywords and didn't individually examine them by hand which means they didn't look into them properly or extensively.\"", "It also wasn't just emails they were investigating. They investigated the process of determining how to handle the emails determining who and why they decided to delete the emails, and cross checking interviews with other pieces of information.", "He's now regressed to full Archie Bunker.", "After the way she and the dnc colluded against Bernie? Nah.  Not voting for her.  ", "Emails or nuclear holocaust?  GEE, LET ME THINK...", "[deleted]  \n ^^^^^^^^^^^^^^^^0.8158 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/06530)", "You have to be a poltical billionaire that goes against his views to be on putin radar.", "And yet your post is still here?", "What? His meltdown is going to be the most entertaining part of this whole election. ", "&gt;Voters were packed tighter than the watermelons in the store’s produce department.\n\nI was unaware that watermelons were packed tightly.", "She should have thought of that BEFORE trying to peddle his campaign of bigotry and hatred.  By doing so they have dishonoured the memory of everyone who has suffered from similar campaigns in the past.\n\nI will never let anything with her name her father's name or anyone associated with his campaign into my house.  I don't care how \"fake Haredi\" she or her husband claim to be.\n\n", "Tiffany Trump made the right call. Hide out in the tower and wait for it all to blow over.", "Alex Ohanian did a presentation at my college a few weeks ago and was asked about censorship on reddit. He said that shipped sailed long ago and it's sad that's it's taken a US election to show us how true that is  ", "Ugh...He's made my skin crawl since Rosie O'Donnell.  I've had enough \"entertainment\" from this hideous man-toddler.", "One day Donald Trump will look deadpanned into a camera and say;\n\n\"I never ran for President.\"\n\n25% of the country will believe him. ", "That is why the invention of square watermelons is biggest scientific leap of this century ", "&gt; We measured knowledge of government based on a question asking how long senators’ terms were and a question on which of four policy areas the government spends the least (the answer was foreign aid; the other options were Medicare national defense and Social Security). We focused our analysis on whites because nonwhites were not supporting Trump in sufficient numbers.  \n\n&gt; For example, we found that people who did not know either of these questions about government evaluated Trump 20 points more favorably than Clinton, compared with those who knew both of those questions. This was not true in 2012: Knowledge of politics had little relationship with people’s views of Mitt Romney and Obama.\n\nI legitimately do not know how to have a rational conversation with people on this end of the spectrum without getting unreasonably angry. Its a real problem I have that only makes the situation worse when i try to engage in political discourse with family or coworkers like this. Does anyone have a way to mitigate the willful ignorance? I get way to upset about these things and usually just come off as offensive. ", "Should she have gone to the Winchester for a pint instead?", "Filter 'from' = linkedin probably clear up about 649K of emails.  ", "It's OK they switched to Fortunate Son by CCR.", "I got downvoted for pointing out that \"HillaryClinton.com\" is not a valid source. ", "Remember when it was revealed that Debbie Wasserman Schultz was working with the DNC to sabotage Bernie?\n \nAnd remember when Hillary took her onto her Campaign when she stepped down in shame and never even mentioned the scandal whatsoever.\n \nGood times gooood times", "VOTE FOR WHOEVER YOU WANT\n\nStein \nTrump\nClinton\nJohnson\nWrite in Bernie\n\nit's your vote - do what you please", "Every single one standing with Donald in this campaign knew what a train wreck of a person he is and they were willing to put this country's future on the line just so that someone they know becomes the president.\n\nAs American citizens how can those campaign managers honestly tell people to make him president while not trusting him with his twitter account? These people are ready to throw this country under the bus for personal gain ", "Even his campaign staff don't trust him to act like an adult.  \n\nWhy should we?", "As a fellow NJer if prosecuting Christie makes this sentence possible to say unironically, I'm all for it.", "His Twitter account once he loses and Kellyanne moves on to a better job is going to be a thing of wonder.", "I've only been married for seven years but I've found that treating my wife well and showing her appreciation makes her mood a lot more pleasant and predictable.", "&gt;The Daily Beast claiming to have supported Sanders\n\nahahahahhahahaahahah.", "starting November 9th she will be going by Ivanka Kushner... ", "He should be thrilled. I'm sure his inspiring message that [\"The best taco bowls are made in Trump Tower Grill. I love Hispanics!\"](https://twitter.com/realdonaldtrump/status/728297587418247168?lang=en) really convinced Hispanic voters to ignore all the racism.", "&gt; How could anyone say that's a bad thing?\n\nClearly we should only be counting correct votes.", "Fuck Hillary. Fuck the DNC. Fuck thedailybeast.", "He's going to divorce her.  When he sits down and has his come to Jesus moment he's going to put her on the list of people that screwed him.  She did that speech on purpose.  She didn't look presidential enough.\n\nHow do you expect a man who has done nothing but project his worst faults on his opponent to do anything less?", "This is 100% accurate. They took over the s4p sub a long time ago. Every one who was an active participant knows exactly what this shit looks like.", "And those Latinos would not have counted in the polling numbers because they weren't considered likely voters. ", "I think confusing the ignorant was part of Springsteen's whole point with that song. ", "This kills The Donald.", "As always XKCD has this covered: https://xkcd.com/208/", "&gt; One week ago early returns had Democrats fretting. Turnout among black voters was lagging, and while Latinos were submitting ballots in large numbers, so were white voters seen as more likely to support Trump.\n\n&gt; Those trends shifted during the last four days. Black turnout jumped substantially, boosted by Obama’s multiple Florida visits and Sunday’s “souls to the polls” voting drive led by black churches.\n\n&gt; **Black turnout in Florida will end up higher than in 2012**, Daniel Smith, a University of Florida political science professor and election data analyst, predicted on Sunday.\n\nand\n\n&gt; Meanwhile, the state’s Latino turnout accelerated. **The number of Latinos who voted in person through Saturday was up fully 100 percent from 2012**. It appears likely that more Latinos in Florida will have voted early in 2016 than they voted overall in 2012.\n\n&gt; Smith also noted that **36 percent of the 907,000 Latinos who have voted this year didn’t vote at all in 2012**. “That’s a full 12 points higher than whites, and will likely be the key to who wins the presidency,” he said.", "Hard to believe 6 months ago you'd NEVER see a pro Hillary article on the front page of this sub.", "he's gonna go for the shat trick", "All of those lies the man is a pathological liar.\n\nHe is also the most thin-skinned, petulant politician in the history of US politics.\n\nAnd insecure to boot, because:\n\n - Really rich people don't need to constantly remind the world how rich they are.\n\n - Really smart people don't have to tell the world, explicitly and repeatedly, how smart they are.\n\n - Guys with big dicks don't need to reassure the world that they do, indeed, have big dicks. ", "What? His plan makes perfect sense. With a 35% tariff on all imports the people building all those Chinese factories will be forced to move them to the US, assuming you can build a factory here for &lt;135% what it costs in China, and assuming you can pay your American factory workers at most 135% the wage of a Chinese peasant.\n\nAnd with all these fabulous new factory jobs who is going to complain that every item in Wal-Mart costs 35% more?", "If nothing else he's efficient.", "Information rejecting voters is more like it. It's not that they haven't heard the science behind climate change or explanations why regressive taxing will hurt them. They just flat out reject it's truthiness. \n\nI had an argument with a Trump supporter who was claiming that the KKK supports Hillary even though I linked to them site after site doing the complete opposite and endorsing, quite feverishly might I add, Trump. \n\nI got an \"exactly\" as if they believed I proved myself wrong. And that was it. It was over. I don't know what else to do. They can't read or something.\n\nTrump voters are stupid. Let's not walk circles around it. Stupid or bigots. That's the two flavors.", "Well that kind of abuse worked for Paul Ryan. He just expected that to happen again. ", "&gt; Voters were packed tighter than the **~~square~~ cube** watermelons in the store’s produce department.\n\nNot quite the same ring.\n\nedit: Was on the wrong dimension", "I'm hoping for the exact opposite. Soon as the election is over the GOP is going to try to pretend Trump never happened. That their party is not built to cater to the hateful desires of some of the worst people in the country.   \n    \nI hope Trump stays in the public eye for as long as he can. I hope he goes on twitter rants, one after the other, gives interviews to whatever news outlets will have him, and launches his own tv station to spout whatever nonsense Alex Jones can think up to feed him. Hell, when Trump tv inevitably fails and starts asking for donations, I'll gladly throw them a couple bucks to help it stay on the air just a little while longer.  \n   \nThat way, the American public, with its absurdly short attention span, never forgets what the Republican party really stands for and what sort of people it represents. It never forgets what kind of lunatic the party chose to represent their base. ", "Never managing is different from personally managing and then having that revoked. Trump has prided himself on his 3am commentaries in the past. \n\nHe's already said that he doesn't update it himself he just tells an aide what to put out there verbatim. Now someone's actually refusing to post what he's saying as campaign strategy. ", "This explains **so** much.  Why are Melania Trump and Sarah Palin - who just 2 months ago couldn't attend the Republican National Convention because aviation had apparently not yet made it to Alaska - suddenly being shoved on stage as surrogates while we hardly hear a peep from Ivanka Trump who the Trump campaign spent months and months talking up and highlighting?\n\nBecause Trump desperately needs female surrogates, and Ivanka sees the writing on the wall and still has something to lose.  Unlike, of course, Ms. Pussy Bow and the most famous methhead in Alaska.\n\nAmazing.", "She only has a lead if you go out and **VOTE**.", "This absolutely huge for Clinton.  Imagine Trump winning Pennsylvania because a huge slice of her supporters couldn't physically make it to the polls.", "Why go all the way out to the pub when you can just go grab some crates of unsold Trump Vodka from the basement?", "All social media is engaging in censorship right now. ", "he was also just going to divorce her soon anyways because she has gotten too old for him and has cranked out some kids so now she has no value to him and might as well be a dried up prune because that is how Donald views women.", "I gotta admit I will be listening to hear if he shows any remorse or just to laugh at his continued lies about it being rigged against him. ", "I'm shocked this comment hasn't been removed yet.", "Putin is ex-KGB and if there is one thing he knows it is to not mistreat enemies that defect and come to you for shelter. These are the last pieces of advice in Sun Tzu's \"The Art of War\":\n\n21\\. The enemy's spies who have come to spy on us must be sought out tempted with bribes, led away and comfortably housed. Thus they will become converted spies and available for our service.\n\n22\\. It is through the information brought by the converted spy that we are able to acquire and employ local and inward spies.\n\n23\\. It is owing to his information, again, that we can cause the doomed spy to carry false tidings to the enemy.\n\n24\\. Lastly, it is by his information that the surviving spy can be used on appointed occasions.\n\n25\\. The end and aim of spying in all its five varieties is knowledge of the enemy; and this knowledge can only be derived, in the first instance, from the converted spy. Hence it is essential that the converted spy be treated with the utmost liberality.\n\n26\\. Of old, the rise of the Yin dynasty was due to I Chih who had served under the Hsia. Likewise, the rise of the Chou dynasty was due to Lu Ya who had served under the Yin.\n\n27\\. Hence it is only the enlightened ruler and the wise general who will use the highest intelligence of the army for purposes of spying and thereby they achieve great results. Spies are a most important element in water, because on them depends an army's ability to move.\n\nTHE END\n\nSo yea, now compare Clinton's foreign policy to that of Trump and have a guess why Putin wants the latter to win the US elections. A Trump victory would be a disaster for American intelligence gathering. A Clinton victory would be the best thing that can happen for them.", "Holy shit his fingers *are* tiny.", "Not any that are very popular. As soon as a political forum exceeds a certain popularity threshold it's guaranteed to attract shills. Especially during election season.", "First tweet from Trump.\n  \n\"Fucking Normies rigging my election. REEEEEE\"", "First **[do not get complacent](http://i.imgur.com/o4yjbX2.png)**.            \n            \nSecond, for what it is worth before we all go, \"LOLOL FOX, must mean she's winning by 20!\", Fox's poll division is actually good and separate from their 'News\" division.              \n               \nThird, just imagine how much of a meltdown Fox and Trump is going to have tomorrow night and glorious that popcorn will be. But just remember, it'll only happen if you vote.", "That's even better for Putin.  He doesn't give a shit about Snowden criticizing him.  He's above that; he could make Snowden go away in a second.  To the outside world this helps him to -seemingly- show that he is cool with criticism.\n\n(Spoiler: he's not)", "Nothing is over until November 9th. Vote!", "Make America Great Again like back when women had no choice but to settle on someone, anyone, or face lifelong poverty. \n\nHASHTAG: SARCASM", "[deleted]  \n ^^^^^^^^^^^^^^^^0.5979 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/65675)", "I think the big point here is that the laptop contained 600000 emails (if that is the correct number).  Of those emails, their investigation in regards to Clinton only had mandate to review those containing her email address, and only during the time frame that she was head of the state dept.  After narrowing the original 600,000 down to that window the remaining emails were deduped from what they already had from prior investigations.  The remaining emails to review were of a much smaller subset of the original.  I do not know the exact count, but the reports I have seen indicate it as \"much smaller\", take that as you like.  Given that you have a great deal of agents working on this case, as previously indicated by the FBI, the remaining emails very easily could be reviewed by their office over the course of 8 days.  \n  \nLet's assume \"much smaller\" means 25%.  Let's also assume Comey only has 100 agents in the entirety of the FBI he can help him with the task of reviewing these emails.  150,000 emails between 100 agents is 1,500 emails.  In 8 days, each agent must review 188 emails per day.  Lets' assume they worked 10 hour shifts, it's important with the election near, time for a little overtime.  That's 19 emails reviewed per hour.  We can assume large chunks of these emails are \"thx\", \"okay\", \"lol\" single line responses and other innocuous junk, so it seems perfectly reasonable to assume 19 emails could be read within an hour.  \n  \nThat's assuming \"small amount\" means a percentage as high as 25% and that Comey only had a measly 100 agents to work on this.  It's not only feasible that 8 days was what it took to accomplish this, it's highly likely that this is exactly how long it would take to do this.", "Haha comrade! You write great propaganda for Russia Excellent, I am Gorbachev, I'm hacking the emails all the way from Kremlin that are within the \"darkest parts of the internet\" as we speak. Remember, this is Russia's fault.. Please comrade wipe server with cloth as soon as possible.", "Yep this could be massive", "Because something something Hillary is worse.", "So I'm not a big supporter of the political rumor mill but hasn't it been a longstanding rumor that Trump doesn't have the best relationship with his children?  I remember reading how Trump Jr was vocal about his hatred for his father during his college days (he was, at the time, a heavy drinker).  It seems the band got back together when they all got older, and Trump only started to take a more active roll in their lives when they could contribute to his business.\n\nIvanka's friendships are liberal leaning.  She's long considered Chelsea a friend.  Plus, wasn't she not a registered Republican until this election?", "&gt; Down in the shadow of the penitentiary\n\n&gt;Out by the gas fires of the refinery\n\n&gt;I'm ten years burning down the road\n\n&gt;Nowhere to run ain't got nowhere to go\n\nVintage Donald.", "Inb4 mass downvotes and getting called a Trump supporter ", "Because he didn't want to set a precedent where the incoming president would prosecute the outgoing one", "He doesn't have the focus for that. He can barely remember to stay on topic *mid sentence*. But he'll find plenty of new targets for his vicious tweeting what with all the pundits discussing his loss for the next straight week.", "This was the first thing that made me dislike him. When he was trying to argue that people that smoke weed have no self-control. Um Chris, you're like 400 LBS! ", "Factories are already coming back yes?  But they'll be filled with robots.  So some jobs will be there, but they're going to require more education.\n\nThose manufacturing jobs that require no education?  Yeah, they're never coming back.", "1) Politics\n\n2) Unbiased\n\nPick one.", "But first vote for Hillary! /s", "As an Excel fanboy I just want to shout out that even Excel could do a massive amount of matching/keyword-finding/converting-of emails into fields and tables and apply even basic VBA and formulas to kick out huge portions of the dataset as \"irrelevant\".\n\nNot the best way to do it, at all--not the most powerful tool--but I've converted .txt database dumps to pretty and simple tabular formats and junior databases for review in minutes.  \n\nEven a half-competent tech-friendly guy/gal could take that 650k and probably wash out half of it in an hour or two as \"...and these ones here?  Spam, confirmations from Amazon purchases, notifications sent from the WaPo digest, jokes from Reader's Digest, recipes, duplicates of other ones, prayers, stuff about football, meeting acceptances/rejections, and etc.\".", "Trump's \"army\" is proud to say they pay no attention to the MSM but get all their news from Facebook. \n\nThe idea that low/no information voters might decide this election pains me so much that I cannot bear to read the linked article.  ", "&gt; From complaining about not getting enough GOP support to a rigged media or even simply claim that votes were miscounted. \n\nWhich is what the interviewer will lob across the plate for him, gently prompting \"that's what you mean, right? You're speaking metaphorically, not literally?\"\n\nTrump will pause for a brief moment then say, \"no, I mean literally. Literally I never ran for president.\" ", "Get fucked GOP", "Why the FUCK would you vote for this monster after all the corruption that's been proven true? That's just handing over our country to the elite and letting them have their way with it. That's pathetic. ", "Damn they started the strike on Nov. 1, knowing full well that the governor would step in to insure public transit was running in Philly for election day. That's how you use leverage ladies and gentlemen.", "Sorry Ivanka. A lot of us are not only going to boycott everything Trump but to varying degrees *everybody doing business with Trump.* You are pariah.", "Agreed I don't think Trump sees any value with Christie.", "Gee I wonder what/who could possibly be responsible for putting this guy's wife in a bad mood.", "They don't care. It supports their business goals. ", "\"I served as counselor to the president in the Clinton White House\" That's not a secret it's in the second paragraph  ", "Im still not sold on massive vote manipulation however being pro-trump and anti-hillary are two separate things. if people on /r/politics are unwilling to accept criticism about HRC then it doesn't very much feel like its unbiased.", "Newt infuriates me the man is insightful and crazy intelligent he could have done the world a lot of good, but instead he chose to be this snide little shit of a man. So much wasted potential. ", "I can think of a nuanced argument he could make about it. From complaining about not getting enough GOP support to a rigged media or even simply claim that votes were miscounted. \n\nHe won't go gracefully. He won't show any compassion for the country. He will see his popularity slip but remain at a floor of Clinton haters and bigots. ", "He loves THE Hispanics and THE blacks, etc etc", "He's already stiffed the 3 little girls that did a dance number for him. Their manager (one of the girl's fathers) filed a lawsuit trying to recover monies owed. ", "Sounds like a Republican wet dream. Disenfranchising black people? Check. Flipping traditional blue state. Check. Union getting egg on its face. Check. ", "It's also how you gamble the voting rights of low-income people. \n\nI get it but it still feels slimy. ", "I would be astonished to find out Clinton or Obama ever **wanted** control over their Twitter account. For the same reasons sane politicians don't do their ads live do vet their speeches, and otherwise act like what they say is actually important enough to not improvise.", "There's plenty of time", "Chricarus? ", "And he's now one of the two candidates Americans are now voting for the president let *that* also sink in.", "That's the ultimate irony in using that song.  ", "&gt;“This was kept open until 10. Yeah you feel free right now? You think this is a free and easy election? That’s why it’s important.”\n\nThe horror! The tyranny! Polls kept open so people can participate in democracy! This is the end of democracy!", "Did people doubt this?  Or do I give people too much credit to know their history?  \n\nEdit:  The first European settlement in the U.S. is Ft. Augustine FL by the Spanish.  The Vikings had settlements in Newfoundland, Canada. \n\nEdit 2:  By the Viking comments I am getting, I am now learning that yes, I totally gave people too much credit to know their history.  Or at least their geography. \n\nEdit 3:  I did not know that Pensacola had a previous settlement.  That is pretty interesting.  So St. Augustine is the first *permanent* European settlement.  There was also a temporary French settlement and two Spanish settlements in North Carolina and Virginia.  \n\nEdit 4:  You guys are splitting hairs by saying that Florida wasn't apart of the U.S. until 1845.  Yeah, that's true, but everyone knows what he meant by \"country\" as in geography and before the U.S. independence/government started.  \n\nEdit 5:  He even specified that he was talking about Ft. Augustine. ", "One more day until\n\n&gt; THE RACE FOR 2020!", "Well guys, we've done it. The longest fucking election cycle with the biggest damn clusterfuck in the modern history of this country.\n\n If you've paid any sort of attention to this election, you've come far. Just a little bit farther.\n\nPony up and vote for your least disliked candidate.  You'll make yourself more likely to vote in the future, and possibly make this part of your habits. Tell your friends about the fact you voted. You'll make them more likely to vote too, and make the direction of this country be more aligned to your perceived self-interest.\n\nIf you are invested, invest a little more.  And be here when the meltdowns, recriminations, and aftermaths sweep the nation.   \n\nIt's part of our civic duty.", "I just threw up in my mouth ", "Took the words right out of my mouth. How dare people exercise their constitutional right to vote.", "And getting rejected as president means we know you're full of shit.", "Here's the GOP narrative:\n\nThey only kept the polling locations in *Democratic* areas open late to give Democrats an unfair advantage over people voting in Republican areas. Never mind that they simply kept the places that *needed to be open late* open late or that the reason there are too many Democrats to vote within regular hours is because of some strategic and not-so-secret placement and regulation.\n\nGOP voters are honestly convinced that there *must be* Republicans who couldn't vote because *their* neighborhood's voting location wasn't open late.\n\nAnd there's nothing you and I can do to convince them otherwise; their mind is made", "[FiveThirtyEight Now-cast.](http://projects.fivethirtyeight.com/2016-election-forecast/#now) FL turned blue a little while ago as well as NC within the last hour.", "I don't know about this. She's still campaigning hard for him including four speeches throughout Pennsylvania yesterday.  There's no way her clothing line will ever make as much money as she stands to inherit, so she's not going to bite the little orange hand that feeds her. \n\n\nhttp://www.lehighvalleylive.com/bethlehem/index.ssf/2016/11/ivanka_trump_tells_lehigh_vall.html", "Here's one glaring issue heading into tomorrow: The Republicans are currently favored to retain Senate control: \n\nhttp://projects.fivethirtyeight.com/2016-election-forecast/senate/\n\nVOTE. THE SENATE RACES ARE JUST AS IMPORTANT AS PICKING THE PRESIDENT.   ", "Meanwhile Mike Pence is planning an expedition to find the holy kingdom of Prester John which lies beyond the sea.", "Please Florida Man Jesus. Please make it so.", "He was being so racist he forgot which race he wanted to attack. ", "Let's pretend that Trump was right - that the polls were held open longer than usual specifically because the constituency was Democrat-leaning AND to give campaign workers additional time to \"bus voters in\".\n\nHe's smack out of his mind of course, but let's *pretend* he's got his facts straight.\n\nHow does that benefit Democrats? Does a Democratic vote cast on Saturday count *more* than a Democratic vote that will inevitably be cast on Tuesday, had that voter not been given access to \"illicitly\" extended polling hours over the weekend? \n\nHow - exactly - does holding advance polls open for longer \"rig\" the vote count in that precinct?", "Remember to vote everyone! Polls don't matter if we become complacent. ", "I'm becoming very comfortable with burning bridges with real life Trump supporters. They tried to destroy the country to protect their feelings and I hate them for it.  Trump supporters I know pretty much have to live with the fact that I think they are stupid if they want to keep associating with me and not bring up politics if they don't want to get yelled at. They alienated me fuck them.", "I'll be on the edge of my seat for the next 48 hours... Ugh make it stop", "Can you imagine the shit storm of lawsuits investigations and audits this mutt will be dealing with for the rest of his existence? Nothing reveals your closet skeletons like running for POTUS and this guy has a freaking marching bands worth of them in his. From Sexual harassment and rape suits to tax chicanery to Trump U to stiffed vendors feeling emboldened to get their fair share I predict this guy will be forced in bankruptcy by the end of next year just under the weight of his legal fees.", "I wrote this in another thread but I want to say that I'm a NY attorney that has received the HRC training to poll watch in Philly. They are incredibly sophisticated and the number of lawyers descending on Philly is amazing. Trumpers will not be able to fuck with Philly, though there is full expectation that they will try.", "Because it was a [\"Certain group\"](http://www.cnn.com/2016/11/06/politics/donald-trump-michael-mcdonald-nevada/) of people ", "\"Hey uh, I know we called you Bernie Bros during the primaries in a derogatory manner and degraded you as human beings for not supporting Hillary instead, but, uh, you **must** vote for her.\"", "Not so \"entertaining\" when 50+ million people hooked up to a pipeline of delusion believe they have been disenfranchised. It remains to be seen what proportion of nutjobs are violent.", "Data scientists here.  Snowden is right.\n\nI can explain how this works.\n\nThere are a set of algorithms named hash functions.\n\nA hash function takes a document of N bytes and creates a secure and collision free fixed width string of characters of the input bytes.\n\nSo you can take a document a book and produce a short hash key for the book like:\n\nsha256(us_constition): 0xa123f\n\nThis is just an example and SHA256 is much longer than this.\n\nnow the problem is that if you change ANY character of the document, you get a completely different hash code.\n\nThis is what Snowden was discussing when removing the To/From/CC.\n\nThese would be inverted, changed depending on the email chain.\n\nThen you just hash all the new documents, compare them to the hash of the old documents and if the new documents were in the set of the old documents then you've already reviewed them.\n\nHonestly, writing the code for this is the hardest part.  Would take a decent programmer, from scratch, about 1 hour at max.\n\nRunning the code on any decent modern machine would take a few minutes for 600k emails.  Probably not even that long... \n\nEDIT alteraccount is right.  They aren't collision free just VERY VERY VERY unlikely. If you find a collission you can always manually compare the documents if it's important.  But we're talking 1/(2^256) improbable which is REALLY improbable.  2^256 is roughly more than all the atoms in the observable universe.", "&gt; How could anyone say that's a bad thing?\n\nBecause he is an *actual* fascist. I doubt he understands what fascism means or what it is but that's still what he is.", "As a non-American who has been watching this race since their nominations: AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHHHHH\n\nGo Florida Go! Make Trump regret generalizing Latinos.", "It's weird how wives are so much like just about every human being in that regard!\n\n", "Great businessmen form alliances.  Where are Trump's *friends* during this campaign.  Where are the people who have worked with him for years and admire him?", "Everybody overuses the word \"democracy\" when they think of America. Our founding fathers were terrified of a \"rule of the people\" or the 50.00001% because a mob rule is prone to illness. \n\nThat said we left \"representative democracy\" decades, if not almost 60 or 70 years ago when the speed of communication began to warp and allow for capitalistic overreach. \n\nThe USA is an oligarchy held at the hands of the Senators and politicians who get the money they need to actually try (and usually fail) to get themselves elected or accomplish political or societal goals from the very companies who time and time again clearly inflict deliberate and calculated pain on the people in the name of money. \n\nThat second coming can happen anytime now. Everything is wrong. ", "Some folks were born with a small million dollar loan. ", "They aren't even hiding their racism anymore", "&gt; Did people doubt this?  Or do I give people too much credit to know their history? \n&gt; Edit:  The first European settlement in the U.S. is Ft. Augustine FL by the Spanish.  The Vikings had settlements in Newfoundland, Canada.\n\nTechnically the first European settlement in the continental United States was in Pensacola started by Tristan de Luna in 1559 but it was abandoned after two years when a hurricane destroyed the town.\n\n[/history nerd alert]\n\nhttps://en.m.wikipedia.org/wiki/History_of_Pensacola,_Florida\n\n\n\n\n", "DJT's children were all raised by their mothers. Even Trump himself has admitted he had minimal role in their upbringings. They're more like employees than children.", "&gt; First they came for the Socialists and I did not speak out—\n&gt; Because I was not a Socialist.\n&gt; \n&gt; Then they came for the Trade Unionists, and I did not speak out— \n&gt; Because I was not a Trade Unionist.\n&gt; \n&gt; Then they came for the Jews, and I did not speak out— \n&gt; Because I was not a Jew.\n&gt; \n&gt; Then they came for me—and there was no one left to speak for me.\n&gt; \n&gt; -Martin Niemöller\n\n\nGuess what? He already said he's coming for the Muslims, Mexicans, media, Clintons, and anyone that opposes him. How long till he adds you to the list?\n\nThink you are safe and he would never come after you? Even Hitler went after his own generals. All dictators do eventually.\n", "*He shuffles after the pardon like a mop bucket filled with barbecue sauce.*", "Never expected the polls to be this close. If people don't vote polls mean nothing, and we could have Trump as president by tomorrow. Real scary.. ", "Honestly I'm just writing this comment so I can find this thread easily once the mods/admins nuke it", "Maybe they set him up on a fake twitter account and he thinks he's posting all these tweets, but really isn't?", "My dad tried to tell me to stop alienating my Trump loving family members because \"it's just an election.\" Sorry. Those people are basically dead to me now. ", "I find it helpful to go more Socratic. Folks like to answer questions about things they feel are important.  Dig a bit deeper into their statements and ask (in **as friendly a manner possible**) for more detail.\n\nIn this example:\n\n\"Donald Trump survived an assassination attempt and went back on stage.\"\n\n\"Wow!  Did they catch the shooter?  I wonder if the gun he had is going to be used by The Left to tighten gun laws.  Do you know what he had on him?\"\n\n...and **keep 'being on their side'** while trying to get them to dig a bit deeper.  Folks who feel attacked close up and hunker down.", "I thought that was an odd metaphor to use too. Could have gone with eggs or canned sardines. Watermelons wtf. ", "Ted Cruz is going to be in bed with a pillow over his face, weeping. Then he'll wake up and eat a whole big thing of butter pecan ice cream while watching Maury and cursing the day he threw his lot in with Trump. \n\nAnd then he'll go to Iowa.", "I picked a rough time to quit drinking 5 years ago.", "Or to quote Game of Thrones (because it's a popular reference): \"Any man who must say 'I am the king' is no true king.\"", "Did the Vikings get as far as Maine? It might have been their language!\n\nEdit: A Viking coin was found in Maine. So there is a chance that Old Norse is the first European language spoken in the United States.", "Maybe the Iranians hate America because we orchestrated a coup and destabilized their county in both 1953 and again in 1979? That tends fuel the fires of radicalization. \nImagine how Americas would feel if a Muslim country overthrew America?\n\nEdit: I'm a former economist that specialized in oil so do I know a great deal about how the actions of various countries have historically affected the oil market and continue to today. \nThe rise of modern Islamic radicalization is a result of the 1979 Islamic Revolution that America orchestrated (not by the CIA like the 1953 coup, but by controlling their country until they reached a boiling point). America started the fire, threw gas on it during the Cold War with Russia, then eventually we got burnt on 9/11. Now we have this delicate chess game that has greatly intensified in the past year between the US, Iran, Russia, and the Saudi's. \nOil is the foundation economic power. Whoever controls oil controls the world. The oil must flow.\n\nEdit2: Using green energy to become energy independent is the only way for the US to get out of the Middle East. In a recent power move, the Saudi's flooded the market with cheap oil to wreck western oil and green energy companies. It worked. But hey, enjoy your $2 gas. ", "You overestimate the historical knowledge of this subreddit if you think people know who Prester John is", "The longest?\n\n2008 never fucking ended - seriously it started before the mid term elections\n\nIn May 2006 Chris Dodd said he has \"decided to do all the things that are necessary to prepare to seek the presidency in 2008\"\n\nOn December 26, 2006, John Edwards formally announced his candidacy\n\nOn January 7, 2007, when asked by Tim Russert on Meet the Press, \"Are you running for president?\" Obama responded, \"I am running for president.\" \n\nClinton announced on January 20, 2007\n\nBiden formally announced his candidacy on January 31, 2007 \n\nObama formally announced his candidacy on February 10, 2007", "The disaster here though is the senate's chance of swapping is down to 45 percent. Without that it'll be 2 years until any appointments have the chance of being made.", "\"I love the poorly educated.\" – Donald J. Trump", "This is the GOP's biggest fear here: that Trump won't just lose but that he'll mobilize the rapidly growing latino vote in to a dedicated Democratic stronghold similar to African Americans. \n\nConstantly losing the black vote is a disadvantage, but constantly losing the black vote *and* the latino vote is absolute poison for a political party going forward.\n\n", "Praise thy  name Florida Man Jesus.", "[deleted]  \n ^^^^^^^^^^^^^^^^0.2570 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/09827)", "Just learned this week that there's no evidence that confidence decreases turnout and there *is* evidence that it boosts turnout. \n\nMore here: http://election.princeton.edu/2016/11/05/confidence-is-associated-with-increased-turnout/", "Ahhh...just like [creed thoughts](https://youtu.be/iQJGmjnc8LU) ", "Thickarus", "And Trump is still sending dog whistles about Obama's legitimacy in November 2016.  So really it's been a 10.5-year election cycle we never left.", "Just shows the damage a fox news culture can do to a country", "Honestly this woman could have had a political future if she had thrown her father under a bus a few months back. She speaks eloquently demonstrates knowledge about certain social issues and she would have endeared herself to the left had she turned on her father. ", "&gt; Why go all the way out to the pub when you can just go grab some crates of unsold **Trump Vodka** from the basement?\n\nAre we degreasing an engine today?", "Sometimes you just have to know when to avoid the conflict in the first place. Ask yourself will either of your minds be changed? \n\nIf it must occur, you have to force yourself to bite your tongue and listen. Try to find something to agree with them on. Say things like \"I understand your argument.\" \"I agree that is an issue.\" \"Thank you for having a discussion and not a fight.\"\n\nYou have to find something to make them feel heard. Then move slowly from there. ", "&gt; Well that kind of abuse worked for Paul Ryan\n\nChris Christie, Carly Fiorina, Ted Cruz, Ben Carson, Jon McCain (on and off), and most of the currently elected GoP.\n\n", "Trump has been rallying on the idea that the polls are \"rigged\" (because he likely knows he will lose) and in Pennsylvania has referred to \"certain areas\" (a coded reference for high minority areas like Philadelphia) being engaged in voter fraud. He has encouraged his supporters to go to these areas to \"watch\" for fraud which means intimidate voters. As lawyers it will be part of our job to stop them.", "GO OUT AND VOTE. \n\nIf you don't vote don't complain about the outcome. ", "*stops whittling and pulls up a chair*\n\nWell it's like this, /u/Cleon_The_Athenian, when America was a baby, it didn't have a fully developed equality. But as America grew up, so too did her equality. But there were a few pernicious cells in America which didn't recognize equality as a natural part of growing up, and so started attacking America's equality. Normally, these cells would get used to the equality or simply die out naturally, but unfortunately for America, her Republican parts thought that they could be stronger by protecting and helping those pernicious cells to grow and multiply. And those cells grew and grew within the Republican parts of America until they had metastasized throughout.\n\nSo today, America has a hateful tumor running throughout its Republicans, and the Republican parts which aren't infected by the anti-equality cancer aren't strong enough to fight it off even if they tried.\n\nSo yes, /u/Cleon_The_Athenian, an important part of America is dying, but it also has been for a long time. And that means some drastic choices have to be made in order to prevent that cancer from polluting all of America, so we're probably going to have to amputate America's GOP. Because if we did nothing, America would just keep getting sicker and sicker until somebody had to step in and put her out of her misery, and nobody should want that.", "And there it is: the Rasmussen snap back to Clinton right before the election so they can maintain their accuracy bragging.\n\nAssuming she wins tomorrow, it will be more proof of what a partisan joke that pollster is. ", "I am scared on the behalf of Canada. And therefore. The world.", "More like 4 years if the Senate doesn't flip and then those appointments will be made by a GOP president elected on the back of \"Hillary hasn't done anything! (nevermind the fact that we didn't let her)\" \n\nThe Senate absolutely has to go to the Dems or Clinton's presidency is dead in the water. ", "Actual fascist Donald LaTrump.", "As a Canadian I'll be on the edge of my seat. I hope you guys make the right choice in Hillary and the election is called early as I have a flight very early the following morning. As much as I dislike Hillary I have never feared someone as much as Trump. Hate is a word I use rarely but I hate Trump and everything he and his base stand for. He absolutely disgusts me. And I've been losing sleep knowing that he actually has a shot of becoming president. So please go out and exercise your right to vote! Us Canadians are counting on our brothers and sisters south of the border ", "&gt; The left needs to learn to let this sort of thing go and focus on important stuff.\n\nSome of us wimmin folk who don't like being stereotyped as irrational and moody find this sort of thing important ", "Trump Tower is made of concrete concrete provided by mob-owned S&amp;A Concrete, and delivered by mob controlled Teamsters Local 282.  Somehow when they went on a city-wide strike though the deliveries kept coming to Trump Tower, maybe it had something to do with Donald giving John Cody's (the head of Local 282) girlfriend a sweetheart deal on three apartments in the building, even allowing her to build the only pool in one of them.", "Gotta insult somebody...\n\nI am genuinely tired of this five year old.  At least toddlers eventually grow up.  ", "Was that an important fact check like someone disputed it and they needed to clear it up? \n\n", "[Trump had Christie get on stage in front of press and claim that Trump hadn't raised the birther issue in over 5 years.  Christie knew it was false that Trump was on tape doing so, but repeatedly said it wasn't true because he wanted Trump's favor.](http://www.cnn.com/2016/09/18/politics/donald-trump-birtherism-chris-christie-mike-pence/)  That was the week Trump had the press conference where he promoted his own brand and then quickly said Obama was a natural citizen, period. Then 2 days later Trump was back out saying that it was still questionable, and then his campaign tried to say that Hillary started those rumors.  He's already thrown Christie under the bus numerous times, but the guy is pathetic and desperate, he doesn't mind the tread marks.\n\n", "“I did a lot of freaking out about Barack Obama.” But he said, “Obama made me a better man.” He regrets calling the President a racist and counts himself a Black Lives Matter supporter. “There are things unique to the African-American experience that I cannot relate to,” he said. “I had to listen to them.”\n\nNo smarm from me, we need to welcome home all Republicans and Conservatives.   We are America, and we need to come together to destroy the false America portrayed by the right wing.   We all need to realize who we are, together. ", "\"The media is rigged I get my news from Facebook\" ", "Condescension under budget and ahead of schedule.", "I really want to see him lose the election then lose his shit. Like a public breakdown in which he cries and pisses his pants before vomiting all over his tie.", "Thats a neat-o fact and all but what difference does it make?", "The GOP is actually advocating turning people in line to vote away based on ethnicity. The GOP is lost. ", "You're waiting at the polls.\n\nThere's no end in sight \n\nAnd your phone is dead.\n\nOut of the corner of your eye you spot him,\n \nDonald LaTrump.", "You know what? Sure the man is a pig -but that's really not important to me in this election. I don't care about her emails and I don't care about him saying he grabbed pussies or any of that cockamamie nonsense. That's all ammo both camps used to attack each others' campaigns -that's not even the slightest bit what this election is about.\n\nThis election is about;\n\n* The Supreme court. First and foremost, this is the biggest stake by far. [The Next President Will Likely Appoint 4 Supreme Court Justices](http://www.alternet.org/election-2016/next-president-likely-appoint-4-supreme-court-justices). Hands down, this affects most lives for decades to come and won't be up for grabs in the next election. If Trump wins and the entire country rises up and votes for his opponent in the next election, you will still be saddled with his SCOTUS until your baby leaves college or longer. Republicans want unconstitutional laws that only target blacks and gays -their SCOTUS won't oppose them. They want to overturn Roe V Wade and plunge women back into alleyway abortions. No matter what they want, they will have a blank check and no one could stop them.\n\n* Trump and his Republican cronies will destroy unionization, regulations and every protection workers now enjoy. You would have to be blind not to see how they have attacked these things for generations.\n\n* Public Education would vanish. Trump, who claims to be so anti-establishment, has fallen in line with nearly every establishment position -including closing the Department of Education. The push for privatization would become the law of the land and we'd end up with school prayer, fictional history and science, and segregation achieved through private means.\n\n* Climate Change and the environment. If he wins, he and the GOP have vowed to close the Environmental Protection Agency and to not fight Climate Change and to not bring us into the modern age with green energy. \n\nTHAT is what is at stake. Is it any wonder both sides sling horrendous mud and fight tooth and nail? No. Is it shocking that voters are fooled by all the mud and ignoring what's at stake?\n\nAb. so. lutely.\n\n", "The US economy has spoken. Hispanics have spoken. Blacks have spoken. The alphabet community has spoken. Feminists have spoken. Major news papers have spoken. Intellectuals have spoken. Experts have spoken. Political leaders have spoken. \n\nShould I point out who's left not listening? ", "Remember when Huffington Post put Donald Trump's campaign under the \"Entertainment\" section? Good times.", "Trust me if I ran for president, actually ran the way these politicians run, \"Look at me! Vote for me!\" Look, had I done that, I would've won. Trust me. Now there are people, good people, smart people, and they're talking about me running in 2020. I don't know, I might do that, I'll have to consider it as an option, leave it on the table. We'll see. ", "I need two things on Tuesday everybody to vote, and lots of coffee. ", "Odds on Ted Cruz being in Iowa by the end of the week?", "Very powerful spot. [Link to the ad on youtube](https://www.youtube.com/watch?v=tgXPl4LdDJ0)\n\n", "Hey us liberals were the ones being too PC, I've now become fine speaking my mind more openly, specifically with Trump supporters, because after all, that's what they want, the ability to say whatever crosses their mind. ", "No excuses! No excuses! You're the excuses!", "Try some immodium.", "I think you've just pegged why the red pillers/MRA's are so persistent online and love Trump so much: putting society back to a point where \"women had no choice but to settle on someone, anyone, or face lifelong poverty\" is the only way most of these dudes will EVER get laid.", "Trump doesn't regret anything. He'll just make excuses and blame someone else when he loses. ", "Thank you for volunteering for such a job", "&gt; he's very charismatic and fun in the beginning\n\nI'm pretty sure The Donald made it clear he was a douchebag from the very beginning.  And I don't mean the beginning of the race but from the very first public mention of his name.  And if you were unfortunate enough to have grown up around him, you would have known his douchebag status even earlier.\n\nThat is what is so baffling about him even being in the race.  He's Biff, FFS!", "&gt; We define low-information voters as those who do not know certain basic facts about government and lack what psychologists call a “need for cognition.”\n\nAmazing how many ways we can euphemize \"stupid.\"", "Vote. Especially if you live in New Hampshire Indiana, Nevada, Missouri, North Carolina, and Pennsylvania. Cannot stress how important it is that you show up and vote in those states, especially if you're a fan of Bernie. \n\n538 has the Democrats down in New Hampshire's senate Race right now, and that would leave the Republicans with a 1 vote majority in the Senate and doom Bernie Sanders' movement to political obscurity. If the Democrats take the Senate, Bernie becomes chairman of the Budget Committee and will have a powerful voice in setting the agenda of the next President. If we can't take it back in 2016, Clinton will have to spend her next 2 years just blocking Republican bills, or even compromising with Senate and House Republicans just to get anything done.", "Or to quote Margaret Thatcher:\n\n&gt; Being powerful is like being a lady: if you have to tell people you are you aren't.\n\n"], "links": ["5blqkn", "5blqkn", "5blmi4", "5blmi4", "5blmi4", "5bkkxm", "5bllu4", "5bj5mv", "5bkkxm", "5blmi4", "5blmi4", "5blknb", "5blmi4", "5bllu4", "5bj5mv", "5bkkxm", "5blmi4", "5bkkxm", "5bllu4", "5bj5mv", "5bllu4", "5bllu4", "5bkkxm", "5bllkh", "5bkkxm", "5bllkh", "5blmt5", "5bk3p7", "5bkkxm", "5bk3p7", "5bjrsd", "5blmi4", "5blmi4", "5bk3p7", "5bjrsd", "5bk0qj", "5blknb", "5bllkh", "5bk3p7", "5blm1t", "5blmi4", "5blml3", "5bk3p7", "5bljm1", "5bke17", "5bk3p7", "5bkkxm", "5bk81i", "5bj4yq", "5blml3", "5blmi4", "5blmt5", "5bjrsd", "5blknb", "5bk3p7", "5bj4yq", "5blmlm", "5bkkxm", "5bj5mv", "5bjxd3", "5blmlm", "5blmi4", "5bjrsd", "5bllkh", "5blmi4", "5bk3p7", "5bke17", "5bjrsd", "5blmt5", "5blknb", "5blmi4", "5blm1t", "5bjrsd", "5bke17", "5bkkxm", "5bj5mv", "5bk3p7", "5blm1t", "5blm1t", "5bjpvl", "5bk3p7", "5blmi4", "5bj5mv", "5bk3p7", "5bj5mv", "5blml3", "5bj4yq", "5blp7p", "5bk81i", "5bleub", "5blmi4", "5blmi4", "5blqy2", "5blmi4", "5blmi4", "5blqy2", "5blmi4", "5blqy2", "5blsws", "5blmi4", "5blq8v", "5blmi4", "5blugn", "5bkkxm", "5bkkxm", "5blmi4", "5blugn", "5blmi4", "5blq8v", "5bkkxm", "5blmi4", "5blmi4", "5bkkxm", "5blmi4", "5blqy2", "5blsws", "5blmi4", "5bkkxm", "5blmi4", "5blmi4", "5blmi4", "5bk3p7", "5bkkxm", "5blmi4", "5blsws", "5bkkxm", "5blq8v", "5blmi4", "5blxcb", "5blqkn", "5bln93", "5blqy2", "5bllu4", "5bk3p7", "5bkkxm", "5bkkxm", "5blugn", "5blmi4", "5bk3p7", "5bkkxm", "5bln93", "5blmi4", "5blmi4", "5blugn", "5blq8s", "5bllu4", "5blmi4", "5blqy2", "5bkkxm", "5bllu4", "5bkkxm", "5bk3p7", "5blmi4", "5blqkn", "5bjrsd", "5bk81i", "5blr1f", "5blmi4", "5blugn", "5blmi4", "5bj5mv", "5bk3p7", "5bk3p7", "5bl2un", "5blugn", "5blrof", "5bkkxm", "5blmi4", "5blukg", "5bkkxm", "5blmi4", "5bj4yq", "5blmi4", "5bkkxm", "5bjrsd", "5blmt5", "5bj5mv", "5blqy2", "5blugn", "5blmt5", "5bjpvl", "5bj5mv", "5blqkn", "5bj4yq", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blqkn", "5blmi4", "5blmi4", "5blmi4", "5blqkn", "5blmi4", "5blmi4", "5blqkn", "5blmi4", "5blmi4", "5blqkn", "5blmi4", "5blmi4", "5blmi4", "5blqy2", "5blmi4", "5blmi4", "5blmi4", "5blqy2", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blqy2", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blqy2", "5blqy2", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blyo9", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blqkn", "5blqkn", "5blmi4", "5blqy2", "5blmi4", "5blmi4", "5blqkn", "5blmi4", "5blmi4", "5blqkn", "5bm5za", "5blqy2", "5blsws", "5blmi4", "5blmt5", "5blmi4", "5blmi4", "5blqkn", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blyo9", "5blyo9", "5blmi4", "5blmi4", "5blmi4", "5blqkn", "5blmi4", "5blqkn", "5blmi4", "5bltra", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blqy2", "5blmi4", "5bme15", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5bmg5p", "5blqy2", "5blsws", "5bmg5p", "5blmi4", "5blmi4", "5bme15", "5blmi4", "5blsws", "5blmi4", "5blqkn", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5bme15", "5bmg5p", "5blmi4", "5blmi4", "5blqy2", "5blmi4", "5bln93", "5bmeo0", "5blmi4", "5bm962", "5blmi4", "5blsws", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5blqkn", "5blmi4", "5blmi4", "5blmi4", "5blmi4", "5bme15", "5bmad8", "5blmi4", "5blqy2", "5blqy2", "5bmd42", "5blqkn", "5blmi4", "5blmi4", "5blqy2", "5blqkn", "5blmi4", "5blqkn", "5bme15", "5blmi4", "5blmi4", "5bmad8", "5blmi4", "5blmi4", "5blsws", "5bm5g9", "5bmcxp", "5bmg5p", "5blmi4", "5blqkn", "5blmi4", "5blmi4", "5blmi4", "5blqy2", "5blmi4", "5blmi4", "5bmad8", "5blmi4", "5blmi4", "5bm962", "5blqy2", "5blmi4", "5bmeo0", "5blmi4", "5blqy2", "5blmi4", "5blqkn", "5blmi4", "5blqy2", "5blmi4", "5blqkn", "5blqkn", "5bme15", "5blmi4", "5bmad8", "5blsws", "5blqkn", "5blmi4", "5bme15", "5bme15", "5bmog7", "5bmog7", "5blmi4", "5bme15", "5bme15", "5bme15", "5bmvmf", "5bmog7", "5blqkn", "5bmrco", "5blmi4", "5blmi4", "5blmi4", "5bmog7", "5bmoy1", "5blqy2", "5bmoy1", "5bmg5p", "5blmi4", "5bmog7", "5bme15", "5bme15", "5blmi4", "5blsws", "5blmi4", "5bmml2", "5bmrco", "5bmml2", "5blqkn", "5bmml2", "5blmi4", "5bmg5p", "5bln93", "5bmll4", "5bmg5p", "5bmvmf", "5bme15", "5bme15", "5bme15", "5blsws", "5bmog7", "5bmmdk", "5bml5i", "5bmog7", "5blmi4", "5blsws", "5bme15", "5blmi4", "5blqkn", "5bme15", "5blmi4", "5blsws", "5bmmdk", "5blqkn", "5bmml2", "5bmg5p", "5bme15", "5blqkn", "5blmi4", "5bmml2", "5bmoy1", "5bmog7", "5bmrco", "5blmi4", "5blqy2", "5blsws", "5blqy2", "5bmll4", "5blmi4", "5blmi4", "5blqkn", "5bmvmf", "5bme15", "5bmml2", "5blmi4", "5bml5i", "5bmog7", "5blqy2", "5bmg5p", "5blmi4", "5blmi4", "5blmi4", "5blqy2", "5bme15", "5bme15", "5bmoy1", "5bml5i", "5bml5i", "5blsws", "5bmg5p", "5blqy2", "5blsws", "5bmrco", "5bme15", "5bn154", "5bn0fq", "5bn0fq", "5bn0fq", "5bme15", "5bn6ic", "5bme15", "5bn0fq", "5bmog7", "5bn0fq", "5bn154", "5bn0fq", "5bme15", "5bme15", "5bn0fq", "5bmvmf", "5bn0fq", "5bn6ic", "5bn0fq", "5bme15", "5blmi4", "5bme15", "5blqkn", "5bme15", "5bn0fq", "5bmg5p", "5bmeo0", "5blmi4", "5bmrco", "5bme15", "5bn154", "5bmog7", "5bmxbf", "5blqy2", "5bn0fq", "5blmi4", "5blsws", "5bmvmf", "5bmvmf", "5bme15", "5bn0fq", "5bn0fq", "5bln93", "5bn154", "5bmlfw", "5bn154", "5bn0fq", "5bn0fq", "5bmvmf", "5bn5hg", "5bn0fq", "5blmi4", "5bn0fq", "5blsws", "5blqy2", "5bn0fq", "5bn0fq", "5bmog7", "5bmog7", "5bmvmf", "5bme15", "5bn0fq", "5bn0fq", "5blsws", "5bn0fq", "5bn0fq", "5bn0fq", "5bme15", "5bn0fq", "5bmg5p", "5bmog7", "5bmw45", "5bn154", "5blqy2", "5bn2z5", "5bmvmf", "5bmg5p", "5bmoy1", "5bn154", "5bme15", "5bme15", "5bln93", "5bm5g9", "5bmad8", "5bme15", "5bn0fq", "5bn0fq", "5bmxbf", "5bmvmf", "5bn0fq", "5bn0fq", "5bmg5p", "5bn0fq", "5bn0fq", "5bme15", "5bmvmf", "5bn0fq", "5bln93"]}